{"Reviews": [{"Title": "Beautifully built, incredibly fast, the best tablet computer ever!", "Author": "John Ryan", "ReviewID": "R3CXMI18TV70OE", "Overall": "5.0", "Content": "The new iPad Air is Apple's latest, slimmest, lightest release of their hand-held computer.  Oddly enough, it's so beautifully easy to use (my one year old daughter loves playing with it), it's almost doesn't feel like a computer at all.A word of warning - this review is written for people who've never owned an iPad before - and are wondering what all the fuss is about.  If you're thinking of upgrading skip down to the \"What's great about the Air\" section below, or just buy it - it's amazing.Just what's all the fuss about?--------------------------------------I used to own a laptop for work, and (very occasionally), it'd sit on my lap on the sofa, and I'd use it for pleasure (eMail, watching films or playing the odd game).  Then I bought my first iPad, and the laptop became redundant, a boring \"work device\".  Hard to explain, but the fact the iPad is so small and light, and you navigate around with your finger by pointing and gently swiping the screen makes the whole experience a lot easier - a lot more fun.Even my most \"Luddite\" of friends have been won over.It's incredibly simple and easy to use (it only has one main button), and everyone from my one year old daughter to my 85 year old dad have taken to without problems.  It's size and shape also support using it like a book (literally to read a book or web page), but you can also watch TV and films.Personally I'm also paranoid about my password getting \"hacked\", and someone running up a huge Amazon bill or buying stuff with my credit card on eBay.  Well one of the benefits of the iPad (and iPhone) is it's \"almost impossible\" to get a virus - one of the most common ways to get hacked.  This doesn't mean you shouldn't use strong passwords, (both Sony and Adobe got hacked), but it's reassuring to leave the Windows world behind.Finally, I love the way these devices (iPad, iPhone, Apple TV, Apple Mac), increasingly work together.  The fact you can start a Pages document on your Mac and edit it on your iPad, or take photos on the iPhone, and in seconds see them on the iPad or Mac and display them on the Apple TV.The thing is, \"it just works\".What would you use if for?----------------------------------* Shopping online.  Obviously - you could be reading a review on Amazon about the iPad Air!* Reading News stories.  As you can hold it like a book it's great to read the news online (my wife loves the UK Daily Mail newspaper Online - personally I prefer a web digest from free app Zite).* Reading Books.  It's great for reading books from Amazon Kindle or Apple Books with the benefit of 1,000s of online book reviews* Navigating web pages.  Instead of clicking with a mouse, you gently swipe your fingers on screen to scroll around* Watching Films.  I use it to watch Netflix online videos (with an Apple TV you can send stuff to the telly)* Reading and replying to mail.  I use \"mailbox\" a great free app to read and reply to mails, but there's a free one included* Showing and organising photos.  Any photos on an iPhone are automatically available within minutes in \"the cloud\"* Playing games.  From fun puzzle games like \"Cut the Rope\" to fully fledged first person shooters.* Listening to the Radio.  With \"Tune in Radio\" you can listen to thousands of radio stations world-wide.  My personal favourite is London UK based XFM - alternative rock* Listening to music.  I stream mine to an Apple TV, but you can also buy portable speakers or just plug into the AUX socket* The list goes on and on.Which model should I buy?----------------------------------I can't comment about Android tablets (apart from the Google Nexus which is well regarded), but in terms of the Apple tablet line-up in order of cost:-1. Avoid the Apple iPad 2, it's a relatively old model, under-powered and with a lower resolution screen.  If you really want an Apple but don't want to spend the cash, buy a 16g WIFI 3rd or 4th generation iPad from eBay.  Avoid this one.2. iPad mini is a lovely tablet.  A 7.9 inch screen and astonishingly light and remarkably thin - it feels like a light-weight book.3. iPad mini with retina screen. Again 7.9 inch screen, but with the blazingly fast A7 chip and a \"retina\" (high definition) screen.  Worth the upgrade if you can afford it.4. iPad Air.  Much larger screen size (9.7 inches - doesn't sound much but it makes a huge difference).  Same fast (A7) chip as the Mini with Retina - the latest and fastest iPad available.Clearly (from my viewpoint) there's only really three options.  The iPad Mini, the Mini with retina screen and Air.What are the Optional add-ons?-----------------------------------------Well, assuming you've dropped by the Apple Store (which I would highly recommend - fantastic service), and handled the iPad Mini (with/without retina screen), and iPad Air then your options are around memory size and cellular option.Memory:  Once bought, you can't add memory (space for apps, films, books etc).  However, the basic price goes up a huge amount (+$100 for the 16g to 32g iPad Air).  But, having owned a 16g and then a 32g iPad - I can safely recommend the 16g unless you really want to store a huge amount of videos and downloads.  Only you can decide, and if you're lucky enough that money is no object then splash out.  Otherwise, 16g should be fine for most people.Celular:  Allows you to connect to the internet while you're out and about.  This will add an additional +$100 to the price and means you can slip in a mobile phone SIM card.  This means (for an additional $5-10 a month extra), you can access the internet on the move.  Alternatively, you can opt for the WIFI option, and use it at home or at at \"hot spot\" (eg. Starbucks, most rail stations and hotels etc).Personally I'd buy (and indeed did), the 16Gb iPad Air WIFI.Do I need anything else?-------------------------------Most people (me included) buy a cover.  Apple (and now several copy-cats) make a \"smart-cover\" which automatically shuts down the iPad when you close it, and switches it on when you open it.  There's versions which cover the back, or just the screen.  Apple charge from $35 to $65 for their (admittedly) high quality fabric or leather covers, but there's many available from $10.  Be aware, you do get what you pay for.Personally,I think it's a pity to cover the beautiful aluminium industrial design of the iPad with a cover - but if you've spent hundreds of pounds you'll want to protect it from scrapes and bangs.I also invested in a keyboard ($20-$70), as I tend to write a lot of mails and documents (remember it comes with a word processor).  I'd recommend the ogitech Ultra Thin iPad Air Case with Keyboard - Space Grey and the ZAGG Keys iPad Air Case Folio with Backlit Keyboard although these are strictly optional unless you want to use your iPad as a proper laptop.Finally, if you have another Apple device (eg. an iPhone, Apple TV or Mac) you'll find these work together beautifully.  For example, you can create a reminder on your iPad and it appears on your iPhone.  Equally, photos taken on your iPhone appear on your iPad, and you can stream music or videos from iPad, iPhone or Mac to an Apple TV.Some people think this \"locks you in\" - but it's your choice.How should I set it up?--------------------------Well, if you already own an iPad or iPhone it's incredibly easy.  Just log in with your existing iTunes and iCloud accounts, and select the option to either set this up as a new iPad or restore from backup.If you've never owned an iPad before - read on to hear about how to set up an iTunes and iCloud account - it certainly confused me the first time I used them.+ iTunes account - is how you buy your music, Apps or films from Apple.  You register your credit card with them, and protect the account with a secure password+ iCloud account - is used to identify you as an individual.  This gives you 5Gb of backup space (your iPad will be automatically backed up when you charge it), and also means your iPad will work together with your iPhone.How to set them  up:1) Create a SINGLE iTunes account for your immediate family and children.  Then when you buy an App, it's immediately available (for free) to all the family members.  Maybe once the children reach 15-16 they'll want their own account (as otherwise they'll end up spending your hard earned cash on your credit card to buy music you don't want).  Until then - it's a great way to share the Apps.2)  Create YOUR OWN INDIVIDUAL iCloud account for person.  That means if you buy an iPhone you can share data (eg. reminders, notes or calendar events) across both devices.  If you're partner (and maybe even children) have their own iCloud account they also have 5Gb of space, and can keep their own notes and documents private.Easy when you know how.What's great about the Air?-----------------------------------* Lighter (30%) and thinner than the previous version (469g from 650g)* Even faster A7 chip.  Blazingly fast!* Improved sound (compared to the iPad 4)* Software including  + iMovie - edit and publish home made movies  + Numbers - Fully functional Excel for the iPad  + Pages - Word processor  + GarageBand - Play a piano or a drum kit  + iPhoto - Edit and organise your photosWhat's not so great?--------------------------* The change in physical size means you'll need a new keyboard or replacement cover if you're upgrading* Pity Apple didn't include the \"touch ID\" to secure your passwordsOverall Opinion---------------------It's hard to believe the iPad version 1 was released just four years ago, and there's a huge raft of \"me too\" tablet computers to choose from, but the Apple iPad Air is still the one to beat.As the UK based consumer magazine \"Which?\" magazine put it - \"...the best tablet we've ever tested.  Apple packs a beautiful screen and lightning fast processor into a slimmer-than-ever shell, and battery life is very impressive\".Yes, there are cheaper Android based alternatives, but the quality, design and beauty of this tablet just sets it apart.  If it were a car it'd be a top of the range Mercedes or a BMW.Highly Recommended.", "Date": "January 4, 2014"}, {"Title": "Excellent", "Author": "Daniel G. Lebryk", "ReviewID": "R2RCYFJ9NNSROC", "Overall": "5.0", "Content": "The iPad Air is everything I imagined it would be and a lot more. This latest generation iPad is so much lighter than previous versions; it is now approaching the weight of a Kindle - meaning it is easy to hold for a long time. The body is about two inches narrower, making it easier to hold. The retina display is so darn sharp and looks great.The iPad Air finally pushed me to upgrade my original, version 1 of the iPad. I bought that iPad on release day, seemingly millions of years ago. I loved that device, my one complaint was that the iPad was too heavy - everything else about it was great. Now that I've used the Air, I'll never go back. This was an upgrade well worth doing.November 2, 2013 Update: After using this for two days and thinking harder about the iPad, I figured you might want a few reasons why this might not be for you. Your iPad works just great and you don't do much more than read email, play angry birds, and look at websites all at home. In my case I went from a slow turtle first generation iPad to this lightning fast new version - I'm blown away. And if you have a latest previous version and get a great deal on recycling your current model (read at least $200) then it might make a lot of sense. This is an expensive device, and a MacBook Air is not all that far away from the iPad, after you add $60 for a case, $100 for two years of accidental breakage coverage, and maybe $60 for a keyboard. A MacBook Air at $1100 suddenly doesn't look all that expensive anymore, especially if you opt for the 128GB option of the iPad. Of course there is nothing like holding one of these new iPads and they are super sweet. If you are super logical and conservative, this is probably not the device for you.On the other hand, I decided to jump in both feet first.Setup was super fast and easy. There is a good step-by-step wizard to get the device running. Since I have an iCloud account, I was blown away with how fast this thing synced. That whole improved WiFi antenna is not hype - the device connected quickly with my network. Most devices take a while to connect to my network, this was painless and fast. Filling in the information for my mail account, it seemed like seconds and new email was downloaded - significantly faster than my other iPad.I had a choice during set up to restore from a backup or set up the unit as new. I chose new device, so none of my apps loaded right away. If I had chosen a backup, I could plug this into my computer and with iTunes could have grabbed my purchased apps. All incredibly seamless.Video is stunning. Amazon Prime Video took seconds to start (I've gotten used to 15-20 seconds). The video started in standard def, and within 15 seconds switched to high def. So much faster than happens even on my PS3. I have never seen buffering move this fast, scanning forward, there was a 5 second delay for buffering and the movie resumed. Sound is much better than the single speaker. It is still not great, just more passable. It is silly that they put two speakers on the bottom of the iPad. A speaker on top and bottom would give movies stereo. Music sounds better. Two speakers put out more sound, the stereo effect is minimal, the two speakers are one inch apart.This is an incredible display for films. The blacks are deep, rich, and have great tone range. Out of the box, this display looks fantastic.Everything moves so darn fast. Switching apps is a snap. New apps load with a blink of an eye.I'm glad I bought the full size iPad; Apple got this size and weight exactly right. I think this is well worth the extra $100 over the retina mini to be released the end of November. Apple has blurred the lines between these two devices. I guess they've done the same thing with iPods, so it makes sense they would do it with the iPad.If you've used iOS 7 on an iPhone, the iPad is essentially the same thing - you will feel right at home.", "Date": "November 1, 2013"}, {"Title": "Longer lasting power, faster, lighter, with free top quality apps to download!", "Author": "jjceo", "ReviewID": "R3ONM01PGHOTQB", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moEKZW1NZ68FJVembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moEKZW1NZ68FJVrefresh_preplay() {\n\ndocument.getElementById(\"cv_moEKZW1NZ68FJVchiDiv\").innerHTML = document.getElementById(\"cv_moEKZW1NZ68FJVhiddenPre\").innerHTML;\n};\ncv_moEKZW1NZ68FJVrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moEKZW1NZ68FJVso;\t   \n\n\nfunction cv_moEKZW1NZ68FJVloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moEKZW1NZ68FJVso = new SWFObject(swfLocation, \"cv_moEKZW1NZ68FJVAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moEKZW1NZ68FJVso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moEKZW1NZ68FJVso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moEKZW1NZ68FJVso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moEKZW1NZ68FJVso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moEKZW1NZ68FJVso.setAttribute(\"height\", swfHeight);\n          cv_moEKZW1NZ68FJVso.setAttribute(\"width\", swfWidth);\n          cv_moEKZW1NZ68FJVso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moEKZW1NZ68FJVso.write(\"cv_moEKZW1NZ68FJVflashcontent\")) {\n          fp_resizePlayerSpace('cv_moEKZW1NZ68FJV', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moEKZW1NZ68FJV';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moEKZW1NZ68FJV', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moEKZW1NZ68FJVloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moEKZW1NZ68FJV\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1Q9GR3DWN4C7M\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1Q9GR3DWN4C7M\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3ONM01PGHOTQB\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1Q9GR3DWN4C7M/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moEKZW1NZ68FJVduration')) {\n      document.getElementById('cv_moEKZW1NZ68FJVduration').style.display='none';\n    }\n    cv_moEKZW1NZ68FJVloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moEKZW1NZ68FJVloadSwf(movieID, playerVersion) {\n   return _cv_moEKZW1NZ68FJVloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moEKZW1NZ68FJVnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moEKZW1NZ68FJV', 0, h);\n}\n\nfunction cv_moEKZW1NZ68FJVresetPlayer(w,h,bw,cc) {\n  cv_moEKZW1NZ68FJVnewHeight(h);\n\n  cv_moEKZW1NZ68FJVso.addVariable(\"resetBandwidth\", bw);\n  cv_moEKZW1NZ68FJVso.addVariable(\"cacheCode\", cc);\n  cv_moEKZW1NZ68FJVso.setAttribute(\"height\", h);\n  cv_moEKZW1NZ68FJVso.setAttribute(\"width\", w);\n  cv_moEKZW1NZ68FJVso.write(\"cv_moEKZW1NZ68FJVflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moEKZW1NZ68FJVRollOverImg = new Image();\ncv_moEKZW1NZ68FJVRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81wRvQ9Mn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moEKZW1NZ68FJVpreplay = document.getElementById('cv_moEKZW1NZ68FJVpreplayImageId');\nif (cv_moEKZW1NZ68FJVpreplay) {\n  cv_moEKZW1NZ68FJVpreplay.onmouseover = function() {\n    cv_moEKZW1NZ68FJVpreplay.src = \"http://ecx.images-amazon.com/images/I/81wRvQ9Mn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moEKZW1NZ68FJVpreplay.onmouseout = function() {\n    cv_moEKZW1NZ68FJVpreplay.src = \"http://ecx.images-amazon.com/images/I/81wRvQ9Mn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moEKZW1NZ68FJVpreplay.parentNode;\n\n  var cv_moEKZW1NZ68FJVcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moEKZW1NZ68FJVcurrentClick) {\n      return cv_moEKZW1NZ68FJVcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:12 MinsI use an Apple iPad about 6 to 8 hours a day.  I own an iPad 2 and 3 and now this new iPad Air version.  My main reasons for updating were that I literally fill up my 64 GIG iPad every day or two with videos and photos that I shoot.  Having this larger version at 128 GIG allows me to work longer and add more to my iPad.  In addition this new version is much lighter and easier to use all day long.  Even though the battery is smaller in capacity than my iPad 3 the battery life is longer and it is very noticeable. This is because the faster A7 CPU and the motion chip actually use less power.Please watch my video as I go into more details in it.I immediately noticed the increase in speed.  The unit connects to the WIFI faster, synchs with iTunes faster, downloads emails faster and speeds up your web browsing.  The differences are very noticeable and enjoyable as a user.  The dual speakers are a nice change but I also use a lot of Bluetooth speakers to enhance the sound of the iPad.In my video I do a size and weight comparison to an iPad 2, an iPad 3 and the iPad Air.  I also show how the basic set up takes place and for advanced users you can just speed through that portion of the video.  The iPad 2 weighs 1 pound 5 1/8 ounces, the iPad 3 weighs 1 pound 7 1/8 ounces, and the iPad Air weighs 1 pound and ¼ ounce.  The iPad Air is narrower but has the same screen size.  The left and right edges of the iPad are thinner on the sides of the useable screen and you can see that in the video.Here are the key improvements for me:* Much lighter in weight* Thinner, smaller design with the same screen size* Much faster when synching with iTunes* Much faster when browsing the web* Much faster when downloading emails* Stronger WIFI connection and faster WIFI synching* A more powerful AC wall adapter with 5.2 VDC and an output of 2.4 Amps.  It charges at 12 watts of power. It operates at 100 to 240 VAC and 50/60 Hz and it is UL approved.  It features folding AC wall plugs for easy packing when traveling.* Lower CPU and motion chip power consumption that makes the smaller/lighter internal battery last longer!  This is very noticeable!* As usual a beautiful high resolution retina screen with 2048 by 1536 resolution at 264 pixels per inch.  You can see the difference in the photos, videos and reading quality of the screen.* Dual speakers in the bottom* Free high quality Apps* iPhoto* iMovie* GarageBand* Pages* Keynote* Remember to download these from Apple!Overall this is a superior product that really outperforms the older iPads that I have.  I was disappointed that the new iPad Air did not have the home button with the fingerprint sensor built in.  Since I have used it with my iPhone 5S I have really become attached to it and it just seems like a way to cheapen the unit and be more competitive instead of showing and using the enhanced technology.  I would have paid a little more for the iPad Air with that sensor.This is still a 5 star product and I recommend it as a very good tablet.", "Date": "November 9, 2013"}, {"Title": "Beautiful product, non-premium hardware.", "Author": "Avenging Taco", "ReviewID": "R52KR35VM0NQ3", "Overall": "3.0", "Content": "I have owned several Apple products, and the iPad is the most distinguished among Apple's line up relative to its competition.  The most compelling aspects of this tablet are the beautiful design, and the 10 hour battery life.  These are the two features that made me decide to purchase another Apple product irrespective of their business practices which try to squeeze money out of their customers by not supporting devices properly after they are released.After having used this product for over a month now, I can say it is an improvement over my iPad 1.  The browser now crashes on the original to the point of making it worthless.  My original iPad had 256 MB of RAM which is not enough to load a lot of modern web pages without the browser crashing.  That is why I had hoped the 1 GB of RAM in the iPad Air would be sufficient, and it has improved, yet I still find that the browser crashes on occasion.  The scroll latency is very subtle, but noticeable to me.  It doesn't really impact my usage, but it could create problems for people who game on their iPads.  Putting in 2 GB of RAM (which is what I have in my Nexus 4) does not cost that much, and would improve the performance greatly.  For a premium product, I expect the best, and Apple has consistently under-delivered on processing hardware which created the same problems all the way back to the iPhone 1 I purchased on launch day.I take 1 star off for business practices which burn through your pocket, and the second star is removed for needless low-RAM browser crashes that are still a problem on the latest iteration (which is likely planned to force relegation of old devices and compel new sales.)  Still, I can say that this is the best 10 inch tablet available, and android has no viable alternative worth purchasing.  If you can overlook the two biggest strikes I have against Apple, you should consider no other 10 inch tablet at this time.UPDATE 1/17/14Today I called into Apple support because my browser is crashing frequently.  I am now experiencing 5 - 10 browser crashes a day when it was only 2 - 3 times a week when I first purchased it.  Speaking with the Apple support technician, he said that they have not received many complaints about this issue yet, so I may be experiencing a rare software or hardware problem.  I looked through my crash log (which had over 100 crash reports in it since Nov. 11th) and the vast majority of them were low memory crashes.  However, the tablet did not operate this way when I initially purchased it, and it began to increase in frequency about 2 weeks ago.  Therefore I suspect that there is a software conflict (I still have 4 GBs of free flash hard drive space, so I doubt it is a conflict with virtual memory, although a RAM hardware problem is possible).  I went through some basic procedures the technician recommended, and I was advised to do a system wipe if the problems should persist.  I will test the tablet for a few days before wiping everything and starting over. I'll update this review once I am confident of what the issue was.", "Date": "December 8, 2013"}, {"Title": "Apple still rules the tablet world.", "Author": "Makavelli02", "ReviewID": "R3AWGSO5C50M8A", "Overall": "5.0", "Content": "First of let me tell you I am not an apple fanboy. I own and support samsung products. I carry a galaxy note 2 with me every day and would not consider an iPhone until the make some huge changes to it. Last year I bought a nexus 7 and loved it. Now that it's specs are getting a little dated I had to look for an upgrade. The new nexus 7 didn't impress me with it's dated CPU. So I looked to the note 2014 and the iPad air. I used both side by side and researched every detail. I sell these things for a living. The note is very impressive but, for all it's stats and hardware features it still struggles with simple movements. You can point out is 3 gigs of ram and the very good snapdragon 800 quad core CPU. Then you have apples 1 gig of ram with the measly dual core a7 CPU. ????? Now for the real world facts and it pains me to say this because I love android, but the fact is the a7 in the iPad air with it's upgraded clock speed at 1.39 gigs has yet to be matched in any bench mark from another mobile processor including the quad core s 800 by snapdragon. And with the future in mind the 64 bit tech is hard to beat. Them to the 1 gig of ram vs the 3 gigs in the note. If you can't use all that horsepower why put it in there. The air is twice as snappy as the note with no lag what so every. The note on the other hand lags even on swiping through home screens. It all comes down to the operating system apple remains king. Android may be pretty and customizable but that all comes at a cost. That cost is performance. You can take a car with 500 horsepower and put it on a curvy bending road. All that horsepower doesn't mean a thing. The car with 200 horsepower will still win by going straight.So I bought the air and love it. And must say I have missed iTunes and the more refined apps.", "Date": "November 24, 2013"}, {"Title": "The best iPad yet!", "Author": "Roxanne \"Photography, as a powerful medium of...", "ReviewID": "R3AA0IQZDZRGAN", "Overall": "5.0", "Content": "My first iPad was fun-I called it my toy. I also called it \"the brick\". I used & enjoyed it for certain things. Now several more iPad down the road I have the iPad Air & I am in love! I read a LOT & I went through various Kindle devices-from the original to the Paperwhite as well as the Fire HD & HDX. They all went back to the store after much disappointment & I would go back to reading on the Kindle App.The iPad Air has become my mini workstation, paired with an Apple wireless keyboard, my library, my entertainment zone where I watch movies, play games & listen to music. I can also shop, do research-the list is endless! The device is as light as air even with a leather cover. It stays cool-no overheating. It is fast & with 128g, there is room for what interests me. The Retina screen is gorgeous-which as a professional photographer who uses it as a portfolio to show my work is a must.Apple, you did a fabulous job!", "Date": "December 28, 2013"}, {"Title": "Light, Nice Design, and Does the Job", "Author": "Simon", "ReviewID": "R1PHLHVNLYURIX", "Overall": "4.0", "Content": "This is my 3rd iPad. I've had original iPad, iPad 3, and now the Air. Many people may say iPad is not worth the price for what it does, but in my case, it was worth every penny. I used iPad 3 and now the Air mostly for browsing the web, reading textbooks, and occasional gaming, and for these tasks iPad Air is perfect; not to mention, I've saved a couple of hundreds on textbooks already. Air is much lighter and faster than the other iPads I've had so far. Now, I can easily hold it longer while reading longer texts, and I can see the performance increase in web browsing and games.Mini vs. Air DilemmaI first got the new iPad Mini with Retina display, because the Apple sales person said it is identical to iPad Air in every aspect other than screen size. Of course it turned out to be wrong, since mini is a bit slower and has the display color accuracy issue. After a week, I went back and exchanged the mini for iPad Air. While mini is a wonderful tablet, I was keeping it much closer to my eyes that I liked to. Web browsing also suffered a lot on a smaller screen of the mini even with Retina. With iPad Air, everything is back to normal again, and I can browse the web more easily now.Wi-Fi vs. 4G CellularI have had the cellular version of iPad 3 and the original iPad. To be honest, I only enabled the service for a few months and disabled it afterwards. I find myself to be always near Wi-Fi networks, either at school or work, so I decided to get the Wi-Fi version this time. Another reason was that I can always turn on the Hot-Spot feature on my phone, and share the internet with iPad Air. Because of these points, it didn't make any sense to pay $130 more for the cellular version.Games and PerformanceI've tried a few games, including Dead Trigger 2, and the 3D performance is very good. The new A7 processor really shines here. I am sure new wave of 3D and 64-bits games will come to iPad pretty soon, and if you are into gaming, definitely go with larger than 16GB models. The web browsing performance has been increased as well, so you can browse the web more fluidly.ConclusionI am pretty happy with my purchase. The free iLife and iWork packages with the purchase of new iPad from Apple sealed the deal for me. It is much better than my previous iPad 3, and I definitely love the new reduced weight. The performance increase is also noticeable both in games and web browsing. If you are coming from older iPads, you will probably appreciate the new design and performance as well.", "Date": "December 8, 2013"}, {"Title": "About as useful as a peanut", "Author": "Joe C", "ReviewID": "R2SCYOVSAQ3G2Y", "Overall": "3.0", "Content": "I am a college student and got sick of lugging a laptop around with the risk of it getting stolen so I purchased an iPad. I am neither an apple/pc/android fanboy, I use the tool that gets the job done reliably. (Ever have a paper due and your computer breaks down?) I own a macbook, iphone, windows desktop, and had a Nexus 7 for a short time but wanted a tablet with a larger screen.So lets get down to it- initial impression was \"Wow!\" and I never realized how chunky or laggy the Nexus 7 was. The resolution, animations, user interface, and general build quality is superb in my opinion. It feels like a device \"that will get work done\". Unfortunately, the iPad out of the box feels like a digital storefront for the App store as opposed to something I can do school work on. Bluntly, the device is unnecessarily handicapped. For me to put my own videos on it, I have to use Handbrake and waste 3-4 hours to convert the movie to something the iPad can play. The Nexus 7 played almost any format out of the box. Using textbook PDFs is horrible, there are only a few quality apps that offer continuous scrolling. If your course requires mymathlabs, webassign, or one of those other edu-gimmicks to do homework, good luck, most of them require Flash which is unsupported. Then I went to use safari.. advertisements everywhere! Same with every free app, constant advertisements! Occasionally I have to download PDF to read for course work. Ain't happening in safari- there is no way to download and the page will refresh if you close the app. Good luck reading where there is no wifi.Then I jailbroke it, installed f.lux, adblockerNetworks, safari downloader, nitrous, retinapad, vplayer video player, and videopane. That took care of the blinding blue light at night time, killed off 90% of advertisements, I can download files now, iPhone only apps are now in HD, I can watch almost any format of video too. Now the device is useful!After that, I installed DocsToGo to read PDFs with continuous scrolling and to write papers. I also HIGHLY recommend Notes Plus if you intend on hand writing notes. Lastly, I would suggest getting the \"Papers\" app (no typo) to read PDFs with multiple columns.Overall, iPad has a lot of potential but is held back by Apples walled garden. After jailbreaking and eliminating the majority of the artificial handicaps, I feel OK with heading to school only with it and not worrying about it not being capable of doing something. Remember- iPad is not a device for creation, it is for consumption and is essentially just a storefront to iTunes. If you keep these limits in mind, you won't be as disappointed as I was.", "Date": "January 29, 2014"}, {"Title": "Warning!", "Author": "Owhillo", "ReviewID": "RQ1UDS9MXHJC2", "Overall": "1.0", "Content": "I wish I could say I love my iPad Air  because my kids bought it for me for Christmas.  Within a month, there was a crack across the screen.  I did NOT drop it.  It's in a ZaggFolio case with a keypad and it's a great case.  When I called Apple, they accused me of dropping it.  I can have the screen replaced for $300.  Hello?  Within the next couple of months, the web was full of people who had bought this Air and their screens were broken.  They get them replaced and they break again.  I am not able to post the link on here, but you can check out the Apple site for just a sampling of complaints and questions that you will note has not been addressed at all by Apple.There is a clearly a problem with the screen.  If you don't mind fractures across your iPad, this might be the one for you.  We are an Apple family.  Spent thousands on phones and computers for years.  So disappointed in this model.", "Date": "May 2, 2014"}, {"Title": "Longer lasting power, faster, lighter, better power charger and with free top quality apps to download!", "Author": "jjceo", "ReviewID": "R3DOT7M66G6ZAV", "Overall": "5.0", "Content": "I use an Apple iPad about 6 to 8 hours a day. I own an iPad 2 and 3 and now this new iPad Air version. My main reasons for updating were that I literally fill up my 64 GIG iPad every day or two with videos and photos that I shoot. Having this larger version at 128 GIG allows me to work longer and add more to my iPad. In addition this new version is much lighter and easier to use all day long. Even though the battery is smaller in capacity than my iPad 3 the battery life is longer and it is very noticeable. This is because the faster A7 CPU and the motion chip actually use less power.Please watch my video as I go into more details in it.I immediately noticed the increase in speed. The unit connects to the WIFI faster, synchs with iTunes faster, downloads emails faster and speeds up your web browsing. The differences are very noticeable and enjoyable as a user. The dual speakers are a nice change but I also use a lot of Bluetooth speakers to enhance the sound of the iPad.In my video I do a size and weight comparison to an iPad 2, an iPad 3 and the iPad Air. I also show how the basic set up takes place and for advanced users you can just speed through that portion of the video. The iPad 2 weighs 1 pound 5 1/8 ounces, the iPad 3 weighs 1 pound 7 1/8 ounces, and the iPad Air weighs 1 pound and ¼ ounce. The iPad Air is narrower but has the same screen size. The left and right edges of the iPad are thinner on the sides of the useable screen and you can see that in the video.Here are the key improvements for me:* Much lighter in weight* Thinner, smaller design with the same screen size* Much faster when synching with iTunes* Much faster when browsing the web* Much faster when downloading emails* Stronger WIFI connection and faster WIFI synching* A more powerful AC wall adapter with 5.2 VDC and an output of 2.4 Amps. It charges at 12 watts of power. It operates at 100 to 240 VAC and 50/60 Hz and it is UL approved. It features folding AC wall plugs for easy packing when traveling.* Lower CPU and motion chip power consumption that makes the smaller/lighter internal battery last longer! This is very noticeable!* As usual a beautiful high resolution retina screen with 2048 by 1536 resolution at 264 pixels per inch. You can see the difference in the photos, videos and reading quality of the screen.* Dual speakers in the bottom* Free high quality Apps* iPhoto* iMovie* GarageBand* Pages* Keynote* Remember to download these from Apple!Overall this is a superior product that really outperforms the older iPads that I have. I was disappointed that the new iPad Air did not have the home button with the fingerprint sensor built in. Since I have used it with my iPhone 5S I have really become attached to it and it just seems like a way to cheapen the unit and be more competitive instead of showing and using the enhanced technology. I would have paid a little more for the iPad Air with that sensor.This is still a 5 star product and I recommend it as a very good tablet.", "Date": "November 9, 2013"}, {"Title": "Good but should have included the fingerprint features", "Author": "redrover", "ReviewID": "R1RBYETUIF6IS9", "Overall": "3.0", "Content": "UPDATE 11182013:A number of comments seem to take issue with my statement of \"not feeling like glass\" but that is JUST MY PERSONAL FEELING. Others about the brightness...indeed I do have it cranked all the way up but the brightness is nowhere as bright as what is found on the Samsung Note 10.1 2014 edition, nor the iPad4 and my most recent purchase the Samsung Note 8. All 3 when cranked all the way up are much brighter than the iPad Air.I will be buying the new Google nexus 7(even with all the GPS and multi-touch issues) for the upcoming holidays but even in the store, that too seems much brighter...I am very dismayed at this lack of brightness from the Air but it is still more than adequate for indoors. I have not tried it outdoors nor will I as this is not my \"outdoor\" tablet...lol.I like Apple and the tight integration of their apps and the reason many including myself continue to buy their products. I do feel the price for this latest iteration is them trying to make money at our expense. WHO HERE DOES NOT KNOW IN THEIR HEART THAT APPLE IS TRYING TO GET IN ON THE CHRISTMAS RUSH AND PUT THE AIR AND THE NEW MINI WITHOUT THE FINGERPRINT FEATURES FOUND ON THE NEW IPHONE...COME MARCH MAYBE APRIL, APPLE WILL UPDATE THE IPAD AIR TO INCLUDE THAT FEATURE.I will continue to buy Apple mostly because their store has apps that are better, with more choices and work extremely well with their devices. I think this product is a 3 1/2 Stars at best and mostly for the size and weight reduction that is very significant. I feel the \"glass\" is too thin but seems to be durable as I have really been typing a lot on it as well as playing several games that require a lot of tapping. I am very happy with the size reduction but feel the brightness is not up to par with other new tablets or the iPad4.Recently the Safari browser has been \"crashing\" a lot over the past week in that when you tap on a hyperlink, the browser will basically disappear off the screen. None of the tabs close but it just disappears and returns you to the home screens. I also am finding the browser will get stuck/freeze for several minutes before resuming. I have several calls in with apple support and they are looking into the issues.Other issues is the VIDEO app, if you play a video via streaming not downloading and leave it somewhere like the middle or so on, it actually reduces your available memory by the amount you have watched from what I can glean. IT IS LIKE DOWNLOADING THE MOVIE TO THE POINT YOU HAVE WATCHED IT TO EVEN THOUGH YOU SELECTED THE STREAMING LINK. If you do this with several movies, you can basically wipe out your free memory. I find it difficult to clear the buffer and have basically learned to tell the app not to display any movies then to display movies then play the movie but move the slider to the beginning and press stop playing then done. Of these many steps I eventually clear the buffer but I am not sure which of all these steps actually is what does it if any!Oh lastly, the WI-fi is fantastic.FINAL RATING IS 3 1/2 STARS...MAYBE 4 IF NOT FOR THE BRIGHTNESS ISSUE.First I own iPad 2 and 4 and Samsung Note 10.1 2014 edition.I like...not love...the new iPad Air as it is faster both in operating the software apps and graphic intensive apps. The apps continue to be fantastic for all the pads not just the Air.Apple did a great job on the weight but FEEL STRONGLY THAT THE NEW SCREEN IS NOT NEARLY AS BRIGHT AS MY iPad 4 NOR DOES IT EVEN FEEL LIKE GLASS.As I type this review on the Air, the \"cheap tapping\" feel of this glass leaves me wondering how durable this glass is. It feels thin and makes a tapping sound not found on the more solid glass on my other two iPads.Oh I am keeping the Air for the faster processors but feel Apple has put out a product whose screen will not be as durable as prior pads.I can see it flex when I push down on it with minimal effort and have some light distortion when I press down like old type LED TVS.Apple over prices their products because they can and really did so on this iteration of their iPad. In my estimation the glass feels like plastic and the brightness is much diminished when compared to my iPad 4 and so must have a higher profit margin with all these cost cutting that resulted in a new iPad that for all practically purposes is just faster but not as solidly built as prior pads.Time will tell on the screen and maybe this is the way all tablets are headed to achieve the weight reduction and thinness. I love the ability to hold the Air in one hand comfortably for much longer than any of my current tablets. I am OK to sacrifice the glass quality as long as the touch screen does not suffer or long term screen reliability.I wish Apple would splurge and include a 6 foot charging cord...OMG $600 for 32GB and the cord is so short still after all this time...lol.", "Date": "November 18, 2013"}, {"Title": "Worst iPad Ever", "Author": "SanPa", "ReviewID": "R6AXD3MO1PMIA", "Overall": "1.0", "Content": "I'll get right to it. This product is designed for 64-bit operation; however, Apple has yet to debug the software provided with it.  The biggest challenge has been crashes while using Safari .... Arghhhh.  These crashes don't happen with my iPad Mini, so I know it is isolated to the Air.The AppleCare tech has acknowledged that the issue has been reported by other users, but Apples engineers have yet to offer any solution.  In short, this product is not ready for prime time.I'll consider revision of this review if and when Apple fixes the problem.  But, I know this will never be a 5 star review given the time wasted to date going through hours of debug exercises.", "Date": "February 17, 2014"}, {"Title": "Very nice hardware for the price! Lightweight, a joy to use", "Author": "Gearhead Mania", "ReviewID": "R3K3EAML83WH3K", "Overall": "5.0", "Content": "I've been using Android products mainly, but I first delved into touch devices with the first generation iPod Touch so I am familiar with iOS to an extent. For the past few years I've used Android FroYo, Gingerbread, Ice Cream Sandwich, and now Jelly Bean. I also have a Kindle Fire HD. The iPad Air is my first iPad, and I chose to go with the iPad Air because it has a much higher resolution than the best Android Tablets, with a really slick dual-core CPU and quad-core GPU. The Samsung Galaxy Note 10.1 is a close second but is more expensive than the iPad Air which was on sale during a Black Thursday promotion. The Galaxy Tab 3 just doesn't even come close with the screen resolution.The iOS 7 interface is OK. I prefer Jelly Bean's interface. Although clean and simple, the iOS interface isn't intuitive. There are too many sub-menus interwoven in odd areas. To change language, I have to go into no less than 2 sub-menu layers. Siri is fine, but Google Now/Google Search was far more intelligent and effective. Siri's default US female voice is much more realistic and smoother, but Google Now's other voices along with IVONA rectify that situation fairly well.The battery life on the iPad Air is very good. After an hour or so, I'm still above 90%. The WiFi is fast, and the overall UI is smooth. The movie/graphics playback is super fast. I can watch Flash based movies/video within the Safari browser without any hiccups.Compared to my 7 inch Kindle Fire HD, I felt that the 9.7 inch (Air's display size) or 10 inch screen size is just right, but only because the iPad Air is extremely thin and lightweight. The 7 inch KFHD is large enough to be usable for reading magazines, but it is not a good use of space. I have to flick through 2 or 3 screens while the iPad Air will show the entire page (in a very legible font size) in one screen. The KFHD is also heavy, so hopefully the new KFHDX is thinner and lighter.I used to make fun of Apple for going with the Lightning connector, but after using it up close, I can understand why it is innovative. It is made out of a solid chunk of metal with contacts on both sides. There's no \"right\" way of plugging it in, unlike USB where I constantly flip it around trying to figure out which side is up. But I still feel micro-USB is the right way to go, due to its universal acceptance with devices. The included 12W power adapter can actually charge the iPad Air at up to 14W of power based on what I saw with my Kill-A-Watt.With respect to the hardware and design, the iPad Air is outstanding at this price point. Aside from the hardware, the bulk of the iPad Air and Apple experience centers around iTunes, iCloud, and other Apple software. This is an area where I feel Google far surpasses Apple. The Apple ID system is cumbersome and annoying to use. I had to login probably a dozen times during the registration process, and buying/installing free apps required me to enter my password each time. It didn't seem like all of Apple's programs were tightly integrated because I had to use my Apple ID each time I fired up the apps for the first time. Once everything was setup and installed, it seemed fine. That said, installing and running Google's apps on the iPad was significantly less painful. The first time I used my Google account for an app (I believe it was YouTube), all of the other Google Apps recognized me and started syncing. Google Now/Google Search also puts Siri to shame, albeit Siri seems more \"human\" with basic functions. For instance, asking about the weather, Siri actually told me (In Chinese and English) that the weather wasn't very good at 27F. Doing basic searches, Siri and Google Now are about equal, but Google Now seems more intelligent with some of the intermediate activities like unit conversions or advanced searches.I never liked iTunes in the past, and my opinion has not changed with ITunes 11. It is overly complex to use. With Google/Android, I can access Play with a browser and have new apps sent to my devices with the greatest of ease. Syncing calendar events, email, contacts, etc... is also far easier with just using a browser versus the iTunes program on my PC. The good news is that iTunes isn't too bad to use on the iPad. Running Zinio, Conde Naste magazine apps, and other apps was smooth and problem-free.For those that like to use their tablet for browsing or reading magazines, or watching videos, I'd highly recommend a 10 inch display (the Air is 9.7\" but falls in the range). My 7 inch Kindle Fire is fine to use, but it is frustrating to use for magazines due to the amount of panning that is needed. After using the iPad Air, my Samsung Galaxy S3 feels claustrophobic with its 4.9\" display.Overall: 5/5 stars, the iPad Air is a well-designed device with great hardware especially with the Black Thursday/Friday promotions. However, Apple has a lot of catching up to do with respect to its software designs. I very much prefer Google's ecosystem as it is more \"cloud-based\" than what Apple is trying to do. Google's ecosystem feels almost seamlessly integrated while Apple's ecosystem felt more separated.", "Date": "November 29, 2013"}, {"Title": "Superb", "Author": "kalip", "ReviewID": "RQPH5B045CWYY", "Overall": "5.0", "Content": "This is my second iPad, I purchased an iPad 4 around a year ago.This iPad air is all I thought it would be and much more; it's muchthinner and the 64-bit A7 processor makes it faster it is also quite narrower although the screen sizeremains the same 9.7 inches.The retina display is  stunning and the battery life is great. You just can't beat Apple for quality.The first thing I noticed when picking it up is the difference in weight, this iPad air feels almost halfthe weight of my iPad 4. I can easily hold it in my hands for long periods.Like one reviewer alluded to earlier..... and judging from the comments of some, it seems thatthe major gripe most folks have about the iPad  Air is the price.I am almost sure if the price of the iPad was dropped close to that of those lower quality and lower pricedSamsung or Google Nexus; these same folks would be singing the iPad's praises.I have hesitation in recommending this product.", "Date": "December 6, 2013"}, {"Title": "Not disappointed", "Author": "Jadaros", "ReviewID": "RJNCYTJZMUC2R", "Overall": "5.0", "Content": "I bought this because I wanted to download epubs from the jw.org website and it works great for that.  The publications download easily, after you download the free ibooks app.  Once downloaded, the publications have all the scripture links embedded, pictures, etc.  This makes jumping from publication to Bible unnecessary at meetings because the scripture references are all right there in the publication.  The books are located in your library as books, too. The iPad Air is easy to set up, easy to use, lightweight and the battery lasts a long time.I have two older Kindle Fires and downloading non-Kindle books was a pain.  I had to get help from my geek speaking son to convert the files, the scripture links weren't always there, they didn't appear as books, but as downloads without a cover picture, and the pictures inside were messed up.  I love the Kindle for reading Kindle books and watching movies, but the iPad Air is better for downloading and reading non-Kindle books.", "Date": "March 29, 2014"}, {"Title": "I love it and it is light!", "Author": "Dr. Oceanfront \"Oceanfront\"", "ReviewID": "R20QAYXRGADNIY", "Overall": "5.0", "Content": "First my background...I am an Apple user with a lot of Apple gadgets. I need to be on the computer for 7-12 hours a day.I already own a MacAir, which I love, but as light as it is, it still weighs about 3 pounds ( still, I highly recommend and love my MacAir!).Anyway, I also have an ipad 3 and an Ipad mini, iphone etc., you get the idea. The reason I am mentioning this, is because I have a bad back and that is the only reason I have been updating devices. I am trying to find the \"perfect\" computer for my use. If I can help even one other person out there in my situation ( and save them a ton of money I had to spend <g>), I will be happy! :)First let me tell you a little about the Ipad Air...IT ROCKS!!Although the speed on the Air is much faster then my Ipad 3, whether syncing with iTunes, browsing the web or just getting emails, the speed was not the reason I upgraded. I am not a game player or a number cruncher so the speed of the ipad 3 was just fine for me.What did get my attention was the weight! I had already bought the new ipad mini, which is super cool and a lot of fun.I actually intend to keep it. However, as good as it's screen is, I cannot see me using it 10 hours a day. If I had 20 year old eyes, it might have beat out my Air! ;-)The a Ipad 3 was about 1.7 pounds. That may not seem like a lot, but for me it could not be a one handed device. I needed to put a case on it, making it 2 pound device. Compared to the Ipad Air, which is about 1 pound, that was almost a 50% reduction in weight! The reason the reduction is so much, is I do not feel I need a case with the Air. I have covered it with clear coat all over and that is it. I do not seeing it slipping out of my hands. However, when I travel, I will use a 5 oz cover or just a Smart Cover (3.5 oz).I know it can be dangerous, not using a case, but I am extremely careful and i bought the special Apple warranty. Besides, isn't the reason we spend so much on these because they weigh so little and are aesthetically pleasing?It is too beautiful to cover up. So far, no regrets at all, but I need to find something to lean the Air against while lying down.If my review helped you, please click \"helpful\" below. Thanks :)", "Date": "January 8, 2014"}, {"Title": "love it", "Author": "M. Feldman", "ReviewID": "R3RJBL6E94L09V", "Overall": "5.0", "Content": "yes I love it.  I've had an iphone for years as has the rest of my family.  I have to admit I read all about the new Kindle Fire HDX 8.9 and I bought it two weeks ago. the specs were awesome for the price. the only thing is a lot of the things I needed were not compatible with it. then my granddaughter tried to facetime with me and of course I couldn't because  Kindle doesn't have facetime. I told we would both have to download Skype to teleconference with eachother and she said forget it. too much trouble.  then I'd have to buy new extra chargers/cables etc. just too much incompatibility. so I returned it and bought this and I'm thrilled and happy with it. if I wasn't used to Apple products I would have kept the the Kindle. just being honest as I don't want anyone to think that the Kindle wasn't good", "Date": "November 21, 2013"}, {"Title": "Disappointed first time apple customer", "Author": "Ginfx", "ReviewID": "R3PXX0AJCUBKMP", "Overall": "3.0", "Content": "I was excited to purchase my first apple product. This unit was purchased from another retailer as part of a bundle and offered flexible payments. I was looking at the Air laptop, but then heard iPad air was coming out.  Sadly it will be going back.  iPad air is thin, lightweight, perfect size screen.The color is super sharp.  Super fast typing and going from app to app,, when it wanted to work. Which meant I really couldn't tell you if they worked well or not.  I'd only had it for a day and the screen froze.  Could only go back to the home screen, then loose any work one might have done. Couldn't turn it off. Then, when I was getting ready to put it back in the box, amazingly it decided to work. The set-up wizard was super fast helping this technically challenged person set up and link  all her accounts.  I REALLY liked that it was a tablet and a small laptop as it came with an awesome keypad. So then I started downloading music and wanted to hear the small ball speaker that came in the bundle. The female plug in the air was not quite the right size. I couldn't get a snug fit, also tried with the ear buds and another speaker. And as I fidgeted with the plugs to get a secure connection to receive a signal, the song would stop playing and the volume on the screen kept going up and down. Is this supposed to happen???? As for the sound, I wasn't expecting much from such a thin tablet. The speakers were on the back side but I'm not sure if speakers could be placed in the front. But since the speaker plugs won't fit, what's the point? You'd need to buy some blue-tooth speakers to really hear better soundIt would be hard for me to compare the ipad air to other tablets as this would have been my first touch-screen device other than my android smart phone.I'd have to agree with previous reviews. I also feel this device was rushed on the market before X-mas. With the screen freezing and the plug being poorly made, is a good indication of frantically putting something together and getting it on the market for the holidays. I really hope that the next generation iPad air will be greatly improved as I really like apple products,and software, and was hoping this would be the first.Apple, I am disappointed. You can do a lot better. Quit cutting corners and please remember you have a reputation to protect.", "Date": "December 5, 2013"}, {"Title": "Love It - Even If I Don't Like Admitting My Spouse Was Right ...", "Author": "delicateflower152", "ReviewID": "R1DLRVVT9CG06G", "Overall": "5.0", "Content": "Because I love my Kindle Keyboard, I was firm in my resolve to upgrade to the Kindle Fire HDX 8.9\".  The need for both color for children's books and my own need for a white background to provide contrast when reading were my primary motivators.  The price and versatility of the Kindle were better than other options available.  I do not use my device as a media player, but that seemed to be a nice option.  However, my spouse insisted I look at the \"Apple iPad Air\" before I made any purchase.After looking at the Kindle Fire HDX 8.9\" and the \"Apple iPad Air\" side-by-side in the big electronics retailer, I had to admit it, he was right!  Clarity on both devices was excellent, particularly as I intended to use the item primarily as an e-reader.  However, the Kindle Fire HDX 8.9\" kept freezing up; the blue shirted employees said that was a frequent occurrence.  The \"Apple iPad Air\" connected easily to WiFi and navigation was smooth and seamless.  The ability to use many of the same programs I have installed on my PC is a plus.  Downloading books is quick and the \"Apple iPad Air\" does not bog down so that it seems painfully slow when I try to change from a book to the main menu page.  Using the \"Apple iPad Air\" is intuitive, even for those individuals - like me -who are not especially tech-savvy.  Based on recommendations and the fact that I would use the tablet when traveling, I purchased the \"Apple iPad Air\" 16 GB with the ability to connect to AT&T.;The principle downside of purchasing the \"Apple iPad Air\" is its initial cost.  Individuals who are debating between purchasing a Kindle Fire HDX 8.9\" and an \"Apple iPad Air\" should look at the two side-by-side; consider their primary uses and personal preferences; and evaluate the price difference in light of those factors.  While I don't like having to admit my spouse was right, I do love my \"Apple iPad Air\".  If it fits your needs, you may find the \"Apple iPad Air\" is a tablet you will love, too.", "Date": "January 16, 2014"}, {"Title": "Perfect iPad", "Author": "Mak", "ReviewID": "R1N47LPBW4W011", "Overall": "5.0", "Content": "Excellent iPad, much better than predecessors. Everything you could want (thin, light, retina display, A7 processor, better battery life). Highly recommend this iPad if you are looking to upgrade or get your first one.", "Date": "December 6, 2013"}, {"Title": "iPad air crashes ! ! !", "Author": "Hank", "ReviewID": "RVAGWCG6KOG1P", "Overall": "3.0", "Content": "It's a nice tablet. Fairly fast. I got the AT&T; model and internet connections are fast. However, the darn thing crashes frequently !Very aggravating.", "Date": "February 17, 2014"}, {"Title": "NICE !!", "Author": "Swim Coach", "ReviewID": "R187JTPKIE0CPX", "Overall": "5.0", "Content": "I hesitated buying another iPad when my family already has 6 (different models and gens). These are great products and no wonder Apple is winning the tablet war. This is a testament to Apple's quality and attention to detail. However, the iPad Air exceeds all expectations. It is smaller, lightweight and long-lasting. The Retina screen was an improvement (aside from speed) during the iPad's evolution. The iPad Air is more revolutionary than evolutionary: highly recommended for those considering to replace their notebooks!!", "Date": "February 2, 2014"}, {"Title": "Lover the iPads", "Author": "marie \"teach\"", "ReviewID": "R1HUZW1RS647DS", "Overall": "5.0", "Content": "If you are on this site, you are trying to decide whether to buy the iPad or another tablet such as Samsung or other device. I mentioned Samsung because I love their phones, tv's, etc. However, when comparing the note to the iPad, I opted for the iPad. One very big reason is I love to buy, rent, download movies to watch. Having an iTunes account makes this so very simple. Also, I have a ton of iTunes credit (I always ask for iTune gift cards whenever the occassion arises). In addition to iTunes, I love Pages. When I got this app, it was free! However, if you do a lot of word processing, you might want to invest in this much needed addition. The great thing about Pages is you can send as a PDF or Word doc via email.Some are trying to decide if they should buy a 16, 32, 64, etc. Speaking from experience, a 16 will not be enough for must adults, but would be fine for a child. I know you can store in the \"cloud\". However, you have to have a wifi in order to retrieve from the \"cloud\" unless you have the iPad with a cellular service (which to me, is a waste). So, having your documents available whenever needed is a plus. Therefore, a minimum of 32 would be great.All said, I love gadgets and technology. I love having the latest, and that is why with each new model, I will upgrade. However, I think this iPad air will be mine for many years - of course I say that until the next iPad air comes out with the finger print scanner and I will tell myself, \"must have\".If you own one, enjoy! If you are contemplating purchasing, make the plunge (you can return it if not satisfied to most places including Amazon).", "Date": "January 30, 2014"}, {"Title": "Perfection", "Author": "C. Misra", "ReviewID": "R1XHINKVWKIHWD", "Overall": "5.0", "Content": "I had the retina mini which was great but too small for web browsing comfortably for extended periods.  I exchanged it for the Air.I'm much happier with the Air.  The extra screen space is more than worth it to me.  No more panning and scrolling and zooming endlessly with the mini, that is over with the Air.  The Air also plays video and music beautifully.  I actually felt the mini was absolutely perfect form factor for tv, movies, and e books.  The Air does all these things great too, but mini did them better, in my view.  Sigh.....so long, little dude.I had an ipad 4 from feb to yesterday.  Ten months.  It was great.  I sold it easily on Craig's list for $320.  I wish I priced it higher.  I could have likely gotten $350 for it.  In any event, I paid $180 to use it for ten months or eighteen dollars a month.  Fifty cents per day.  I can live with that.Love my new ipad Air.  It is sleek, light and attractive.  Easy to hold with one hand and I have small hands.  I have known girls shorter than me who had bigger hands than me.I recommend the Air.  A superb investment.  Whatever ur needs.  If you read. Or watch tv and movies, or need a great camera, organizer, music player.  It is a great product.  Just go get it.  Sell other stuff if u have to.  You will not regret.", "Date": "December 29, 2013"}, {"Title": "A little underwhelming", "Author": "Lucky Yona", "ReviewID": "R1HJY4K8FH1E26", "Overall": "3.0", "Content": "This will be relevant for heavy users. I gotta say I have a crash or frozen screen pretty much everyday. Battery life hardly reaches the 10 hour mark even when I'm conservative. I feel indifferent", "Date": "February 3, 2014"}, {"Title": "Not good enough!", "Author": "C. Nguyen", "ReviewID": "RLL1W7Q6ZFXZ1", "Overall": "3.0", "Content": "I love apple perfect hardware and design.  The new iPad air is not a good buy imo.  The bezel is too thin thats its so hard to hold without touching the screen and activate random things.  Apple didn't upgrade the memory in the iPad Air.  It is still 1GB.  I don't know why they do this but with only 1GB the iPad won't be good for more than 2 years.  Same thing happened to the iPad 1 and iPad 2 because of the limited memory that make everything much slower.  I think the 1GB memory is the very bad flaw on the new iPads.  Don't support apple because you own their product or you are their fanboy.  It is very stupid to do so.Although I love apple's hardware and software, I would not buy another iPad or other apple's products unless I see that they don't hold back on the upgrades.", "Date": "January 5, 2014"}, {"Title": "Just what I need!", "Author": "Awesome Possum", "ReviewID": "R2I6EP2UETQM8F", "Overall": "5.0", "Content": "The iPad Air is a fantastic tablet. Just what I need. Thinner and lighter than my sadly broken iPad 3, but now that I have had a chance to really use it, I think I probably would have upgraded even if I didn't break my last iPad. There are not too many changes (and there don't have too be) but the deal makers are the new and lighter design and the the 64-bit A7 chip that will pave the way for better applications and performance. No touch ID which is ok because I don't like having a pass code on my iPad anyways where on the 5S it is greatly appreciated. Same fantastic resolution as its past 2 models but now has better power to push them all. Gaming and productivity apps look and feel great and I can use them to do everything I need.", "Date": "December 1, 2013"}, {"Title": "Best tablet in the market that i could find for my wife THOUGH i am a Android fan!", "Author": "Moze", "ReviewID": "R2NB4JHKWOVJQT", "Overall": "5.0", "Content": "Though it was $15 more from Apple, I am okay with it. My wife loves it. The perfect user device no questions asked.", "Date": "November 26, 2013"}, {"Title": "Best large tablet on the market, but more choices than ever.", "Author": "Nick", "ReviewID": "R1DW9VYGONR4CK", "Overall": "5.0", "Content": "As a stand alone purchase, iPad's are still the best tablets on the market. As an upgrade from prior iPad's, the Air is going to be the biggest reason to upgrade in recent memory. Users from the 3rd Generation down will see substantial benefits to speed alone.What Works:It's substantially lighter. Easier to hold and use while watching movies or reading a book.It's substantially faster. The upgraded processor is so fast that most users will be future proofed for the next two years or more. 64 bit processing will give this tablet some legs.the battery charges substantially faster. This is a nicer reason to upgrade than most realize. The Air's battery is smaller, and holds it's charge very well compared to older models on iOS7. I had problems on my 3rd gen keeping it charged compared to the zippier charging Air.Lightning port is much more convenient, easier to plug in compared to 3rd generation and back.Speakers seem to pack more of a punch.What doesn't work:the screen has a slightly hollow and thin feel on the finger. As a consequence of a lighter tablet it's expected that the display lost some of it's heft.the volume buttons are spaced a little too far apart for me. Harder to press.volume speakers are annoyingly where you'd hold the tablet horizontally.-----That's my impressions with the tablet. My recommendation is if you have $500 or more to spend on a tablet, the iPad Air is going to be your first choice. Android hasn't been competitive in this section of the market. If you're looking for a less expensive, smaller tablet, then you're going to be looking at the Kindle devices or the Android devices.For Apple users, i'd recommend people on the 1st and 2nd gen devices take the plunge, the changes are enough to warrant the upgrade. 3rd Gen users are in the grey area. They are not going to see any difference in screen quality, and the speed of the Air may not be too large to matter for basic use. 4th Gen users are totally fine where they are.", "Date": "November 14, 2013"}, {"Title": "They Sent me a used iPad......WTF????", "Author": "Marcus Scott-Morgan", "ReviewID": "RUZ0K3ME024YE", "Overall": "1.0", "Content": "I cant believe these guys had the nerve to send me an iPad air with no factory seal around the unit.I then proceeded to charge the iPad for the first time.  Reach in the box for the cable to find that the lightning cable had a tinge of smoker yellow to it with major kinks in it.I cannot believe that i was able to purchase this piece of junk form these crooks.  How can it be OK to treat a consumer like this who spends upwards of $500 on a product.Do not purchase from these guys.  I have reported this to Amazon, and have been refunded already.  YOU GUYS ARE REDICULOUS!!!", "Date": "June 4, 2014"}, {"Title": "This is more a review of the seller than the product", "Author": "LaCretia Gelley", "ReviewID": "R1FX1O1JHRS33H", "Overall": "3.0", "Content": "I love the iPad. The issue is that I am unable to get AppleCare on this because the seller purchased longer than 30 days ago. Apple will only allow you up to 30 days after purchase to add AppleCare. Now I'm screwed as far as that goes.", "Date": "May 20, 2014"}, {"Title": "Simply the best", "Author": "Jenny Delamotte", "ReviewID": "RRR8L2C59ZFD1", "Overall": "5.0", "Content": "Do you remember being in grade school and having the kid you were in love with pick on you or make fun of you on the playground?  Remember what your mom and dad explained to you was the reason for that public humiliation?  Because they liked you too!  The same principle applies to all the competitors that say bad things about the iPad.  It's because secretly, they want to BE the iiPad.You can buy a competitor's product, but any way you slice it, it won't even begin to measure up. Just remember, every time they say something negative, they are really saying how much they love the iPad.  Nothing else compares to the bright screen on the iPad Air, or the way that it feel resting ever so lightly in your hands.  It just feels right.And that is what Apple has done so right.  It never wavered or varied based on the negative opinions of other companies.  It never even responded to them.  On the playground Apple walks away without a scratch, without trying, and without lifting a finger to respond to any other tablet's challenge.  It doesn't have to.  And everybody loves it.  See, mom really does know best.", "Date": "May 14, 2014"}, {"Title": "Great product but must return it due to multiple issues", "Author": "Amazon Customer", "ReviewID": "R2H7KKH50LJGSR", "Overall": "3.0", "Content": "Had to give this three stars because even though I loved the product I had problems with it. First off, the iPad arrived slightly scratched from shipping. I contacted amazon and decided to settle on getting a partial refund as I didn't want to go through the hassle (international customer) and also the item was working well and the scratch marks were on the back which I decided would be covered by a case anyway. However, after a couple weeks of (light) use it developed a blue line across the screen. I am sending it back. I wont buy another iPad from amazon though because what I have come to realize is that the warranty starts from the date the seller purchased the product meaning that I only have a few months left on this warranty. I'm just glad I figured this out sooner rather than later. Excellent product overall and great customer service from amazon in sorting out the issue.-Update- I have since received my refund and purchased a new iPad from Apple. What I realized immediately was how differently this one was packaged. The one I ordered on amazon did not come sealed and did not have plastic on either the screen or the back. Plus I had mentioned before that there were scruff marks on it. I strongly suspect that the original iPad I purchased here was not new as advertised. Buyers beware.", "Date": "May 13, 2014"}, {"Title": "Great piece of machinery, amazing app store, sucky memory.", "Author": "Pam A.", "ReviewID": "R3D1D23NZL600F", "Overall": "4.0", "Content": "You may be thinking to yourself right now that 16 GB is right for you. And if you are using this for the sole purpose of creating, sharing, and presenting documents, maintaining your schedule, and taking a few photos. That's great. However, I  tend to watch a few movies, but considering that I only actually have 12 GB of memory after software, large apps like pages and keynote, books, and few photos (less than 100) are taken into account, I can only put one on at a time, which gets a little old after awhile. The fact that apply doesn't allow expanded memory like memory cards still frustrates me to this day because you never know what you may want to put on your tablet in the future, and this leaves you no room to breathe. I hate the restrictions and the only real reason why I decided to get the IPad over the Samsung Note series is because the app store is incredible and much more versatile. I will certainly NEVER get another IPhone after having a Samsung galaxy unless Apple introduces the expanded memory.Anyway, moral of the story: Ipad Air is sleek, light, fast, functions well, has a great display and app store (that just being Apple in general). And if you REALLY have your heart set on this, I would genuinely think twice about the memory you choose. I don't regret buying this, it has served me in more ways than one. I just wish I had bounced for the 32 GB.", "Date": "April 22, 2014"}, {"Title": "Super tablet with one caveat", "Author": "Jojo", "ReviewID": "R1UME8OXVJTF7V", "Overall": "4.0", "Content": "I need to start by saying that I am an Apple fan.  I have tried to use Android and Windows, but I keep coming back to the Apple world.  I just like Apple's products.  I got an iPad Mini for Christmas, but decided to trade up to the Air because I wanted a larger screen.  I use my Air mostly for internet use.  I am doing online college courses, and find that I can access my coursework easily using the Air.  I also love how I can load the Amazon Video app and watch Prime on my iPad or Airplay to my Apple TV.  I love that I can sync my iPad to my computer for backups and to organize music and videos.  Now for the caveat.  Apple needs to increase the basic memory for these.  I could not afford to pay another $100 for the 32 gb Air.  16 gb does not last very long!  I want more memory!!  The available memory is more like 11-12 gb because the OS takes up the rest of the space.  Apple may never put a memory card slot in the iPads - they should, they could make it proprietary and sell them for a good markup, (not $100!) then they would make more money on volume sales!  At the least, they should start iPads with 32 gb.", "Date": "April 13, 2014"}, {"Title": "Reliable and fast...", "Author": "Jerry Palmer", "ReviewID": "RIYHW5RDGX42W", "Overall": "5.0", "Content": "I own or have owned several different tablets... IOS, Android, Windows... and I like them all.  I am not in one camp or the other as I believe device ownership is a matter of personal preference, need and usability for varied needs. That being said, I really to like the iPad Air.  It is light, fast and just plain reliable.  While IOS may be a bit closed when compared to other operating systems, I find myself using the Air a bit more then other devices for general use.  The display is great for consuming content and this iPad does so with nary a hiccup. The difference in size and weight from previous iPads truly makes a difference if you tend to be very mobile.  In addition, if you are turned off by the smaller size of the iPad Mini this is great alternative as it is so thin and light in comparison to previous models.  I came to this one from a 1st gen Mini.  I was very happy with the size of the Mini and (having owned a 1st gen iPad) was a bit concerned that the I would no longer be comfortable with a full size iPad but that has not been the case with the Air.If you are a storage hoarder and need  to carry all of your content with you, the 128GB device is the way to go. It is quite pricey but if you are willing to pay the price you will not have to worry about making room for new content.Overall very satisfied with this device.", "Date": "April 9, 2014"}, {"Title": "Apple ipad air 64 gb", "Author": "Frances Murray", "ReviewID": "R2OCMA2C72ZTPG", "Overall": "5.0", "Content": "I Love it ,works juust as I new it would ,Pictures come out so clear and watchng netflix on it is like having a TV with you", "Date": "April 1, 2014"}, {"Title": "Great Product.", "Author": "R. S.", "ReviewID": "R33TYA6D26XQ6C", "Overall": "5.0", "Content": "I am very happy with the IPad Air.  I had an iPad mini but decided to upgrade.  I like that it is so light weight and the retina display is wonderful.", "Date": "March 29, 2014"}, {"Title": "Great Deal", "Author": "Jason S.", "ReviewID": "R1UY6BT8EF4HY1", "Overall": "5.0", "Content": "Ipad came as described, new and in perfect condition.. thanks for the good price! No hitches, bought applecare at apple with no problems!", "Date": "March 29, 2014"}, {"Title": "not an iFan but starting to love it", "Author": "Malek Muraywed", "ReviewID": "RBE04CD5TT5DT", "Overall": "5.0", "Content": "I am finding why the apple products are popular in the user community. I like the product in all aspects of its design. I tried the android products in the past (just because I did not want to do apple products) and that prove to have been a big mistake. Never looked for simplicity but functionality - the iPad for sure seems to have a better handle on functionality than any other tablet on the market to date.", "Date": "March 28, 2014"}, {"Title": "not an iFan but starting to love it", "Author": "Malek Muraywed", "ReviewID": "RBE04CD5TT5DT", "Overall": "5.0", "Content": "I am finding why the apple products are popular in the user community. I like the product in all aspects of its design. I tried the android products in the past (just because I did not want to do apple products) and that prove to have been a big mistake. Never looked for simplicity but functionality - the iPad for sure seems to have a better handle on functionality than any other tablet on the market to date.", "Date": "March 28, 2014"}, {"Title": "Favorite purchase of 2014!", "Author": "Paul B. Miller \"pbm-photos\"", "ReviewID": "RV2GFQ9JB9KBQ", "Overall": "5.0", "Content": "No other way to say it, the new ipad air is simply awesome. Fast, responsive. Great to play games on, manage finances, edit photos, etc. all on a generously sized high resolution screen. I like that mine came with a screen protector. That was a plus. Make sure to buy a protective case and/or apple smart cover - as it completes the whole experience rather nicely. I got a handmade pouch/sleeve to carry it in at a really good price on Etsy, just search for ipad sleeve and there will be many different styles to choose from. Best tip I can give to the cellular device users is to go to Tmobile and pay the $10 fee for a SIM card that will give you 200MB of free LTE data for LIFE! Even though it's true that once you go over the limit, the speed is reduced to 2G, there are no overage charges. It's been great for really light data users such as myself as I only need it when not in the presence of a wifi connection (very rare). And I bought the \"Verizon version\"", "Date": "March 23, 2014"}, {"Title": "Too good", "Author": "Pavan", "ReviewID": "R35NGXXYIHAFG8", "Overall": "5.0", "Content": "Start using it for the past 1 month and love it. This is my first tablet and cudnt any better.", "Date": "March 19, 2014"}, {"Title": "THE BEST", "Author": "yocheckitout", "ReviewID": "RP8KL77KD32MK", "Overall": "5.0", "Content": "The iPad Air is everything I wanted it to be. It is so much better than the older iPads. Its light and its easy to hold onto. If you're looking for a tablet, I'd definitely recommend the iPad air", "Date": "March 19, 2014"}, {"Title": "Gift for my Wife", "Author": "Doyen", "ReviewID": "R3IFOHTMHD4FI6", "Overall": "5.0", "Content": "My wife had the original iPad. This purchase was an upgrade for her. The original iPad was just too old to run some of the new apps.She loves her new lighter, clearer, faster Air. We had no trouble getting on the AT&T; network. One call and everything was up and running in minutes.Shipping was outstanding. Received the iPad in two days in perfect condition.", "Date": "March 7, 2014"}, {"Title": "Rarely needed, always pleasant", "Author": "Tyler Mumford", "ReviewID": "R3OXHCBW592RLO", "Overall": "5.0", "Content": "I use my iPad for things that I could do with a laptop or iPhone, but it truly is more convenient for many of those tasks. I read, watch shows, browse the net, manage email, and take notes, to name a few things.", "Date": "February 18, 2014"}, {"Title": "Fully meets expectations", "Author": "George F. Smith", "ReviewID": "RIBYND44K2AQV", "Overall": "5.0", "Content": "Bought this for my wife as a Christmas present, and she absolutely loves it.  She had been using an earlier iPad so was already familiar with tablet technology.  She uses it for reading, checking email, web browsing, and for taking videos of our grandson during his wrestling matches.  For some reason, iPads are popular among moms and grand moms for taking wrestling videos.  She then transfers the videos to her MacBook Pro, writes them to an optical disc and gives it to the coach for analysis.  Video transfers are achieved when she syncs the iPad Air with her MBP.  She keeps it protected in a pink Otterbox, which gives the iPad a completely different look and feel.iPad Air is thinner and lighter than previous iPads and comes with a sharp Retina display.  I don't know if it's the best tablet for your money.  I do know she keeps it close at all times, and though she doesn't qualify as a geek she's worked in software maintenance most of her professional life.  If she were unhappy with it she wouldn't use it.  From my perspective as her husband it's a winner.My one complaint about all digital gadgets is that they are not nearly as tough as the old HP calculators.  Out of the box the gadgets are beautiful but then you have to stick them in some kind of case if you want to protect them, and the cases are a different look altogether.", "Date": "February 18, 2014"}, {"Title": "Super", "Author": "tct2 \"tct2\"", "ReviewID": "R1SO6X4JJA8GA", "Overall": "5.0", "Content": "I traded in my iPad 2 for the iPad air and could not be happier the performance difference is amazing! And the fact that how much value these devices hold. I received $168 from Amazon for my v2 to put down on the the Air, no other device on the market has the same residual value. I plan on using the air for three years then trading up for the latest and greatest. Read the cnet reviews/comparisons (just search best tablets) on this tablet it is the the cream of the crop and if you keep it in good condition with packaging it will hold its value. Props to Apple and Amazon!", "Date": "February 16, 2014"}, {"Title": "Great Ipad AIr. We love it.", "Author": "Jian Du", "ReviewID": "R16X17BS20UUEB", "Overall": "5.0", "Content": "Thank you providing a great product for easier our life.This is a very attractive product, light & mint and highly effective for work & life usage.", "Date": "February 16, 2014"}, {"Title": "apple i pad air", "Author": "bob f.", "ReviewID": "R23137PS1UPC2A", "Overall": "5.0", "Content": "i considered the apple i pad air since i have used apple products i have often found them easy to use, and ithe  i pad fits right into my computer world.. while others make make great products; i consider apple to be at  the top of the list", "Date": "February 9, 2014"}, {"Title": "Great product", "Author": "Robert J Hawk", "ReviewID": "R3FYV6SXBL7RQL", "Overall": "5.0", "Content": "It is far lighter than my wife's iPad with retina display. This makes it far less fatiguing to hold and carry. The new iOS 7 is also very cool.", "Date": "January 20, 2014"}, {"Title": "Awesome.", "Author": "Prasuti", "ReviewID": "RANZ97R2E549T", "Overall": "5.0", "Content": "The Apple ipad air is the best tablet made, period! It's light, fast and really easy to use. If you've got an iphone, you'llbe disappointed if you don't get an ipad instead of another brand.", "Date": "January 19, 2014"}, {"Title": "She loves it!", "Author": "JoeBotts \"bottieri\"", "ReviewID": "RX1U3A3YCPAI6", "Overall": "5.0", "Content": "This was a Christmas gift and she loves it.  We took it on out RV trip over the holidays and it worked out perfectly.  No more cumbersome laptop.", "Date": "January 19, 2014"}, {"Title": "Still the best!", "Author": "disks did,e", "ReviewID": "RGY5QBTRH4FJH", "Overall": "5.0", "Content": "I have owned the ipad air, 16gb, for a little over a month now, and it is perfect for my everyday busy life. It is slim, lightweight, and fast! It has the biggest AppStore out there, which is good for my kids. My teenage son loves it because he can do school research on it! No more using an old desktop. This tablet also has  the new a7 chip which makes faster. Even though I did not buy it from amazon, I bought it from AT&T;, you should consider buying it from here too,.", "Date": "January 18, 2014"}, {"Title": "posted earlier", "Author": "Dale Carrison", "ReviewID": "R1OO2UZAD55II4", "Overall": "5.0", "Content": "use it every day  have kids, grandkids, and great  grandkids entertaining us in picture, video, and sound  what could be better", "Date": "January 18, 2014"}, {"Title": "Great", "Author": "gary doyle", "ReviewID": "R1XOLSK5LU10NF", "Overall": "5.0", "Content": "Gave it to my wife for christmas. She is doing dishes . I asked her how she likes it . Loves it 5 stars", "Date": "January 18, 2014"}, {"Title": "Nice iPad air and a great deal!", "Author": "Junevreyes \"Jun\"", "ReviewID": "RRHQC8ICQR1VV", "Overall": "5.0", "Content": "I've been longing to buy an iPad air since it came out. Since this deal came, I took as an opportunity to have one. It's a great deal and I really liked my new iPad air! Thanks*****", "Date": "January 3, 2014"}, {"Title": "Very happy customer", "Author": "Janice \"Janice\"", "ReviewID": "R2FOX3W8I5LSY6", "Overall": "5.0", "Content": "This is my second ipad, when I saw the ipad air I definitely wanted to upgrade.  It arrived quickly and was packaged well.  This vendor is very good.  The ipad air itself is everything you expect from Apple and everything I wanted.  Very, very happy and highly recommend the product and the vendor.", "Date": "January 2, 2014"}, {"Title": "Apple is the Best!!!!", "Author": "BioHazard", "ReviewID": "R1N91OA7RXUSVM", "Overall": "5.0", "Content": "I love the new IPad Air. I got it the day it came out in stores. It starts with the ultra-sharp exterior. If you loved last year's iPad Mini, you'll feel right at home with the Air. Apple essentially built a larger version of the Mini with the Air, by slimming the beveling of previous iPads to achieve a sleeker framework.The lack of heft makes the Air just a little more comfortable: An LTE-equipped Air weighs all of 1.05 pounds. Wrapped in a comfy and protective Apple Smart Case, the Air weighs 1.368 pounds, still lighter than a third-generation iPad by itself. Despite the lack of size, the Air is no less tough. It's sturdy and not at all easy to bend.The Air feels that much more like an electronic magazine. The Retina display, once the standard for all screens but also facing more competition this year, helps that; reading text and viewing web pages on that crystal-clear, pixel-dense screen is the same joy it was when Apple first built Retina screens into its tablets early last year.If this is all Apple did, it would likely still be enough to keep it on top. But the iPad Air does far more, starting with the new processor powering the entire experience, the A7. The same dual-core, 64-bit A7 chip that debuted in the iPhone 5S is in the iPad Air; and initially, this seems like a disappointment. In theory, you expect something more in Apple's flagship tablet, something a bit more powerful, with perhaps more graphical horsepower.In practice, you won't notice a thing. Web browsing and apps still handle as snappily as ever, even if you have a gaggle of things running in the background. Top-tier games such as Infinity Blade 3 continue to deliver. A pleasant surprise is also how quickly some of the beefier games, such as Anomaly 2, loaded, compared to previous iPads. You'll move into and out of levels just a little bit more swiftly, and that helps make the entire gaming experience more friendly and natural. It's hard to know what this really means for Apple gaming, but don't rule out the possibility of more console titles being ported to the iPad.Apple realizes the limitations of the 64 GB storage too, offering a new 128-gig model. You'll pay a more-than-average-laptop premium here ($799 for the WiFi-only model and $929 for an LTE version), but the improved storage is intriguing, especially for those planning for a game-heavy future. I can now easily and comfortably load all the music and movies onto the iPad Air that I want and still have plenty of room left over for games such as XCOM: Enemy Unknown and Civilization: Revolutions.Battery life is steady, even if it's not mind-blowing. Apple claims the iPad Air can get you 10 hours on a charge, and that's definitely true. Even when using Apple's navigation for a long trip to Washington, I easily got through a day without needing to charge; and more casual usage, such as Web browsing and email checks, is no problem.The Air's lone shortcoming is that it lacks the fingerprint identification technology that debuted on the iPhone 5S. But I'd be hard-pressed to claim that this was some glaring omission; every other tablet you're going to use this year lacks such tech, and I've never seen that tech as an absolute must-have.The resulting tablet is as pleasant to use as they come, and it's backed by some consistently solid software. Android has made a tremendous run over the past few years, and a plethora of both Android and Windows Mobile devices are truly intriguing this holiday season. But if there's one consistent shortcoming on those devices, it's the up-and-down support of operating systems.It's hard to know whether this Android tab or that will support Google's latest OS, but that's almost never a problem with iPads. iOS releases are generally consistent and stable, the lone knock on Apple being its lack of Android-like customization.And while the Apps Store and iTunes are also battling competition from Microsoft's stores and Google's Marketplace, Apple's setup continues to set the bar, managing to be intuitive and easy to use and enjoying more and more high-profile digital releases.", "Date": "January 2, 2014"}, {"Title": "Love It!", "Author": "Amy Leftis", "ReviewID": "R9JQAS7K7K0PK", "Overall": "5.0", "Content": "Much faster than the original ipad. A little smaller and lighter in weight. Easy to use and carry with you.", "Date": "January 2, 2014"}, {"Title": "Apple is the Best!!!!", "Author": "BioHazard", "ReviewID": "R1N91OA7RXUSVM", "Overall": "5.0", "Content": "I love the new IPad Air. I got it the day it came out in stores. It starts with the ultra-sharp exterior. If you loved last year's iPad Mini, you'll feel right at home with the Air. Apple essentially built a larger version of the Mini with the Air, by slimming the beveling of previous iPads to achieve a sleeker framework.The lack of heft makes the Air just a little more comfortable: An LTE-equipped Air weighs all of 1.05 pounds. Wrapped in a comfy and protective Apple Smart Case, the Air weighs 1.368 pounds, still lighter than a third-generation iPad by itself. Despite the lack of size, the Air is no less tough. It's sturdy and not at all easy to bend.The Air feels that much more like an electronic magazine. The Retina display, once the standard for all screens but also facing more competition this year, helps that; reading text and viewing web pages on that crystal-clear, pixel-dense screen is the same joy it was when Apple first built Retina screens into its tablets early last year.If this is all Apple did, it would likely still be enough to keep it on top. But the iPad Air does far more, starting with the new processor powering the entire experience, the A7. The same dual-core, 64-bit A7 chip that debuted in the iPhone 5S is in the iPad Air; and initially, this seems like a disappointment. In theory, you expect something more in Apple's flagship tablet, something a bit more powerful, with perhaps more graphical horsepower.In practice, you won't notice a thing. Web browsing and apps still handle as snappily as ever, even if you have a gaggle of things running in the background. Top-tier games such as Infinity Blade 3 continue to deliver. A pleasant surprise is also how quickly some of the beefier games, such as Anomaly 2, loaded, compared to previous iPads. You'll move into and out of levels just a little bit more swiftly, and that helps make the entire gaming experience more friendly and natural. It's hard to know what this really means for Apple gaming, but don't rule out the possibility of more console titles being ported to the iPad.Apple realizes the limitations of the 64 GB storage too, offering a new 128-gig model. You'll pay a more-than-average-laptop premium here ($799 for the WiFi-only model and $929 for an LTE version), but the improved storage is intriguing, especially for those planning for a game-heavy future. I can now easily and comfortably load all the music and movies onto the iPad Air that I want and still have plenty of room left over for games such as XCOM: Enemy Unknown and Civilization: Revolutions.Battery life is steady, even if it's not mind-blowing. Apple claims the iPad Air can get you 10 hours on a charge, and that's definitely true. Even when using Apple's navigation for a long trip to Washington, I easily got through a day without needing to charge; and more casual usage, such as Web browsing and email checks, is no problem.The Air's lone shortcoming is that it lacks the fingerprint identification technology that debuted on the iPhone 5S. But I'd be hard-pressed to claim that this was some glaring omission; every other tablet you're going to use this year lacks such tech, and I've never seen that tech as an absolute must-have.The resulting tablet is as pleasant to use as they come, and it's backed by some consistently solid software. Android has made a tremendous run over the past few years, and a plethora of both Android and Windows Mobile devices are truly intriguing this holiday season. But if there's one consistent shortcoming on those devices, it's the up-and-down support of operating systems.It's hard to know whether this Android tab or that will support Google's latest OS, but that's almost never a problem with iPads. iOS releases are generally consistent and stable, the lone knock on Apple being its lack of Android-like customization.And while the Apps Store and iTunes are also battling competition from Microsoft's stores and Google's Marketplace, Apple's setup continues to set the bar, managing to be intuitive and easy to use and enjoying more and more high-profile digital releases.", "Date": "January 2, 2014"}, {"Title": "Love It!", "Author": "Amy Leftis", "ReviewID": "R9JQAS7K7K0PK", "Overall": "5.0", "Content": "Much faster than the original ipad. A little smaller and lighter in weight. Easy to use and carry with you.", "Date": "January 2, 2014"}, {"Title": "Very Nice!!", "Author": "Cyndi", "ReviewID": "R3MYP9QATDQD5A", "Overall": "5.0", "Content": "I struggle with new technology so I'm still learning about my new iPad Air, but I really like it so far.", "Date": "January 1, 2014"}, {"Title": "Great", "Author": "Victoria Enger", "ReviewID": "RM6QGFKCMDQK", "Overall": "5.0", "Content": "Best iPad ever.  Love it.Beautiful pictures and great functions. Wouldn't have another and other kind of tablet.  Light and easy to take around", "Date": "January 1, 2014"}, {"Title": "I love it !", "Author": "Julie Ramson", "ReviewID": "R2XESEEA91TQ76", "Overall": "5.0", "Content": "I got this two weeks ago and love it!  It's all that I hoped it would be and more.  The product came in perfect condition, sooner than I had expected and the seller followed up to be sure I was satisfied.  I would definitely buy from them again.  They were great!", "Date": "December 31, 2013"}, {"Title": "The most well rounded tablet you can buy", "Author": "Nick", "ReviewID": "R1Q04HD4US4YZU", "Overall": "5.0", "Content": "After previously using the iPad 2 , this iPad is a whole new world. Apple constantly thrives to improve there products, and this one is no exception. The new IOS coupled with the blazing fast 64-bit a7 chip makes this one of the fastest tablets I have used! The ease and simplicity of this tablet makes everyday emails, messaging, projects,etc. no problem. This is the only tablet I have looked forward to using.Now for more serious activities like gaming and other intensive applications, the iPad has no problems what so ever. The graphics are very smooth, almost life-like.  From the outside, this is the most beautiful tablet hands down. From the chamfered edges to the sleek aluminum back, this is a high quality device. Most other tablets are made out of cheap plastics, not this one. Everything feels well made and solid. Even though apple chose to use metals and other high end materials, the iPad remains one of the lightest and thinnest full size tablets you can buy. Another high point for the iPad air its the battery. It seems to go on forever! After using it throughout the day, I end up with 70 to 80 percent battery! Its unbelievably how much juice this thing holds! Some miscellaneous things about the iPad that push it even further over the top are the decent cameras and the excellent microphones and speakers. The speakers have a good base tone and very clear high pitches. Overall I would recommend this tablet to anyone looking for a device that can do pretty much anything. I just don't see anyway the apple can improve on this iPad. I guess we will just have to wait and see.  Keep it up Apple.", "Date": "December 30, 2013"}, {"Title": "Brilliant", "Author": "rafagrullon", "ReviewID": "R2QTYOU02A2S8U", "Overall": "5.0", "Content": "Brilliantly light. Brilliant tablet. Brilliant quality. Apple had this right. Can't say anything negative about it. Would recomend without hesitating. PS.: It comes with a wall charger and USB lighting cable.", "Date": "December 28, 2013"}, {"Title": "Great Product", "Author": "babajou99", "ReviewID": "R2DI6I8ZC828U7", "Overall": "5.0", "Content": "Has all the features I am looking for IPAD with the new technology and features to work and to have.", "Date": "December 28, 2013"}, {"Title": "It's Grrrreeaaat!", "Author": "Billie too", "ReviewID": "R3IMOIYP5DQNTZ", "Overall": "5.0", "Content": "The color and picture are even better than my HD TV. Got this for my Husband for Christmas. He's hardly put it down since then. We have a Roku 2 but the picture quality on the iPad Air is far superior to the TV and he now prefers to watch movies on the tablet instead of the television. Luckily I can still use my iPad Mini when I want to watch on the bigger screen.", "Date": "December 28, 2013"}, {"Title": "iPad", "Author": "William Myers", "ReviewID": "R3QDLZ2AXX8OJQ", "Overall": "5.0", "Content": "First iPad that I owned and just love it. For the price is should include a pen. Otherwise I have no other negative feedback.", "Date": "December 27, 2013"}, {"Title": "The best purshase that I did", "Author": "Jasmina G.Boycheva", "ReviewID": "RW7IQ5MPQTS5J", "Overall": "5.0", "Content": "I never had apple before an I decided to have one,I am very satisfying of this purshase.I forgotten my laptops my android phones....very positiveP", "Date": "December 26, 2013"}, {"Title": "The fastest and thinnest tablet around", "Author": "inspector gadget 007", "ReviewID": "R2OB5FIBY7GFDJ", "Overall": "5.0", "Content": "A anniversary gift for my wife and she loves it. The 32 GB was the right size as she takes lots of pictures,  downloads aps and watches movies and the video quality is excellent. I'm glad I went with the iPad Air as it works great with her iPhone. So far its worked flawlessly.", "Date": "December 25, 2013"}, {"Title": "Great Christmas Gift", "Author": "danny", "ReviewID": "RM4AEM9CLPYEV", "Overall": "5.0", "Content": "This iPad is so beautiful. It's unbelievably light, and thin for a full size tablet. This iPad  also extremely fast and made me finally realize just how slow my iPhone is.  The screen on this thing is also sharp and beautiful. The only bad thing about this product is that the screen attracts a lot of fingerprints, but a screen protector can easily fix that.", "Date": "December 25, 2013"}, {"Title": "Daughter's Christmas & Birthday Present +", "Author": "C. Martin", "ReviewID": "R3KMC3ACXK9QJ8", "Overall": "5.0", "Content": "1st off - better prices are available now (figures!) @ other stores. That being said, my daughter loves it! She and my son-in-law love the Retina display, the overall speed and capability of the Air. She uses it both @ home and work. I'm writing this on a Windows PC and I'm already saving up so that when this dies I can move on up to Apple!When I plugged her Air into my wall for the initial charge (12 hrs. one time only), it immediately recognized my Wifi net as well as those of my closest neighbors! If you use a Windows PC then you know the hoops you go thru sometimes to establish and connect to your own net! This Air handles the data processing my \"kids\" need at work in the airline industry without any difficulty at all and whisks through various cloud (Google or Apple) services.", "Date": "December 21, 2013"}, {"Title": "A new Air in my life", "Author": "Francisco Jose Garcia Galicia", "ReviewID": "R3OGJZ6A6IKXKE", "Overall": "5.0", "Content": "I am an old guy (54) who has have a lot of trouble trying to adapt my self to this world full of technology. I am suffering early Parkinson since 14 years ago. But with the new iPad air, everything is easier.", "Date": "December 17, 2013"}, {"Title": "Very happy!", "Author": "Iva Hardisty", "ReviewID": "RYES28LQLNSGR", "Overall": "5.0", "Content": "I love the iPad air! So light and easy to use. I have played with other iPad but this is the first one I have owned and I love it! Also a great price! 15 dollars cheaper than if I had ordered from Apple it's self! 15 dollars might not be much but it was enough to also get me a case! Over all very pleased! It also came a day early which  was great I was so excited when I got it.", "Date": "December 15, 2013"}, {"Title": "Seems to me to be the best tablet out there (but you've got to be willing to pay a premium for it)", "Author": "Kenneth Cooper", "ReviewID": "R3HOQ64T6OMR9F", "Overall": "5.0", "Content": "Some of these reviews from people who have supposedly purchased or used this device are a bit bogus (comments that don't match with the reality that actual device owners are experiencing).  Let's hope that those who are coming here for 'guidance' are also reading professional reviews from trusted media sources .. and .. talking to actual users of the product.My review: After trying several of the latest high resolution tablets on the market I returned all but one, the iPad Air. I can't find a thing about it to complain about (except the price). It's just outstanding in every way (display, size, weight, available apps, and operating system). It also addressed certain niggling complaints I had with my earlier iPads. With regard to other devices I tried, the latest Kindle Fires were excellent (great displays - and the price was right) but not sufficiently versatile to meet all my needs. The LG 8.3 was another excellent Android tablet but it didn't seem like a truly finished product (couldn't, for instance, lock it in landscape mode - very frustrating when trying to use it while lying in bed). It also seemed a bit pricy for what it was at nearly the price of an iPad Mini Retina (a tablet I was seriously considering for its portability). For what it's worth, the only tablets I tried, or even wanted to try, were those with very high pixel density displays. Later I also ruled out the true 7 inch devices with their 22 square inch displays (the iPad Mini's is 30 square inches, the LG 8.3's is 31, while the iPad Air's is 45). In other words, most of what else was out there had screens that were either too small or displays that were not sufficiently retina like.", "Date": "November 24, 2013"}, {"Title": "Receive a used one when pay for new", "Author": "Tommy Le", "ReviewID": "RNMMX58FSREJA", "Overall": "2.0", "Content": "Bought iPad air 128GB. Needed in a hurry so pay for one day shipping. I do a lot of online trading s I need something fast n reliable. My iPad 3rd generation seem to required charging all the time and loading seem to slow down.love the new iPad air. Fast ,sleek, love every thing about it. After set up and download and update all my apps I start using the search engine and look at the history that's when I realize that this iPad has been used. The history list was long. I'll be contacting amazon today to return this and get a new one. Good luck to all.", "Date": "February 19, 2014"}, {"Title": "Decent tablet, but expensive and takes away all user control.", "Author": "Serge", "ReviewID": "ROZMH0V6Y2OOR", "Overall": "3.0", "Content": "The hardware part is quite good, but connexion to external storage devices is only possible with a $30 add-on from Apple, and then only supports image files and completely ignores images taken with mobile phones other than Apple's.", "Date": "January 14, 2014"}, {"Title": "Nice product", "Author": "Alan Prouty", "ReviewID": "R32BP7047YJ23N", "Overall": "5.0", "Content": "This is just modern technology at it's best.  When the first iPad came out a few years ago, I scoffed.  \"Who would buy one of these things?  They're useless!\"  Bot, was I wrong.  It took a while but we finally decided to take the leap.  My wife's laptop died and I thought this would be a good replacement for her since she mostly consumes data (YouTube, Skype, Facebook, etc.) rather than inputting data (e-mail,word processing, spreadsheets, etc.).  It's a nice addition.  Also purchased the wireless keyboard to go along with it for longer e-mails and stuff like that.  It's easy to setup and has long battery life.  Kindle installed so all books go with it.", "Date": "December 28, 2013"}, {"Title": "another great Apple product", "Author": "R.M", "ReviewID": "R3MNNCN9SI93YO", "Overall": "5.0", "Content": "I love the IPad Air, it frees me from my desktop so I can work from anywhere! I haven't even begun to look at all the apps!", "Date": "June 2, 2014"}, {"Title": "A truly wonderful piece of hardware.", "Author": "Kyuzosan", "ReviewID": "RG3UUEOVR7FY", "Overall": "5.0", "Content": "Please note that when it comes to this market, I prefer Samsung based Android devices. Without any bias, this is a solid tablet computer. The touch screen is responsive, has great performance (iOS 7), and has outstanding battery life. Everyone in the family has a use for it, and with the right amount of storage and price point, is a valuable device. The merchant at which I purchased it from had it priced $100 below retail MSRP during its 1st half year on the market (March 2014). A great recommendation as a gift.", "Date": "May 26, 2014"}, {"Title": "iPad is the best !", "Author": "Bruce Holms", "ReviewID": "R3NHSO4M0POTRS", "Overall": "5.0", "Content": "I had the original iPad that I received as a gift back in April of 2010. At that point (a long time ago in the tech world) very few people took it seriously. My only concern at the time was the lack of a \"USB' port and camera. However, I was very eager to use it and I did. By the end of the year, I had accumulated 25 apps and was already \"sold\" on its usefulness.By 2012, it became obvious that with the release of video cameras and newer OSs, I was being left in the back - so I began to wish for a newer version. Recently I saved up enough money (about $800 total when you add in insurance) to purchase the latest iPad which I am reviewing now. I still always buy the 64GB version because I always need more space.What I like most about the the new iPad is that it is much faster and a lot lighter. What I don't like is the lack of a \"USB\" - but I guess you can't have everything.", "Date": "May 26, 2014"}, {"Title": "Gorgeous. Solid as a rock. Fast as hell. Just about perfect.", "Author": "S. Krason", "ReviewID": "R3J5RGZU0OFLFM", "Overall": "5.0", "Content": "Apple attracts haters these days because they're now considered the overpriced behemoth when they used to be the little engine that could. Whatever. This is the best-built, fastest tablet you can buy.Pick up any other tablet and twist it. It moves. It creaks. It's made of plastic and feels cheap. The iPad Air doesn't budge or make a peep. It's solid as a rock. It's gorgeous to look at, a pleasure to use and I adore it.", "Date": "May 24, 2014"}, {"Title": "Over $450 and another $9 for a user manual ??", "Author": "olrick", "ReviewID": "RYFZKO8HR9DR4", "Overall": "4.0", "Content": "My first Apple product, my first swipe screen---and it comes in slick package with a postage stamp of \"instructions\"......You want to read about how to use your new iPad Air ?  Be prepared to BUY  your operator's manual on line from Apple--ifof course you can navigate through the App store!.It may be greater'n'grits,  but I am struggling with basic functions  and a little bummed out that \"everyone\"  thinks these things are intuitive.  Shucks, I almost sent it back, because the harder I 'touched' the less often it worked !  It took a young relative to explain soft swipe and soft touch...", "Date": "May 21, 2014"}, {"Title": "Difference from iPad 2 to iPad Air is leaps and bounds.", "Author": "Nick", "ReviewID": "R3Q1K3UCP1BXS2", "Overall": "5.0", "Content": "Difference from ipad 2 is night and day. Retina display looks unbelievable. The speed difference is extremely noticeable. If you have an ipad 2 and you are considering upgrading to ipad air, they are in different leagues. Would HIGHLY recommend to the ipad/apple enthusiast.", "Date": "May 14, 2014"}, {"Title": "love it", "Author": "TROY MILLS", "ReviewID": "R3EWY3Z2G1RY2", "Overall": "5.0", "Content": "Really love the Air, still have the iPad 3 which my wife now uses, she loves it, i can see a little better graphics on the Air, great product", "Date": "May 13, 2014"}, {"Title": "Nice upgrade", "Author": "Jacx \"J.C.\"", "ReviewID": "R3OLYYBSUX1RHR", "Overall": "5.0", "Content": "I was needing a new iPad  and bought a kindle since they were on sale one day, the kindle is good for reading, watching netflix , holding my audio books and other things I have purchased through amazon but had some issues with app compatibility , apps not working well and writing programs just too different from what I was use to, not to mention only a front facing camera. Also the screen was tiny for web browsing.So I went ahead and bought the iPad Air and I am so glad I did, it's fast , has all my apps and rear camera although low light photographs are not the best and the speaker system in iPad Air is not up to the quality of the original iPad, which I still own and use but they no longer support or update. The iPad Air responds quickly and I am happy with it.  Was so impressed my mom updated her iPad a few days later getting the same one. I do like the white, had black before, slightly brighter when naked but mine now has a silicon case around it covering edge anyway.", "Date": "May 10, 2014"}, {"Title": "Yes lighter, yes faster, necessary to some.", "Author": "Christine A. Strand \"Chris\"", "ReviewID": "R2MOXWTQYUOCL7", "Overall": "4.0", "Content": "Yes new Apple items are awesome or amazing, I dislike the planned obsolescence, the waste left at each purchase and I am not speaking only about the garbage.  I would have happily used my iPad 2 for years and years if only the O S could support applications fundamental to my project. Cahoots I tell you!!", "Date": "May 3, 2014"}, {"Title": "great to use....and long lasting!!", "Author": "Swati Sundaram", "ReviewID": "R2E9XH8ZSG399E", "Overall": "5.0", "Content": "Just got an ipad air, its light in weight, has longer lasting battery life.  My kids use it more than i do, they do a lot of reading and games on the ipad.  It very easy to use, light in weight and has a lot of wonderful apps on it.  they absolutely love it.  Use it also to take pictures.  Just love it....wish i had brought it much earlier.....", "Date": "May 2, 2014"}, {"Title": "Yes lighter, yes faster, necessary to some.", "Author": "Christine A. Strand \"Chris\"", "ReviewID": "R2MOXWTQYUOCL7", "Overall": "4.0", "Content": "Yes new Apple items are awesome or amazing, I dislike the planned obsolescence, the waste left at each purchase and I am not speaking only about the garbage.  I would have happily used my iPad 2 for years and years if only the O S could support applications fundamental to my project. Cahoots I tell you!!", "Date": "May 3, 2014"}, {"Title": "great to use....and long lasting!!", "Author": "Swati Sundaram", "ReviewID": "R2E9XH8ZSG399E", "Overall": "5.0", "Content": "Just got an ipad air, its light in weight, has longer lasting battery life.  My kids use it more than i do, they do a lot of reading and games on the ipad.  It very easy to use, light in weight and has a lot of wonderful apps on it.  they absolutely love it.  Use it also to take pictures.  Just love it....wish i had brought it much earlier.....", "Date": "May 2, 2014"}, {"Title": "ipad air 32 gb", "Author": "Willie Fetchit", "ReviewID": "R32PLRW76F7PWU", "Overall": "5.0", "Content": "I was always warned to stay away from Apple products because they are proprietary. They told me they only run apple software. Guess what ? NOT TRUE. I love this product. I've had it two weeks now and it does everything my desktop quad core does, only faster. True, it took me a few minutes to find my way around the controls, but after that it was a breeze. My only regret is that I did not order it with AT&T.; Lightning took out our phones and internet for3 days and I went into withdrawal ! A great device. So light and powerful. Well worth the money !", "Date": "April 30, 2014"}, {"Title": "IPad Air", "Author": "Penny Schritz", "ReviewID": "R38VH6W5T1GY46", "Overall": "5.0", "Content": "Was a great birthday gift for my partner. Her I Pad was 3 years old, and giving her problems. Sound didn't work sometimes. This new I Pad Air was just great. I even had the time to update it from her old one, so when she opened it, it was set and ready to use.", "Date": "April 30, 2014"}, {"Title": "Love my apple Air", "Author": "ROBERT PINES", "ReviewID": "R2DOYC7HWAWPJE", "Overall": "5.0", "Content": "It is really a great tool.  I use it to surf and to read books and its just so convenient", "Date": "April 26, 2014"}, {"Title": "I love it.", "Author": "Amazon Customer", "ReviewID": "R2XF9TUJXKI20Z", "Overall": "5.0", "Content": "Works perfect. Very good for my sermon preparation. I will recommend it for all my friendsespecially my pastor friends", "Date": "April 22, 2014"}, {"Title": "Best there is! Lighter, faster, more powerful, more compact, and with a longer battery life to boot.", "Author": "Hugo D. Ley \"Looking for a Good Deal\"", "ReviewID": "RWJ6NQ3O04JGA", "Overall": "5.0", "Content": "And last but not least ...an amazing ecosystem.I've had the original iPad, and got the iPad mini because of the weight of the original. But the new Air gives me a great a large screen retina display with a vey manageable footprint and weight. Technology is all about usability, enjoyability, and productivity, and the iPad Air gets an A+++ in those accounts.", "Date": "April 22, 2014"}, {"Title": "Not enough memory", "Author": "Cindy Cove", "ReviewID": "R1V2JWJRHI0OHY", "Overall": "5.0", "Content": "I didn't realize how much \"stuff\" I had on my previous iPad.  So I had to return it and order a 32gb.  The return was extremely easy as well!", "Date": "April 17, 2014"}, {"Title": "Love this product.", "Author": "Kerstian", "ReviewID": "R3QR870ZW2KN74", "Overall": "5.0", "Content": "I received this product from Tech Giant.  The shipping was fast and the product came in the iPad box like if you buy it in the Apple Store.  I had originally had the iPad 2 and felt like I wanted to upgrade.  I use my iPad for social networking, games, and online.  For me it's a great iPad.  It's like(which I think is due to the screen, which feels more like plastic then glass).  All in all great iPad!", "Date": "April 16, 2014"}, {"Title": "Best purchase I've made here,", "Author": "CTV", "ReviewID": "R1WJLMDS1Q03I9", "Overall": "5.0", "Content": "The IPad is wonderful! I adore everything about it. The customer service and speed of delivery was exceptional. As a matter of fact, I love this little contraption so much I have already purchased two covers for it-and that's not like my \"usual self\" LOL. Yes I have a high speed high performance computer and an IPhone but this IPad Air still rocks,", "Date": "April 16, 2014"}, {"Title": "We love it", "Author": "Jill Spasser \"Food maven\"", "ReviewID": "R24QZGAR8KGUQD", "Overall": "5.0", "Content": "There is nothing lika an air pad, as the song goes.  It is clear,rapid and portable.  I carry it wherever I travel.", "Date": "April 6, 2014"}, {"Title": "excellent tablet, thin, super fast", "Author": "Coby Moore", "ReviewID": "R1OZ7TFK462GA3", "Overall": "5.0", "Content": "excellent...ultra light tablet,super clear screen, not bulky. This iPad Air is amazingly fast, most apps mirror a desktop/laptop computer which is very nice. The battery is superb, left uncharged overnight and still had 90% battery in the morning...very impressive, also has great WiFi connection...what else can you say..lolno complaints...better than original ipad by far", "Date": "April 5, 2014"}, {"Title": "Love it", "Author": "Andrea", "ReviewID": "R1GWMIKW3FUFTX", "Overall": "5.0", "Content": "Very light weight. Good graphics. Battery life is great. Great for traveling, use it for Netflix, browsing the web, reading, and so much more.", "Date": "April 4, 2014"}, {"Title": "my favorite electronic", "Author": "chillociraptor", "ReviewID": "R1R0XKWB8124D", "Overall": "5.0", "Content": "Gorgeous clear screen, lightweight, tons of fun and useful apps - well worth the money. I've tried other tablets and this one is just the best.", "Date": "April 3, 2014"}, {"Title": "Love it", "Author": "sherry tadlock", "ReviewID": "R3F3I010RH5DVN", "Overall": "5.0", "Content": "Love I just have to learn all the great things I can do with it. My husband who usually shys away from electronics is using it", "Date": "April 3, 2014"}, {"Title": "Love my iPad", "Author": "Sara Branch", "ReviewID": "R3MX1GENU4TETO", "Overall": "5.0", "Content": "What can I say? Apple makes products that thrill the user, stimulate creativity, and take learning to new level. I'm a professional trainer and use my iPad for demonstrating and evaluating learning exercises. We are also developing and app for iOS and I'll use my iPad to demonstrate that. I'm also a classical singer and I've loaded an app that analyzes my voice and SHOWS me if I'll be able to sing \"over\" an orchestra. Truly amazing.", "Date": "April 3, 2014"}, {"Title": "Excellent purchase", "Author": "Marlene Blair", "ReviewID": "R1BOINOAYHOYIH", "Overall": "5.0", "Content": "I researched Ipads and also thought about just updating my iPod. I finally decided to purchase an Apple Ipad air and it is everything I wanted and more.Large screen, easy to operate and interfaces with other Apple products. It was a great purchase.", "Date": "April 2, 2014"}, {"Title": "Definitely the best Pad out there", "Author": "Jiaming Yin", "ReviewID": "R29MX4LYEWPMJC", "Overall": "5.0", "Content": "It seems you can't go wrong with the apple products. Tried GalaxyTab and Nexus10, still ipad is more intuitive to use.", "Date": "March 31, 2014"}, {"Title": "Wonderful", "Author": "lynn green", "ReviewID": "R3OWTKQ6YGFCIR", "Overall": "5.0", "Content": "Very little to complain about. Some apps that it won't take such as Flash but pics are beautiful as well as the resolution and clarity. Completely satisfied!", "Date": "March 31, 2014"}, {"Title": "Just as I expected, Fantastic.", "Author": "WillieArthur", "ReviewID": "R3UQ0BMIYZVCBH", "Overall": "5.0", "Content": "The iPad arrived on schedule, which is always a big plus for me when buying Online. I love the quality of the iPad Air, its brilliant, but I would like to see some features similar to Samsung devices, such as widgets, dual screen, etc. That said the quality of the iPad is just brilliant. .", "Date": "March 31, 2014"}, {"Title": "Ipad", "Author": "Ray Bencar", "ReviewID": "R2GTTDSY0VVBY3", "Overall": "5.0", "Content": "This is my first Ipad and I love it! I purchased it with WI-FI only and have it hot spotted with my Iphone. All the food groups with a lower cost!", "Date": "March 25, 2014"}, {"Title": "Awesome !!!!", "Author": "Castillod70", "ReviewID": "R17HG1LF301RLL", "Overall": "4.0", "Content": "Great deal and super fast shipping, great customer service. But before purchasing ask if your iPad is able to get apple care plus on it. I was not able to because it was more than 30 days out. But still has most of the year of the standard apple care.", "Date": "March 21, 2014"}, {"Title": "i pad air", "Author": "David Morris", "ReviewID": "RBOGSL9A2GR3C", "Overall": "5.0", "Content": "it has exceeded our expectations in performance and usability. both my wife and I have been using it on a regular basis.", "Date": "March 21, 2014"}, {"Title": "I Pad Air", "Author": "Bea Perez \"Beatrice Perez\"", "ReviewID": "R1L0O3DF34YA0A", "Overall": "5.0", "Content": "The I Pad Air is so light that it feels like I'm not holding anything. It works great & the pictures are beautiful I love it.", "Date": "March 21, 2014"}, {"Title": "Great buy!", "Author": "Rick Currie", "ReviewID": "R1QB6GD9KMV8NE", "Overall": "5.0", "Content": "Takes a few days for it to arrive but there was no rush for me.  Will certainly enjoy using it.", "Date": "March 21, 2014"}, {"Title": "A huge step when comparing a generation 1 ipad and the iPad air", "Author": "Chastity", "ReviewID": "R2JDAE53SM5F76", "Overall": "5.0", "Content": "I have used a generation 1 ipad for a year now and, I was excited when I first started using it. Even though it didn't have a front or back camera. I didn't mind.It's pretty heavy so, i just layed it down on a tablemost of the time. It was all fun and games, until the ios7 update came out a few months ago. After the new update,I could barely do anything on it. All of my favorite apps were no longer useable and, I had to delete them all because theyrequired the new update. After ios7, the first gen ipad suddenly became useless and, I felt cheated out on the amount ofmoney that was spent on that ipad. I'm very surprised that the ipad 1 only costs 200 hundred dollars less than the new one.Even though generation one is a discontinued model. In my opinion, it should be off the market completely. Why bothergetting this outdated device, when you can buy the newest one for $200 more? The ipad air has a completely different feel to it. It's a hundred times lighter.The iPad air has so much new things like Siri. Some people may think asking a electronic device to do something for you might be a bit lazy but, you can make a reminder within 5 seconds without leaving your current app. Siri has better results when searching for something specific. It's also helpful if you're slow at texting or, if your hands are full. Browsing the web is a lot faster but, downloading an app may take a while depending on your Internet connection. Since ios7 is an high definition upgrade.", "Date": "March 19, 2014"}, {"Title": "First choice for a tablet a real winner", "Author": "C. Donnelly", "ReviewID": "R3OTZBD2FA1I3C", "Overall": "5.0", "Content": "I'm not trying to gush, but wanted to say that I waited and bided my time before breaking down and buying a tablet, and I'm really glad that this was the one that got my feet wet!  My main reason for getting one was that I was tired of dragging a cumbersome laptop (ha! laptops are now cumbersome!) when I traveled and needed to work.  This is lighweight, efficient, and has changed the way I can work while away from the office.  And while the cellular service added greatly to the purchase price, I prefer not having to rely solely on Wifi should it not be available.", "Date": "March 19, 2014"}, {"Title": "Love my iPad", "Author": "Wub", "ReviewID": "RUTNY1Y1WT55D", "Overall": "5.0", "Content": "I thought I could live without an iPad, but it is so light and convenient.  It does everything!  I have to hide it from my grandkids.", "Date": "March 18, 2014"}, {"Title": "Awesome iPad", "Author": "Chris Foste", "ReviewID": "R2AZ3JM64JGAYM", "Overall": "5.0", "Content": "I bought the iPad for traveling purposes and haven't regretted it.  Does everything a computer would do and then some.  Definitely worth the money.", "Date": "March 18, 2014"}, {"Title": "Great iPad.. Step up from other older versions", "Author": "bigbeezy209", "ReviewID": "R2E69RJV1RXYHP", "Overall": "5.0", "Content": "Love this iPad air.. It's so light & sleek that it's not a burden to carry around everywhere you want to go... Screen looks beautiful and build quality is just like every apple product.. A+", "Date": "March 18, 2014"}, {"Title": "excellent", "Author": "arthur", "ReviewID": "RRTKCTTR95PTK", "Overall": "2.0", "Content": "i like it and hope word could be used when I open the apple ipad air.in fact ,I can not find the difference between ipad 4 and ipad air", "Date": "March 18, 2014"}, {"Title": "had to buy charger", "Author": "robert bennett", "ReviewID": "RBLALTKNUFLOU", "Overall": "4.0", "Content": "Ipad is great! Charger was not. Would've given 5 stars but charger had short in it had to buy new charger.", "Date": "March 17, 2014"}, {"Title": "ipad mypad!", "Author": "Rita Runyon", "ReviewID": "R2OZSMS2AY9QU9", "Overall": "5.0", "Content": "I love it… I just haven't figured out how to use it… I can't get to the Apple store at the mall, for help, they do not have electric carts and I can't get inside without assistance. I have been using it to do some reading online and it's great! I sold a cherished antique to buy this and I'm so glad I did! I'll get this figured out.", "Date": "March 8, 2014"}, {"Title": "First tablet...it is awesome", "Author": "Sonya B Dean \"webrose\"", "ReviewID": "R37EBVPXPZC5I1", "Overall": "5.0", "Content": "this is my first tablet so take that info into consideration...I have an iphone 4 so was able to sync all my apps and contacts and everything else including music very easily.", "Date": "March 8, 2014"}, {"Title": "Tablet decision", "Author": "Kathy Bridges", "ReviewID": "R10NM0VW1A1TF2", "Overall": "5.0", "Content": "I debated which tablet to get for over a year, sitting on the fence, afraid to make a move. Finally, I decided that since I had an I-phone, this was probably the easiest move for me. I am so pleased, was up and going in about 5 minutes. Donating my nook to the 2 year old granddaughter today.", "Date": "March 8, 2014"}, {"Title": "The  best on the market", "Author": "Kathleen D.", "ReviewID": "R1DR1EZ8NHQO2J", "Overall": "5.0", "Content": "I really like my I pad it takes beautiful pictures. Plus we took it to the ice rink where my 5 and 7 year old granddaughters takeskating lessons. we took video's of them and they loved watching them. over and over.", "Date": "March 6, 2014"}, {"Title": "IPAD AIR", "Author": "Bishnu D Piya", "ReviewID": "R3GVHH63R8Z7R4", "Overall": "4.0", "Content": "awesome device much lighter and smaller thann the regular ipad's.Easy to handle. Much faster in processing than the old ipad's", "Date": "March 6, 2014"}, {"Title": "I-pad air 32 GB", "Author": "J. morford", "ReviewID": "R28Y58SFLRMTQB", "Overall": "5.0", "Content": "I love my new I-pad air!!!  Faster, lighter and perfect in every way!!!  love it!I would highly recommend. It!!", "Date": "March 6, 2014"}, {"Title": "in love", "Author": "Justin & Sarah P. \"Creature... For a while.\"", "ReviewID": "R90TN1B948FSF", "Overall": "5.0", "Content": "of course I am in love!  Came a day earlier than expected...it was like Christmas morning for me!  iPad is the way to go!", "Date": "March 6, 2014"}, {"Title": "Everything I thought it would be", "Author": "Don DiFiore", "ReviewID": "R32B3191K976UN", "Overall": "5.0", "Content": "All apps synced perfect. All my Apple products work exactly as advertised, across the board through the cloud.  Worth the money difference if you use Apple products.", "Date": "March 6, 2014"}, {"Title": "Happy", "Author": "Ben A. Holliday \"Ben\"", "ReviewID": "R2IHKIXHY3VJG7", "Overall": "5.0", "Content": "It was a gift to my wife and she loves it, so that makes it worth it. As much as she uses the iphone now she at it with the ipad. Shewatches TV and a movie on the iPad at the same time.", "Date": "January 15, 2014"}, {"Title": "Loved It!", "Author": "Ramon S. Reyes", "ReviewID": "R8GCU6Z8NYVVA", "Overall": "5.0", "Content": "This iPad Air was a gift for my wife and she continues to enjoy it immensely.  The unit is much lighter than her first generation iPad and the graphics are definitely better.  She can now use Facetime since this new unit has a camera, one that did not come with her original iPad.", "Date": "January 15, 2014"}, {"Title": "I love it", "Author": "Ana Sofia De Agrela", "ReviewID": "R1FGBOLGM6Y46Q", "Overall": "5.0", "Content": "The iPad air is the best iPad yet! If you buy it you won't regret it! Really love my new iPad :)", "Date": "January 15, 2014"}, {"Title": "Ipad Air", "Author": "Karen A. Stoner", "ReviewID": "R36A8QXU63KP5F", "Overall": "5.0", "Content": "So far can find NOTHING wrong (CON) about my new ipad Air!!! (PROS- It is smaller & definitely lighter and has some new features!I had previously purchased the Ipad 2nd Generation and was VERY \"happy\" with it! BUT in my very rushed world, I dropped and cracked the front screen...:-( Not knowing what to do, BUT knew I didn't want to be WITHOUT my ipad. (I take it almost everywhere I go.) So when someone asked what I wanted for Christmas, I told them! So now I have my travel ipad and my stay-at-home (Ipad Air).So now, I won't be without my Ipad...:-) I will update my review if the need arises.", "Date": "January 15, 2014"}, {"Title": "Hubby Loves IPAD!", "Author": "Pinkbubblegum4me", "ReviewID": "R1G6Y6OI019WZN", "Overall": "5.0", "Content": "Hubby, who is somewhat tech challenged, loves this! So easy to use and READ! Now I can use the desktop computer again!", "Date": "January 14, 2014"}, {"Title": "Smaller in a good way", "Author": "Aaron Smith", "ReviewID": "R3LQ2RMXC00BYM", "Overall": "4.0", "Content": "I have really big hands and I can palm this thing.  I truly like the smaller bezel around the edge.  That has always been wasted space in my mind.  I came off an iPad 2 and this one is significantly faster.  Text is significantly clearer on the retina type display.  A great design and works like a charm.", "Date": "January 14, 2014"}, {"Title": "Buy one", "Author": "bonniejean815", "ReviewID": "R1R2UWWI65O2LG", "Overall": "5.0", "Content": "Awesome iPad. Best ever yet. Fast. Beautiful display light and thin  Best ever  worth every penny. Battery lasts longer. Than earlier models", "Date": "January 14, 2014"}, {"Title": "Didn't think I needed one....till it was in my hand.", "Author": "Joe", "ReviewID": "R2NUVMMUSXTU0L", "Overall": "5.0", "Content": "Headline says it all. So ridiculously light and sleek. If you're trying to save a few pennies, maybe look at the Nexus 7 or Kindle HDX, but if you want the best, this is it.", "Date": "January 14, 2014"}, {"Title": "GET ONE, IF YOU HAVEN'T ALREADY", "Author": "Mr. T. Echeumuna", "ReviewID": "R3HUSUASDGJIQY", "Overall": "5.0", "Content": "I am so pleased with my iPad Air. It is unbelievably light for an item this size. You will not believe it. If you have had ones of the earlier iterations, then you will know what I am on about. But if not and you are looking for a tablet - money no object - then get this iPad, and  you won't regret it.Enough said!", "Date": "January 13, 2014"}, {"Title": "Wonderful,", "Author": "Mme Mildred Elliott \"Tony E\"", "ReviewID": "R2Y0BQ2MSAUH2Q", "Overall": "5.0", "Content": "I use the iPad for personal and business purposes. Whilst I am still learning just to operate this wonderful piece of equipment, I have already found many applications that will assist me  and shorten my completion of  my tasks.", "Date": "January 11, 2014"}, {"Title": "Great device.", "Author": "SHEY", "ReviewID": "R20810V6O92N25", "Overall": "5.0", "Content": "I absolutely love my new iPad. It's amazing! It was a present for me and I can't get enough of it. My entire family loves it. Would definitely recommend.", "Date": "December 26, 2013"}, {"Title": "A great gift", "Author": "Georgeen Carden", "ReviewID": "RTB7ALFQTYSAL", "Overall": "5.0", "Content": "Gave it to my husband for Christmas and he loved it. The only complaint is the start-up process was difficult to understand and required tech assistance (available Christmas Day!!!). Apple continues to do it right in electronics.", "Date": "December 25, 2013"}, {"Title": "best gift", "Author": "diane trekell", "ReviewID": "RVY15CBP64UVT", "Overall": "5.0", "Content": "fast shipping, well packed, best Christmas Gift ever. looking forward to using it for work fun and playing games, pictures", "Date": "December 25, 2013"}, {"Title": "Great devices to have.", "Author": "Janice Hemsley", "ReviewID": "R17SK6Y25Z4K56", "Overall": "3.0", "Content": "The Apple IPad Air is a great device.  It feels comfortable to hold in your hands.  The only dislike I have is that it don't support Adobe Flash Player.  I like to play certain games on my computer, but when I pulled them up the the Apple Air, I'm not able to download.  After reading more about why Apple doesn't support Adobe on none of their devices, I was kind of upset.  I wish I would had looked more into this before I purchase this ipad.  I've only had it for a week and now I'm trying to sell it.", "Date": "March 24, 2014"}, {"Title": "iPad air......", "Author": "Alistair", "ReviewID": "R33VY9LYY4KHUL", "Overall": "5.0", "Content": "I recently switched from the kindle fire HD to the iPad air. I like the larger screen, stunning resolution and general,ease of use. Ok so it is more expensive but I believe you get what you pay for.", "Date": "February 3, 2014"}, {"Title": "For those who are still thinking about upgrading from the iPad 3", "Author": "Dmitry Shishkin", "ReviewID": "RCWBUBL868JAX", "Overall": "5.0", "Content": "To make it short: no, it is not worth upgrading from iPad 3 based on my experience...After reading all these excited reviews I finally gave in to the temptation to get one from the store, thinking that may be if I play with it more I would see how awesome it is (trying it in the store did not impress me that much). After a few days of using the iPad Air and iPad 3 I can tell that an upgrade would not be worth the hassle of putting my older iPad on ebay and making up the difference which would be around $300 I guess (I have the 16 GB version) . Actually, a lot of professional reviewers online recommend exactly this: don't upgrade if you already have either an iPad 3 or iPad 4.The difference in size and weight is (slightly) noticeable when you are picking the device or holding it in your hands. The thing is that I never just hold my iPad in my hands when using it (and I do use it a lot!). Most of its weight goes either to the desk when I am at my desk, or to my lap if I am in my chair, or to my chest if I am on my couch. Which means I am basically using my hand(s) to balance the iPad not to support it. In such situations extra 7 ounces is not a big deal at all.If you are using your iPad differently (for example, playing games a lot) then you might appreciate the iPad Air better. Also, if you just want to have the latest and the coolest iPad then of course that would be worth it too :)Seems like Apple is following the same pattern with both the iPad 2 and the iPad Air, mostly squeezing the same device in a smaller package. This is not good enough for me. I waited until the iPad 3 came out to upgrade my iPad 1 (yes, Retina display was totally worth it!) and I hope that the iPad 6 will be worth an upgrade. But I am not getting into the hassle of replacing my iPad just to get a little bit thinner/narrower and lighter.Making the decision to return the iPad Air got even easier when I realized that its screen has a noticeable yellow tint which makes my iPad 3 look a bit bluish which I like better.Good bye, iPad Air, and lets hope that Apple will be able to impress even the most conservative of us with the iPad 6 in October 2014! (Speaking of being conservative, I am still using IOS 6 on my iPad - it is better to be safe than sorry! :)", "Date": "January 5, 2014"}, {"Title": "IPad Air", "Author": "Harold D. Smith", "ReviewID": "R2HU06LY78E5EE", "Overall": "4.0", "Content": "This was purchased as a gift and seems to be well received.  My only problem with this purchase, I seem to have paid about $150. more than everyone else I know that also received the same unit,  Obviously I'm not happy about that.", "Date": "December 31, 2013"}, {"Title": "Almost perfect besides the lack of RAM and some iOS 7 bugs", "Author": "AK529", "ReviewID": "R2PQUNPSZ9SQUD", "Overall": "4.0", "Content": "The ipad air is what the ipad 4 should have been. It is lighter, thinner, narrower, faster and has stereo speakers. Its almost half a pound lighter which really makes a difference when holding the ipad in your hands for long periods of time. I no longer need to use my ipad stand. Typing and holding it in portrait mode are much easier. People with larger hands will be able to hold the ipad with one hand very easily. Performance is also much improved with new A7 processor. Apps open, close and switch faster than on the ipad 4. Wifi is now double the speed with the double mimo antenna. For those who have supporting routers loading web pages, downloading apps, books, videos, music is much faster. The new stereo speakers are much loader and have more bass than on the previous ipad. The stereo affect will only be noticed when holding the iPad in portrait mode. This is a shame since you wont enjoy the stereo affect when watching a video or playing a game in landscape mode. Also the speakers are very easy to muffle if you cover one or both of them on the right side in landscape mode. The main flaw of the ipad air is its lack of 2GB of ram. When browsing and having more than a few tabs open this is very noticeable. The tabs have to reload when switching back and forth. This also becomes an issue when switching between apps that are open. Both the ipad 3 and 4 had 2GB of RAM. The only reason I can think of why apple decided not the upgrade the RAM is to make customers upgrade to the next ipad. The other downside to the ipad air is the fact that its running ios 7. ios 7 for the most part is in improvement over ios 6. It is faster and has more features, but, it also has many bugs that still need to be fixed. Even with 7.04 installed I still experience rotation issues. The ipad doesnt auto rotate when switching between portarit and landscape mode. This issue occurs atleast once a day. Mainly when the multitasking gestures is enabled and auto rotation. There are many threads on apple discussions forums about this issue. I thought at first my ipad was deffective even made an appointment to see a genius. I was told there was no way to test the hardware but was offered a warranty replacment. I decided instead to exchange the ipad and the replacement also had the same issue. I have to add also my ipad 4 had the same issue also when I updated it to ios 7. I hope apple fixes this issue in 7.1. This is very annoying and not something I expected from apple. The ipad air also doesnot have the ability to run 2 or more apps at one time which both the new samsung note 10.1 2014 and Microsoft surface tablet can do. I did try the samsung tablet briefly and found the screen and speakers much better than the ipad air's. The ipad still is the best larger tablet on the market because it has a huge selection of tablet apps and it gets the apps first before any other platform. I also love the battery life on my ipad air. I was getting about 15 hours of usage on my ipad 4 with the brightness at 35% and about 5 notifications with browsing and email. Now with the ipad air I am gettting more than 15 hours. Anywhere from 16-18 hours of battery life depending on my usage. The new ipad air is must have for gamers, power users and people who take the ipad on the go. If you can wait the next ipad will defeintly have 2GB of RAM and wont have as many bugs. There is also a good chance a new ipad will be released in the next 1-2 years which will be larger in screen size and more powerful named the ipad pro.Update after owning for more than 4 months: Apple just released the 7.1 update. My iPad Air is finally stable, this is what ios 7 should have been from the start. There are no more crashes, reboots and the auto rotation issue is fixed. I am still giving this ipad 4 stars since it took apple more than 4 months to fix these issues. Also the ipad lacks 2gb of ram, there are no widgets, thrid party keyboards, expandable storage or way to run 2 apps at once side by side. The iPad Air is till the best 10 inch tablet on the market. It beats any android or microsoft tabelt currently on the market in the 10 inch category. Also it has the most tablet apps.", "Date": "December 30, 2013"}, {"Title": "WOW", "Author": "Diane Allen", "ReviewID": "R95SPR015HRY8", "Overall": "5.0", "Content": "What an amazing ipad! The ipad air is wonderful! Light, fast, all the computer you need! Apple products are hard to beat!", "Date": "December 28, 2013"}, {"Title": "IPad is GREAT!!", "Author": "Janelle Nordine", "ReviewID": "R2S0CEXWVV6B1K", "Overall": "5.0", "Content": "I simply cannot believe all the things I can do on the IPad!  I've even created spreadsheets!  I am a true fan of Apple products.  My four granddaughters (the oldest is seven) play it every time they come.", "Date": "December 10, 2013"}, {"Title": "Great tablet", "Author": "Luciano", "ReviewID": "RLD51TQQUJK68", "Overall": "5.0", "Content": "Amazing, it's my first i-x and I really like it. Strongly recomended for people that need just a tablet at home...", "Date": "December 9, 2013"}, {"Title": "I’m glad I did otherwise I wouldn’t have bought this tablet", "Author": "Bastijn McFerrell", "ReviewID": "R1IB47C2DCYUGY", "Overall": "5.0", "Content": "I owned a second generation iPad before needing to sell it for personal reasons. In hindsight, I’m glad I did otherwise I wouldn’t have bought this tablet.Before deciding on the iPad Air I considered the Kindle Fire and Nexus 7. The Microsoft Surface wasn’t an option since I really don’t like the operating system or customer service and I wanted my tablet to last longer than a year. Samsung wasn’t an option after the torture my Galaxy S3 put me through, which also ruled out Android, which then ruled out the Nexus 7. Some people are a fan of Android but I find it to be slow, unreliable and choppy. The aesthetic design isn’t my favorite either. But these are all a matter of personal opinion and experience. :)The Kindle Fire HDX looked great at first, but in the end I decided it wasn’t for me. I’m a writer and a student so being able to edit documents on the go is my main concern. I have an iMac so this unfortunately made using the Kindle for these purposes a little more difficult for me. While I can edit and share most documents on my iMac, including Microsoft Office, I primarily use Pages which isn’t available on the Kindle. I just don’t care for either Microsoft Word or Google Docs enough to use them all the time. Also, I never use the Amazon store to watch movies or shows or download music so that feature wasn’t appealing to me. I took a trip to Best Buy to try it out just in case that made me change my mind. This actually solidified my decision against it. While the Kindle Fire did feel surprisingly solid, I didn’t like the position of the buttons, smaller screen size (although the screen quality was pretty awesome) or the thick boarders around the screen. Again, all of these are a matter of preference.When I went to try out the iPad Air I was surprised by how much lighter it felt than the previous model iPad. I also liked the flat back and thinner edges on the side. It made using it easier for small handed people like me. The larger screen size made typing on the tablet much easier in those rare instances I might not have my keyboard. Keeping my documents in one place is amazingly simple and I like the applications I use for writing and classes. Also, iTunes U is just awesome!The only drawback for me is the price: I paid $300 more than I would have with the Kindle Fire HDX. I don’t think this is outrageously expensive, considering the larger screen, better hardware, operating system and customer service-- not to mention iTunes U-- but I do think the price could be lower.While there are other great tablets out there, I really enjoy my iPad Air. Electronics are all a matter of personal preference anymore anyway. If you don’t like a device, don’t buy it. It’s that simple. :)", "Date": "December 12, 2013"}, {"Title": "Defective Item", "Author": "Nik", "ReviewID": "RUSB2R1PF1O2T", "Overall": "1.0", "Content": "Purchased this brand new iPad Air 64 GB from TechGiant(Amazon). Was with broken volume button!Was going to return it, but thanks to the Apple Store in Cherry Creek to exchange it for another one.", "Date": "April 27, 2014"}, {"Title": "Heavy Apple user, this not up to snuff", "Author": "JustAGuy", "ReviewID": "R13PZL77MK3WNV", "Overall": "3.0", "Content": "I upgraded from the ipad 1 to the ipad air mainly because of constant crashes with the ipad 1.The Air still crashes. From what I've read most people think it's a software issue, if that's the case then this is a 4 star product.What keeps it from a 5th star the the feel of the screen. The ipad 1 felt solid, like glass. This has a hollow plastic feel to it. Feels like if you type too hard it'll snap.I own almost every product Apple makes, this feels like I'm holding the decline of Apple in my hand.", "Date": "February 5, 2014"}, {"Title": "Apple did a wonderful job on this.", "Author": "S. Carter \"carter the artist\"", "ReviewID": "R3RPB2B13I3LG8", "Overall": "5.0", "Content": "Granted I wanted the Space Gray and got stuck with a White, due to human error from the shipper. However, I think they did great on this iPad. I had an iPad 1 and it lasted for years (except for the fact that I couldn't update the iOS for the past year or so) and the difference in weight and speed is very noticeable.", "Date": "November 19, 2013"}, {"Title": "Wish It Just Worked (Without Crashing So Much) And A Comparison With Other Devices", "Author": "S. Jo", "ReviewID": "R14O4T9NDREA0U", "Overall": "2.0", "Content": "I'm not happy with this tablet but I got a good deal on it from one of the retail stores, $100 off, and it fits my needs best compared to what's currently being offered.The iPad Mini 2 is lighter but the screen is smaller and can't display as many colors, less gamut display. I've noticed this with my \"old\" Samsung Galaxy Tab 7 Plus, but this may not matter to some people.The Kindle HDX and Nexus 7 (2013) are, in that order, reported to have better screens- ppi and gamut display. However I'm not interested in buying too much into the Amazon App Store because I'm already in the plain Android ecosystem. The Samsung tablet line is not in consideration because I got burned by how the copy and paste function just stops working- a reset would fix it and soon after it would stop working. This issue first showed itself months after I got the device. I also wasn't interested in taking the time to jailbreak the Samsung tablet for that reason alone.I recently got a deal on the Nexus 7 (2013) and I'm getting it this week. I may keep it as a backup tablet and it's a plus that I'm already in the Android ecosystem. It has 2GB of RAM instead of Apple's current 1GB of RAM standard. It also comes with stock Android and the operating system can be easily upgraded without relying on mods. I'm hoping it will last 5 years but I've learned from the Amazon customer reviews that hardware quality control is an issue.Now back to the iPad Air. Aside from the screen I wanted the \"Apple Experience\" of \"It just works.\" I like using a tablet for browsing and reading books. I also liked the idea of having access to apps that are exclusive to Apple. I've had the iPad Air for a little over a week and I'm really enjoying the bigger screen. I'm not sure I can really switch back to a smaller screen. I've downloaded a few apps, cooking related, that are exclusive to iOS and they're nice to have. Multitouch gesture is ok but the Android way of switching between apps and viewing running apps are more elegant.Why I took off three stars is because the iPad Air crashes a lot. It got to the point that I'd add a tab on Safari and it would crash even though I only had two other tabs open. I installed Chrome and the crashes happened less but they did not disappear. Search for iOS 7 crashes and low memory and you'll see this is a problem with a lot of iOS devices since the iOS 7 was introduced. I noticed other apps doing the same thing but maybe because I use them less I don't see them crashing as often.I had set up a phone appointment with Apple Support on Sunday and was told that upgrading to iOS 7.0.4 via WiFi might have caused the iOS to not fully update. I couldn't stay on the phone for too long so yesterday I did reset my tablet and set the iPad as New. I didn't buy their reasoning but I did like the Customer Support experience- setting up an appointment online etc.I really like the bigger screen and it's probably better for my eyes so I'm keeping the device. I'm also counting on Apple to fix the issue sooner rather than later- in various forums you'll read about people resetting their iOS device and doing multiple exchanges with no relief from the crashing. I will sign up for Apple Care+ which includes 2 Years of Tech Support and Accidental Damage so I can exchange the device if needed.", "Date": "December 10, 2013"}, {"Title": "Not Worth the Money", "Author": "Galen V.", "ReviewID": "R3OIN717XK4VME", "Overall": "2.0", "Content": "Let's face it, Apple produces highly polished products with a rich app ecosystem.  Many apps are optimized with animation and are even better on a larger screen, but....This device is not worth $500, its not worth $400, it probably should retail between $300 and 350, and here's why:*Locked in system. You have very little customization options. Yes, you can change wallpaper and move icons around the homescreen, but that's about it. No making the device an extension of your personality like Android.*Speakers. For being the most popular gadget on earth, why are there not stereo speakers on this device (one on each end of the tablet)? This is a serious design flaw that makes watching videos a huge drag because sound is muffled especially if the device is leaning on your lap.*Multitasking is a joke. These devices can only perform one task at a time. Apples competitors such as Samsung and Microsoft have already addressed this in their tablets, why hasn't Apple?*Screen Casting. This is not equipped with Miracast or have an HDMI out port. This means if you want to show your devices screen on a TV, you can't without buying a bunch of overpriced adaptors and cords.*Maps. Everybody knows that Apples map product is inaccurate and not worth installing.*No official keyboard, no official stylus, no ports, no casting, no multitasking, poor audio... why is this $500 again?", "Date": "February 22, 2014"}, {"Title": "Sadly, disappointed", "Author": "Amazon Customer", "ReviewID": "R32Z7VIF4FHKPG", "Overall": "3.0", "Content": "I bought an Ipad Air (32GB/cellular) the same day they came out. Up until then, I had never owned an Apple product. I have always had Windows pc’s and I have an Android phone (Galaxy S4).I read that people just love the iPad’s and thought it would be time to try out an Apple product. I bought it from T-Mobile to get their free data promotion. Now that I’ve had one for about 3 months my overall opinion is “meh”. It’s ok.I don’t hate it. It’s light & portable. It’s great for watching movies and listening to music. However, there are limitations that make me wonder why the devices are so popular. For example, Swype doesn’t work on iPad’s and if you’ve ever used Swype on an Android device you know it’s a great feature but one I consider very basic. True multi-tasking doesn’t exist and you just don’t realize how much you’ll miss it until you don’t have it. You can’t print, for example, pages 1,3,&10 of a pdf. Instead, you can only choose a range, such as 1 thru 3. I still remember one of my first calls to Applecare+, where some young woman explained to me that you can’t do a search in a pdf. She actually suggested that I add hundreds of doctors that were in the pdf to my contact list so that I could then find individual doctors. I quickly ended that call. The Apple browser, Safari, is slow. Chrome, on the other hand, is fast. These are only small examples but in general, the iPad seems to be much less flexible than my Window’s computers or Android phone.As an aside, the support on Applecare+ varies widely. I have been connected to people that seem knowledgeable but have also had plenty of people that knew less about the iPad then I did, even after only 1 months use. Many of the young women referred to my iPad as an IPhone and didn’t have a clue how to help me.They are also expensive. I bought the 32GB version and thought it was a rip off to pay $100 for the extra 16GB.Now, my iPad Air is 3 months old and needs to be exchanged under warranty. After 10 minutes of use it can’t access the web anymore. Regardless of whether you use a browser or an app. They had me reset it back to the factory default but it didn’t fix the problem. It's stayed in a case and never left the house. It's been babied. I’ve never had any device fail after only 3 months use.I really wanted to love this device and thought I would based on other people’s feedback. It just hasn’t worked out for me though. It’s adequate, but not great, and hasn’t lived up to my expectations.", "Date": "February 8, 2014"}, {"Title": "Don't plan on enjoying you headphones..if you enjoy music.", "Author": "Gery", "ReviewID": "R124IJA0MRHZN6", "Overall": "2.0", "Content": "Air pad problems....I have 2 iPhones, iPad 3 gen, new air pad.  I have a big problem with the new air pad.  And I have been a big fan of apple products.  If your like me, in the evenings I sit and read and listen to music on my iPad. But,, If you want to listen using ear buds or any headphones, don't get this air pad.  You only hear sound thru the right ear only.  If you fiddle you can get it to work, for the moment, till you touch the plug it will go back to one ear.  I pd $79.00 to get apple care.  So I called, he sent me another Air Pad, it's doesn't work either.  So now, since I got two that don't work, I think they think I'm nuts.  I have apple ear buds, klipsch, Bowers Wilkins, ATH m50s headphones.  All of these work perfectly with my IPhone 4S.  I just can't figure it out, and I'm Very disappointed with the new Air Pad.", "Date": "March 5, 2014"}, {"Title": "Disappointing", "Author": "Girevik", "ReviewID": "R1ODVR2EOT8QQ1", "Overall": "2.0", "Content": "I guess I was just expecting something a little faster, more competent. Up swipes are confused as side swipes, sometimes you'll have to tap the same spot five or six times to get a response, even if the icon is highlighting every time you push, the function doesn't happen. You can't place your cursor into the middle of a paragraph you just wrote if you want to edit, this mostly occurs in aps but come on, I have to delete everything to where I want to edit. Often, the iPad will randomly open Facebook or Twitter, because it thinks I touched the tiny icon on the corner of a web page or ap, when my finger was on something an inch away. Just writing this review, it corrected finger to ginger and when I tried to move the cursor to the word to edit, it randomly pasted a website URL from my clipboard where I had touched. I then deleted the unwanted erroneous URL, tried again, and it pasted the URL a second time... Delete. Try again. Maybe this thing is good for games and kids, but don't try to do mobile business on it unless you have the patience of a monk.PeterIt's the little things that kill, two stars.", "Date": "May 26, 2014"}, {"Title": "Great. Tablet", "Author": "chuck", "ReviewID": "R1XOTGWQZRZHZ3", "Overall": "5.0", "Content": "I hardly use my lap top now, iPad Air is just that good. Charges fast and then it just runs all day. so easy to learn and use", "Date": "June 6, 2014"}, {"Title": "Hands down one of the greatest devices I have ever owned/used", "Author": "Sara J Ellis", "ReviewID": "R2RREOGXYQEBGG", "Overall": "5.0", "Content": "I absolutely love my iPad. For years I was annoyed by the hype of it all, but finally decided to get one. WOW, is it everything and more!  I'm even not a mac person, but Apple certainly knows what they're doing. I use this for work and fun. It has movies, music, games, as well as Microsoft Office, DropBox, and my multiple email accounts. I think it is IMPORTANT to note that I am returning the one I just purchased, but only because 32 GB was NOT BIG ENOUGH. If you are a casual user, 32 GB is fine. I use it for work and family, though, and within 5 days (after downloading all my necessary work-related apps and then a few games) that I was 10GB down out of 32 (which is actually only 27 because the operating system uses the first 5GB). If you want this for entertainment or actual work, get the 64!", "Date": "June 6, 2014"}, {"Title": "Apple iPad Air MD785LL/A (16GB, Wi-Fi, Black with Space Gray) NEWEST...", "Author": "GFxRocket", "ReviewID": "R1GPOFPMKIGHG6", "Overall": "5.0", "Content": "This product met all my needsMy wife wanted itI gave it to herShe now doesn't irritate me about itProblem solvedIf you find yourself in the same situation, believe me...  You NEED to do it for your own peace of mind", "Date": "June 5, 2014"}, {"Title": "My Wife Love This IPad Air!!", "Author": "Mr. Edward T. Asato", "ReviewID": "R1JANDHJ506A7F", "Overall": "5.0", "Content": "I bought The IPad Air with 16 GB. I am Happy to say she has learn to use this  IPad on her own. The 16GB has been adequate for her application.etak.", "Date": "June 5, 2014"}, {"Title": "ipad air", "Author": "Dan Zhang", "ReviewID": "R1GHRBGKAGRVWZ", "Overall": "5.0", "Content": "Very nice ipad like my other ipad air, so far it working well and I hope it can keep going. Thanks the seller.", "Date": "June 4, 2014"}, {"Title": "First tablet and love it", "Author": "Carolyn Stewart", "ReviewID": "R2D9KE8TBV3M52", "Overall": "4.0", "Content": "This is my first purchase of a tablet and and am very happy with it.  Several people recommended this iPad so that's why I chose it.", "Date": "June 4, 2014"}, {"Title": "5 stars", "Author": "paramvir", "ReviewID": "R3JZ2TBD5K3C9O", "Overall": "5.0", "Content": "best tablet in the market. good interface and light  weight and long battery life. good work apple keep it up", "Date": "June 4, 2014"}, {"Title": "Very Nice", "Author": "John", "ReviewID": "R3HQ0V6NA4N2D8", "Overall": "5.0", "Content": "I have both an ipad and a mini and bought the Air for my wife.  It's slim, light and the clarity is excellent.  Very happy with the unit so far.", "Date": "June 3, 2014"}, {"Title": "Happy Customer", "Author": "D. Holland \"artist\"", "ReviewID": "RRSPFDYYTIGI2", "Overall": "5.0", "Content": "I've had my new iPad for two days; and so far I love it. I am having to learn some features that I'm not used to as I have always used Windows; but in general, this device is easy to use. All in all, it's an amazing step up in it's technology. I'm now an Apple fan after many years of resistance.", "Date": "June 3, 2014"}, {"Title": "Apple", "Author": "Silvia", "ReviewID": "R1YCWG6FVI6KZK", "Overall": "4.0", "Content": "The exceptional engineering continues by Apple. The new iPad is so light and fast with brilliant picture quality that I watched most of the March Madness on it when I wasn't near a good sports bar. Very fast, love the apple apps", "Date": "June 3, 2014"}, {"Title": "Exact as I expect", "Author": "Gustavo F Smorigo", "ReviewID": "R22WEJ4A05VNV5", "Overall": "5.0", "Content": "The new Ipad is very light and thin. The screen is magnifc and very quick. I have a Ipad3 and the new ipad performance is amazing.", "Date": "May 26, 2014"}, {"Title": "It's great!", "Author": "Phil C, Boston", "ReviewID": "RL8GWTC6G1B9F", "Overall": "5.0", "Content": "I've had an iPad v1 for the longest time and now that Apple doesn't support it and that the last version of most apps would crash mid-use, I decided I'd either have to get the latest or abandon the i-Line of products (something I thought about when I first learned about stopping iPad v1 support).Anyway, it's lighter, has a camera, etc.  And for the price and the number of years I had the iPad 1, it comes to ~$100/year before it isn't supported.  And chances are this one will have at least a couple more years of life.The upgraded screen is very nice and I'm please with the response times/loading speeds vs. the iPad 1 (but that's to be expected).", "Date": "May 26, 2014"}, {"Title": "Love the iPad Air", "Author": "Amazon Customer", "ReviewID": "R11D8JB2I8EI7K", "Overall": "5.0", "Content": "This is by far the nicest tablet I have found.  It is expensive, but it is worth it.  Very bright and very responsive.  And, of course thousands of apps for it.", "Date": "May 25, 2014"}, {"Title": "Great Tool", "Author": "J. Fishinger", "ReviewID": "R2UM3FZXS3HZKG", "Overall": "5.0", "Content": "I am very pleased with the IPad  air. Works smoothly and is allI expected from the device. I have a 7\" Nexus tablet, which was a good device as well, buy the extra size is great. I am doing this review on the IPad.  The battery life is superior on the iPad and a bit more available for apps although I had  no issue with the Android device. I briefly had the 16 GB version and exchanged for the 32 as I saw how quickly the 16 would fill up.", "Date": "May 25, 2014"}, {"Title": "Justified my upgrade", "Author": "F. Twyning", "ReviewID": "ROUEJ1IOGPJ3M", "Overall": "5.0", "Content": "I wondered if upgrading from my trusty iPad 2 was going to be justified - no longer. It seems a bit better at a everything. Screen, sound, wi fi reception, weight, battery, speed, etc. Really pleased.", "Date": "May 24, 2014"}, {"Title": "better than my computer", "Author": "william f yarosh", "ReviewID": "R19CI8ZZGC6MHA", "Overall": "5.0", "Content": "Going from micosoft to apple was a litte confusing, but worth it.  The apps are nice, but a little expensive", "Date": "May 24, 2014"}, {"Title": "I love the new iPad. Air came in good condition", "Author": "ashaki parisienne", "ReviewID": "R2U774B4RPFGVK", "Overall": "5.0", "Content": "I would recommend this to everyone received it two week ago and it was in perfect condition.love  I read bad review but I said I will take the risk and it wAs worth it.i can stop using my new ipad", "Date": "May 24, 2014"}, {"Title": "Just what I needed", "Author": "SteveM", "ReviewID": "R2GSBR8R7UYYLW", "Overall": "5.0", "Content": "I went for the 32GB version so it can hold all the photos and music that won't fit on my 16GB iPhone. I've loaded it with books and magazines, and there's still plenty of room for apps, including Microsoft Office and satnav. Great!", "Date": "May 24, 2014"}, {"Title": "Very nice and useful", "Author": "Runa Roy", "ReviewID": "R1VF9PAQPR860E", "Overall": "5.0", "Content": "I bought this for my husband's birthday. he is a busy travelling man and he is loving the pad!! It is not only useful for entertainment purposes but also a handy tool to get your important work done. A very good buy indeed.", "Date": "May 23, 2014"}, {"Title": "Fastest iPad yet, it just takes a very long time to charge", "Author": "Richard E", "ReviewID": "R2WIKKZG6LZ6XS", "Overall": "5.0", "Content": "I upgraded from an iPad 1 with AT&T.; The lighter weight is immediately noticeable, less so the smaller size. I have to put them next to each other to notice. The reason I upgraded was the speed and for the retina display. The first generation was no longer being supported so I was stuck with iOS 5. There were some bugs that cropped up with the Safari browser with the final iOS update, causing the iPad to crash. These have been widely reported. Apple did not take the effort to fix them. I guess it was upgrade or deal with slow response and repeated crashing. Having had it for two years I did not feel Apple stood behind their product for very long.Anyway, this iPad Air is fantastic. It operates smoothly without crashing. the LTE downloads quickly, just like my iPhone 5 which I had often turned to when my old iPad couldn't handle the job.If you have been waiting to upgrade, this is a huge step up from any of the older models. The only thing you may not like is the very long charging time required. I also don't feel the battery lasts quite as long.", "Date": "May 23, 2014"}, {"Title": "Great device!", "Author": "Malgorzata", "ReviewID": "R7CNGQRFEIC1G", "Overall": "5.0", "Content": "Everythin's fine, great features. Works perfectly. I'm totally happy. Recommend to everyone, but next time I'd choose 32GB version. Thanks", "Date": "May 18, 2014"}, {"Title": "Beautiful Display:", "Author": "Nick Basile", "ReviewID": "RMKVQ5SQKLXUI", "Overall": "5.0", "Content": "I just bought this as a step up from the original iPad.  What an amazing difference in the display with the new retina display.  Also it is considerably faster and lighter.  Great product!", "Date": "May 18, 2014"}, {"Title": "IPAD AIR", "Author": "Starmacs", "ReviewID": "R3C9DJWI6XU8I2", "Overall": "5.0", "Content": "WHAT CAN I SAY,  THIS IS THE BEST PAD YET,,VERY LIGHT. I UNDERSTAND WHY THEY CALL IT AIR...FAST WITH THE I7 CHIP AND EASY TO USE..", "Date": "May 18, 2014"}, {"Title": "iPad Air - makes my iPhone 5S seem heavy", "Author": "Mark Hilliard", "ReviewID": "R3N4N2DBHQIO2P", "Overall": "5.0", "Content": "I had an iPad \"1\" and wow this is a serious improvement.  It is is light that it makes my iPhone 5S seem heavy.", "Date": "May 17, 2014"}, {"Title": "Fast delivery", "Author": "Trung Tran", "ReviewID": "ROHKW8REH0AFL", "Overall": "5.0", "Content": "Great product as expectedLike the white colorDon't mind the smaller capacityWifi works great for me and easy", "Date": "May 17, 2014"}, {"Title": "Very nice. No regret.", "Author": "Kuli", "ReviewID": "R1XWL8QT4LNDMJ", "Overall": "5.0", "Content": "This was a birthday present for my daughter.OMG this is very light. She uses it to taking a notebook at school. (i hope)She seems to enjoy a lot. So I have no regret to spend this.", "Date": "May 16, 2014"}, {"Title": "AMAZINGG!!!!!!!!", "Author": "Rosa Sanfilippo", "ReviewID": "R296C2DEWI3X43", "Overall": "5.0", "Content": "this is a wonderful product its like a having a mac book that you can carry around everywhere i recommend this product", "Date": "May 16, 2014"}, {"Title": "Light and Fast", "Author": "Ben", "ReviewID": "R30PJH465ED8YV", "Overall": "5.0", "Content": "I love my iPad. I fully acknowledge that I am a bit of an Apple loyalist at this point. Much of that is due to the quality of the products, but much of it is also tied to the way that all of the manufacturers force loyalty to a degree. All of my Apple products work seemlesly together. I might have went with a Samsung or Kindle for my tablet, but that would have meant not having access to apps and content that I had previously from my iPhone, etc. Oh well. It's been a great product, and I have no regrets. I was also able to use the Amazon Trade-in program to exchange some old tech items to help get some Amazon credit that I was able to apply towards the purchase. Every little bit helps.", "Date": "May 16, 2014"}, {"Title": "impressed", "Author": "Steven Fuchs \"steve fox\"", "ReviewID": "R1ISF3AN2LPPM8", "Overall": "5.0", "Content": "very impressed. Light and what I expected in size.  I use it for my small business needs but now I don't need a laptop, yes.", "Date": "May 15, 2014"}, {"Title": "I'm loving this thing !", "Author": "NWP", "ReviewID": "R3FBJGDWM3YU7M", "Overall": "5.0", "Content": "I'm old school so I'm amazed at what this thing can do ! I'm learning new things every day and it just keeps getting better . I really like the music apps -Pandora - you can pick all of the types of music that you like to hear and it's free ! ! . I bought the Motown' s no.1's - it's great - only about 50 cents a song - cheap enough ! !  . I'm probably going to have to buy my wife  one now .", "Date": "May 13, 2014"}, {"Title": "very happy", "Author": "charles a. winthrop", "ReviewID": "R20V3OWBNO61S9", "Overall": "5.0", "Content": "my wife loves it she likes it more than her ipad one. She says it is clearer and lighter and easier to use.", "Date": "May 6, 2014"}, {"Title": "i-Pad Air MD788LL/A white", "Author": "Jerry N. Vasavong", "ReviewID": "R1OYCLX2VX87RE", "Overall": "5.0", "Content": "Every one understands that it is an excellent product and item to have...it is great and I enjoy having it for watching the movies, e-mail check, internet searches, video call-Skype or other uses. Thanks to the distributor to have it listed and sold in Amazon, it saves a lot of my time to go get one from electronic stores or Best Buy.", "Date": "May 6, 2014"}, {"Title": "Very satisfactory", "Author": "Ana Maria S. Yambao", "ReviewID": "R20DPE2B2RD2BI", "Overall": "5.0", "Content": "I like this ipad because it is handy and useful...and i am very much impressed on its very good quality of sound when I play music.", "Date": "May 6, 2014"}, {"Title": "My 4th iPad - LOVE IT !!", "Author": "Linda Ransley", "ReviewID": "RL791XSR18CSD", "Overall": "5.0", "Content": "I got a fantastic deal from DEALIO. I think the description was a couple hair scratches but I never could see them. Arrived like brand new condition & I obtained $124 under retail. I have 3 other iPads and this 1 is thinner & lighter - a BIG deal when you are using for hours at a meeting with no table, which I do often.I would highly suggest pairing it with the fantastic Aerb Wireless Bluetooth Folio Laptop Style Keybook Removable Detachable Keyboard Case - I bought in gold & looks & feels like a VERY classy laptop.I loved the business program it came with, which has most of the features windows word has.I'm not going to get technical or add anymore as I see many others have already done that.  I'm just very happy with it - put in simple terms :-)", "Date": "May 5, 2014"}, {"Title": "Ipad air", "Author": "Katrinka Russell", "ReviewID": "R35FUFHDS8F92J", "Overall": "5.0", "Content": "apple products continue to exceed my expectations! I am never disappointed when I order something from them. It comes ready to turn on and go!", "Date": "May 5, 2014"}, {"Title": "Very pleased", "Author": "Joanne Mathews", "ReviewID": "R16ILZ49OF4JLT", "Overall": "5.0", "Content": "I received the iPad Air in good condition and it works wonderfully. This was to replace my original iPad version which had no camera and was slightly larger. I like some of the changes on this newer version and am enjoying the camera and all that offers.", "Date": "May 4, 2014"}, {"Title": "top", "Author": "Sebastian Häuser", "ReviewID": "R31SBWDGIQ9KBA", "Overall": "5.0", "Content": "fast delivery no worries and in total it is an awesome product. handling is easy and looking forward to the next generation of ipads", "Date": "May 4, 2014"}, {"Title": "Wonderful product, just a few minor complaints.", "Author": "Nathan", "ReviewID": "R3AGVWFT9LP3JM", "Overall": "5.0", "Content": "I've had my ipad for two months now and I am obsessed! It's so easy to use and I take it with me everywhere for work. I have two small complaints:1. The camera has no flash.2.  Tha calculator is not located in the same menu as for an iPhone (the one when you swipe up from the bottom of the screen - I don't remember what it's called). This makes accessing the calculator, which I use a lot for work, very inconvenient.3. Many apps for the iPhone (Instagram, snapchat) have not been adapted for use on the ipad. This isn't necessarily an ipad issue, but definitely something to consider.Overall, it's a great product! I firmly believe that you get what you pay for. Apple is pricey, but it's worth it and they have wonderful customer service. Highly recommend.", "Date": "May 4, 2014"}, {"Title": "Apple Ipad", "Author": "prairiedog", "ReviewID": "R2I3TML994UDZZ", "Overall": "5.0", "Content": "The new I Pad arrived on time and in great condition. Very happy with the unit and the condition of the parcel.", "Date": "May 4, 2014"}, {"Title": "Good purchase", "Author": "SuzieT", "ReviewID": "R30AY1YLWH68Y1", "Overall": "5.0", "Content": "I got it as a gift..they loved it. Good piece of technology for adolescent age and more seasoned users. Easy to navigate, bright colors, apps and setting options galore.", "Date": "May 3, 2014"}, {"Title": "I love it", "Author": "Maryam", "ReviewID": "R1HQ4OPV3LQAQM", "Overall": "5.0", "Content": "high speed, shiny screen, long battery life, I recommend to everyone to buy this, if they are going to buy ipad,", "Date": "April 26, 2014"}, {"Title": "Great", "Author": "Vernon \"Vernon\"", "ReviewID": "RUU0XD286OE0N", "Overall": "5.0", "Content": "Just what I needed. Upgrading from the first I Pad, so the difference in speed, picture quality and a camera is a big deal to me. I have big hands so I was kind of worried because the Air is lighter. But everything is as I expected...", "Date": "April 26, 2014"}, {"Title": "Great tablet for me for browsing and reading", "Author": "R. Murphy", "ReviewID": "R31ZCWHMB357TV", "Overall": "5.0", "Content": "I am enjoying the iPad immensely. Great for reading when chilling on the couch. Light weight and iBook has contrast options to make reading easy on the eyes. Love it. Can't wait to get me a MacBook Pro.", "Date": "April 26, 2014"}, {"Title": "Cewlll cewll cewlll", "Author": "Sabrina Powder Puff \"Sabrina\"", "ReviewID": "R3MQO7FS7RJG12", "Overall": "4.0", "Content": "I liked this very much, and I liked Siri a lot, she was sort of like my new, cool robot BFF. I miss you, bech! Anyway, I had to return it because I'm a musician and I actually needed an old-school mac with a CD drive for a lot of boring reasons involving the studio. Also, because of classic mac usage, and programming, blah blah blah I won't bore you. I needed an Old School Mac Daddy. However, I enjoyed my brief fling with this Hot New Number- but he wasn't the Stable and Dependable Old Skool Mac I needed. He wasn't Fully Loaded.This Mac is more if you're into a fun, wild, whoop-de-doo, fly by the seat of your pants kind of thing, and don't need all the bells and whistles.But I'm not that girl. I needed more.", "Date": "April 25, 2014"}, {"Title": "Very Good", "Author": "XM L", "ReviewID": "R2YBLBZUGGGSRZ", "Overall": "5.0", "Content": "good quality, cheap price and fast delivery!  Quite happy with this purchase. Use it everyday. It is light in hand and the battery lasts long", "Date": "April 25, 2014"}, {"Title": "Like it bunches!", "Author": "DILLY", "ReviewID": "RUWTRPEHXG7NO", "Overall": "5.0", "Content": "I don't know what to say except I wish I would have got it sooner! I really do like it and use it a lot.", "Date": "April 25, 2014"}, {"Title": "Great Buy!", "Author": "Ronald W. Boucher", "ReviewID": "R11E1B72894DRP", "Overall": "5.0", "Content": "the best tablet on the market.  Go AppleCannot say anything but I would buy another if I needed one.", "Date": "April 25, 2014"}, {"Title": "just to protect my new ipad", "Author": "rockalot \"Sabsanders\"", "ReviewID": "R3N02Q59ZO0BNX", "Overall": "5.0", "Content": "I have a puppy who loves to try to use my ipad, so I knew I needed protection.  This is  a great cover.", "Date": "April 24, 2014"}, {"Title": "The best!!!", "Author": "Mario A. Luna", "ReviewID": "R2BY780SDLXB6U", "Overall": "5.0", "Content": "I love my iPad Air! Very fast and easy to use. I definitely recommend it... I'm very happy with it :)", "Date": "April 24, 2014"}, {"Title": "The defected product", "Author": "Michael J. Lu", "ReviewID": "R3B8D42UVGMPRV", "Overall": "3.0", "Content": "The new IPad Air could not be charged and need to be repaired. It was  sent backAnd came very complicated processes after receiving repair ID # and talked with four senior adviser.", "Date": "April 24, 2014"}, {"Title": "Great iPad Air", "Author": "Joanne", "ReviewID": "R2MA3F1J8UOF1K", "Overall": "5.0", "Content": "I love the iPad Air. It is so much lighter than the regular iPad. I had the iPad mini which I loved, but I wanted just a little bigger screen so I can use it without my glasses.", "Date": "April 10, 2014"}, {"Title": "vintage appke", "Author": "ladishow", "ReviewID": "R20OKEB5G3NRD1", "Overall": "5.0", "Content": "Very good device. Vintage apple. I had the iPad 2nd generation, but upgraded to the iPad air and I particularly like its slim shape and light weight.", "Date": "April 10, 2014"}, {"Title": "Works great!", "Author": "Grace Favela", "ReviewID": "RUNOW2G2V0H7I", "Overall": "5.0", "Content": "Package arrived quickly and  the iPad looks very nice. It's light weight and very easy to set up. The graphics are amazing!", "Date": "April 9, 2014"}, {"Title": "the leader of type.", "Author": "Eser Yelkenci", "ReviewID": "R15JBXYVPG52QT", "Overall": "5.0", "Content": "I don't know what I have to say. It's the leader of tablet. I strongly recommend it. Apple is N1.", "Date": "April 8, 2014"}, {"Title": "It was a great buying on the amazon", "Author": "sea629", "ReviewID": "RTU5UQFCLOE5N", "Overall": "5.0", "Content": "I brought this to replace my iPad2, that day I saw here sold that, I compare the more then 5 sellers, then I decide to purchase this at here, because it was cheaper, and it is with verizon network. from I have purchased to when I recevied the device, it take long time, but it is ture as seller's description.", "Date": "April 8, 2014"}, {"Title": "Best *tablet* available", "Author": "Trevor Rentschler", "ReviewID": "R2HVZVWERLIK8G", "Overall": "5.0", "Content": "You will be very hard pressed to fing anything that operates better the this amazing piece of perfect engineering. Get this and you will not be disappointed", "Date": "April 7, 2014"}, {"Title": "Apple iPad air", "Author": "Barbara J. Post", "ReviewID": "RKD9NLKBBS7UP", "Overall": "5.0", "Content": "Love the sleek lightweight pad.  Clear screen and nice arrangement of icons.  Still need time to go through everything so can't comment on anything else.", "Date": "April 7, 2014"}, {"Title": "Great Day", "Author": "Noel McGuire", "ReviewID": "R1DYEFJG2STFZK", "Overall": "5.0", "Content": "Never had a tablet before, always used a laptop or a desk top to accesss the interent, play games or draw. Been slowly getting into this Ipad Air thingy and i think its going to come in handy for sketching and art. Apple does seem to have the best apps for creative people, so i'll see what i can find. Overall its a good device and i think its going to be a great day.", "Date": "April 7, 2014"}, {"Title": "It does what I need it to", "Author": "Angela Gibson", "ReviewID": "R10C4Z6WAJYHLY", "Overall": "4.0", "Content": "The shipping took forever but it's doing what needed it for so it's all good! Wish it came in pink! : P", "Date": "April 6, 2014"}, {"Title": "Love the Air!", "Author": "Shirlee Pierini \"Book lover\"", "ReviewID": "R243NSY5WOZYJ7", "Overall": "5.0", "Content": "I love my iPad Air because it is so much lighter than my other iPad.  I use it primarily for reading so it is great.", "Date": "April 4, 2014"}, {"Title": "Ease! Fun!", "Author": "Bick", "ReviewID": "R12XU0GWM5CFXF", "Overall": "5.0", "Content": "Never been an Apple fan, however, after purchasing this IPad Air, we are so happy with every aspect of it's design, Just wish I didn't have to pay as much as I did compared to  tablets.", "Date": "March 17, 2014"}, {"Title": "This iPad is worth every penny!", "Author": "aonetruthr", "ReviewID": "R24MI0VFKCBEZJ", "Overall": "4.0", "Content": "I saw the iPad Air for $479 on Amazon and I had to get it!  I've had the 4th Gen iPad for 11 months and I wanted my mom to have her 1st tablet so I gave her the 4th Gen.  It's so light and fast, and it's a great tablet.  I'm worried to hear what will be on the next iPad but as far as I'm concerned, this one has everything I need.", "Date": "March 17, 2014"}, {"Title": "Beautiful tablet...", "Author": "lailari72", "ReviewID": "R2ZHA36CY94149", "Overall": "4.0", "Content": "Beautiful little machine, more evolved companion to my ipad 2 but with a few differences. I know the air has the much talked about retina, but to be honest with my eyes it's hard to tell the difference between the clarity between the #2 and the air. The camera on the air far surpasses the ipad 2, but it's the march of technology as such.Also the Air really seems to hate the chrome browser. I don't use safari as a rule, not even on my MBP, being more comfortable with chrome. I never noticed my ipad 2 having an issue with chrome, but the air does and crashes four to five times a week when chrome is being used. I know apple loathes google, but whatever their differences they should put it aside for their customers.", "Date": "March 16, 2014"}, {"Title": "BETTER THAN MY EXPECTATIONS", "Author": "William C. Fike, Jr", "ReviewID": "RIS53EE3YHVPP", "Overall": "5.0", "Content": "Highly recommend this product to anyone.  My wife and I really enjoy the excellent features and the ease of use.", "Date": "March 15, 2014"}, {"Title": "Finally one for ME", "Author": "Gram", "ReviewID": "R1XG8XMTSZJX7P", "Overall": "5.0", "Content": "The price was right, new in box, fast delivery - when I get \"border\" with it or upgarde to the generation after this I will hand it to my grandchildren.", "Date": "March 15, 2014"}, {"Title": "Very satisfied", "Author": "Dave", "ReviewID": "RJFHIUSAYE45U", "Overall": "5.0", "Content": "Scared to send something of this value and being electronic and -20 degrees below zero. I didn't know for sure how it would work out.  All was fine.  No issues.  Just the tax money saved was well worth shipping it through the mail verses the big box stores.", "Date": "March 15, 2014"}, {"Title": "Simply the best", "Author": "s198 \"s198\"", "ReviewID": "RS96ZBQP4JQB2", "Overall": "5.0", "Content": "I haven't owned an Apple product since the iphone4.  I have been an Android man the past several years.  Let me say that this iPad Air is the perfect device.  Rock solid and the apps are SOLID. I am a Cybersecurity manager and have seen one too many malware infested Android apps lately.  Enough to scare me away.  Buy this, you won't regret it", "Date": "March 15, 2014"}, {"Title": "iPad is the top of the league.", "Author": "abhishek", "ReviewID": "R3Q4KB7YSU381L", "Overall": "5.0", "Content": "I bought windows rt and dell venue before I finally settled on this one.all others are either very slow or too small.the iPad is a little expensive but its very classy and technologically way ahead of all the others.I would suggest everyone to just go with the iPad and never look back.", "Date": "March 15, 2014"}, {"Title": "So far I'm loving it!!", "Author": "roxanne", "ReviewID": "R1ATOPMPY6LHFM", "Overall": "5.0", "Content": "I bought this after hemming and hawing over all the different options for tablets. I'm a PC user primarily and Apple products are usually more expensive than I'm comfortable with. I eventually chose the iPad Air because Apple has long lasting, durable products and their customer service is usually top notch.The iPad came quickly and so far I love it!! It's incredibly light and has a lot of useful apps for school (which is why I wanted a tablet). It beats dragging a heavy computer around campus, that's for sure! The sound quality of the speakers are really nice and the screen's resolution makes pictures beautiful.I only just received the product so the battery is quite new, but it has a very long life; even when you're constantly using wi-fi or bluetooth it will last you all day.If you're looking for a tablet, you should go with whatever makes you comfortable and consider what you want to use the tablet for.  That being said, even though I'm more comfortable on PCs this is a handy device and so far I'm happy with my purchase.", "Date": "March 14, 2014"}, {"Title": "Great", "Author": "Todd Machuca", "ReviewID": "R1ZODCTHMQPQ5", "Overall": "5.0", "Content": "Excellent machine. Far surpasses what I expected. Light weight bigger screen and much faster then the last version. Love it.", "Date": "March 14, 2014"}, {"Title": "iPad air", "Author": "alice lynch", "ReviewID": "R14P29E7WT9MF0", "Overall": "5.0", "Content": "Love my iPad air. It is so light and easy to use. I received it on the date that I was suppose to and have been having fun with it every day. Really like reading books on it so easy to read. Handy to use.", "Date": "March 8, 2014"}, {"Title": "Love this iPad", "Author": "Richard V.", "ReviewID": "R1KV98BFYI1VQ1", "Overall": "5.0", "Content": "This is a great tool! It's instantly on when I want to use it. I can take it anywhere and it's already to give me any information I need. I should have made this purchase a long time ago..", "Date": "March 8, 2014"}, {"Title": "Welcome to the age of technology", "Author": "Susan Macosko", "ReviewID": "R17IL5Q5NJ1QTD", "Overall": "4.0", "Content": "Having this kind of technology is a learning experience for me.  I am enjoying using \"facetime\" with my family.  It is much better than \"Skype\".", "Date": "March 7, 2014"}, {"Title": "Awesome new ipad Air", "Author": "Andrew Viernes", "ReviewID": "R3VTONI22U4AO6", "Overall": "5.0", "Content": "Have had every upgraded iPad since it's inception and this is the pinnacle of iPad design, functionality and style. Great battery life, screen resolution and weight.", "Date": "March 7, 2014"}, {"Title": "unbeatable", "Author": "cset", "ReviewID": "R2N3F59CO5YKWX", "Overall": "5.0", "Content": "iPads are still the easiest to use, most versatile and best quality tablets on the market.  Samsung has some nice Android OS ones, but they are just as expensive and with Android you have so many different brands and versions of OS that it is impossible to standardize as a program/App may work on one but not on another brand or model etc. Apple just makes user support a non-issue. Power on and go.", "Date": "March 7, 2014"}, {"Title": "New tricks for an old dog?", "Author": "V. Chevalier", "ReviewID": "R3RQFBRHRN1PCA", "Overall": "5.0", "Content": "When I'm home in my comfy chair, I still prefer using my laptop with the old keyboard and mouse; however, when I'm anywhere else, this iPad is wonderful!  It's fast, convenient and the battery lasts so much longer then my laptop battery.I'm not tech savvy and I have yet to learn a lot (like using word or numbers programs) but so far the old gal is thrilled with it.", "Date": "March 7, 2014"}, {"Title": "Perfect!", "Author": "Luiz Ferreira", "ReviewID": "ROB775JLKVC9A", "Overall": "5.0", "Content": "I choose this raiting because I didn' nothing wrong. Absolutely  PERFECT.That's all I want. Beatiful. Light. Fast. Fast. Faster. Recomend to all my friends.", "Date": "March 7, 2014"}, {"Title": "Love it!", "Author": "avidreaders", "ReviewID": "R1D53BTB8VHP81", "Overall": "5.0", "Content": "I should have purchased this much sooner much easier than carrying around my laptop.  Nice to share with my iPhone.", "Date": "March 6, 2014"}, {"Title": "Best buy", "Author": "Daniel", "ReviewID": "R1X23X4070M8NU", "Overall": "5.0", "Content": "This is a very nice and fast Ipad, quite light when you hold it in your hand. I warmly recomebd it.", "Date": "March 6, 2014"}, {"Title": "Best ipad I have owned", "Author": "Devon white", "ReviewID": "RVSSHLI3AD0RR", "Overall": "5.0", "Content": "So just to let you know of my experience with IPad's I have owned the first generation the ipad 2 and know the ipad air and I can honestly say this is the best ipad yet. I loved my ipad 2 had it for 2 years it never skipped a beat. But know that I have the ipad air it's in a whole new ball park I wouldn't even say that the ipad 2 is even close to the ipad air. Performance wise I do a lot of multi tasking and it doesn't even break a sweat. The picture is brilliant very clear and crisp. The size and structure are amazing light and beautiful very sharp. It fits in your hands like a glove. It has a great camera for a tablet you wouldn't believe the pictures I have taken with this thing I get a lot if compliments all the time. As for its competitors the samsung note 10.1 2014 edition, the structure of this ipad blows it away. Know Samsung has its own perks that Apple doesn't offer but I would still say its a fair superior product then the note. That being said I do own a galaxy s4 smart phone and I absolutely love it I just prefer my phone to have a bigger screen,and it has it's other perks as well. mainly the galaxy gear watch sealed the deal for me. Hope this helped you into buying a IPAD AIR", "Date": "March 5, 2014"}, {"Title": "iPad love it", "Author": "Tina Mastrangelo", "ReviewID": "R11OZ51LS2CQ3L", "Overall": "5.0", "Content": "I received this promptly and love it!!Very easy to set up and sync with iPhone!Since I have ordered a cover and stylus", "Date": "March 5, 2014"}, {"Title": "Exactly what I was expecting", "Author": "K. G.", "ReviewID": "R2KK7FNSNSUDXF", "Overall": "5.0", "Content": "It was exactly what I was expecting...love it!!  Also got a keypad to go with it and it is awesome!", "Date": "March 5, 2014"}, {"Title": "Handy", "Author": "Jerry Kristan", "ReviewID": "R2S1U93978ZXLN", "Overall": "5.0", "Content": "Very handy to have on the end table as it acts as our TV guide. It is user friendly just like the i phone, we use it for looking items up on the web as well as paying bills on line and banking. The battery lasts us a week before needing a charge.", "Date": "March 5, 2014"}, {"Title": "Everything is great,", "Author": "Sylvester A. Alfonso", "ReviewID": "R39N60J9TEQJ80", "Overall": "5.0", "Content": "Needed a replacement for my other iPad. Decided to get the upgrade and found this cheaper here than on apples web site.", "Date": "March 5, 2014"}, {"Title": "love it", "Author": "Mengmi Zhang", "ReviewID": "R1N2ESZ8FVNIP9", "Overall": "5.0", "Content": "Really great quality and like it alot. Cheaper than app store and still great quality. Save extra bucks to buy smart case and screen protectors lol. Well done", "Date": "March 4, 2014"}, {"Title": "Great", "Author": "Li Xuanran", "ReviewID": "R1691JHU19U5X5", "Overall": "5.0", "Content": "its a good good good good good product,sometimes little bit stuck，all in all it's a good good product any more", "Date": "March 4, 2014"}, {"Title": "Arrived quickly", "Author": "Steven I. Arroyo", "ReviewID": "RR4FLZTBGGU93", "Overall": "5.0", "Content": "Great purchasing through Amazon, the iPad arrived quickly and works perfectly, no issues great upgrade from the 3 Gen. iPad I was using, a lot lighter, easier to hold", "Date": "March 4, 2014"}, {"Title": "good~", "Author": "Wenhui Hu", "ReviewID": "RQW8QVW68OC8T", "Overall": "4.0", "Content": "love it, as it is new as what has been described. while sometimes the product reflects a little slow when you have been using it for a very long time. That's may need some development~", "Date": "March 4, 2014"}, {"Title": "Love my ipad", "Author": "Amy R.", "ReviewID": "RUX05YBNWU5NV", "Overall": "5.0", "Content": "What can i say....it has met and exceeded my expectations.  I wish i had purchase this thing earlier.  I love the way my iphone apps are automatically loaded over onto the ipad.  Some of the views on an ipad are different than the phone (like gmail, other apps I use often), some of them I prefer on the ipad, some i still prefer on the phone.", "Date": "March 4, 2014"}, {"Title": "Love my new iPad!", "Author": "Rachel Shelton", "ReviewID": "R3OHGFRCF3SGY9", "Overall": "5.0", "Content": "I adore this new iPad. Shipping was very fast also - it got here in a couple days. I have an iPad 2 that the battery's starting to go out on - but I used it to the MAX for 2 years solid. I like the less weight of the iPad Air - it's awesome!", "Date": "March 3, 2014"}, {"Title": "It is great and had no problems with delivery", "Author": "Nicole carlson", "ReviewID": "R1X68FTIN2P9GI", "Overall": "5.0", "Content": "I choose this raining  because it was delivered right on time and with no issuesIt  was so good to just open the box and start working on the I padI wold recommend it to any one", "Date": "February 26, 2014"}, {"Title": "Best tablet", "Author": "Shahab Pourtalebi", "ReviewID": "REDJRNH7GAWLQ", "Overall": "5.0", "Content": "I had an ipad 2 64GB 3G. It was a good tabled, but I never used more than half of the storage space. Now I spent less money and I have more facilities.", "Date": "February 26, 2014"}, {"Title": "Terriffic upgrade to our new iPads", "Author": "Randy B", "ReviewID": "R1YU4F51PTUQ45", "Overall": "5.0", "Content": "We have had iPad 2 for quite some time. They have been great but we bit the bullet and upgraded to these. So much faster, a bit smaller and with better graphics. A bit of a hassle getting all the apps loaded on but I am not sure if it was me or iTunes but it all worked out and everything is running nicely. The extra 16 GB of memory was well worth the extra cost.", "Date": "February 25, 2014"}, {"Title": "Apple is by far the best computer out there.", "Author": "KENNETH P.", "ReviewID": "R3JGQ1MGHSVE1R", "Overall": "5.0", "Content": "Apple is by far the best computer out there, i 've used other computers in the pass and i thought to myself that i would try apple to see what all the fuss was about apple, when i started using it the quality was so outstanding and the HD quality was magnificent, everything about Apple was excellent, i just feel in love with Apple and i hope to buy some more apple products in the future................", "Date": "February 25, 2014"}, {"Title": "Easy to use great screen.", "Author": "chris", "ReviewID": "R19ENXPB2BRNU8", "Overall": "5.0", "Content": "Pros: almost everythingCons: Movies look great I just with the iPad was 16:9 so the movies would fill more of the screen. I had the Sony table and the not 10.1 2014 and this by far is way better. I feel myself not using my phone as much.", "Date": "February 25, 2014"}, {"Title": "Very nice!", "Author": "D. Utterback", "ReviewID": "R2OM4RTB2ATHD7", "Overall": "5.0", "Content": "I haven't used it tons but I have read several books on it and am also using it for checking email and messages some. Also handy for the eBay app. Nicely made and sure looks like a great product! I've had an iPhone 5 for a couple of years so it was an easy step into using this since the operating system is the same.", "Date": "February 24, 2014"}, {"Title": "Arrived on time and in great condition", "Author": "Always Satisfied", "ReviewID": "R2FQJ90F66FJQX", "Overall": "5.0", "Content": "I like that I was able to beat the sales tax on this item - there are few other places where sale tax is not collected at source.Have not been able to use the item since it is a gift for someone else.", "Date": "February 24, 2014"}, {"Title": "iPad", "Author": "yolanda lewis", "ReviewID": "R3VLXFLFGPXKQW", "Overall": "5.0", "Content": "I love my iPad! It's great! I use it more than my laptop. It's light as a feather and so easy  manipulate.", "Date": "February 24, 2014"}, {"Title": "Light weight, great performance", "Author": "KJoegg", "ReviewID": "R3BYVZCBK3EMC4", "Overall": "5.0", "Content": "I really like the lighter weight and slightly smaller dimensions of the iPad Air. Holding the iPad with one hand for extended periods just got a lot less tiresome. It's surprising how much difference it makes. Performance seems about the same to me. I recommend the iPad Air to anyone who spends a lot of time on the move and holding it to read or work versus sitting it in a stand.", "Date": "February 24, 2014"}, {"Title": "Love it", "Author": "Jane C. Scott", "ReviewID": "R3UX9BK1SZ6HWL", "Overall": "5.0", "Content": "I love it.  I learn a new way to utilize it everyday. I do private tutoring and I am able to carry use it easily.... plus I have my own entertainment when traveling or waiting or whatever.", "Date": "February 24, 2014"}, {"Title": "Incredibly light, fast and beautiful. Is it the best tablet for you?", "Author": "John Ryan", "ReviewID": "R99F4BEOZO0JF", "Overall": "5.0", "Content": "The new iPad Air is Apple's latest, slimmest, lightest release of their hand-held computer. Oddly enough, it's so beautifully easy to use (my one year old daughter loves playing with it), it's almost doesn't feel like a computer at all.A word of warning - this review is written for people who've never owned an iPad before - and are wondering what all the fuss is about. If you're thinking of upgrading skip down to the \"What's great about the Air\" section below, or just buy it - it's amazing.Just what's all the fuss about?--------------------------------------I used to own a laptop for work, and (very occasionally), it'd sit on my lap on the sofa, and I'd use it for pleasure (eMail, watching films or playing the odd game). Then I bought my first iPad, and the laptop became redundant, a boring \"work device\". Hard to explain, but the fact the iPad is so small and light, and you navigate around with your finger by pointing and gently swiping the screen makes the whole experience a lot easier - a lot more fun.Even my most \"luddite\" of friends have been won over.It's incredibly simple and easy to use (it only has one main button), and everyone from my one year old daughter to my 85 year old dad have taken to without problems. It's size and shape also support using it like a book (literally to read a book or web page), but you can also watch TV and films.Personally I'm also paranoid about my password getting \"hacked\", and someone running up a huge Amazon bill or buying stuff with my credit card on eBay. Well one of the benefits of the iPad (and iPhone) is it's \"almost impossible\" to get a virus - one of the most common ways to get hacked. This doesn't mean you shouldn't use strong passwords, (both Sony and Adobe got hacked), but it's reassuring to leave the Windows world behind.Finally, I love the way these devices (iPad, iPhone, Apple TV, Apple Mac), increasingly work together. The fact you can start a Pages document on your Mac and edit it on your iPad, or take photos on the iPhone, and in seconds see them on the iPad or Mac and display them on the Apple TV.The thing is, \"it just works\".What would you use if for?----------------------------------* Shopping online. Obviously - you could be reading a review on Amazon about the iPad Air!* Reading web pages. As you can hold it like a book it's great to read the news online (my wife loves the Daily Mail Online).* Reading Books. It's great for reading books from Amazon Kindle or Apple Books with the benefit of 1,000s of online book reviews* Navigating web pages. Instead of clicking with a mouse, you gently swipe your fingers on screen to scroll around* Watching Films. I use it to watch Netflix online videos (with an Apple TV you can send stuff to the telly)* Watching TV. With the free BBC iPlayer app you can catch up or download BBC programs* Reading and replying to mail. I use \"mailbox\" a great free app to read and reply to mails, but there's a free one included* Showing and organising photos. Any photos on an iPhone are automatically available within minutes in \"the cloud\"* Playing games. From fun puzzle games like \"Cut the Rope\" to fully fledged first person shooters.* Listening to the Radio. With \"Tune in Radio\" you can listen to thousands of radio stations world-wide.* Listening to music. I stream mine to an Apple TV, but you can also buy portable speakers or just plug into the AUX socket* Editing Word, Excel and Powerpoint documents using FREE App \"QuickOffice\" (owned and supported by Google).* Editing Pages, Numbers and Keynote documents (Office for the Apple) on the FREE Apple apps.* The list goes on and on.Update: You can edit Word, Excel and Powerpoint documents (plus Pages, Numbers and Keynote) on the iPad (although I'd recommend an external keyboard - see below). It's definately powerful enough, although I'd not expect these apps to cope with REALLY complex document layouts. Great for general letter and document writing though.Which model should I buy?----------------------------------I can't comment about Android tablets (apart from the Google Nexus 7 which is well regarded), but in terms of the Apple tablet line-up in order of cost:-1. Avoid the Apple iPad 2, it's a relatively old model, under-powered and with a lower resolution screen. If you really want an Apple but don't want to spend the cash, buy a 16g WIFI 3rd or 4th generation iPad from eBay. Avoid this one.2. iPad mini is a lovely tablet. A 7.9 inch screen and astonishingly light and remarkably thin - it feels like a light-weight book.3. iPad mini with retina screen. Again 7.9 inch screen, but with the blazingly fast A7 chip and a \"retina\" (high definition) screen. Worth the upgrade if you can afford it.4. iPad Air. Much larger screen size (9.7 inches - doesn't sound much but it makes a huge difference). Same fast (A7) chip as the Mini with Retina - the latest and fastest iPad available.Clearly (from my viewpoint) there's only really three options. The iPad Mini, the Mini with retina screen and Air.What are the Optional add-ons?-----------------------------------------Well, assuming you've dropped by the Apple Store or John Lewis (which I would highly recommend), and handled the iPad Mini (with/without retina screen), and iPad Air then your options are around memory size and cellular option.Memory: Once bought, you can't add memory (space for apps, films, books etc). However, the basic price goes up a huge amount (+£80 for the 16g to 32g iPad Air). But, having owned a 16g and then a 32g iPad - I can safely recommend the 16g unless you really want to store a huge amount of videos and downloads. Only you can decide, and if you're lucky enough that money is no object then splash out. Otherwise, 16g should be fine for most people.Celular: Allows you to connect to the internet while you're out and about. This will add an additional +£100 to the price and means you can slip in a mobile phone SIM card. This means (for an additional £7-15 a month extra), you can access the internet on the move. Alternatively, you can opt for the WIFI option, and use it at home or at at \"hot spot\" (eg. Starbucks, most rail stations and hotels etc).Personally I'd buy (and indeed did), the 16Gb iPad Air WIFI.Do I need anything else?-------------------------------Most people (me included) buy a cover. Apple (and now several copy-cats) make a \"smart-cover\" which automatically shuts down the iPad when you close it, and switches it on when you open it. There's versions which cover the back, or just the screen. Apple charge from £35 to £65 for their (admittedly) high quality fabric or leather covers, but there's many available from £10. Be aware, you do get what you pay for.Personally,I think it's a pity to cover the beautiful aluminium industrial design of the iPad with a cover - but if you've spent hundreds of pounds you'll want to protect it from scrapes and bangs.I also invested in a keyboard (£25-80), as I tend to write a lot of mails and documents (remember it comes with a word processor). I'd recommend the Logitech Ultra Thin iPad Air Case with Keyboard - Space Greyand the ZAGG Keys iPad Air Case Folio with Backlit Keyboard - Black although these are strictly optional unless you want to use your iPad as a proper laptop.Finally, if you have another Apple device (eg. an iPhone, Apple TV or Mac) you'll find these work together beautifully. For example, you can create a reminder on your iPad and it appears on your iPhone. Equally, photos taken on your iPhone appear on your iPad, and you can stream music or videos from iPad, iPhone or Mac to an Apple TV.Some people think this \"locks you in\" - but it's your choice.What's great about the Air?-----------------------------------* Lighter (30%) and thinner than the previous version (469g from 650g)* Even faster A7 chip. Blazingly fast!* Improved sound (compared to the iPad 4)* Software including+ iMovie - edit and publish home made movies+ Numbers - Fully functional Excel for the iPad+ Pages - Word processor+ GarageBand - Play a piano or a drum kit+ iPhoto - Edit and organise your photosWhat's not so great?--------------------------* The change in physical size means you'll need a new keyboard or replacement cover if you're upgrading* Pity Apple didn't include the \"touch ID\" to secure your passwordsOverall Opinion---------------------It's hard to believe the iPad version 1 was released just four years ago, and there's a huge raft of \"me too\" tablet computers to choose from, but the Apple iPad Air is still the one to beat. As \"Which?\" magazine (in the UK) put it - \"...the best tablet we've ever tested. Apple packs a beautiful screen and lightning fast processor into a slimmer-than-ever shell, and battery life is very impressive\".Yes, there are cheaper Android based alternatives, but the quality, design and beauty of this tablet just sets it apart. If it were a car it'd be a top of the range Mercedes or a BMW.Highly Recommended.", "Date": "February 23, 2014"}, {"Title": "Apple does it again", "Author": "Robert Garner", "ReviewID": "R2A8NVDAH0DGG5", "Overall": "5.0", "Content": "This is not my first iPad. The iPad Air exceeded my expectations. The speed is the greatest improvement and the feel (weight) is amazing.", "Date": "February 23, 2014"}, {"Title": "iPad Air", "Author": "Dena Kimberlin", "ReviewID": "R2LHEMWU8IBPC7", "Overall": "5.0", "Content": "This amazing iPad is  sleek and very easy to manage.  It is easy to carry and so lightweight you do not really know you are holding an iPad", "Date": "February 21, 2014"}, {"Title": "i-pad air", "Author": "linda hughes", "ReviewID": "RGWALXES2Z8RS", "Overall": "5.0", "Content": "was gift for grand daughter.she is very happy with it she loves it .lightweight and does everything it says.no negative comments.", "Date": "February 21, 2014"}, {"Title": "Great buy", "Author": "Cindi Hansen", "ReviewID": "R3GFV6XCW7ACOC", "Overall": "5.0", "Content": "This product is awesome! So fast and everything I would need in a tablet. Clear screen display as well. Perfect", "Date": "February 21, 2014"}, {"Title": "Fast", "Author": "michael", "ReviewID": "R1A1BVYAMHU95R", "Overall": "4.0", "Content": "I love the graphics on hd photos like Facebook. A lot of apps and tons of music. A must have.", "Date": "February 21, 2014"}, {"Title": "Totally wicked awesome!!!", "Author": "chris", "ReviewID": "R3UWYQEK4KVF6U", "Overall": "5.0", "Content": "Apple has earned the top spot for a reason and this is no exception. The new iPad air does all you can think of doing and more. I am extremely pleased with the purchase and wouldn't hesitate to buy another if the need arises.", "Date": "February 20, 2014"}, {"Title": "PERFECT ITEM", "Author": "Xin Liang", "ReviewID": "R1T6KF4GPEJ5B5", "Overall": "5.0", "Content": "The delivery was so fast. It turned out iPad is still the world's best tablet and if you don't have an iPad, I totally recommend this iPad Air to you.", "Date": "February 20, 2014"}, {"Title": "Love it", "Author": "Michele L. Boyd", "ReviewID": "RYLVR0RLBIBW1", "Overall": "5.0", "Content": "The iPad is so easy to use that I don't turn on my other computer any more.  Wish I had it sooner.", "Date": "February 20, 2014"}, {"Title": "GREAT!!!", "Author": "Ramtech72", "ReviewID": "R2CYRQ4CLFH6EG", "Overall": "5.0", "Content": "I love it. I had before the iPad 3 and this is just great. Its size and weight are excellent, and the best price we could get. Your shipping was very fast.", "Date": "February 20, 2014"}, {"Title": "Excellent,but if you have iPad 3 or 4. Don't change", "Author": "armando yepez", "ReviewID": "RB6BNTSX3LHFN", "Overall": "4.0", "Content": "The iPad air is faster lighter but in essence is the same that older iPads. The reason why I change my iPad 3 for the iPad air was I need more space. Also I sold my iPad 3. The notice that improvement is the lighter of this iPad air. The faster is depend of your internet connection. I recommend this iPad air if you are looking for first time or you want improve your memory capacity if not don't buy and keep your old iPad.", "Date": "February 14, 2014"}, {"Title": "It's iPad Air", "Author": "Mohammed Kamal \"iMak\"", "ReviewID": "R1MSL1Y39CNXIF", "Overall": "5.0", "Content": "What can I say? It's iPad Air and that's enough to say. The best iPad I have owned. Love it.", "Date": "February 13, 2014"}, {"Title": "Great purchase", "Author": "Wayne J. Buck", "ReviewID": "R5VQUQMBSUSAL", "Overall": "5.0", "Content": "We replaced our original version of the Ipad with this Ipad Air. Found the right price, it arrived on time and has been just what we wanted.", "Date": "February 13, 2014"}, {"Title": "Love it!", "Author": "Opozz", "ReviewID": "RR8HTJEOW1S4D", "Overall": "5.0", "Content": "Received it quickly and love it!  Very light and easy to use.  Finally getting back to reading books again. So simple to download from amazon.", "Date": "February 10, 2014"}, {"Title": "New iPad Air", "Author": "Kissifur \"Kissifur\"", "ReviewID": "R3KRFSYZXO5LG6", "Overall": "5.0", "Content": "What is not to like about an iPad that is lighter, but still has the same large screen ....great product and super shipping and packaging.", "Date": "February 10, 2014"}, {"Title": "iPad air", "Author": "Nicole", "ReviewID": "R2X2NC92JEZIAR", "Overall": "5.0", "Content": "Great product and very lite and hd clear better than my ipad 2 on something's it's a all around good product.", "Date": "February 10, 2014"}, {"Title": "Valentines Gift", "Author": "David Ballerini", "ReviewID": "R2UFVHNH3KJY1C", "Overall": "5.0", "Content": "I bought this for my wife. Bottom line, she loves it. As I am tech challenged, my neighbor helped set the device up. Thank God for helpful neighbors!", "Date": "February 9, 2014"}, {"Title": "What can I say perfect product", "Author": "mona ghobrial", "ReviewID": "R1OLTIUVY1Y04B", "Overall": "5.0", "Content": "What not to like!Portability light weight and powerful and I am doing whatever I need to do without being tied to my desktop", "Date": "February 6, 2014"}, {"Title": "Pretty nifty!", "Author": "Jill B. Kettleson \"Sparky\"", "ReviewID": "R183OBAPWSNC4C", "Overall": "5.0", "Content": "This is ideal for just about anything... I have the iPhone 5s and this is a good compliment.  I highly recommend this.", "Date": "January 31, 2014"}, {"Title": "The future is a breeze", "Author": "The Guardian", "ReviewID": "RCZI8SDOCSF1B", "Overall": "4.0", "Content": "The iPad has established itself in four short years as the 'tablet of choice' to which all others are compared, and the Air is the newest and coolest in the family.First of all, the good news. At 467g the Air redefines computer portability and is so lightweight it's hard to tell whether you're carrying it in your bag or have in fact forgotten it, without looking to check. The Air has a fast A7 chip and the screen is a useful 9.7 inches; it's a breeze to use. The design of the graphics is so intuitive that any child or technophobe can master it and feel at home in a few minutes, which makes it the perfect entry-point into IT for someone who has so far avoided computers.One of the clever things Apple have done is the creation of the individual `Apple ID' which means once you enter your ID & password your iPad, iPhone, iPod and Mac immediately share all their files, and everything you created or stored on one device becomes available on them all: photos, music, reminders, address book, documents are all shared. This is probably the most brilliant idea ever in the IT mass market to create brand loyalty among consumers and `locks you in to the corporation for the duration'.Now, the bad news: the software crashes from time to time necessitating a reboot, which is annoying and inconvenient. This fault is acknowledged by Apple, as the software has a few bugs. Also the wireless reception is not all it might be, as it sometimes (mysteriously) fails to connect to even a moderately strong signal.Apple's pricing structure does not reflect the cost of manufacture but is driven by a market segmentation strategy, so the price really cranks up if you want an iPad with more memory or which can use the GSM phone network. The best value is the 16G Air without Cellular, which only connects to the internet via WiFi. 16G is a lot of memory by the historic standards of portable computers and you'll only find it insufficient if you want to store a lot of big files like films or powerpoint presentations.You'll need a carrying case to protect it (scores of different designs are available) and maybe a keyboard, which if you're doing a lot of writing and document creation rather than just surfing the internet is the one essential accessory, as without a separate keyboard the usable screen area is reduced in size. Around one million downloadable apps for Apple devices means you can personalize your iPad and make it into more or less whatever you want. The Air design is aesthetically a work of beauty in its simplicity, cleanness of lines and proportion, and despite some irritating niggles is a pleasure to own and use.", "Date": "January 22, 2014"}, {"Title": "Don't buy from Worldwide Distributors!!!  Restocking Fee for Returns!", "Author": "joedc831", "ReviewID": "RAIJ37X44JFHX", "Overall": "1.0", "Content": "They have a 10-15% restocking fee for returns that is not easily found on Amazon's website. Upon returning the unopened iPad Air to them, they charged me a $51.70 restocking fee.  Avoid Worldwide Distributors.", "Date": "January 15, 2014"}, {"Title": "BEWARE of unusable iPad Air!", "Author": "MORE THAN UNHAPPY!", "ReviewID": "R109F1FVFO7ZBB", "Overall": "1.0", "Content": "The iPads I purchased from TechGiant were not as they were described! When I took them to T-mobile to activate these \"brand new ipads\", I was told that they could not activate 4G on any of the 8 ipads I purchased! This was because all 8 were previously owned and blocked for FRAUD! TechGiant is selling previously owned items!  TechGIANT I would appreciate it if you contacted me directly to resolve this asap!", "Date": "June 4, 2014"}, {"Title": "I pad rocks", "Author": "Elizabeth", "ReviewID": "RXW5V6IUCQIZW", "Overall": "5.0", "Content": "I bought this wonderful table for my birthday this month so far I have no problems with it it does everything and more .I would recommend it to anyone this tablet rocks I am a satisfied customer.", "Date": "March 26, 2014"}, {"Title": "I love this thing.", "Author": "Signalshifter", "ReviewID": "R1PG0RSEDGFJ0B", "Overall": "5.0", "Content": "I have had several iPod Touches over the years and I have always wanted an iPad. Well the iPad Air had all of the power, features, and storage space I was looking for.  I was looking forward to it's arrival and when I first started to you use it, it was somewhat of a wa-de-doo-da experience not disappointment but total familiarity because of all of the iPod Touch's I have. Then it started to grow on me, watching Crunchyroll anime, Amazon Prime movies, and it's prefect integration with my Apple TV all of this while being decadent in bed with my Irish Terriers snuggled up around me, total domestic bliss. It is a howler when you accidentally activate Siri while asleep my snoring it gives Siri fits.  I purchase the small Apple keyboard for it and this just enhanced the iPad more, now I have a really nifty alternative to a small notebook computer.  I have not commented of the functionality I suspect most of you out there are like me coming from another iOS device. I do notice some un Apple like bugs in iOS 7.01.and somewhat less in 7.1 but have a PC with Windows 8.1 installed so any minor bugs in iOS-7.1 are nothing compared with this disaster from M$.", "Date": "March 22, 2014"}, {"Title": "Just what we needed", "Author": "Carol L", "ReviewID": "RV8GCGFKFRA88", "Overall": "5.0", "Content": "Large , clear, easy to see. My husband does not like electronics, but he loves his I-pad. Shares what he likes with everyone who will listen.", "Date": "March 21, 2014"}, {"Title": "best mac product", "Author": "mindy rosenbloom", "ReviewID": "R3637KAZKBDYO1", "Overall": "5.0", "Content": "love the size portability battery life looks seek like having appshave the desktop mac air iphone this is the best", "Date": "March 21, 2014"}, {"Title": "Great Device", "Author": "Adam R.", "ReviewID": "R26IVP3W64PC4J", "Overall": "5.0", "Content": "This is a great device.  I am able to be very productive on it.  I pair it with my New Trent Airbender case, and it is almost like having a light laptop.", "Date": "March 6, 2014"}, {"Title": "great device, but beware of third party sellers", "Author": "J. Zajaczkowski", "ReviewID": "R33HKDXO136BFX", "Overall": "5.0", "Content": "I recently got the iPad Air 128GB from TechGiant and immediately after getting it I took it to my local Apple store to get AppleCare+ for it. After talking to 3 different reps and finally a manager it turns out that the model I actually received was the ME898E/A and not the invoiced, and what was on the package, ME898LL/A. After doing some research the manager determined that they could not sell me AppleCare because the model wasn't sold in the US, but instead in Mexico. The Apple store manager then advised me to return the iPad because not only did I not receive the model invoiced but also that if I had any problems with it I would not get any warranty service because warranties are not offered for Mexican sold Apple products.Otherwise, this is the best tablet I have ever used. Like any other mobile device or computer, it does have problems if you open every app without closing them. To close apps on your iOS 7 iPad, simply double click the home button and swipe upwards the apps you aren't working with. This way you can enjoy the cutting edge speed this thing is capable of.", "Date": "March 6, 2014"}, {"Title": "I find it difficult to get used to", "Author": "beatrice j seegers", "ReviewID": "R1SUXXIMMTN7O7", "Overall": "2.0", "Content": "I've tried hard to learn how to use my pad, but still finding it hard to use.I suspect this could be me...but it \"freezes\" up and I do turn it off and start over but some times it does not work.I'm thinking of giving it to my son and getting a laptop.I like the pad and the ease of using the keyboard.The size is perfect and it is not too heavy", "Date": "March 4, 2014"}, {"Title": "Best iPad yet", "Author": "Amazon Review Dude", "ReviewID": "R2QU4ZAJZXRQ92", "Overall": "5.0", "Content": "This is definitely the best iPad I have owned.  I am upgrading from a 3rd gen retina iPad, but I've also owned an iPad 2 as well.  The weight of this thing is definitely one of the biggest draws.  The screen obviously looks just as good as the prior retina models, but the decreased bezel on the side is really nice.  I can almost palm the device and still have a full iPad screen.  I use it as my daily couch device every single day.  I think the iPad has gotten to a point where it can replace the need for a laptop for most folks.  While I still need a high performance desktop for various reasons, the iPad really gets what I need done when I am lounging around.", "Date": "February 16, 2014"}, {"Title": "Great Product", "Author": "12Junes", "ReviewID": "R131F02L9OA31P", "Overall": "4.0", "Content": "After coming from the 1st gen iPad, this took some getting used to. There are things that I like and things that I don't, but I think it's just personal preference. I do think that my 80 year old parents would have had a more difficult time getting used to this one.", "Date": "December 12, 2013"}, {"Title": "Don't buy from Worldwide Distributors!!!  Restocking Fee for Returns!", "Author": "joedc831", "ReviewID": "RAIJ37X44JFHX", "Overall": "1.0", "Content": "They have a 10-15% restocking fee for returns that is not easily found on Amazon's website. Upon returning the unopened iPad Air to them, they charged me a $51.70 restocking fee.  Avoid Worldwide Distributors.", "Date": "January 15, 2014"}, {"Title": "Love it", "Author": "Curt", "ReviewID": "RJ5E3PPGZEGQI", "Overall": "5.0", "Content": "I replaced a Samsung Galaxy tablet I bought just for fun.  It was ok, but was difficult to use, had limited apps, and seemed slow compared to my iPhone.  So I decided to try the iPad even though it was twice as much.I love this thing!  It's fast, intuitive, more apps, and just plain works better.  This tablet does so much more, works so well, I'm seriously considering going Apple instead of PC.  Don't think you can go wrong with an iPad, or iPhone either.", "Date": "June 8, 2014"}, {"Title": "BEWARE of unusable iPad Air!", "Author": "MORE THAN UNHAPPY!", "ReviewID": "R109F1FVFO7ZBB", "Overall": "1.0", "Content": "The iPads I purchased from TechGiant were not as they were described! When I took them to T-mobile to activate these \"brand new ipads\", I was told that they could not activate 4G on any of the 8 ipads I purchased! This was because all 8 were previously owned and blocked for FRAUD! TechGiant is selling previously owned items!  TechGIANT I would appreciate it if you contacted me directly to resolve this asap!", "Date": "June 4, 2014"}, {"Title": "I pad rocks", "Author": "Elizabeth", "ReviewID": "RXW5V6IUCQIZW", "Overall": "5.0", "Content": "I bought this wonderful table for my birthday this month so far I have no problems with it it does everything and more .I would recommend it to anyone this tablet rocks I am a satisfied customer.", "Date": "March 26, 2014"}, {"Title": "I love this thing.", "Author": "Signalshifter", "ReviewID": "R1PG0RSEDGFJ0B", "Overall": "5.0", "Content": "I have had several iPod Touches over the years and I have always wanted an iPad. Well the iPad Air had all of the power, features, and storage space I was looking for.  I was looking forward to it's arrival and when I first started to you use it, it was somewhat of a wa-de-doo-da experience not disappointment but total familiarity because of all of the iPod Touch's I have. Then it started to grow on me, watching Crunchyroll anime, Amazon Prime movies, and it's prefect integration with my Apple TV all of this while being decadent in bed with my Irish Terriers snuggled up around me, total domestic bliss. It is a howler when you accidentally activate Siri while asleep my snoring it gives Siri fits.  I purchase the small Apple keyboard for it and this just enhanced the iPad more, now I have a really nifty alternative to a small notebook computer.  I have not commented of the functionality I suspect most of you out there are like me coming from another iOS device. I do notice some un Apple like bugs in iOS 7.01.and somewhat less in 7.1 but have a PC with Windows 8.1 installed so any minor bugs in iOS-7.1 are nothing compared with this disaster from M$.", "Date": "March 22, 2014"}, {"Title": "Just what we needed", "Author": "Carol L", "ReviewID": "RV8GCGFKFRA88", "Overall": "5.0", "Content": "Large , clear, easy to see. My husband does not like electronics, but he loves his I-pad. Shares what he likes with everyone who will listen.", "Date": "March 21, 2014"}, {"Title": "best mac product", "Author": "mindy rosenbloom", "ReviewID": "R3637KAZKBDYO1", "Overall": "5.0", "Content": "love the size portability battery life looks seek like having appshave the desktop mac air iphone this is the best", "Date": "March 21, 2014"}, {"Title": "Great Device", "Author": "Adam R.", "ReviewID": "R26IVP3W64PC4J", "Overall": "5.0", "Content": "This is a great device.  I am able to be very productive on it.  I pair it with my New Trent Airbender case, and it is almost like having a light laptop.", "Date": "March 6, 2014"}, {"Title": "great device, but beware of third party sellers", "Author": "J. Zajaczkowski", "ReviewID": "R33HKDXO136BFX", "Overall": "5.0", "Content": "I recently got the iPad Air 128GB from TechGiant and immediately after getting it I took it to my local Apple store to get AppleCare+ for it. After talking to 3 different reps and finally a manager it turns out that the model I actually received was the ME898E/A and not the invoiced, and what was on the package, ME898LL/A. After doing some research the manager determined that they could not sell me AppleCare because the model wasn't sold in the US, but instead in Mexico. The Apple store manager then advised me to return the iPad because not only did I not receive the model invoiced but also that if I had any problems with it I would not get any warranty service because warranties are not offered for Mexican sold Apple products.Otherwise, this is the best tablet I have ever used. Like any other mobile device or computer, it does have problems if you open every app without closing them. To close apps on your iOS 7 iPad, simply double click the home button and swipe upwards the apps you aren't working with. This way you can enjoy the cutting edge speed this thing is capable of.", "Date": "March 6, 2014"}, {"Title": "The best full size iPad yet", "Author": "Sioux Hockey Fan", "ReviewID": "RNQY68DP984SQ", "Overall": "5.0", "Content": "I received this gift for Christmas this year after having waited over two years to finally make the jump into the tablet market. I can honestly say that I am happy with my choice.I personally found that the iPad Air has the perfect balance of portability, durability, productivity, app selection, and screen size for my needs. For me, it beats the rest of the tablet market right now.I got the 64GB Wi-Fi version, but found that I would have been more than happy with the 32GB version and a little bit of selective storage.iOS 7 is still not perfect for iPad yet, but honestly most Android skins aren't perfect either. Additionally, the app selection from the App Store specifically designed for tablets is just amazing.", "Date": "January 20, 2014"}, {"Title": "I love the Air", "Author": "Joe R. Sayers", "ReviewID": "R3JOM3CM6UT5OR", "Overall": "5.0", "Content": "I have bought an iPad in the past, the 2nd generation.  After having it for a few weeks, it was nice, but to me was just heavy, the dimensions (not including the screen) just seemed so big and it wasn't comfortable to hold.  I sold that one off, but recently decided to give the iPad Air a try, and I must say I am extremely impressed.  I know it takes a while for technology to sometimes get up to speed with what our expectation of it should be, and the iPad Air has definitely done that.The dimensions are great, it is SO light, SO thin, and it is not as wide or tall as the previous models, which make it much more comfortable to hold and use.The processor is so fast, and I can't help but continue to be impressed by all that comes along with that in use of apps, daily routines of email, facebook, games, learning apps, etc..  The hardware is also just absolutely beautiful.  Sure you can get other tablets at a lower price, but I don't think that the build quality, processor speed, or overall user experience can be matched.I love my iPad!", "Date": "January 16, 2014"}, {"Title": "My First IPad", "Author": "Amazon Customer", "ReviewID": "R1MDO7NKR4G044", "Overall": "5.0", "Content": "My IPad was received with a dent on the side where the box had also been dented. I was able to replace it at my local Apple Store.  I am not sure when this dent occurred but it took awhile before I wanted to go to the Mall and exchange it.With the holidays,  haven't had a lot of time to get to know my new IPad.  This week.", "Date": "December 30, 2013"}, {"Title": "Apple iPad Air 32GB Wi-Fi", "Author": "Tyketimer", "ReviewID": "R137ZBRF21H37E", "Overall": "5.0", "Content": "The iPad Air is an amazing device. I am impressed with the clarity & sharpness of the display and the thinness & decreased weight over the original iPad I have been using for several years. I would recommend the iPad Air to everyone who wants the very best in there tablet. You will NOT go wrong picking the iPad Air.", "Date": "December 29, 2013"}, {"Title": "Apple rules", "Author": "D2-X \"D2-X\"", "ReviewID": "R3R2AZ5Y76P81L", "Overall": "5.0", "Content": "I have years using iPad and this iPad Air truly is the best. It's super thin and lightweight makes it easy to use for play, work and even take pictures. Love it!", "Date": "December 29, 2013"}, {"Title": "Exactly what an iPad should be, and more!", "Author": "@akmclemore", "ReviewID": "R3P8C6WC66CV4P", "Overall": "5.0", "Content": "You really do have to experience this iPad to believe the amazement about it. Not only is it lighter, it is faster. much faster. Let's compare it with the iPhone 4 for instance. The iPad air is 3x as fast as that, making web-browsing and app downloading much easier.  I am really satisfied with this improvement.  Cons I noticed were the lack of an camera flash and fingerprint Id scanner.  I am using the iPad air right this minute to right this review and it has caught me surprise even though u did my research on the table before purchasing it two weeks before.", "Date": "December 29, 2013"}, {"Title": "Perfect", "Author": "C. A. Arnold \"lazy reader\"", "ReviewID": "R1WDK2DKMEK91P", "Overall": "5.0", "Content": "Great price, great item.  Hate this rating system...Son loved it as it is his Christmas present, and he now takes it everywhere.  MUCH lighter than the normal iPad, which makes it perfect for a purse", "Date": "December 29, 2013"}, {"Title": "o.k.", "Author": "just me", "ReviewID": "R2X18GAYX9HWQW", "Overall": "5.0", "Content": "It's GREAT but I had to have a few people HELP me getting it started, as this is my 1st one and and they don't send you a user paper to tell you anything.... and old folks need a little something to follow along with, if i had a smart phone, they said it's about like that to set up....", "Date": "December 26, 2013"}, {"Title": "Versatile, fast and intuitive!", "Author": "kim joseph", "ReviewID": "R3KZDREU91KCPH", "Overall": "5.0", "Content": "Love it!  It is faster and lighter, then the IPAD. I like it so much, especially for reading and for studying my music.", "Date": "December 23, 2013"}, {"Title": "Looks great; met all our expectations.", "Author": "David W.", "ReviewID": "R22OGLEW2J897D", "Overall": "5.0", "Content": "My wife and I are both familiar with Apple products, but this is the first iPad we've ever owned. Because I'm not a tablet guru or anything (nor was I particularly concerned with the improvements between revisions), I can really only review the product from the simplest perspective: does the product meet my particular needs?My answer is definitely yes. As our first tablet, we were mainly looking for a mobile media hub that also can perform various utilities that we find important (finances, travel guides, recipes in the kitchen, ebook reading). The iPad covers all of those bases nicely, and it's all packaged in a very sleek, attractive design.My primary reason for purchasing this particular model is that I plan on this lasting as long as possible, and I was concerned that an older model would become functionally obsolete faster than a newer model.", "Date": "December 12, 2013"}, {"Title": "Padman", "Author": "Joe Consumer", "ReviewID": "R25QATJS0DQ09G", "Overall": "5.0", "Content": "Lighter by far.  I love the large screen, but till now would find myself using the iPad Mini most of the time.  The iPad Air is light and comfortable to hold. The Mini is now the backup as I love the Air.  Speed increase, overall case size reduction, and weight reduction are all solid reasons for the upgrade.", "Date": "November 12, 2013"}, {"Title": "Great Purchase", "Author": "Art Lover \"Art Lover\"", "ReviewID": "R18PG2QYWEFW0V", "Overall": "5.0", "Content": "As expected, an excellent product. Great battery life and graphics as well as availability and variety of apps.I am very satisfied with my purchase.", "Date": "May 23, 2014"}, {"Title": "Great tablet", "Author": "Ken J. Erskine \"KJE\"", "ReviewID": "R1BVVV3GVE27QB", "Overall": "5.0", "Content": "I have a kindle fire, great for books but downloading videos is hit or miss and it would not connect to plane wifi.Have not had any of those problems with the iPad.Will probably go against the grain with this comment, also have an older iPad and I don't see a difference in download speed or picture quality--- not sure the $200.00 difference is worth it for the lighter weight, but no complaints regarding it quality or performance", "Date": "May 14, 2014"}, {"Title": "Yup.  The Apple devicecount just keeps growing and growing...", "Author": "jon mceachron \"(JDMc)\"", "ReviewID": "R3AJAQ0ZFLO5OJ", "Overall": "5.0", "Content": "(Disclaimer - I am a tech researcher during my day job...)So I get to work with a lot of different tools/technologies/devices.The Apple iOS devices were a hit from day #1.  Our household acquired one of the original iPods, followed by phones, tablets, and the Apple TV.  They reproduce like bunnies!Still a little pricey - all Apple Stuff is - but cheaper through Amazon than at my local Apple store.  (And I don't have to elbow my way through the mall...)JDMc", "Date": "May 10, 2014"}, {"Title": "Very good", "Author": "lishousong", "ReviewID": "R1UROO8VBZGJYC", "Overall": "5.0", "Content": "I like the item very much! I think I will buy it again and tell my friend who want to buy it.", "Date": "May 10, 2014"}, {"Title": "Just too difficult to manage", "Author": "Michael Hooker", "ReviewID": "R234KC8JAK7HC8", "Overall": "3.0", "Content": "1st iPad. I own a Kimdle HD. The Kindle is easier to manage files. Kindle has a free App of the day, nice little perk. Apple is faster. But, all the proprietary issues, operating system, cables, and iTunes, detracts from the tablet experience.", "Date": "May 9, 2014"}, {"Title": "Great deal", "Author": "David McDonald", "ReviewID": "R32NW95IXJZNCS", "Overall": "5.0", "Content": "Good product at a price that is lower than Apple.com because you don't pay sales tax (except California I think).", "Date": "May 7, 2014"}, {"Title": "NOT BRANDNEW", "Author": "bhscr", "ReviewID": "R3EQ6K6G8O6HO7", "Overall": "3.0", "Content": "i bought get the ipad air at 4/2/2014. but after i check the imei on the new. the ipad already being active at 1/26/2014.", "Date": "April 6, 2014"}, {"Title": "Ipad", "Author": "Cyndy", "ReviewID": "R36V3S5DBBKBIM", "Overall": "4.0", "Content": "I have loved my ipad however I bought a cover for it and it fell out the door of the truck and the front shattered even with the cover on it.", "Date": "April 1, 2014"}, {"Title": "Too pricey for the unit", "Author": "Karen Ballard", "ReviewID": "R2I4I2RC7AFJOH", "Overall": "3.0", "Content": "Nice looking, well laid out system, but the wifi is very slow to load.  Would have liked a system preference pane where everything is easy to find and pull up.  I think it is overpriced.", "Date": "April 1, 2014"}, {"Title": "Perfect tablet for my use.", "Author": "Deepam Panchal", "ReviewID": "R2GQ90JRKA0YAK", "Overall": "5.0", "Content": "It is perfect!!!!!Light weight and powerfulI use it for work, jotting down ideas and watch movies on Netflix.", "Date": "February 6, 2014"}, {"Title": "Love!", "Author": "Marsha F.", "ReviewID": "R3PQWMS937GG8Q", "Overall": "5.0", "Content": "Bought this for my husband for Christmas. He loves it. Takes it everywhere. No crashing issues with the OS like on his Iphone. Screen is amazing. Pictures and video come out great. Would highly recommend.", "Date": "February 1, 2014"}, {"Title": "User manual is not preloaded", "Author": "Thomas G. Field, Jr.", "ReviewID": "R3O5X6J8W8BDR7", "Overall": "4.0", "Content": "After a couple of weeks, I stumbled onto the manual (using my macbook). After a few hours, I figured out how to locate it and  load it on the iPad. Now, I'm trying to figure out why it wasn't pre-loaded. I'm sure there's a good reason that will come to me shortly.", "Date": "February 1, 2014"}, {"Title": "More Than Satisfied", "Author": "Ed Shuey", "ReviewID": "R21NZ3JDKOOJDZ", "Overall": "5.0", "Content": "Waited years before purchasing, read dozens of reviews, tried other manufacturers' products, and listened to others' opinions.Apple is at, or near, the top of their game obviously.Design, tooling, functionality, aesthetics, all of it really, are on the mark. Throw in the \"it\" factor and this is what you get.", "Date": "February 1, 2014"}, {"Title": "What you've come to expect from Apple", "Author": "jerome hammond", "ReviewID": "R3RO0MZNFFJVAY", "Overall": "5.0", "Content": "This was an upgrade from the original iPad, which was still in top working condition and being used daily. The product arrived earlier than expected in perfect condition. I've been using it now for 24 hours and my assessment is that it's exactly what we've come to expect from Apple - a product that feels great in the hand, looks great to the eye, and operates exactly as the mind would have created it. I look forward to 3 more years of trouble-free use from this outstanding Apple product.", "Date": "February 1, 2014"}, {"Title": "They were who we though they were", "Author": "Scott Crabtree", "ReviewID": "R3MRVFN9AKYGGG", "Overall": "5.0", "Content": "This is one of the pricier tablets, but I never have any problems with it.  The picture is great on it, and there's a ton of apps.  One gripe is having to download a browser that can handle flash.  That is just nitpicking at this point.  I mostly use it for netflix, hulu, xfinity streaming, and surfing the internet.  It is everything I thought it would be.", "Date": "January 31, 2014"}, {"Title": "Gift for my wife", "Author": "Mike Lockridge", "ReviewID": "R39TI6FZE4GSZ8", "Overall": "5.0", "Content": "My wife is really enjoying her Ipad Air.  She likes the size to watch her videos.  She enjoys playing her games on it anywhere she goes.  Also the picture is the best we have ever seen and we have seen quite a few desktop monitors, laptops, phones and tablets.", "Date": "January 30, 2014"}, {"Title": "IPAD AIR", "Author": "rudy", "ReviewID": "R2QTYC587U6C6J", "Overall": "5.0", "Content": "Its better that i expected i like it so much also the wife likes it tooI will buy 1 more for my daughter", "Date": "January 30, 2014"}, {"Title": "IPad Air", "Author": "R. ALCARAZ", "ReviewID": "R1O379UY5133TV", "Overall": "5.0", "Content": "The device is great and really light and comfortable to use.  I would highly recommend it for a tablet.  It would be even better if it supported flash player content.", "Date": "January 30, 2014"}, {"Title": "I am in love!", "Author": "purpleskier", "ReviewID": "R1QNFG4XUQMYID", "Overall": "5.0", "Content": "I LOVE THIS ITEM!  Works perfectly all the time...best money I ever spent!!  I just got the wifi and so far this has not been an issue at all.", "Date": "January 29, 2014"}, {"Title": "Great Christmas present!", "Author": "Sarajo Esch", "ReviewID": "R2JB2RHZAK4TUP", "Overall": "5.0", "Content": "Still learning to access all the great features. We are really enjoying the many features on this ipad. Delivery was very prompt.", "Date": "January 7, 2014"}, {"Title": "Very nice", "Author": "David Kent", "ReviewID": "RNEN846FHORIX", "Overall": "5.0", "Content": "This is our first \"pad\" so we have nothing to compare this product to but so far we love it.  It does everything that we wanted.", "Date": "January 7, 2014"}, {"Title": "IPAD AIR", "Author": "ONLY2222", "ReviewID": "R1Y37C3PEEEZIP", "Overall": "5.0", "Content": "EVERYTHING ARRIVED PROMPTLY WITH ALL COMPONENTS AND ALL OPERATED.  PRICE WAS IN LINE WITH APPLE STORE.  EASY SET UP AND INSTALATION OF MY IPHONE APPS.", "Date": "January 7, 2014"}, {"Title": "iPad air", "Author": "Sailor", "ReviewID": "R3TNSP6G5B6HSK", "Overall": "5.0", "Content": "Oh my goodness, this is the best thing since popcorn! Haven't owned an iPad before but I can't imagine not owning one now. Retina display is awesome, can't find a single thing that is not simply awesome, was so easy to set up.", "Date": "January 7, 2014"}, {"Title": "Ipad air 32 gb space grey", "Author": "Chris Rucker", "ReviewID": "R3U86ROZMV60HO", "Overall": "5.0", "Content": "It was just as described . A brand new unopened ipad air 32gb space grey product. The product has served me well and havnt had a problem out of it Will do business again .", "Date": "January 7, 2014"}, {"Title": "Great Product", "Author": "skipreed", "ReviewID": "RJ1KH2YAWVOTQ", "Overall": "5.0", "Content": "The Apple iPad Air, with 128 GBT, looks great and functions very well.  I bought it as a Christmas present for my wife and she really likes it.", "Date": "January 7, 2014"}, {"Title": "The Best.", "Author": "Richard Philips \"foot doc\"", "ReviewID": "RIM9SU6MXTRWE", "Overall": "5.0", "Content": "The speed of the ipad is great and many apps available for the ipad. This is my second ipad and they have only made it better.", "Date": "January 7, 2014"}, {"Title": "GREAT IPAD", "Author": "DONALD MIDGETTE", "ReviewID": "R2JEKEVW0808LS", "Overall": "5.0", "Content": "THE IPAD TURNED OUT TO BE ONE OF THE BEST GIFTS. I RECOMMEND TO ANYBODY WANTING A MANAGEABLE DEVICE. GO APPLE", "Date": "January 6, 2014"}, {"Title": "Great", "Author": "Rustam", "ReviewID": "R31WY8ERT5JDDS", "Overall": "5.0", "Content": "I like these guys, they have fulfilled all my needs. I have order like new (open box) item, but received a brand new never opened one. I love it", "Date": "January 3, 2014"}, {"Title": "Perfect for my iPad air.", "Author": "RRA", "ReviewID": "R1J2LFKGFYTUWO", "Overall": "4.0", "Content": "This item was the correct size, easy to carry and gives me what I need to use my iPad air.", "Date": "December 31, 2013"}, {"Title": "Apple does it again. Great device.", "Author": "Davey Williams \"davey williams\"", "ReviewID": "R3BD3NRCM6XUU6", "Overall": "5.0", "Content": "Apple does it again.The iPad Air is indeed revolutionary, building on everything the existing iPad generations have accomplished and offering a little more. Apple has continued improving and offering what they deem most important about these devices - usability, great display, wide range of inexpensive apps, durability, quality and lightness. They have not added features that some other tablets offer, but which may not be needed by everyone.ProsThe thing is zippy, looks great and works out of the box. Any questions I have or problems are quickly addressed by the Apple support community or the Genius Bar. There are a ton of apps, many free. IWorks and iLife are free, so I was up and running on Pages and iMovie in ten minutes at no cost. And it's LIGHT. I didn't think 0.4 lbs would be abig deal, but it is. For me, it crosses the threshold where sometimes I freak I left it behind because I can't feel it in my bag, and it's comfortable to hold continually.ConsApple didn't include a slipcover keyboard, but you can buy one in the Apple Store. It's a bit more expensive, but it's more durable, of higher quality, and retains more resell value than competitors. It doesn't have all those add-ons that one in one hundred users would use, which would make it weight as much as the surface or a garden brick.It's a five star device. The Surface may be too, I'm not sure, I don't own one. Go use both in the store, and get the tablet that works for you.", "Date": "November 26, 2013"}, {"Title": "The iPad didn't work properly", "Author": "JcTenn", "ReviewID": "R2RLLJ5CJOK5MI", "Overall": "3.0", "Content": "I had to take it to the Apple store where they replaced it, but told me that the warranty began upon original purchase.  The iPad was new,but had been purchased by the person who sold it to me.  It all worked out, but be aware and ask about warranty info before purchasing to make sure you're covered. I don't think it was due to any wrongdoing or misrepresentation of the seller, just some due diligence.", "Date": "May 11, 2014"}, {"Title": "It works", "Author": "Gordon Campbell", "ReviewID": "R1X9MFNRUPZ173", "Overall": "3.0", "Content": "Suits the purpose for what we bought it for. I think the prices are a bit exhorbitant, they could probably increase their market share if they lower the prices for the higher capacity versions.", "Date": "May 10, 2014"}, {"Title": "Apple IPadAir 16 GB Wi-Fi White Silver Newest Version", "Author": "nancy m schiffman", "ReviewID": "R1Y71SU7ZXTVHR", "Overall": "5.0", "Content": "I am writing to comment on how pleased I am with my new I-PadIt is easy to handle and navigate, making it lots of fun.", "Date": "May 10, 2014"}, {"Title": "it's ok", "Author": "Marbo", "ReviewID": "R2MITTZVT1SJTP", "Overall": "2.0", "Content": "It's sleek and nice looking but does not put the ipad to sleep every time.  i have to go back and check it.  So what's the point?", "Date": "April 29, 2014"}, {"Title": "I tried it because it's the newest version.", "Author": "Stavros \"Woma\"", "ReviewID": "R1FLSY7RAEYO6G", "Overall": "4.0", "Content": "It was a little too small for me, so I bought the iPad 4 and I could not be any happier. I guess it depends on what you're expecting and your personal tablet needs.  In addition, there are so many more products that are compatible with the iPad 4 and they seem to fit it much better.  On the good side, I recently became an Apple person after years of being an HP and other Android type computers.", "Date": "February 15, 2014"}, {"Title": "Great!", "Author": "GDA6186", "ReviewID": "R2902ILP6C105N", "Overall": "5.0", "Content": "Received the iPad just as expected. If there is any criticism I might have it would be that the product appeared to be packed very lightly. As in there was not very much padding for shipping. I received everything in perfect order, but the package appeared as though if it had been dropped or handled roughly there could have easily been damage to it. Nonetheless there was no damage, so I am completely satisfied.", "Date": "February 5, 2014"}, {"Title": "Love it", "Author": "Jan", "ReviewID": "R1GAW4N2PJ61ZB", "Overall": "5.0", "Content": "Received the very next day and can't seem to put it down.  Wish I had brought the 32GB I watch lots of movies and listen to lots of music.", "Date": "February 4, 2014"}, {"Title": "ipad helps me in my real estate business", "Author": "James J. Trapasso \"jmyjo\"", "ReviewID": "R3SHIC92KPS6HA", "Overall": "5.0", "Content": "I am very pleased with the ipad.  I use it for my real estate business.It  provides me with a great deal of information that I can easily share with my clients.", "Date": "February 4, 2014"}, {"Title": "good", "Author": "soso", "ReviewID": "R3NJCA5M7JPPSD", "Overall": "5.0", "Content": "great this is useful for me. because i need this thing long time, and it is great. really good thing", "Date": "February 4, 2014"}, {"Title": "good purchase", "Author": "Linh", "ReviewID": "RZWGSTJ3VP307", "Overall": "5.0", "Content": "So far so good! The ipad arrived earlier than I expected and up to now, it has been working just as efficiently as I expect it to be. Good purchase", "Date": "January 31, 2014"}, {"Title": "Love this iPad!", "Author": "D", "ReviewID": "RKOH24B8RA5NE", "Overall": "5.0", "Content": "My niece and nephew purchased the iPad Air and had only good things to say about it so I purchased this one for myself.  It's light to hold and the colors and pictures are awesome.  A word of caution--be careful if you purchase a cover for it.  The first one I purchased caused the iPad to get extremely hot and it always wanted to shut down.  Got a new cover and all is well.  This is not a slam against the iPad at all--the cover was the cause.  Just be careful when purchasing a cover.", "Date": "January 31, 2014"}, {"Title": "Love it", "Author": "jahnny", "ReviewID": "R2AEFTL0X558WC", "Overall": "5.0", "Content": "It does every thing my laptop can do and I can use it anywhere I use it for mostly school", "Date": "January 29, 2014"}, {"Title": "Excellent", "Author": "Patrick J. Webb", "ReviewID": "R1BT7HMPD3DJ33", "Overall": "5.0", "Content": "Other than not being able to use Flash Player this is an excellent product. 9 out of 10 for no Flash.", "Date": "January 28, 2014"}, {"Title": "Nice.", "Author": "J. Powell", "ReviewID": "R205T84XGYQMQ1", "Overall": "5.0", "Content": "What can I say. It is made by Apple, it works every time. Retina display is beautiful and makes picture taking a whole new experience...", "Date": "January 28, 2014"}, {"Title": "perfect", "Author": "Khalid aljamei", "ReviewID": "R2DZ0KCOMYT4VD", "Overall": "5.0", "Content": "its really nice, useful, and will change your whole experience, its nice to have, don`t miss it.really something new", "Date": "January 28, 2014"}, {"Title": "Service not good", "Author": "James Lawrence", "ReviewID": "R2X2LXS8Z8VZ9V", "Overall": "5.0", "Content": "The ipad is great. The problem is my wife wanted a white one and as you can see that is what I ordered, but what I got was an all black one. Not  pleased with that at all.", "Date": "January 17, 2014"}, {"Title": "Product meets need of student", "Author": "Frank D Kot", "ReviewID": "R3HK0DQL92JECY", "Overall": "4.0", "Content": "Product was a gift for my grand-daughter. - She will be using it in Middle School where everyone uses tablets.", "Date": "January 12, 2014"}, {"Title": "Great buy at a very competitive price.", "Author": "RICHARD DANDRADE", "ReviewID": "RPLGS6V47S6DK", "Overall": "5.0", "Content": "Because it was worth the money and i couldn't beat the price anywhere else.The shipping was a bit slow but i got it before christmas and that's what was inmportant. Brand new, never opened.", "Date": "January 11, 2014"}, {"Title": "Excellent product", "Author": "Edward L. Byars", "ReviewID": "R2F88WDUKFW79P", "Overall": "5.0", "Content": "Everything was as expected and as advertised.Great value for the price.New in box with charger.Met my expectations.Super fast shipping.", "Date": "January 10, 2014"}, {"Title": "No problems to date", "Author": "donyelle", "ReviewID": "R2U7X0HX11T8NU", "Overall": "5.0", "Content": "It's worth the investment. Portable light weight and everything you need to work smarter not harder. Came brand new in box", "Date": "January 7, 2014"}, {"Title": "As Expected", "Author": "Wendy", "ReviewID": "R18SZF7JD9MMV2", "Overall": "5.0", "Content": "In good working order and no issues with product so far.  It was recevied a little late but still before Christmas.", "Date": "January 6, 2014"}, {"Title": "Excited", "Author": "Shev", "ReviewID": "R3VG29B3881N4M", "Overall": "5.0", "Content": "Everything was as expected. Happy to purchase this product. I ordered this as a gift for someone for Christmas and they loved it.", "Date": "January 6, 2014"}, {"Title": "As always Apple does it right!", "Author": "Alex Dailey", "ReviewID": "R30YI2AGYLKYTW", "Overall": "5.0", "Content": "Nothing bad to ever say about an Apple product. It's new design is extremely worth the purchase. I would always recommend it over the rest.", "Date": "January 6, 2014"}, {"Title": "Great", "Author": "Doug White", "ReviewID": "R3ML66NJ0D56NZ", "Overall": "5.0", "Content": "Really nice the best I have ever owned really nice to play games on it was the best ever present", "Date": "January 5, 2014"}, {"Title": "Totally incredible", "Author": "SMT", "ReviewID": "RQPOJWQNQFZK1", "Overall": "5.0", "Content": "This is my second iPad, I love it, what can I say? they know how it is done. My fourth apple device. love them", "Date": "January 5, 2014"}, {"Title": "Loved it!", "Author": "Ashley Richardson", "ReviewID": "RF6AWHG1XOWJ8", "Overall": "5.0", "Content": "Everything I had expected. I upgraded from an iPad2, this is a great device. I would recommend this product! I received my shipment fast and the iPad air was a great price.", "Date": "January 3, 2014"}, {"Title": "Fantastic Item", "Author": "Phill \"PhillFlash\"", "ReviewID": "R2LF8ZNUI25SUX", "Overall": "5.0", "Content": "I'm glad that I opted for this model.  Everything functions as it should.  Very easy to configure right out of the box.  Very little setup time.", "Date": "January 3, 2014"}, {"Title": "Beware of what Ipad you are really getting", "Author": "Norrlater", "ReviewID": "R32T2ZNF14R9F6", "Overall": "2.0", "Content": "The Ad says \"Ipad Air with plastic,no box'' Here's what you will get: It comes in a 9 inch cubical cardboard box-The Ipad still has the sealed cloth bag around it and is wrapped in bubble wrap. There are 3 little air pillows around it. That is ALL YOU GET, period. I never even opened up the cloth bag to look at the actual Ipad so I will assume that the \"with plastic\" means there is the thin plastic screen protector, in place. I will never know because I didn't open the cloth bag. Its true that there is ''no box'' but there will also be no instruction booklet, no USB cable, and no charger. (seller later told me he would send these accessories, which normally come with a \"New\" Ipad air-.One can merely speculate what happened to the originals. I had  assumed from the original Ad that the only thing that would be missing was the original box. Also, I was a little surprised when an email from the seller said \"iPad its brand New, it cover under apple's limited warranty.Model Verizon - put a sim card and use anywhere\"---thats a cut and paste.......The surprises just kept on coming. It went back in the original box, back to Amazon and out of my life.", "Date": "February 10, 2014"}, {"Title": "Good iPad", "Author": "Jimmy Crites", "ReviewID": "RB0CYABU3MR9O", "Overall": "4.0", "Content": "I hate the new charger/USB cord, all my iPhones and old iPad chargers won't work, and I have them all over the house, truck and work. But as far as the iPad goes, it works well.", "Date": "January 30, 2014"}, {"Title": "Not what I expected.", "Author": "bajangna \"bajangna\"", "ReviewID": "R1RSUPL9K57KEB", "Overall": "2.0", "Content": "This Ipad air is not for who love surfing internet, it crashed all the time. Very annoying. Apps mostly good. Design is great. But It's not worth even I got 32GB model for 515 included tax. Buy it for my girl. Wish it will be the best gift. No it's not.", "Date": "December 26, 2013"}, {"Title": "Does not stream Netflix in hd", "Author": "SpaceCat", "ReviewID": "R2P1VQC10SKXPX", "Overall": "2.0", "Content": "I bought this product primarily to stream movies and videos.  Although the screen is fantastic, and obviously built for HD, Netflix appears in a quality even lower than standard definition.  I have done a lot of research, and discovered a lot of folks are having this issue with the iPad Air.  After troubleshooting and trying all the fixes I could find, this is a dealbreaker for me, and it is getting returned. If you don't have Netflix, you might not notice this flaw.  Other streaming services seem to work okay.  Netflix told me it was an Apple issue.Although not a dealbreaker, I was also surprised how fast the battery drained on this device after hearing it praised in reviews.", "Date": "December 1, 2013"}, {"Title": "I need a USB port ???", "Author": "Charlie P.", "ReviewID": "R9CGKSVPE7QDE", "Overall": "4.0", "Content": "I have the newest ipad but would like to purchase the ipd air 128GBI would like to use it for work docs to work at homeI would like to copy docs from work on a stick and download to my ipad airTell me is this possible. Is there a USB port on an ipad air", "Date": "January 4, 2014"}, {"Title": "Big improvement in design, little improvement in Safari crashes.", "Author": "Ken H.", "ReviewID": "R3NT1XHW2KQFGE", "Overall": "2.0", "Content": "Upgrading from an iPad one I have to say that overall this is a very good machine. My main disappointment is that Apple did not add more RAM. While the machine does not crash as much as my iPad one did, Safari crashes on me at least 2-3 times a day. At a cost of about a dollar Apple could add an extra gigabyte of RAM to this device and make it much more valuable to the consumer.", "Date": "November 21, 2013"}, {"Title": "Wow so many gigabytes!", "Author": "Drew Bandas", "ReviewID": "R2QMQMLEXKFPCB", "Overall": "5.0", "Content": "I have never owned this product, nevertheless it's a fantastic product. It is very expspensive but worth it! My sister is shopping for an IPad and this would be perfect it even has a touch screen! Wow! I'm sure if I owned this I would use it for various activities, such as ordering Chinese food or watching Garfield 2. What a great  movie, I can't believe a movie about a cat that like lasagna could be such a cinematic masterpiece. Back to main idea here, this is supposedly a great product, and I say wow!", "Date": "March 15, 2014"}, {"Title": "totally wrong colour", "Author": "Amazon Customer", "ReviewID": "RCLGKZX3C2LD9", "Overall": "1.0", "Content": "I don't understand ， i need a black one 。 why i got a white one ？ don't you have a good sense of colours ??", "Date": "May 16, 2014"}, {"Title": "Not Overjoyed", "Author": "Amazon Customer", "ReviewID": "R1AVQNOU7NSTV7", "Overall": "2.0", "Content": "Purchased the iPad Air for my son who plays with it all of the time.  We had to reformat or reboot it last week already because it was frozen and would not turn on at all.  After the reboot or reformat it has worked fine ever since.  (Pushed the circular button on the bottom and the main startup button on the top right corner at the same time and held until unit started up again)", "Date": "January 2, 2014"}, {"Title": "Great!!!!", "Author": "Sean Slawik", "ReviewID": "R1CRLDM6WXA8P4", "Overall": "5.0", "Content": "Product came in an orderly fashion. Didn't get to use it because it is a Christmas present, so I will update this review once it is opened and being used", "Date": "December 10, 2013"}, {"Title": "iPad Air", "Author": "Petra E. Pershall", "ReviewID": "RH0NQSVS250M4", "Overall": "2.0", "Content": "I just purchased the iPad Air as a Christmas present for my grandson and so far I have had several problems with it.  I cannot get it to connect to my home Wi-Fi and had to have my business tech person work on it.  It was plugged to charge since before noon yesterday and as of 6 a.m. today, it had only charged 99%.  I have a iPad 2 and an iPad 4.  I wish that I had purchased one of those instead of the Air.  Hopefully, it won't crash on Christmas Day b/c my grandson is only 5 and won't understand why it doesn't work.  He uses my other iPads with no problems.", "Date": "December 23, 2013"}, {"Title": "I tried but wasn't for me", "Author": "Carter \"O.C.\"", "ReviewID": "R3L8JINUOZZDB5", "Overall": "3.0", "Content": "It's not a bad tablet by any means... one of the best BUT i'm slightly annoyed that it doesn't have the features i'm so use to using. My friend got me this as a gift to try to win me over to apple products... I gave it a go but It's just not for me. I decided to stick with my Samsung Galaxy Note 10.1 2014... I love using two screens at once.Pros: Really just the new design although I tend to have issues with the new bezel when holding it, you have no choice but to have one finger on the screen which sometimes causes issues with apps. and its smooth which is greatCons: Not enough features,  and boring. This was cool years ago but with tablets out there that allow multi screen and other amazing stuff...I gave it a go guys, and I really wanted to not be bias in my review. Hopefully you were able to see that. I think if you like the other Ipad's you will be happy with this for sure. If you want a much more amazing experience then i'd say go with the Samsung Galaxy Note 10.1 2014 or even a surface tablet.", "Date": "November 3, 2013"}, {"Title": "Just ok", "Author": "Kimmy", "ReviewID": "R3RZZIP3RS6P5N", "Overall": "3.0", "Content": "Given the competition from Samsung Apple scores low. I own both a Samsung Note 10.1 and the wife owns the Ipad air. She is returning the Ipad be cause it is not as great as my Note 10.1. If I had bought this 2 years ago the competition to the ipad was barely there. Now Appke has to tey a little harder to catch up again.", "Date": "December 2, 2013"}, {"Title": "You get what you pay for", "Author": "adsum \"dilligad@peoplepc.com\"", "ReviewID": "R1ZFI7JVOYW7TM", "Overall": "5.0", "Content": "Apple is like a Lexus/BMW/Infinity versus the others being a VW/Fiat/Kia. Sorry if this hurts someone's feelings- that is my EXPERIENCE.", "Date": "December 7, 2013"}, {"Title": "was a plassent buy  i very hapy for the item i buy fron the seler trait you goin to like", "Author": "juan b matos", "ReviewID": "RTRDLBCN76A58", "Overall": "5.0", "Content": "was a plassent buy  i very hapy for the item i buy fron the seler trait you goin to like this is the best ipad they make very light and i have what i want", "Date": "December 6, 2013"}, {"Title": "Not good", "Author": "asul", "ReviewID": "R2S0IRXD2WN9EL", "Overall": "2.0", "Content": "I got this last month and it became unusable to me. I got 4 replacements from Apple and they all kept on crashing.  Check out my review here [...]", "Date": "December 13, 2013"}, {"Title": "Same ol' same ol'", "Author": "Capt. McPl0x", "ReviewID": "R2YLISQO65IBEL", "Overall": "3.0", "Content": "There is NO reason for you to go out and buy this product is you already own the last generation version.  The differences are negligible.Apple should stop flooding the market with JND products ( just-noticeable difference) to rake in billions of more dollars.They should focus on making something that is truly new - not just a 5% upgrade of a previous product.", "Date": "November 11, 2013"}, {"Title": "It's nice looking but not for me", "Author": "Carter \"O.C.\"", "ReviewID": "R1PM9J9SMY6EOP", "Overall": "3.0", "Content": "It's not a bad tablet by any means... one of the best BUT i'm slightly annoyed that it doesn't have the features i'm so use to using. My friend got me this as a gift to try to win me over to apple products... I gave it a go but It's just not for me. I decided to stick with my Samsung Galaxy Note 10.1 2014... I love using two screens at once.Pros: Really just the new design although I tend to have issues with the new bezel when holding it, you have no choice but to have one finger on the screen which sometimes causes issues with apps. and its smooth which is greatCons: Not enough features, and boring. This was cool years ago but with tablets out there that allow multi screen and other amazing stuff...I gave it a go guys, and I really wanted to not be bias in my review. Hopefully you were able to see that. I think if you like the other Ipad's you will be happy with this for sure. If you want a much more amazing experience then i'd say go with the Samsung Galaxy Note 10.1 2014 or even a surface tablet.", "Date": "November 9, 2013"}, {"Title": "Not User Friendly Like Mac Desktops and Laptops", "Author": "Macuser", "ReviewID": "R1HPDY2MUUX9BD", "Overall": "2.0", "Content": "ipad has been nothing but fustration. There is no menu bar....no File, Edit, View, etc. So you cannot command the ipad to copy, paste, save, find file, etc. You cannot create folders.  So even if you could figure out have to save a document, you could not put it a folder.  There is not even a desktop like on a Mac!  So you cannot save things to the desktop where they are easily seen and manipulated.  With regard to email, the email programs on a iPad are very abbreviated versions of regular Macintosh mail programs.  So it's very hard to figure out how to compose, edit, quote, etc. because they are wildly different programs than what's on a Mac.  The highly touted \"fast Wi-Fi\" of the iPad Air turned out to be a cruel joke. At restaurant Wi-Fi hotspots the iPad browsed the internet slowly and it took many minutes for the email to load.  I will be returning this iPad because I cannot accomplish anything with it.  It's attractive looking and the retina display is very nice, but I can't get any functionality out of it. I need a real computer that's easy to use - a Macbook Pro laptop with retina.", "Date": "December 11, 2013"}, {"Title": "iPad-Air Battery", "Author": "RICHARD A CRABBE", "ReviewID": "R3K84MX7596GJT", "Overall": "1.0", "Content": "The ipad-air  has been out for some time and it is obvious the battery lets it down. There is no point in having a gadget if its battery cannot be charged. What is interesting is that Apple does not seem to care. As it stands, I will not recommend it to anyone.", "Date": "January 11, 2014"}, {"Title": "fast, great display, expensive - the professional reviews aren't wrong - especially about how there is not much new to say", "Author": "Dwight", "ReviewID": "R2OCSO7W1RW8R3", "Overall": "5.0", "Content": "Do not overcharge the nonremovable battery and prolong the longevity of this device with its huge sunk cost.Retina Display from what I can tell is wherever you have your ipad - be it six feet higher than your head or far off in the corner of the room, you can see the display.  It's tv quality display unlike the laptop or regular computer screen that is not visible if you are standing off to the side or too far away.I still hate touch screen tablets preferring the keyboard control of laptops but I have no regrets about this family purchase.  It does load internet pages faster and it does have the best display I have ever seen (but we are not a high tech wares household).  You can see the images from different angles from distances unlike how you need to position yourself to view a laptop screen.  So basically the high price can be somewhat justified in that for the price of a really good laptop - you can get a tv quality screen.  If the iphone had come out with a bigger screen like the Samsung Galaxy Note 3, I wouldn't have supported the purchase of this device and I would have been wrong about that but my brother has been sick and this makes him happy every day when he holds it - he smiles to himself.  After a few weeks of holding it carefully in a plastic bag!, we finally got the nearest perfect case for it: the i-Blason Apple iPad Air / iPad 5 ArmorBox Kido Series Light Weight Super Protection Convertable Stand Cover Case (Black).  I wanted the Speck handyshell of the Tylt stand but I as wrong.  The iblason folds under making it sturdier and better especially on a bed.We have screen protectors on front and back because this looks like the iphone 5s in that it is prone to scratches.We went with 64 gb after deciding on the 32 gb because nevermind Apple's profit margins, it was worth a hundred dollars more to prolong the life of this device.  Hopefully, this will be the only ipad we ever own.  We know people who still have their one and only ipad 2.This is another nonremovable battery so don't overcharge it.  You need to break out the included adapter because it's designed to be powerful enough to charge this ipad.  Iphone adapters will probably give you the message that the device is \"not charging\" after lighting up for a few seconds with the charging symbol when you first plug it in.It is thin but it is like a hard wafer - so it still FEELS thick in some ways - but it turns out one pound FEELS heavy to us so we didn't mind putting a fat case on it and ruin the thinness of it.  For the first few weeks without a cover, it didn't feel like that comfortable in the hand but then neither did the iphone 5s without a case.Holding something thin like the Air or the 5S does not make the device feel grounded but I definitely do not prefer the ungrabbability of the laptop - it is always a chore to haul a laptop.I don't doubt after living with the Air that Apple will be putting out much bigger Ipads in the future - it's the grab and go quality that is the selling point and we need bigger screens - this will then cut into Roku's competitiveness because Apple WILL put out an Ipad that is just large enough to make owning a tv set nonessential - it just needs to be bigger enough to be a few feet from the eyes.  Apple TV has real competition in the Roku but a bigger Ipad would not only be a laptop killer but it could make flat screen tvs less important.***********you can stop reading if you just need to decide if this is a good device - it is.  It also happens to be exponentially more expensive than Android and Windows tablets.The Apple walled garden feels BIG - it doesn't feel like the Android one which makes you feel like you went the a la carte route - you got a removable battery and removable memory with your device and you're feeling clever about saving money but the trade off is that you always have to scramble and you are NEVER SURE that you got everything covered (think of Apple as frustrating and expensive American citizenship as opposed to being a citizen of the European Union - Apple SUX!)  Android is missing apps and you notice when shopping at apps that it doesn't feel like the Apple App Store on the device - it doesn't feel like you have almost internet-size reach within the Apple universe.  It doesn't give you the feeling that you are receiving the goods first.  Android updates can be wonky and there is no accountability there - Samsung just apologizes if bad code screws up their phones that you now own and those updates with the unappetizing names that only sound good in theory but are all frankly, DREADFUL foods are never guaranteed for your particular device.  It feels like there is no recourse, no genius bar, nothing if there is malware or some other software problem.I'm not happy at all with Apple because of the nonremovable battery and the tough luck attitude if you plunk down way too much money BUT I can't trust the Android products at all BY THEIR VERY NATURE.  Google themselves won't refund their own branded devices after 14 days.  Am I supposed to head out to their California headquarters and beg for some customer service?  It doesn't matter if Apple stores don't make the majority of the sales  - they indicate a commitment to the customer.I'm always afraid Samsung is going to fold when it is no longer profitable for them - chaebols do do that.  I honestly don't think Google and Motorola are seriously interested in taking away from the Appleverse.  The Appleverse is the alternative, the break time from working on Microsoft computers.I would think the Android devices after they stopped getting updates would be as useful as the gameboy or nintendo ds toys in the back of the drawer somewhere.I'm not an Apple fan but I don't think Android has a shot despite offering removable batteries and memory sometimes which are extremely important especially for work-related data.*****************************The Apple Store lets you buy gift cards or coinstar receipts to pay.  Sony wants your credit card information even after they \"got\" hacked and released all the credit card information of its accounts.  Microsoft is only slightly better.  It's arrogant to force us to lose our financial privacy and security to access a device that we paid for.****************Who do you want to have access to too much of your personal information?I don't want ANY Of my stuff on ANY cloud especially if it is work related.  The internet-enabled devices are getting way more myserious, inaccessible and way slicker in the way they are not providing a description of what they do, how they do it, what is entailed, etc.  It's all ... hazy like a CLOUD.The internet access and the access of the apps to the owner's information makes me very uncomfortable which is why I see this as an entertainment device and not a work one  - it is impossible to look under the hood and control this thing - it takes the user for the ride - we are NOT in the driver's seat with these devices but that is also another reason to go American (that means Windows, Android Motorola/Google or Apple) and Apple and Windows are the ones with more closed systems but they're not perfectly secure.I think Siri indicates that not only are they recording our voices but they digitized them and broke down our voices into code not for recognizing our COMMANDS - but that means Siri could probably say something you never uttered in your voice.  The touchscreen could have been a fingerprint collector all along and the camera - well, I'm sure it is always on.**************Apple's litigation against Samsung is big news this week and if Samsung has been allowed to make money (it may be the only competitor who has something to show for its efforts) then it may have been in on it which means it can shut off the lights on their android devices and just sell big appliances because Apple's legal wins have huge implications.  It let competitors (usually foreign) copy (mostly for android - the name \"android\" doesn't really invite confidence thanks to Blade Runner and I, Robot) and if Apple is now suing Samsung successfully for copying - that means Apple didn't strike until there was something they could get back financially and it also means that Apple can damage you enough so that all your years of efforts will be for naught.  Those sunk costs - that's the poison.So I wonder - what if Apple sues in the home countries - the ban is for Samsung sold in the US.  What would Korean courts do about a lawsuit by Apple in Korea?  Does that make Sony Experias vulnerable in Japan?  What about Nokia now owned by Microsoft in Finland and in Italy one of Nokia's strongest markets?  What about the touchpad controller on the Playstation 4?Three days from the anniversary of the Pearl Harbor Attack, Comedy Central is reairing South Park episodes on 12/4/13 in this order:HumancentiPad - not only about the actual war crimes committed upon civilians and POWs by Mengele and Unit 731 but also about Apple's originality AND their dominant attitude towards their rightsfollowed byA Song of Ass and Fire which reiterates the claim made in Black Friday that the selling point of the Playstation 4 is the touchpad interface.Apple can pull the litigation trigger at ANY TIME and because they already won with Samsung, Sony's attorneys are not going to be able to drag out much of the issues of the lawsuit so that the Playstation 4 can sell for as many years as its predecessors.Holy Moses.", "Date": "November 20, 2013"}, {"Title": "Expensive but built cheap.", "Author": "Timothy M. Meadows", "ReviewID": "R2F4TBJC2715OP", "Overall": "1.0", "Content": "Get the older versions.. This one although light.. has a cheap feeling plastiky screen that feels like you are going to poke your finger through and sounds hollow as you do it. Buy A Microsoft Surface 2 or Pro and dont look back.. Much more productive device and more capable.  Research research research!", "Date": "January 5, 2014"}, {"Title": "Bad taste", "Author": "Jeffrey Funk", "ReviewID": "RXKVUH328JER7", "Overall": "1.0", "Content": "I was stupid and sent this as a gift to a woman that didn't work out ,but am sure she is enjoying it on my dime.", "Date": "March 17, 2014"}, {"Title": "Crap!", "Author": "iPad Air Expert", "ReviewID": "R299FHI9ANQC7R", "Overall": "1.0", "Content": "It won't even turn on. Why is that!  :( ahhhhhhhhh what is going on. And it also didn't come with a charger!", "Date": "November 6, 2013"}, {"Title": ".4 lbs lighter WOW what a pointless device!", "Author": "Deimos \".\"", "ReviewID": "R2JBOFZJ3AG6LC", "Overall": "1.0", "Content": "So you get the same OS, the same capabilities as every other Ipad or slightly \"faster\" and .4 of a pound lighter?  Who the hell in their right mind would buy this pointless device.  If you have any other more capable tablet or any other version of the apple store shackled limited Ipad you do not need this peiece of junk.  If I held this up facing toward you with a first gen Ipad, and an Ipad 2, you would not be able to tell the difference, you know why that is....becasue there is none. Ohhh the new version of IOS has slightly different looking icons....it's still the same locked, limited, crippled Iphone OS on a larger screen.  It's a giant, thinner iphone. A total waste of money, espessially when there are vastly better options available from Microsoft and Android that can outperform this toy any day of the week in features and power.", "Date": "December 9, 2013"}, {"Title": "Lol.", "Author": "Max \"Boston\"", "ReviewID": "R28WHNGRGRKWRU", "Overall": "1.0", "Content": "People are going crazy for an ipad coming out a tiny bit thinner, and a little bit more powerful (because we know that app really requires the mega power). Meanwhile a revolutionary, world changing product like Google Glass is getting very little buzz. Appletards really have their priorities straight, huh?", "Date": "November 4, 2013"}], "ProductInfo": {"Price": "$599.00", "Features": "Runs Apple iOS 7 operating system using the A7 processor chip, 64-bit architecture and M7 motion coprocessor.\nWi-Fi (802.11a/b/g/n) with MIMO;\n9.7 Retina display, 2048 x 1536 resolution and 5 MP iSight camera; supports 1080p HD video recording\nUp to 10 hours of battery life,has 32 GB storage capacity", "Name": "Apple iPad Air MD789LL/A (32 GB, Wi-Fi, White with Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51tiL831AuL._SY300_.jpg", "ProductID": "B00G2Y5YIG"}}