{"Reviews": [{"Author": "AK from Trinidad", "ReviewID": "R37Y3PXHF3VZ0A", "Overall": "5.0", "Content": "I've had this for about a month now and compared to high price big brand, if it's not the same it's probably better. Crisp clear screen, boots up fast, runs fast and very smooth, no regrets, very good.", "Title": "Excellent.", "Date": "May 28, 2014"}, {"Author": "airchamp \"ariel\"", "ReviewID": "R1S49HOF1JCG5F", "Overall": "5.0", "Content": "I couldn't believe I found a 10\" tablet the latest Android OS.for such a low price.Honestly, I still have not noticed the difference between the 4.2 and the Kit Kat OS, but tis tablet works really welland can basically do anything an ipad can d for much much less money.At $150 you can't beat this deal.", "Title": "Great deal", "Date": "May 27, 2014"}, {"Author": "doug Landry", "ReviewID": "R1V7X6EE9FH882", "Overall": "4.0", "Content": "I just recieved my andteck 10\"\" quad core tablet .very happy but I need to buy a andteck protective cover or after market cover? So if anyone can help me I would really appreciate it cheers. Doug☺", "Title": "happy with tablet and price!", "Date": "May 4, 2014"}, {"Author": "Alexander Wallgren", "ReviewID": "RHOWTHXX4X17M", "Overall": "1.0", "Content": "Not that I had a whole lot of expectations for what I paid. However, the battery dies within an hour of using it. Don't be fooled by the presentation of the tablet. Generally I needed it to recieve and send emails and not a whoile lot more. Yet another vendor who sells junk on Amazon.", "Title": "Not even close to advertised.", "Date": "April 7, 2014"}, {"Author": "Stacey", "ReviewID": "RXOIEFD37ULKC", "Overall": "1.0", "Content": "Okay, listen, I bought these after I bought my kids their tablets (At Walmart - 59$) for Christmas.  I spent $88.00 on these and the picture quality just isn't there.  You seem to have to struggle to see what is on the screen.  Just not a fan for everything this thing say it has, it really doesn't seem like it.", "Title": "NO SO MUCH", "Date": "January 11, 2014"}, {"Author": "Kathy Tatum", "ReviewID": "R2WXRRF4S1GF36", "Overall": "5.0", "Content": "for the price and having bluetooth-can send things straight to print or share photos without going to the computer and attaching cords.", "Title": "Great", "Date": "January 7, 2014"}, {"Author": "XRAXPRT", "ReviewID": "R1HRS9Y7QIQIRO", "Overall": "5.0", "Content": "Loads fast and the screen quality is excellent. Battery life is better than expected. I took notes at a meeting for over 2 hours and still had 68% battery life.", "Title": "Really good deal", "Date": "January 27, 2014"}, {"Author": "edward fichter", "ReviewID": "R3G1RCBPCM9USD", "Overall": "5.0", "Content": "I JUST GOT MY TABLET AND KEY BOARD, AND WAS  AMAZED AT HOW EVERY THING WAS PACKEDI WAS IMPRESSED WITHE PRODUCTS, EVERYTHING WORKS JUST FINE, THE ONLY THING I FINDWRONG IS THE INSTRUCTIONS BOOK TO DARK TO READ, OTHER THAN THAT MINOR PROBLEMEVERY THING IS JUST FINE....  ED FROM PA.", "Title": "GREAT PRODUCT, FOR THE PRICE.", "Date": "April 8, 2014"}, {"Author": "preston", "ReviewID": "R2FPGSE0X9P9ZY", "Overall": "3.0", "Content": "Nice image..hard to turn on..and this thing gets hotter than hell after 10 mins of use..so hot my daughter can't touch it..why is that...not to mention I bought 3.", "Title": "nice and hot", "Date": "March 24, 2014"}, {"Author": "Jennifer Adams Young", "ReviewID": "RGI74MIXA9A57", "Overall": "5.0", "Content": "I got this for my tech loving 5 year old to game with.  He is a calm child so I don't worry he will break it.  It works great for him.  He can run it all by himself, install his owns apps, and plugs it in to charge.  It works great for him.  It is affordable without giving up on quality.", "Title": "Great for loading apps and easy", "Date": "March 10, 2014"}, {"Author": "shirley d.", "ReviewID": "R5GE2CA2IEHJA", "Overall": "2.0", "Content": "it's ok, but i bought a samsung galaxy tab 3.  and i love it,i gave this tablet to my daughter she likes it", "Title": "tablet", "Date": "April 28, 2014"}, {"Author": "teeradech", "ReviewID": "R2L6OCBBLMFH1F", "Overall": "1.0", "Content": "mini HDMI prot its not work .How can i do? if u guys have saler mumber plz send it to me \"teeradech_new@hotmail.com\" thnk u so much", "Title": "help me plz", "Date": "April 23, 2014"}, {"Author": "R. Ken", "ReviewID": "R1IS9MMSBSPH1P", "Overall": "3.0", "Content": "The wireless range of the unit is limited.  The customer service has been a positive experience.  My primary reason for choosing the unit over several others was the warranty.  With that in mind, the fact that the company has responded to my request gives them a bump in the rating.", "Title": "Good but", "Date": "April 8, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R2G2XBA1PTWEBP", "Overall": "1.0", "Content": "The customer service rep was really nice but the charger broke after less then a week and the one that was sent to me was already bent so it's just a matter of time before it breaks also. I've had it less then a month and the screen is already cracked. Honestly I would spend the extra money and stick with kindles they are reliable and I've never had a problem with any of mine!", "Title": "buy a kindle fire instead!", "Date": "April 3, 2014"}, {"Author": "Pen Name", "ReviewID": "R2SW6KP09OVIY2", "Overall": "5.0", "Content": "Best tab for th price and customer service is great one of th best out thr... i wanted a tablet with hdmi to see movies on tv and is great hight def but th tablet screen is lik a 3 star", "Title": "TouchTab 9", "Date": "March 23, 2014"}, {"Author": "Blenthia King", "ReviewID": "R2GN3HT22F9OK0", "Overall": "4.0", "Content": "I would have given a 5 stars but the power cord in the box does not appear to be the right cord because it does not fit properly.  I have not contact the seller yet.  I have not really has time to work with tablet, so i am not rating the tablet yet..", "Title": "7 inch Tablet", "Date": "March 16, 2014"}, {"Author": "Joyce pepper", "ReviewID": "RWFJ498250SMZ", "Overall": "4.0", "Content": "Volume to low otherwise no other problem. I will call them  Grateful for the flash app  now able to view more favorite christian programs", "Title": "TOUCHTAB 7", "Date": "March 16, 2014"}, {"Author": "super dad", "ReviewID": "R3DZMTCQ0VVD4E", "Overall": "5.0", "Content": "It's a great product and good quality i Would Recommend It To Anyone It's great for a child and my  daughter love's it.", "Title": "Great item  don't pass it up I might buy another one for myself because my daughter won't let me touch it.", "Date": "March 6, 2014"}, {"Author": "Marsha Gibbs", "ReviewID": "R2V1F29875JWID", "Overall": "4.0", "Content": "This tablet is good for the price. It's a bit slow but that could be due to my wifi connection. The screen size is great. The touch screen is very sensitive, so I found myself being back on the main menu a lot. If you just want something to play games, read, etc.... then this is a great buy.", "Title": "Worth the price", "Date": "March 6, 2014"}, {"Author": "Ivan Johnson", "ReviewID": "RN43H9134RHMR", "Overall": "4.0", "Content": "This unit arrived promptly with no problems. My first Android tablet. So far so good. It should more than meets my needs and expectations.", "Title": "Touch Tab 7\" x2 Dual Core Google Android Andteck", "Date": "February 28, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00GR34IU2", "Features": null, "ImgURL": null, "Name": null}}