{"Reviews": [{"Author": "Gelmaniac", "ReviewID": "R2ATSBJVWFW5LJ", "Overall": "1.0", "Content": "The only reason to give it one star is because I was able to turn it on, get online and use the voice command. Browsing stalls, orientation is not recognized even after calibrating, the touch on screen is unresponsive, the camera is grainy and worst of all the AC adapter will not charge the device! Battery life was maybe 2 hours tops. The Android marketplace/1Market program pre-installed to get apps is horrible to use and Google Play wouldn't recognize my device. Don't buy this model, it is a waste of money.", "Title": "Terrible Device", "Date": "November 26, 2013"}, {"Author": "tamara", "ReviewID": "RRR3RECX85M5M", "Overall": "3.0", "Content": "I love it since I only play games,listen to music,an facebookon it, its a bit grainy but Hey its not an ipad,I am having trouble setting up the wifi it gives me a different code to use each time I try too, so I haven't used it much...can't find any help on the web for it so I gave three stars but will give 5 when i get a fix...any help is accepted tamhow1@gmail.com thanks. I'm HAPPY with it otherwise, no problem with the plugs an such", "Title": "its cool", "Date": "December 3, 2013"}, {"Author": "Rachel Batey", "ReviewID": "RZ039JM7NZ80G", "Overall": "1.0", "Content": "Immediately out of the box it is having problems.  The file manager is nonresponsive.  Programs closing spontaneously. Don't waste your money.", "Title": "Waste of money", "Date": "December 28, 2013"}, {"Author": "Dejadan", "ReviewID": "R37STXL8QJ3B25", "Overall": "4.0", "Content": "I got three of these for out grand children and I played with them a little bit, they seem to do what they say they do. I'm thinking of getting one for my wife to play some games, email and go on line since it seems fairly easy to work with. Mt only disappointment is that the user maual is in the tablet and not in paper form.", "Title": "email and go on line since it seems fairly easy to work with", "Date": "December 12, 2013"}, {"Author": "Paul", "ReviewID": "R2E8JEYGN5GLZQ", "Overall": "5.0", "Content": "Reason for this cheap unit is for kid, I use external sd memory for kid's movies, music, and of course some kids game.  My kid love it and  unit work great. I will say battery last about 3-4 hours when fully charge. will get another one just for game use and internet surfing.  Great unit for simple use.", "Title": "affordable great unit", "Date": "December 8, 2013"}, {"Author": "Frederic B. Hyman", "ReviewID": "R3SEU8V8ZDS88I", "Overall": "5.0", "Content": "I got mine as a Christmas present and so far I love it!  I to \"work it\" a bit to get all of the connections right as I had to run the wifi through my computer that didn't have wifi capability so I had to get an adapter and a router, but after I got it set up the rest has been very easy to use.  I can be on it for about 4 hours before I have to charge the battery, which I thought would be longer, but it is my first tablet and I didn't pay $300.00 for it!!!  You get what you pay for!  I paid for a cheaper version and so far I'm very happy!  I've been on Facebook, sent emails and set up some of the aps.  I accidentally deleted one ap store but I think I can easily restore it.  So for what I paid for a tablet and with all the aps it has, I have no complaints!  It was well worth it.  If you are a Grandmom, like me, it is a great way to keep up with the grandchildren!  If you are thinking of getting a tablet for your child, why not get this!  It has parental controls too!  I would definately recommend this to anyone beginning the Android world!", "Title": "Love it!", "Date": "January 6, 2014"}, {"Author": "Liz Wannop", "ReviewID": "R7XA3GBKFC8RG", "Overall": "1.0", "Content": "A very poor product! Internet connection is very poor, needs recharging after 2 hours of use.  The touch screen works intermittently at best.  The charger worked for the initial charge but wouldn't recharge a second time, I contacted the company they recommended I purchase a new charger locally as theirs were on back order.  Obviously even their chargers are defective!", "Title": "AGGRAVATING PRODUCT", "Date": "February 25, 2014"}, {"Author": "Clairmonte", "ReviewID": "RZSVSYWXC3OL", "Overall": "4.0", "Content": "Good for the price, and it works excellent....would recommend this. Had a little problems feting use to, but it all worked out ok in the end.", "Title": "Good For The Price", "Date": "January 23, 2014"}, {"Author": "Miguel S.", "ReviewID": "R1CBL7ZLEBKADK", "Overall": "4.0", "Content": "Very good tablet until now has worked perfectly thought it was a larger but very comfortable cpoco ye responsible seller", "Title": "Very good", "Date": "February 9, 2014"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B00GOKTKVA", "Features": "Android 4.2.2 Jelly Bean Operating System\nLED Backlight 800*480 Display, Support External 3G port\nMali 400 3D GPU, 4 Direction Gravity sensing, Support Multiple Language\nA13 Cortex A8 1GHz-1.5Ghz, FCC, UL , RoHS compliance, RAM DDR3 512MB\n1 year limited warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/512DxzgxcJL._SX300_.jpg", "Name": "New TravelTek 7\" Inch Tablet Android Google 4.2.2 Jelly Bean 4GB DDRIII External 3G Port MicroSD Flash USB Port 1GHz"}}