{"Reviews": [{"Title": "Excellent 7\" Tablet for all round purpose.", "Author": "rpv", "ReviewID": "R1W839PSVMCKRL", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2NUKNM2JWOC8QembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2NUKNM2JWOC8Qrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2NUKNM2JWOC8QchiDiv\").innerHTML = document.getElementById(\"cv_mo2NUKNM2JWOC8QhiddenPre\").innerHTML;\n};\ncv_mo2NUKNM2JWOC8Qrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2NUKNM2JWOC8Qso;\t   \n\n\nfunction cv_mo2NUKNM2JWOC8QloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2NUKNM2JWOC8Qso = new SWFObject(swfLocation, \"cv_mo2NUKNM2JWOC8QAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2NUKNM2JWOC8Qso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2NUKNM2JWOC8Qso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2NUKNM2JWOC8Qso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2NUKNM2JWOC8Qso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2NUKNM2JWOC8Qso.setAttribute(\"height\", swfHeight);\n          cv_mo2NUKNM2JWOC8Qso.setAttribute(\"width\", swfWidth);\n          cv_mo2NUKNM2JWOC8Qso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2NUKNM2JWOC8Qso.write(\"cv_mo2NUKNM2JWOC8Qflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2NUKNM2JWOC8Q', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2NUKNM2JWOC8Q';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2NUKNM2JWOC8Q', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2NUKNM2JWOC8QloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2NUKNM2JWOC8Q\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3DU990BRJZDYM\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3DU990BRJZDYM\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1W839PSVMCKRL\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3DU990BRJZDYM/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2NUKNM2JWOC8Qduration')) {\n      document.getElementById('cv_mo2NUKNM2JWOC8Qduration').style.display='none';\n    }\n    cv_mo2NUKNM2JWOC8QloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2NUKNM2JWOC8QloadSwf(movieID, playerVersion) {\n   return _cv_mo2NUKNM2JWOC8QloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2NUKNM2JWOC8QnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2NUKNM2JWOC8Q', 0, h);\n}\n\nfunction cv_mo2NUKNM2JWOC8QresetPlayer(w,h,bw,cc) {\n  cv_mo2NUKNM2JWOC8QnewHeight(h);\n\n  cv_mo2NUKNM2JWOC8Qso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2NUKNM2JWOC8Qso.addVariable(\"cacheCode\", cc);\n  cv_mo2NUKNM2JWOC8Qso.setAttribute(\"height\", h);\n  cv_mo2NUKNM2JWOC8Qso.setAttribute(\"width\", w);\n  cv_mo2NUKNM2JWOC8Qso.write(\"cv_mo2NUKNM2JWOC8Qflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2NUKNM2JWOC8QRollOverImg = new Image();\ncv_mo2NUKNM2JWOC8QRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81pLQqFI%2BcS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2NUKNM2JWOC8Qpreplay = document.getElementById('cv_mo2NUKNM2JWOC8QpreplayImageId');\nif (cv_mo2NUKNM2JWOC8Qpreplay) {\n  cv_mo2NUKNM2JWOC8Qpreplay.onmouseover = function() {\n    cv_mo2NUKNM2JWOC8Qpreplay.src = \"http://ecx.images-amazon.com/images/I/81pLQqFI%2BcS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2NUKNM2JWOC8Qpreplay.onmouseout = function() {\n    cv_mo2NUKNM2JWOC8Qpreplay.src = \"http://ecx.images-amazon.com/images/I/81pLQqFI%2BcS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2NUKNM2JWOC8Qpreplay.parentNode;\n\n  var cv_mo2NUKNM2JWOC8QcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2NUKNM2JWOC8QcurrentClick) {\n      return cv_mo2NUKNM2JWOC8QcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:04 MinsI reviewed black version of this as I purchased it. Color is only difference. ProntoTec Q8 7 inch Dual Core Tablet is a very good value in price per performance. It has 4 GB SDRAM. After installing bunch of applications, I still had available 2 GB. This runs Android 4.2.2. Android. I have been using for 3 days with no issues. The performance of this box is great and I have used browser/email/games like Temple run as well as puzzle games. I will go into the specifications and review based on my user experience. You can see in my video review the game of Temple Run Oz.Most of tablets have ARM based processors. This makes sure all of the Apps in Google Play ecosystem are available. This has Cortex A8 Dual Core 1.2 GHz. If you look at my video review, I have screenshots showing the CPU speed and other kernel details. The screen is 800 x 480 Pixels and has a RAM of 512MB. This supports a wireless and cellular with Wi-Fi (802.11 BGN) and Support for 3G Dongles. Settings page has a IMEI number already assigned. Tablet has 2 cameras - Front 0.3M/Rear 2M. There is a built-in 2800mAh Rechargeable Lithium Battery. Battery came for a good 5 hours with moderate usage. Battery usage really depends on how heavy you use the system. Overnight it drained very less. Mobile Networking was on by default. I switched off as I was using only Wi-Fi mode. I suggest you go to Settings and tweak things which are not required. Developer Mode was enabled by default. I turned it off. The capacitive touch screen was really good, some occasions I had to press little harder and at right locations, but pinch-zoom, highlight, Copy-Paste all worked very well.It is great the tablet has HDMI interface along with micro USB Port, 3.5-mm stereo Headphone Jack, built-in speaker, microphone, micro SD card slot and a DC Input Jack. Note that for powering through wall adapter you need to use the provided DC input jack. I was surprised with the HDMI port inclusion and I can connect this to a HDMI capable monitor or any HDTV. Speaker was loud enough. IN a room, once I keep the tablet in a stand it was good. Speaker is on the backside, so you don't want to lie this down on back as it will hamper the audio coming out. This is a design that I hope Android tablets change in coming months/years.Android tablets are really customizable to your heart's content. It is here where ProntoTec shines. Using a native Android 4.2.2, they have achieved something at a low cost. This can have a very wide reaching audience. In many countries, where affordability is key, having a tablet like this with Wi-Fi is a big boon. Imagine having entire Wikipedia at your fingertips for a child. I tried few educational applications on this. I consider this as a big hit with educators than gamers.I tried Google Voice Search and asked \"what is capital of United States\". The voice recognition part was great and it was able to recognize and dictate the answer. I also tried Wolfram Alpha and asked bunch of questions. E.g., what is world population, what is population of China etc? The microphone picked up correctly and answered through Wolfram Alpha. Apps like Calculator, Gmail performed flawlessly.I watched multiple video through few applications. Obvious first choice was YouTube. Was able to search and watch videos. I used TwIT.TV app and watched some segments of a podcast (video streaming through wifi). Again smooth playback. Handholding is really easy given the weight of it. It was a colorful blue; no heat observed handholding the tablet. It is plastic, and buttons are made of plastic. For a kid, this is perfect also though the feature set is equally appealing to an adult. I was so enamored with low cost computers in late 90s and it seems I am reliving them with tablet. If you want to listen to podcasts/watch video then this is perfect. Just keep it in a stand and connect to power. See my video review to get an idea of what I am referring to.For a computer geek, it is a challenge to design something with minimal resources - screen resolution, RAM, storage, chipset. ProntoTec has designed a tablet with budget conscious customer in mind. Out of the box, it worked to my satisfaction given the specification and price. Once powered on, it directly came to a working condition. No need to setup account prior to using. I signed with wifi, the wifi router was in one bedroom. I configured in another room separated by two rooms. There was no issue with wifi signal. Once connected, I created a Google account as well. I generated a Application Specific password as I had 2 factor authentication. Once signed on, I updated applications like YouTube, Google Keyboard etc. I also downloaded few applications like TwitT.TV, Tetris from EA, etc. I downloaded Chrome and browsed few websites. Listened to Audio / Watched Video. Out of the box battery needed a full charge. Initially without charge, I did a video stream and wanted to see how device shutdown. Sure enough it shut down as battery drained. Powered on after charging and everything was fine.I am impressed enough at the engineering for the price/value/budget it delivers. Cortex-A8 Processor is an ARM Cortex(tm)-A8 processor, based on the ARMv7 architecture, has the ability to scale in speed from 600MHz to greater than 1GHz. The Cortex-A8 processor can meet the requirements for power-optimized mobile devices needing operation in less than 300mW; and performance-optimized consumer applications requiring 2000 Dhrystone MIPS. This is from ARM specification. ProntoTec has pulled in many off the shelf components and assembled at a terrific value. I was particularly interested how it performs to streaming video. That is the golden test and it performed beautifully!", "Date": "April 1, 2014"}, {"Title": "Affordable!!", "Author": "KPAk", "ReviewID": "R3HYOP944C6BZJ", "Overall": "5.0", "Content": "I bought seven of these based on the ratings. I feel this product should have a higher rating for these reasons:FIRST: PRICE is affordable. You cant walk into best buy or any store and buy a tablet for this price. You just can't.2nd: I bought these products as gifts to some friends who are just beginning to learn the tablet world and what apps are. This is great for the basic internet use and games.Third: I would recommend this product to anyone who just wants a tablet to surf the net, facebook, skype, watch netflix.. I mean thats what we do on our apple products anyways so why pay sooooo much when you can get the same thing for a cheaper price??", "Date": "April 25, 2014"}, {"Title": "i love it", "Author": "Mechele", "ReviewID": "R3EKJ942HCDD3D", "Overall": "5.0", "Content": "it's great small cute i love the white color and the wallpapers are pretty nice too.. i would recommend to a person who just wants music surfing the net and or research. .. oh and checking your emails and social networks.", "Date": "April 2, 2014"}, {"Title": "First tablet I've got and love it!", "Author": "Racheal", "ReviewID": "R34M68DRACQG3Y", "Overall": "5.0", "Content": "This tablet has an HDMI slot which mostly determined why I bought it, and that is really awesome. It was at an amazing price of $50, because of a sale, and I think that this tablet is worth the money. I had never had a 7 inch tablet so I was surprised at how small it was. The good thing is that it is not too bulky. I would absolutely recommend anyone to buy this tablet. I didn't see it until one final search on Amazon. I was just thinking I should have seen it earlier. Totally worth the money!", "Date": "May 9, 2014"}, {"Title": "Perfect for the beginner", "Author": "rowdy", "ReviewID": "R1OVMWY8ZY0KEJ", "Overall": "5.0", "Content": "I chose this tablet because of the price. I bought two of them for my younger children just as an introduction tablet. So far after a month of use the tablets are performing very well. The kids use them for gaming and so far have not shown any speed issues with the games they play.5 stars for the tabletThe seller was phenomenal to deal with. After ordering the product I received an email confirmation from amazon. Then I received an email from the seller telling me the tablet was on back order. This disappointed me because we were hoping to have the tablets before a planned vacation. This would help keep the kids occupied for the long road trip. In that email they described how the tablet was on back order but that they would send an upgraded version instead. Who does that? These guys sent the upgraded tablet and we received it just in time.Here is what the email said...\"Dear Customer,Thank you very much for your business.Just confirmed that the item you purchased was out of stock now,and we have arranged the HD version of this item(same color)to you as our sincerity,the HD version has 1024*600 display and 6GB storage which is more valuable than the one you ordered,also you have no need to wait too long for your package.Normally our package should be delivered within 9-12 business days,and your package would reach you within 3-5 business days.Hope that you would be satisfied with our service and product.Wish you all the best!Monica\"5 Stars for the sellerWould definitely do business with them again and feel very confident in my purchases.", "Date": "May 27, 2014"}, {"Title": "Excellent tablet", "Author": "Mohammed", "ReviewID": "REGRSRTRG2C2T", "Overall": "5.0", "Content": "I would recommend this tablet, it worth the money payed for it, My Kids are enjoying playing games and watching you tube.", "Date": "May 19, 2014"}, {"Title": "for kiddos!", "Author": "Rhonda L. Redelsperger", "ReviewID": "RU55A95MHMBOO", "Overall": "5.0", "Content": "I bought two of these and loaded them up with books (read to me). They love it! Not super fast but they don't seem to mind.", "Date": "May 13, 2014"}, {"Title": "Very nice tablet for the price! (If I had paid $200 for it, it wouldn't get 5 stars.)", "Author": "Marshall Jessee", "ReviewID": "R30CW2TDZ779I0", "Overall": "5.0", "Content": "When I ordered this product, considering the price of $50, I wasn't expecting much. I was surprised at how well it works, and does everything I need. No, it isn't an Ipad, but it's $50!!! For getting on Facebook, surfing the internet, and looking at my photos, it works fine. While the screen is not HD, I can plug my HDTV into the tablet's HDMI port and see my photos in beautiful perfect color. For wandering around the house, it works well with my computers WIFI. The touch screen works better that my wife's $150 tablet. For the price, I would buy another one just to see my photos and videos on my 55\" HDTV. And maybe another one to keep in the car to use with my cable company's WIFI hotspots around town.", "Date": "May 27, 2014"}, {"Title": "perfect bday gift!", "Author": "Lehua Barajas", "ReviewID": "RA2P5SUUJ3YYC", "Overall": "5.0", "Content": "My daughter loved having this as a bday gift she was soo excited to get one & now she \"finally\" has her own & can stop using mine! LoL  So far it works great, has alot of great features, even features that my tablet doesnt have, like one adobe flash player (go figure!) & my tablet is a samsung galaxy, so needless to say my daughter loves her tablet & She can download all the games she wants! :)", "Date": "May 24, 2014"}, {"Title": "Legit", "Author": "Brandon Hatchell", "ReviewID": "RS44N0F9AWLRQ", "Overall": "4.0", "Content": "This tablet was exaclty what i expected. I got what i paid for and a little more. It was 50 Bucks. That is how much you spend on a dinner when you go out with somone. So I spent that on a little tablet that i can use when i dont want to use my smart phone. This thing is not a IPAD, have great graphics, or blow your mind but it has everything you need. It comes with a USB cord so you can charge it on your computer. It can charge by pluging in the way. Its very nice looking. The graphics are kinda generic but wouldnt be bad for a child or something to just get all scratched up. Im deployed and needed something to play on while laying in bed. I will save the big bucks when i want something to take care of. It came in Super Fast. so i didnt have to wait. The screen had a few smudges and scuff marks but nothing to get upset about. I would of paid 75 bucks for it. Overall i was happy with my buy. The only way i would of been upset is if i paid more than 150 for it.", "Date": "May 23, 2014"}, {"Title": "Good for a sub $100 7\" Tablet", "Author": "Bill Clark", "ReviewID": "R3KABAWP5YKA6A", "Overall": "3.0", "Content": "Still a bit sluggish, but for about $50 I cannot complain.  It was a replacement for a kid so it'll do.", "Date": "May 6, 2014"}, {"Title": "Great buy!", "Author": "Paulette C.", "ReviewID": "R2YZI5QX0Z47DB", "Overall": "5.0", "Content": "I got this tablet for my granddaughter who is 6 years old.  Her parents told me it works perfectly.  Great buy for the money.", "Date": "April 30, 2014"}, {"Title": "the screen is horrible. but its a 50", "Author": "adam a query", "ReviewID": "R2GAUZW0PQOBTQ", "Overall": "2.0", "Content": "i watched the video review and it seemed strange she used a stylus but now i see why. the screen is not accurate to the touch. i have had 6 tablets in the 100.00 range that i have set for other people and this one is just barely usable.  the entire right column is a dead zone for touch. keystrokes are missed very often.the screen is horrible. but its a 50.00 tablet.this is junk.  HOWEVER - this does have HDMI out so it can function to push netflix, hulu, youtube whatever to a tv. In that sense, it is a great thing.If you need very very basic needs and need to be bottom dollar, maybe.  I suggest getting an app from the google play store to increase sensivity of the screen - it helped some.", "Date": "May 8, 2014"}, {"Title": "This is a great tablet for the price.", "Author": "bobtec", "ReviewID": "R2ZTXSTE9ELG7G", "Overall": "5.0", "Content": "I'm actually giving this a 4.5 stars.For the money, you can't go wrong with this. It's Jelly Bean 4.1 OS by Google, and that means it's streaming fast. The upside is that it's like using a smart phone without the phone. Plenty of free games available. Adapts to big TV well enough. Easy to set settings. The only thing that made this 4.5 rating is that the instructions bite (be prepared to break out a magnify glass). Keep in mind that TFT card means SD micro card which works well with sdhc cards (haven't tried sdxc cards yet, or attached to tv yet, but will update if something goes wrong). If it works well enough, I'll get one to keep all my sheet music on. Haven't Checked out the Bluetooth compatibility yet, but will update if anything is wrong. Since Microsoft is attempting to sabotage everyone by not having XP support anymore, this may be the way to go. If you're techie challenged, have a geek friend set it up for you.", "Date": "May 2, 2014"}, {"Title": "For kids and big kids too!", "Author": "Brittany", "ReviewID": "R2U5JCLQD4E6AR", "Overall": "5.0", "Content": "I bought this item for my 3 year old to play games on it.  The item comes with a pre-loaded game and video and is currently holding ten games on the original storage capacity.", "Date": "June 9, 2014"}, {"Title": "Great for my kids", "Author": "N. Peterson", "ReviewID": "R112RZFFZQ1X1O", "Overall": "5.0", "Content": "I was a little nervous ordering this having read the reviews. I wanted a inexpensive tablet for my kids (9&7) to play games on and I chose this tablet because it seemed looking at some other reviews that the seller would rectify any problems if we had any. The tablet was delivered on time and it is working perfectly. It takes a little time to download games and the touch screen probably isn't the best but for $46 - excellent. We are considering getting another one.", "Date": "June 9, 2014"}, {"Title": "Great Little Tablet For The Price", "Author": "Chambo", "ReviewID": "R1EOIF1SRD1HNV", "Overall": "4.0", "Content": "Works as well as any other tablet.  Considering the price I really couldn't go wrong.  Seems to be peppy enough despite the 512MB RAM.  Probably not for serious games or photography but good enough to leave laying around and not worry about.", "Date": "June 8, 2014"}, {"Title": "Great price point.", "Author": "Scott Soulages", "ReviewID": "R1N5V6TI23RCLC", "Overall": "4.0", "Content": "First of all, it's only 50 bucks, so I wasn't expecting iPad quality. But it's a lot of bang for $50. We bought each of the kids one so they'd have their own device for the long road trip. I bought one to try it out first then bought two more along with a neoprene sleeve and 8 gb memory each.Pros:* Full android OS allows supports tons of apps.* memory expansion slot- this was huge for loading movies.* wifiCons* low contrast display (but still good for $50)* plastic case feels cheap* sluggish response at timesI'll likely have an update after the road trip.", "Date": "June 8, 2014"}, {"Title": "Great tablet for its price.", "Author": "Mona", "ReviewID": "RUK3I3YHX50CN", "Overall": "4.0", "Content": "Tablet is easy to use, but the camera is NOT good at all. Both front and back are weirdly warped. Also, I feel like the processor goes slow sometimes even with wifi connected. It lags when swiping screens and changing apps. I've been using it for games, and social media sites, and it's working very well. If you like a lot of apps, I would suggest adding more memory or getting a tablet with more than 4GB. Other then that, I would recommend this tablet.", "Date": "June 7, 2014"}, {"Title": "Great for the price!", "Author": "Sean", "ReviewID": "RV1YMQMP5PJG2", "Overall": "5.0", "Content": "I bought this because i just wanted a tablet to dink around with around the house and in bed and was tired of using my iPhone for everything. If your someone who is wanting a really nice tablet, I'd spend the $200, but if you want something to have fun with, this is a great buy! The cameras arnt the best, but thats not why i bought this so all in all I love it.", "Date": "June 7, 2014"}, {"Title": "Simply Love it and the price!", "Author": "Debps", "ReviewID": "R2LUYXIJK0N2HH", "Overall": "5.0", "Content": "Bought this for my 6 year old grandson.He loves it ...he can download games, netflex to watch movies, skype to talk to family, play music, and take pictures! For the price it is perfect for a child....I also purchased the Poetic Slimbook Case for Coby MID7046 7-Inch to protect the tablet and it was a perfect fit. Hes happy so I'm happy...Oh and it was delivered to my door within 2 days!", "Date": "June 3, 2014"}, {"Title": "Excellent!", "Author": "Angie Angel", "ReviewID": "R3B0E4MYZ27XY4", "Overall": "4.0", "Content": "I have no regret buying this tablet;) Why four stars and not five is because the USB cord doesn't work and after three days the changer is over heating, Apart from that it's Perfect :D i looove it so much, .oh it arrived on time in perfect condition.Thank you !", "Date": "June 1, 2014"}, {"Title": "Horrible", "Author": "Jennifer \"Jennifer\"", "ReviewID": "R4FFK2BR74PCU", "Overall": "1.0", "Content": "This device is horrible! I haven't even had it 24 hours and I can barely use it. The touch screen hardly works and the battery will not stay charged.  I took it off the charger after it being on all night, and after four hours of not even using it the whole thing was dead.  Will be promptly returning this for my 50 dollars back", "Date": "May 22, 2014"}, {"Title": "Returned after 24 hours", "Author": "Davalf", "ReviewID": "R1NYZI720XMHE6", "Overall": "1.0", "Content": "I bought this tablet for my 6 year old to mess around with.  He was paying for half (trying to teach him he has to earn what he gets), he held up his end of the bargain so I did the same.  The reviews were pretty good and the price was in budget.  I ordered it and it shipped quickly.When it arrived, the screen had minor scratches like it had been used previously.  I thought no big deal, this is for my 6 year old, it will be treated pretty rough as it is.I powered it on and everything was working fine.  He was so excited.  I downloaded a game off of the play store and it downloaded quickly.  He was able to use the game with only minor issues.  Still, I thought this was for my six year old so the little bugs didn't matter.The screen resolution was definitely sub par.  I compare to the screen of a flip phone from lets say, 5 years ago.  The camera was just as bad.  Not a big deal, for a 6 year old.Me, being the big kid that I am, had to try his game.  I was instantly frustrated with the touch screen.  You had to press pretty hard to get it to register your finger.  And, about 1/4\" to 1/2\" of the screen all around the border, would take a dozen or so touches for it to register.  Once again a minor detail.Then, my son brought the tablet to me saying it wasn't working.  I took a look at it and the screen had a mind of its own.  Constantly switching between apps, the home screen, inadvertent clicks into the settings.  So I attempted to restart it.  This was a chore because the screen was going crazy.  The shutdown screen would come up but I wasn't fast enough to click restart before it would switch to another screen.  It took several ninja like attempts to get it to restart.  Finally! Problem solved right?  Nope, it restarted with the same tantrum it had before.  I looked in the box for a technical support number or website, nothing.  So, I contacted amazon and got a return label.As soon as we get our money back I will try again.  Pay a little more money to hopefully get a little more quality.Do not buy, this was our first tablet and I am disappointed.", "Date": "May 21, 2014"}, {"Title": "You get what you pay for", "Author": "Anonymous", "ReviewID": "R39NP4MG9SDCIJ", "Overall": "1.0", "Content": "I wouldn't advise anyone to purchase this product. Out of the box, the tablet had many scratches on the screen. When I first powered the device on I assumed the brightness was on a low setting. However, that was not the case, I looked in the settings to find that the brightness was on the highest setting. I bought the tablet for my little sister, for the purpose of watching YouTube video's. I waited over a minute for a video to load, and soon received a message stating their was an issue with Android, and the device shut down. The touchscreen is not capacitive, rather it's resistive touch, meaning it is not like most devices today such as an Ipad, Samsung Galaxy Tab. Capacitive touchscreens rely on the electrical charge from the human body to detect where you touch, which gives accurate and fluid responses. This device has a resistive touchscreen, meaning it relies on force, and will eventually need to be pressed harder and harder in order for it to work, which leads to unreliable feedback, and the screen can ultimately stop working after some time. This product is way outdated and not even worth fifty dollars!", "Date": "May 19, 2014"}, {"Title": "Returned", "Author": "jfer76", "ReviewID": "R2AMSL4NXGQ6JV", "Overall": "1.0", "Content": "The touch screen is barely responsive at times.  The unit freezes up or sometimes won't turn on.  We have calibrated the screen numerous times only to have it STILL not line up when you try to press a button or close a tab in the browser.  We returned it. I guess in this case you get what you pay for.", "Date": "June 4, 2014"}, {"Title": "For patient and clever people", "Author": "S. macgregor", "ReviewID": "R2G38ZVLEA1W31", "Overall": "2.0", "Content": "This wasn't at all user friendly, and very slow.  The power button didn't always work even though I'd just purchased it. Instead of feeling like\" yay, I saved a bunch of money!\", I felt annoyed. That's when I decided just to spend the money and get something which wouldn't annoy me, and which wouldn't frustrate my child. I ended up returning this for a Kindle Fire HD, and just sighed with relief the moment I turned that thing on.", "Date": "May 21, 2014"}, {"Title": "bought these for gifts", "Author": "mary stockton", "ReviewID": "R3H5JAOE5MBTY9", "Overall": "5.0", "Content": "my grandkids live TV is going to be a fan and cool so you'll like to be able to do things that you need to do with it", "Date": "April 6, 2014"}, {"Title": "Mic don't work correctly", "Author": "CHRISTIANA W.", "ReviewID": "R3G879OAH1HIPM", "Overall": "1.0", "Content": "My mic on my tabet don't work n I can't record or voice look up on it or video chat because people can't hear me. Other then that its ok.", "Date": "April 7, 2014"}], "ProductInfo": {"Price": "$109.98", "Features": "CPU: Cortex A8 Dual Core 1.2Ghz\n7-Inch Capacitive 16:9 / 5-Point Touch Screen, TFT 800 x 480 Pixels\n512M DDR3 RAM / 4G ROM (3G Available) / Support TF Card Expansion up to 32G\nAndroid 4.2.2 OS, Google Play Store Pre-Load, Support SKYPE, YouTube, Facebook and more!\nUS Worry-Free Warranty", "Name": "ProntoTec 7\" Android 4.2 Tablet PC, Cortex A8 1.2 Ghz Dual Core Processor,512MB / 4GB,Dual Camera,HDMI,G-Sensor (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/51oPGZ0nQtL._SY300_.jpg", "ProductID": "B00GMDCCRS"}}