{"Reviews": [{"Title": "Beautifully built, incredibly fast, the best tablet computer ever!", "Author": "John Ryan", "ReviewID": "R3CXMI18TV70OE", "Overall": "5.0", "Content": "The new iPad Air is Apple's latest, slimmest, lightest release of their hand-held computer.  Oddly enough, it's so beautifully easy to use (my one year old daughter loves playing with it), it's almost doesn't feel like a computer at all.A word of warning - this review is written for people who've never owned an iPad before - and are wondering what all the fuss is about.  If you're thinking of upgrading skip down to the \"What's great about the Air\" section below, or just buy it - it's amazing.Just what's all the fuss about?--------------------------------------I used to own a laptop for work, and (very occasionally), it'd sit on my lap on the sofa, and I'd use it for pleasure (eMail, watching films or playing the odd game).  Then I bought my first iPad, and the laptop became redundant, a boring \"work device\".  Hard to explain, but the fact the iPad is so small and light, and you navigate around with your finger by pointing and gently swiping the screen makes the whole experience a lot easier - a lot more fun.Even my most \"Luddite\" of friends have been won over.It's incredibly simple and easy to use (it only has one main button), and everyone from my one year old daughter to my 85 year old dad have taken to without problems.  It's size and shape also support using it like a book (literally to read a book or web page), but you can also watch TV and films.Personally I'm also paranoid about my password getting \"hacked\", and someone running up a huge Amazon bill or buying stuff with my credit card on eBay.  Well one of the benefits of the iPad (and iPhone) is it's \"almost impossible\" to get a virus - one of the most common ways to get hacked.  This doesn't mean you shouldn't use strong passwords, (both Sony and Adobe got hacked), but it's reassuring to leave the Windows world behind.Finally, I love the way these devices (iPad, iPhone, Apple TV, Apple Mac), increasingly work together.  The fact you can start a Pages document on your Mac and edit it on your iPad, or take photos on the iPhone, and in seconds see them on the iPad or Mac and display them on the Apple TV.The thing is, \"it just works\".What would you use if for?----------------------------------* Shopping online.  Obviously - you could be reading a review on Amazon about the iPad Air!* Reading News stories.  As you can hold it like a book it's great to read the news online (my wife loves the UK Daily Mail newspaper Online - personally I prefer a web digest from free app Zite).* Reading Books.  It's great for reading books from Amazon Kindle or Apple Books with the benefit of 1,000s of online book reviews* Navigating web pages.  Instead of clicking with a mouse, you gently swipe your fingers on screen to scroll around* Watching Films.  I use it to watch Netflix online videos (with an Apple TV you can send stuff to the telly)* Reading and replying to mail.  I use \"mailbox\" a great free app to read and reply to mails, but there's a free one included* Showing and organising photos.  Any photos on an iPhone are automatically available within minutes in \"the cloud\"* Playing games.  From fun puzzle games like \"Cut the Rope\" to fully fledged first person shooters.* Listening to the Radio.  With \"Tune in Radio\" you can listen to thousands of radio stations world-wide.  My personal favourite is London UK based XFM - alternative rock* Listening to music.  I stream mine to an Apple TV, but you can also buy portable speakers or just plug into the AUX socket* The list goes on and on.Which model should I buy?----------------------------------I can't comment about Android tablets (apart from the Google Nexus which is well regarded), but in terms of the Apple tablet line-up in order of cost:-1. Avoid the Apple iPad 2, it's a relatively old model, under-powered and with a lower resolution screen.  If you really want an Apple but don't want to spend the cash, buy a 16g WIFI 3rd or 4th generation iPad from eBay.  Avoid this one.2. iPad mini is a lovely tablet.  A 7.9 inch screen and astonishingly light and remarkably thin - it feels like a light-weight book.3. iPad mini with retina screen. Again 7.9 inch screen, but with the blazingly fast A7 chip and a \"retina\" (high definition) screen.  Worth the upgrade if you can afford it.4. iPad Air.  Much larger screen size (9.7 inches - doesn't sound much but it makes a huge difference).  Same fast (A7) chip as the Mini with Retina - the latest and fastest iPad available.Clearly (from my viewpoint) there's only really three options.  The iPad Mini, the Mini with retina screen and Air.What are the Optional add-ons?-----------------------------------------Well, assuming you've dropped by the Apple Store (which I would highly recommend - fantastic service), and handled the iPad Mini (with/without retina screen), and iPad Air then your options are around memory size and cellular option.Memory:  Once bought, you can't add memory (space for apps, films, books etc).  However, the basic price goes up a huge amount (+$100 for the 16g to 32g iPad Air).  But, having owned a 16g and then a 32g iPad - I can safely recommend the 16g unless you really want to store a huge amount of videos and downloads.  Only you can decide, and if you're lucky enough that money is no object then splash out.  Otherwise, 16g should be fine for most people.Celular:  Allows you to connect to the internet while you're out and about.  This will add an additional +$100 to the price and means you can slip in a mobile phone SIM card.  This means (for an additional $5-10 a month extra), you can access the internet on the move.  Alternatively, you can opt for the WIFI option, and use it at home or at at \"hot spot\" (eg. Starbucks, most rail stations and hotels etc).Personally I'd buy (and indeed did), the 16Gb iPad Air WIFI.Do I need anything else?-------------------------------Most people (me included) buy a cover.  Apple (and now several copy-cats) make a \"smart-cover\" which automatically shuts down the iPad when you close it, and switches it on when you open it.  There's versions which cover the back, or just the screen.  Apple charge from $35 to $65 for their (admittedly) high quality fabric or leather covers, but there's many available from $10.  Be aware, you do get what you pay for.Personally,I think it's a pity to cover the beautiful aluminium industrial design of the iPad with a cover - but if you've spent hundreds of pounds you'll want to protect it from scrapes and bangs.I also invested in a keyboard ($20-$70), as I tend to write a lot of mails and documents (remember it comes with a word processor).  I'd recommend the ogitech Ultra Thin iPad Air Case with Keyboard - Space Grey and the ZAGG Keys iPad Air Case Folio with Backlit Keyboard although these are strictly optional unless you want to use your iPad as a proper laptop.Finally, if you have another Apple device (eg. an iPhone, Apple TV or Mac) you'll find these work together beautifully.  For example, you can create a reminder on your iPad and it appears on your iPhone.  Equally, photos taken on your iPhone appear on your iPad, and you can stream music or videos from iPad, iPhone or Mac to an Apple TV.Some people think this \"locks you in\" - but it's your choice.How should I set it up?--------------------------Well, if you already own an iPad or iPhone it's incredibly easy.  Just log in with your existing iTunes and iCloud accounts, and select the option to either set this up as a new iPad or restore from backup.If you've never owned an iPad before - read on to hear about how to set up an iTunes and iCloud account - it certainly confused me the first time I used them.+ iTunes account - is how you buy your music, Apps or films from Apple.  You register your credit card with them, and protect the account with a secure password+ iCloud account - is used to identify you as an individual.  This gives you 5Gb of backup space (your iPad will be automatically backed up when you charge it), and also means your iPad will work together with your iPhone.How to set them  up:1) Create a SINGLE iTunes account for your immediate family and children.  Then when you buy an App, it's immediately available (for free) to all the family members.  Maybe once the children reach 15-16 they'll want their own account (as otherwise they'll end up spending your hard earned cash on your credit card to buy music you don't want).  Until then - it's a great way to share the Apps.2)  Create YOUR OWN INDIVIDUAL iCloud account for person.  That means if you buy an iPhone you can share data (eg. reminders, notes or calendar events) across both devices.  If you're partner (and maybe even children) have their own iCloud account they also have 5Gb of space, and can keep their own notes and documents private.Easy when you know how.What's great about the Air?-----------------------------------* Lighter (30%) and thinner than the previous version (469g from 650g)* Even faster A7 chip.  Blazingly fast!* Improved sound (compared to the iPad 4)* Software including  + iMovie - edit and publish home made movies  + Numbers - Fully functional Excel for the iPad  + Pages - Word processor  + GarageBand - Play a piano or a drum kit  + iPhoto - Edit and organise your photosWhat's not so great?--------------------------* The change in physical size means you'll need a new keyboard or replacement cover if you're upgrading* Pity Apple didn't include the \"touch ID\" to secure your passwordsOverall Opinion---------------------It's hard to believe the iPad version 1 was released just four years ago, and there's a huge raft of \"me too\" tablet computers to choose from, but the Apple iPad Air is still the one to beat.As the UK based consumer magazine \"Which?\" magazine put it - \"...the best tablet we've ever tested.  Apple packs a beautiful screen and lightning fast processor into a slimmer-than-ever shell, and battery life is very impressive\".Yes, there are cheaper Android based alternatives, but the quality, design and beauty of this tablet just sets it apart.  If it were a car it'd be a top of the range Mercedes or a BMW.Highly Recommended.", "Date": "January 4, 2014"}, {"Title": "Excellent", "Author": "Daniel G. Lebryk", "ReviewID": "R2RCYFJ9NNSROC", "Overall": "5.0", "Content": "The iPad Air is everything I imagined it would be and a lot more. This latest generation iPad is so much lighter than previous versions; it is now approaching the weight of a Kindle - meaning it is easy to hold for a long time. The body is about two inches narrower, making it easier to hold. The retina display is so darn sharp and looks great.The iPad Air finally pushed me to upgrade my original, version 1 of the iPad. I bought that iPad on release day, seemingly millions of years ago. I loved that device, my one complaint was that the iPad was too heavy - everything else about it was great. Now that I've used the Air, I'll never go back. This was an upgrade well worth doing.November 2, 2013 Update: After using this for two days and thinking harder about the iPad, I figured you might want a few reasons why this might not be for you. Your iPad works just great and you don't do much more than read email, play angry birds, and look at websites all at home. In my case I went from a slow turtle first generation iPad to this lightning fast new version - I'm blown away. And if you have a latest previous version and get a great deal on recycling your current model (read at least $200) then it might make a lot of sense. This is an expensive device, and a MacBook Air is not all that far away from the iPad, after you add $60 for a case, $100 for two years of accidental breakage coverage, and maybe $60 for a keyboard. A MacBook Air at $1100 suddenly doesn't look all that expensive anymore, especially if you opt for the 128GB option of the iPad. Of course there is nothing like holding one of these new iPads and they are super sweet. If you are super logical and conservative, this is probably not the device for you.On the other hand, I decided to jump in both feet first.Setup was super fast and easy. There is a good step-by-step wizard to get the device running. Since I have an iCloud account, I was blown away with how fast this thing synced. That whole improved WiFi antenna is not hype - the device connected quickly with my network. Most devices take a while to connect to my network, this was painless and fast. Filling in the information for my mail account, it seemed like seconds and new email was downloaded - significantly faster than my other iPad.I had a choice during set up to restore from a backup or set up the unit as new. I chose new device, so none of my apps loaded right away. If I had chosen a backup, I could plug this into my computer and with iTunes could have grabbed my purchased apps. All incredibly seamless.Video is stunning. Amazon Prime Video took seconds to start (I've gotten used to 15-20 seconds). The video started in standard def, and within 15 seconds switched to high def. So much faster than happens even on my PS3. I have never seen buffering move this fast, scanning forward, there was a 5 second delay for buffering and the movie resumed. Sound is much better than the single speaker. It is still not great, just more passable. It is silly that they put two speakers on the bottom of the iPad. A speaker on top and bottom would give movies stereo. Music sounds better. Two speakers put out more sound, the stereo effect is minimal, the two speakers are one inch apart.This is an incredible display for films. The blacks are deep, rich, and have great tone range. Out of the box, this display looks fantastic.Everything moves so darn fast. Switching apps is a snap. New apps load with a blink of an eye.I'm glad I bought the full size iPad; Apple got this size and weight exactly right. I think this is well worth the extra $100 over the retina mini to be released the end of November. Apple has blurred the lines between these two devices. I guess they've done the same thing with iPods, so it makes sense they would do it with the iPad.If you've used iOS 7 on an iPhone, the iPad is essentially the same thing - you will feel right at home.", "Date": "November 1, 2013"}, {"Title": "Longer lasting power, faster, lighter, with free top quality apps to download!", "Author": "jjceo", "ReviewID": "R3ONM01PGHOTQB", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moEKZW1NZ68FJVembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moEKZW1NZ68FJVrefresh_preplay() {\n\ndocument.getElementById(\"cv_moEKZW1NZ68FJVchiDiv\").innerHTML = document.getElementById(\"cv_moEKZW1NZ68FJVhiddenPre\").innerHTML;\n};\ncv_moEKZW1NZ68FJVrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moEKZW1NZ68FJVso;\t   \n\n\nfunction cv_moEKZW1NZ68FJVloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moEKZW1NZ68FJVso = new SWFObject(swfLocation, \"cv_moEKZW1NZ68FJVAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moEKZW1NZ68FJVso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moEKZW1NZ68FJVso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moEKZW1NZ68FJVso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moEKZW1NZ68FJVso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moEKZW1NZ68FJVso.setAttribute(\"height\", swfHeight);\n          cv_moEKZW1NZ68FJVso.setAttribute(\"width\", swfWidth);\n          cv_moEKZW1NZ68FJVso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moEKZW1NZ68FJVso.write(\"cv_moEKZW1NZ68FJVflashcontent\")) {\n          fp_resizePlayerSpace('cv_moEKZW1NZ68FJV', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moEKZW1NZ68FJV';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moEKZW1NZ68FJV', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moEKZW1NZ68FJVloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moEKZW1NZ68FJV\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1Q9GR3DWN4C7M\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1Q9GR3DWN4C7M\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3ONM01PGHOTQB\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1Q9GR3DWN4C7M/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moEKZW1NZ68FJVduration')) {\n      document.getElementById('cv_moEKZW1NZ68FJVduration').style.display='none';\n    }\n    cv_moEKZW1NZ68FJVloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moEKZW1NZ68FJVloadSwf(movieID, playerVersion) {\n   return _cv_moEKZW1NZ68FJVloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moEKZW1NZ68FJVnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moEKZW1NZ68FJV', 0, h);\n}\n\nfunction cv_moEKZW1NZ68FJVresetPlayer(w,h,bw,cc) {\n  cv_moEKZW1NZ68FJVnewHeight(h);\n\n  cv_moEKZW1NZ68FJVso.addVariable(\"resetBandwidth\", bw);\n  cv_moEKZW1NZ68FJVso.addVariable(\"cacheCode\", cc);\n  cv_moEKZW1NZ68FJVso.setAttribute(\"height\", h);\n  cv_moEKZW1NZ68FJVso.setAttribute(\"width\", w);\n  cv_moEKZW1NZ68FJVso.write(\"cv_moEKZW1NZ68FJVflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moEKZW1NZ68FJVRollOverImg = new Image();\ncv_moEKZW1NZ68FJVRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81wRvQ9Mn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moEKZW1NZ68FJVpreplay = document.getElementById('cv_moEKZW1NZ68FJVpreplayImageId');\nif (cv_moEKZW1NZ68FJVpreplay) {\n  cv_moEKZW1NZ68FJVpreplay.onmouseover = function() {\n    cv_moEKZW1NZ68FJVpreplay.src = \"http://ecx.images-amazon.com/images/I/81wRvQ9Mn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moEKZW1NZ68FJVpreplay.onmouseout = function() {\n    cv_moEKZW1NZ68FJVpreplay.src = \"http://ecx.images-amazon.com/images/I/81wRvQ9Mn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moEKZW1NZ68FJVpreplay.parentNode;\n\n  var cv_moEKZW1NZ68FJVcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moEKZW1NZ68FJVcurrentClick) {\n      return cv_moEKZW1NZ68FJVcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:12 MinsI use an Apple iPad about 6 to 8 hours a day.  I own an iPad 2 and 3 and now this new iPad Air version.  My main reasons for updating were that I literally fill up my 64 GIG iPad every day or two with videos and photos that I shoot.  Having this larger version at 128 GIG allows me to work longer and add more to my iPad.  In addition this new version is much lighter and easier to use all day long.  Even though the battery is smaller in capacity than my iPad 3 the battery life is longer and it is very noticeable. This is because the faster A7 CPU and the motion chip actually use less power.Please watch my video as I go into more details in it.I immediately noticed the increase in speed.  The unit connects to the WIFI faster, synchs with iTunes faster, downloads emails faster and speeds up your web browsing.  The differences are very noticeable and enjoyable as a user.  The dual speakers are a nice change but I also use a lot of Bluetooth speakers to enhance the sound of the iPad.In my video I do a size and weight comparison to an iPad 2, an iPad 3 and the iPad Air.  I also show how the basic set up takes place and for advanced users you can just speed through that portion of the video.  The iPad 2 weighs 1 pound 5 1/8 ounces, the iPad 3 weighs 1 pound 7 1/8 ounces, and the iPad Air weighs 1 pound and ¼ ounce.  The iPad Air is narrower but has the same screen size.  The left and right edges of the iPad are thinner on the sides of the useable screen and you can see that in the video.Here are the key improvements for me:* Much lighter in weight* Thinner, smaller design with the same screen size* Much faster when synching with iTunes* Much faster when browsing the web* Much faster when downloading emails* Stronger WIFI connection and faster WIFI synching* A more powerful AC wall adapter with 5.2 VDC and an output of 2.4 Amps.  It charges at 12 watts of power. It operates at 100 to 240 VAC and 50/60 Hz and it is UL approved.  It features folding AC wall plugs for easy packing when traveling.* Lower CPU and motion chip power consumption that makes the smaller/lighter internal battery last longer!  This is very noticeable!* As usual a beautiful high resolution retina screen with 2048 by 1536 resolution at 264 pixels per inch.  You can see the difference in the photos, videos and reading quality of the screen.* Dual speakers in the bottom* Free high quality Apps* iPhoto* iMovie* GarageBand* Pages* Keynote* Remember to download these from Apple!Overall this is a superior product that really outperforms the older iPads that I have.  I was disappointed that the new iPad Air did not have the home button with the fingerprint sensor built in.  Since I have used it with my iPhone 5S I have really become attached to it and it just seems like a way to cheapen the unit and be more competitive instead of showing and using the enhanced technology.  I would have paid a little more for the iPad Air with that sensor.This is still a 5 star product and I recommend it as a very good tablet.", "Date": "November 9, 2013"}, {"Title": "Beautiful product, non-premium hardware.", "Author": "Avenging Taco", "ReviewID": "R52KR35VM0NQ3", "Overall": "3.0", "Content": "I have owned several Apple products, and the iPad is the most distinguished among Apple's line up relative to its competition.  The most compelling aspects of this tablet are the beautiful design, and the 10 hour battery life.  These are the two features that made me decide to purchase another Apple product irrespective of their business practices which try to squeeze money out of their customers by not supporting devices properly after they are released.After having used this product for over a month now, I can say it is an improvement over my iPad 1.  The browser now crashes on the original to the point of making it worthless.  My original iPad had 256 MB of RAM which is not enough to load a lot of modern web pages without the browser crashing.  That is why I had hoped the 1 GB of RAM in the iPad Air would be sufficient, and it has improved, yet I still find that the browser crashes on occasion.  The scroll latency is very subtle, but noticeable to me.  It doesn't really impact my usage, but it could create problems for people who game on their iPads.  Putting in 2 GB of RAM (which is what I have in my Nexus 4) does not cost that much, and would improve the performance greatly.  For a premium product, I expect the best, and Apple has consistently under-delivered on processing hardware which created the same problems all the way back to the iPhone 1 I purchased on launch day.I take 1 star off for business practices which burn through your pocket, and the second star is removed for needless low-RAM browser crashes that are still a problem on the latest iteration (which is likely planned to force relegation of old devices and compel new sales.)  Still, I can say that this is the best 10 inch tablet available, and android has no viable alternative worth purchasing.  If you can overlook the two biggest strikes I have against Apple, you should consider no other 10 inch tablet at this time.UPDATE 1/17/14Today I called into Apple support because my browser is crashing frequently.  I am now experiencing 5 - 10 browser crashes a day when it was only 2 - 3 times a week when I first purchased it.  Speaking with the Apple support technician, he said that they have not received many complaints about this issue yet, so I may be experiencing a rare software or hardware problem.  I looked through my crash log (which had over 100 crash reports in it since Nov. 11th) and the vast majority of them were low memory crashes.  However, the tablet did not operate this way when I initially purchased it, and it began to increase in frequency about 2 weeks ago.  Therefore I suspect that there is a software conflict (I still have 4 GBs of free flash hard drive space, so I doubt it is a conflict with virtual memory, although a RAM hardware problem is possible).  I went through some basic procedures the technician recommended, and I was advised to do a system wipe if the problems should persist.  I will test the tablet for a few days before wiping everything and starting over. I'll update this review once I am confident of what the issue was.", "Date": "December 8, 2013"}, {"Title": "Apple still rules the tablet world.", "Author": "Makavelli02", "ReviewID": "R3AWGSO5C50M8A", "Overall": "5.0", "Content": "First of let me tell you I am not an apple fanboy. I own and support samsung products. I carry a galaxy note 2 with me every day and would not consider an iPhone until the make some huge changes to it. Last year I bought a nexus 7 and loved it. Now that it's specs are getting a little dated I had to look for an upgrade. The new nexus 7 didn't impress me with it's dated CPU. So I looked to the note 2014 and the iPad air. I used both side by side and researched every detail. I sell these things for a living. The note is very impressive but, for all it's stats and hardware features it still struggles with simple movements. You can point out is 3 gigs of ram and the very good snapdragon 800 quad core CPU. Then you have apples 1 gig of ram with the measly dual core a7 CPU. ????? Now for the real world facts and it pains me to say this because I love android, but the fact is the a7 in the iPad air with it's upgraded clock speed at 1.39 gigs has yet to be matched in any bench mark from another mobile processor including the quad core s 800 by snapdragon. And with the future in mind the 64 bit tech is hard to beat. Them to the 1 gig of ram vs the 3 gigs in the note. If you can't use all that horsepower why put it in there. The air is twice as snappy as the note with no lag what so every. The note on the other hand lags even on swiping through home screens. It all comes down to the operating system apple remains king. Android may be pretty and customizable but that all comes at a cost. That cost is performance. You can take a car with 500 horsepower and put it on a curvy bending road. All that horsepower doesn't mean a thing. The car with 200 horsepower will still win by going straight.So I bought the air and love it. And must say I have missed iTunes and the more refined apps.", "Date": "November 24, 2013"}, {"Title": "The best iPad yet!", "Author": "Roxanne \"Photography, as a powerful medium of...", "ReviewID": "R3AA0IQZDZRGAN", "Overall": "5.0", "Content": "My first iPad was fun-I called it my toy. I also called it \"the brick\". I used & enjoyed it for certain things. Now several more iPad down the road I have the iPad Air & I am in love! I read a LOT & I went through various Kindle devices-from the original to the Paperwhite as well as the Fire HD & HDX. They all went back to the store after much disappointment & I would go back to reading on the Kindle App.The iPad Air has become my mini workstation, paired with an Apple wireless keyboard, my library, my entertainment zone where I watch movies, play games & listen to music. I can also shop, do research-the list is endless! The device is as light as air even with a leather cover. It stays cool-no overheating. It is fast & with 128g, there is room for what interests me. The Retina screen is gorgeous-which as a professional photographer who uses it as a portfolio to show my work is a must.Apple, you did a fabulous job!", "Date": "December 28, 2013"}, {"Title": "Light, Nice Design, and Does the Job", "Author": "Simon", "ReviewID": "R1PHLHVNLYURIX", "Overall": "4.0", "Content": "This is my 3rd iPad. I've had original iPad, iPad 3, and now the Air. Many people may say iPad is not worth the price for what it does, but in my case, it was worth every penny. I used iPad 3 and now the Air mostly for browsing the web, reading textbooks, and occasional gaming, and for these tasks iPad Air is perfect; not to mention, I've saved a couple of hundreds on textbooks already. Air is much lighter and faster than the other iPads I've had so far. Now, I can easily hold it longer while reading longer texts, and I can see the performance increase in web browsing and games.Mini vs. Air DilemmaI first got the new iPad Mini with Retina display, because the Apple sales person said it is identical to iPad Air in every aspect other than screen size. Of course it turned out to be wrong, since mini is a bit slower and has the display color accuracy issue. After a week, I went back and exchanged the mini for iPad Air. While mini is a wonderful tablet, I was keeping it much closer to my eyes that I liked to. Web browsing also suffered a lot on a smaller screen of the mini even with Retina. With iPad Air, everything is back to normal again, and I can browse the web more easily now.Wi-Fi vs. 4G CellularI have had the cellular version of iPad 3 and the original iPad. To be honest, I only enabled the service for a few months and disabled it afterwards. I find myself to be always near Wi-Fi networks, either at school or work, so I decided to get the Wi-Fi version this time. Another reason was that I can always turn on the Hot-Spot feature on my phone, and share the internet with iPad Air. Because of these points, it didn't make any sense to pay $130 more for the cellular version.Games and PerformanceI've tried a few games, including Dead Trigger 2, and the 3D performance is very good. The new A7 processor really shines here. I am sure new wave of 3D and 64-bits games will come to iPad pretty soon, and if you are into gaming, definitely go with larger than 16GB models. The web browsing performance has been increased as well, so you can browse the web more fluidly.ConclusionI am pretty happy with my purchase. The free iLife and iWork packages with the purchase of new iPad from Apple sealed the deal for me. It is much better than my previous iPad 3, and I definitely love the new reduced weight. The performance increase is also noticeable both in games and web browsing. If you are coming from older iPads, you will probably appreciate the new design and performance as well.", "Date": "December 8, 2013"}, {"Title": "About as useful as a peanut", "Author": "Joe C", "ReviewID": "R2SCYOVSAQ3G2Y", "Overall": "3.0", "Content": "I am a college student and got sick of lugging a laptop around with the risk of it getting stolen so I purchased an iPad. I am neither an apple/pc/android fanboy, I use the tool that gets the job done reliably. (Ever have a paper due and your computer breaks down?) I own a macbook, iphone, windows desktop, and had a Nexus 7 for a short time but wanted a tablet with a larger screen.So lets get down to it- initial impression was \"Wow!\" and I never realized how chunky or laggy the Nexus 7 was. The resolution, animations, user interface, and general build quality is superb in my opinion. It feels like a device \"that will get work done\". Unfortunately, the iPad out of the box feels like a digital storefront for the App store as opposed to something I can do school work on. Bluntly, the device is unnecessarily handicapped. For me to put my own videos on it, I have to use Handbrake and waste 3-4 hours to convert the movie to something the iPad can play. The Nexus 7 played almost any format out of the box. Using textbook PDFs is horrible, there are only a few quality apps that offer continuous scrolling. If your course requires mymathlabs, webassign, or one of those other edu-gimmicks to do homework, good luck, most of them require Flash which is unsupported. Then I went to use safari.. advertisements everywhere! Same with every free app, constant advertisements! Occasionally I have to download PDF to read for course work. Ain't happening in safari- there is no way to download and the page will refresh if you close the app. Good luck reading where there is no wifi.Then I jailbroke it, installed f.lux, adblockerNetworks, safari downloader, nitrous, retinapad, vplayer video player, and videopane. That took care of the blinding blue light at night time, killed off 90% of advertisements, I can download files now, iPhone only apps are now in HD, I can watch almost any format of video too. Now the device is useful!After that, I installed DocsToGo to read PDFs with continuous scrolling and to write papers. I also HIGHLY recommend Notes Plus if you intend on hand writing notes. Lastly, I would suggest getting the \"Papers\" app (no typo) to read PDFs with multiple columns.Overall, iPad has a lot of potential but is held back by Apples walled garden. After jailbreaking and eliminating the majority of the artificial handicaps, I feel OK with heading to school only with it and not worrying about it not being capable of doing something. Remember- iPad is not a device for creation, it is for consumption and is essentially just a storefront to iTunes. If you keep these limits in mind, you won't be as disappointed as I was.", "Date": "January 29, 2014"}, {"Title": "Warning!", "Author": "Owhillo", "ReviewID": "RQ1UDS9MXHJC2", "Overall": "1.0", "Content": "I wish I could say I love my iPad Air  because my kids bought it for me for Christmas.  Within a month, there was a crack across the screen.  I did NOT drop it.  It's in a ZaggFolio case with a keypad and it's a great case.  When I called Apple, they accused me of dropping it.  I can have the screen replaced for $300.  Hello?  Within the next couple of months, the web was full of people who had bought this Air and their screens were broken.  They get them replaced and they break again.  I am not able to post the link on here, but you can check out the Apple site for just a sampling of complaints and questions that you will note has not been addressed at all by Apple.There is a clearly a problem with the screen.  If you don't mind fractures across your iPad, this might be the one for you.  We are an Apple family.  Spent thousands on phones and computers for years.  So disappointed in this model.", "Date": "May 2, 2014"}, {"Title": "Longer lasting power, faster, lighter, better power charger and with free top quality apps to download!", "Author": "jjceo", "ReviewID": "R3DOT7M66G6ZAV", "Overall": "5.0", "Content": "I use an Apple iPad about 6 to 8 hours a day. I own an iPad 2 and 3 and now this new iPad Air version. My main reasons for updating were that I literally fill up my 64 GIG iPad every day or two with videos and photos that I shoot. Having this larger version at 128 GIG allows me to work longer and add more to my iPad. In addition this new version is much lighter and easier to use all day long. Even though the battery is smaller in capacity than my iPad 3 the battery life is longer and it is very noticeable. This is because the faster A7 CPU and the motion chip actually use less power.Please watch my video as I go into more details in it.I immediately noticed the increase in speed. The unit connects to the WIFI faster, synchs with iTunes faster, downloads emails faster and speeds up your web browsing. The differences are very noticeable and enjoyable as a user. The dual speakers are a nice change but I also use a lot of Bluetooth speakers to enhance the sound of the iPad.In my video I do a size and weight comparison to an iPad 2, an iPad 3 and the iPad Air. I also show how the basic set up takes place and for advanced users you can just speed through that portion of the video. The iPad 2 weighs 1 pound 5 1/8 ounces, the iPad 3 weighs 1 pound 7 1/8 ounces, and the iPad Air weighs 1 pound and ¼ ounce. The iPad Air is narrower but has the same screen size. The left and right edges of the iPad are thinner on the sides of the useable screen and you can see that in the video.Here are the key improvements for me:* Much lighter in weight* Thinner, smaller design with the same screen size* Much faster when synching with iTunes* Much faster when browsing the web* Much faster when downloading emails* Stronger WIFI connection and faster WIFI synching* A more powerful AC wall adapter with 5.2 VDC and an output of 2.4 Amps. It charges at 12 watts of power. It operates at 100 to 240 VAC and 50/60 Hz and it is UL approved. It features folding AC wall plugs for easy packing when traveling.* Lower CPU and motion chip power consumption that makes the smaller/lighter internal battery last longer! This is very noticeable!* As usual a beautiful high resolution retina screen with 2048 by 1536 resolution at 264 pixels per inch. You can see the difference in the photos, videos and reading quality of the screen.* Dual speakers in the bottom* Free high quality Apps* iPhoto* iMovie* GarageBand* Pages* Keynote* Remember to download these from Apple!Overall this is a superior product that really outperforms the older iPads that I have. I was disappointed that the new iPad Air did not have the home button with the fingerprint sensor built in. Since I have used it with my iPhone 5S I have really become attached to it and it just seems like a way to cheapen the unit and be more competitive instead of showing and using the enhanced technology. I would have paid a little more for the iPad Air with that sensor.This is still a 5 star product and I recommend it as a very good tablet.", "Date": "November 9, 2013"}, {"Title": "Simple Review", "Author": "Londonnoise \"Robby\"", "ReviewID": "R2HXW1596QTAJL", "Overall": "4.0", "Content": "There are 1001 iPad reviews of varying detail out there and you don't need me to slog you through every little feature. Figuring what you want to know is, \"Is it worth the upgrade?\"Well yes and no.If you are already using an iPad with a retina display (and the display IS pant-wettingly gorgeous), you're going to get a sleeker, lighter, faster version of the same thing. Sure, the camera is a bit improved, but don't you think that people look odd trying to take photos on an iPad? For me, that's not what this is designed for.The first thing you'll notice when you pick it up is how sleek and light it is compared to previous models. It really is a beautifully designed and built tablet. It' also noticeably (but not hugely with the apps I tested) faster. iOS 7 looks fab on the thing.Still, the bottom line is, if you are running a pre-retina iPad and you got the cash, yes, it's worth it (and I use 'worth' as a loose term here, they are bloody expensive). If you are running a newer iPad, sure, this is sleeker and shinier, but I'm afraid it's not going to change your life.To conclude, this thing is beautiful, extremely useful in my life, and I love it like the child I never had :-) Just don't expect it to change your whole life!", "Date": "November 9, 2013"}, {"Title": "iPad Air was a great buy!  You won't regret it!", "Author": "EvansDJ82", "ReviewID": "R3D3OD7YY7Q22E", "Overall": "5.0", "Content": "Purchased this at a recently run promo at the local Best Buy ($150 in gift cards that I received for the purchase was promptly used to offset it's higher cost).It is a 5-star tablet in everyway.  I'm fully invested in Amazon media and am glad that Amazon saw fit to put all it's services onto the iPad Air via apps so that I can access it seamlessly.  I have both the HDX 8.9 and the Air even though the HDX 8.9 has a better screen, I prefer reading books and magazines on the iPad Air because of the 4:3 aspect ratio.  I also am happy that I got it because it is apparently the only tablet that works on my company's internal network.The HDX 8.9 is better for video watching, particularly if you're watching without headphones.  The speakers on it are amazing.  However, the speakers on the Air aren't bad, they're  just too close together to practically be stereo.That said, both the HDX 8.9 and the Air are 5-star tablets.  They have different strengths and do different things well.  The HDX 8.9 is now my son's and the iPad Air is mine (because of it's work functionality).You really can't go wrong with either tablet.", "Date": "December 11, 2013"}, {"Title": "iPad lover", "Author": "J. M. Kahn \"Gizmo Lover\"", "ReviewID": "R3QIG90IQFIVZV", "Overall": "5.0", "Content": "I had first purchased the iPad when it first came out, wasn't impressed and returned it.  Bought the 2nd version, loved it and have had it ever since.  When they came out with the 3rd version I wasn't impressed with the changes so I kept my iPad 2.  Ditto when they came out with the next version.  But I saw the iPad Air in person and had a chance to try it for myself.  I loved the new camera (much more defined pictures) and the screen definition (it's now hi-def).  Beautiful sharp, clear colors.  So I upgraded and bought it (I bought the white one though.)  I was fortunate that the place I bought the iPad Air from accepted my iPad 2 as a trade in so I got it for approximately $200 less (my iPad was in immaculate condition and I still had the box, paperwork and the accessories.)  I do love this iPad.  It's fast, fast, fast and my games are beautiful.  I have both Microsoft and Apple products (although no Apple computers, they're too expensive.)  Both have their merits, but I have to say one thing for the Apple products, upgrading to new devices and transferring all your programs, particularly games, is so much easier.  On Microsoft products, with Windows, you have to reinstall all of your games and programs, and with the games pray that the new operating system will let you play your old games.  In most cases it won't and you have to go through a bunch of iterations to play them (and I say this while typing on an HP Laptop which I use daily and would rather DIE than go without it!)  I don't know why Microsoft, (maybe it's the game developers) won't let you back up your games or the programs like Excel, Word, etc (even though you've already paid for them.)  But with Apple you just attach it to your computer  and sync it (hopefully you backed up your iPad, or whatever, to it) and voila, all your previous games, music, programs are on the Apple product ready to use just where you left off (most of the time anyway.  On a few of the games I had to start from the beginning, but I think that's because of the developer, not the iPad because some of them I did start where I left off.)  Also, set up for programs such as mail is minimal (just put in your user name and password and you're ready to go.)  I wish Microsoft would come out with something like that so I could purchase a new computer without the fear of not being able to play my favorite games.  Anyway, bottom line I LOVE my new iPad Air.  I even found a case that allows me to swivel the stand to either landscape or portrait positions so that I can read the newspaper or books on it and eat at the same time without having to try and prop it up on something (bought the case on Amazon.com, it's a Targus Versavu).", "Date": "November 27, 2013"}, {"Title": "Incredibly light, fast and beautiful. Is it the best tablet for you?", "Author": "John Ryan", "ReviewID": "R3W2AOZWQH82BD", "Overall": "5.0", "Content": "The new iPad Air is Apple's latest, slimmest, lightest release of their hand-held computer. Oddly enough, it's so beautifully easy to use (my one year old daughter loves playing with it), it's almost doesn't feel like a computer at all.A word of warning - this review is written for people who've never owned an iPad before - and are wondering what all the fuss is about. If you're thinking of upgrading skip down to the \"What's great about the Air\" section below, or just buy it - it's amazing.Just what's all the fuss about?--------------------------------------I used to own a laptop for work, and (very occasionally), it'd sit on my lap on the sofa, and I'd use it for pleasure (eMail, watching films or playing the odd game). Then I bought my first iPad, and the laptop became redundant, a boring \"work device\". Hard to explain, but the fact the iPad is so small and light, and you navigate around with your finger by pointing and gently swiping the screen makes the whole experience a lot easier - a lot more fun.Even my most \"luddite\" of friends have been won over.It's incredibly simple and easy to use (it only has one main button), and everyone from my one year old daughter to my 85 year old dad have taken to without problems. It's size and shape also support using it like a book (literally to read a book or web page), but you can also watch TV and films.Personally I'm also paranoid about my password getting \"hacked\", and someone running up a huge Amazon bill or buying stuff with my credit card on eBay. Well one of the benefits of the iPad (and iPhone) is it's \"almost impossible\" to get a virus - one of the most common ways to get hacked. This doesn't mean you shouldn't use strong passwords, (both Sony and Adobe got hacked), but it's reassuring to leave the Windows world behind.Finally, I love the way these devices (iPad, iPhone, Apple TV, Apple Mac), increasingly work together. The fact you can start a Pages document on your Mac and edit it on your iPad, or take photos on the iPhone, and in seconds see them on the iPad or Mac and display them on the Apple TV.The thing is, \"it just works\".What would you use if for?----------------------------------* Shopping online. Obviously - you could be reading a review on Amazon about the iPad Air!* Reading web pages. As you can hold it like a book it's great to read the news online (my wife loves the Daily Mail Online).* Reading Books. It's great for reading books from Amazon Kindle or Apple Books with the benefit of 1,000s of online book reviews* Navigating web pages. Instead of clicking with a mouse, you gently swipe your fingers on screen to scroll around* Watching Films. I use it to watch Netflix online videos (with an Apple TV you can send stuff to the telly)* Watching TV. With the free BBC iPlayer app you can catch up or download BBC programs* Reading and replying to mail. I use \"mailbox\" a great free app to read and reply to mails, but there's a free one included* Showing and organising photos. Any photos on an iPhone are automatically available within minutes in \"the cloud\"* Playing games. From fun puzzle games like \"Cut the Rope\" to fully fledged first person shooters.* Listening to the Radio. With \"Tune in Radio\" you can listen to thousands of radio stations world-wide.* Listening to music. I stream mine to an Apple TV, but you can also buy portable speakers or just plug into the AUX socket* Editing Word, Excel and Powerpoint documents using FREE App \"QuickOffice\" (owned and supported by Google).* Editing Pages, Numbers and Keynote documents (Office for the Apple) on the FREE Apple apps.* The list goes on and on.Update: You can edit Word, Excel and Powerpoint documents (plus Pages, Numbers and Keynote) on the iPad (although I'd recommend an external keyboard - see below). It's definately powerful enough, although I'd not expect these apps to cope with REALLY complex document layouts. Great for general letter and document writing though.Which model should I buy?----------------------------------I can't comment about Android tablets (apart from the Google Nexus 7 which is well regarded), but in terms of the Apple tablet line-up in order of cost:-1. Avoid the Apple iPad 2, it's a relatively old model, under-powered and with a lower resolution screen. If you really want an Apple but don't want to spend the cash, buy a 16g WIFI 3rd or 4th generation iPad from eBay. Avoid this one.2. iPad mini is a lovely tablet. A 7.9 inch screen and astonishingly light and remarkably thin - it feels like a light-weight book.3. iPad mini with retina screen. Again 7.9 inch screen, but with the blazingly fast A7 chip and a \"retina\" (high definition) screen. Worth the upgrade if you can afford it.4. iPad Air. Much larger screen size (9.7 inches - doesn't sound much but it makes a huge difference). Same fast (A7) chip as the Mini with Retina - the latest and fastest iPad available.Clearly (from my viewpoint) there's only really three options. The iPad Mini, the Mini with retina screen and Air.What are the Optional add-ons?-----------------------------------------Well, assuming you've dropped by the Apple Store or John Lewis (which I would highly recommend), and handled the iPad Mini (with/without retina screen), and iPad Air then your options are around memory size and cellular option.Memory: Once bought, you can't add memory (space for apps, films, books etc). However, the basic price goes up a huge amount (+£80 for the 16g to 32g iPad Air). But, having owned a 16g and then a 32g iPad - I can safely recommend the 16g unless you really want to store a huge amount of videos and downloads. Only you can decide, and if you're lucky enough that money is no object then splash out. Otherwise, 16g should be fine for most people.Celular: Allows you to connect to the internet while you're out and about. This will add an additional +£100 to the price and means you can slip in a mobile phone SIM card. This means (for an additional £7-15 a month extra), you can access the internet on the move. Alternatively, you can opt for the WIFI option, and use it at home or at at \"hot spot\" (eg. Starbucks, most rail stations and hotels etc).Personally I'd buy (and indeed did), the 16Gb iPad Air WIFI.Do I need anything else?-------------------------------Most people (me included) buy a cover. Apple (and now several copy-cats) make a \"smart-cover\" which automatically shuts down the iPad when you close it, and switches it on when you open it. There's versions which cover the back, or just the screen. Apple charge from £35 to £65 for their (admittedly) high quality fabric or leather covers, but there's many available from £10. Be aware, you do get what you pay for.Personally,I think it's a pity to cover the beautiful aluminium industrial design of the iPad with a cover - but if you've spent hundreds of pounds you'll want to protect it from scrapes and bangs.I also invested in a keyboard (£25-80), as I tend to write a lot of mails and documents (remember it comes with a word processor). I'd recommend the Logitech Ultra Thin iPad Air Case with Keyboard - Space Greyand the ZAGG Keys iPad Air Case Folio with Backlit Keyboard - Black although these are strictly optional unless you want to use your iPad as a proper laptop.Finally, if you have another Apple device (eg. an iPhone, Apple TV or Mac) you'll find these work together beautifully. For example, you can create a reminder on your iPad and it appears on your iPhone. Equally, photos taken on your iPhone appear on your iPad, and you can stream music or videos from iPad, iPhone or Mac to an Apple TV.Some people think this \"locks you in\" - but it's your choice.What's great about the Air?-----------------------------------* Lighter (30%) and thinner than the previous version (469g from 650g)* Even faster A7 chip. Blazingly fast!* Improved sound (compared to the iPad 4)* Software including+ iMovie - edit and publish home made movies+ Numbers - Fully functional Excel for the iPad+ Pages - Word processor+ GarageBand - Play a piano or a drum kit+ iPhoto - Edit and organise your photosWhat's not so great?--------------------------* The change in physical size means you'll need a new keyboard or replacement cover if you're upgrading* Pity Apple didn't include the \"touch ID\" to secure your passwordsOverall Opinion---------------------It's hard to believe the iPad version 1 was released just four years ago, and there's a huge raft of \"me too\" tablet computers to choose from, but the Apple iPad Air is still the one to beat. As \"Which?\" magazine (in the UK) put it - \"...the best tablet we've ever tested. Apple packs a beautiful screen and lightning fast processor into a slimmer-than-ever shell, and battery life is very impressive\".Yes, there are cheaper Android based alternatives, but the quality, design and beauty of this tablet just sets it apart. If it were a car it'd be a top of the range Mercedes or a BMW.Highly Recommended.", "Date": "February 23, 2014"}, {"Title": "Great, even for an Android fan.", "Author": "Xachary Dinsmore", "ReviewID": "RSJSN0GPTVMU4", "Overall": "5.0", "Content": "I have historically been an Android person, However, this time I decided to give Apple a whirl. In comparison to an Android device it is far less customizable. You don't get to install different keyboards, or load widgets onto 8 different home screens, or install a completely different launcher all together, but this doesn't mean it's all bad. The user interface is very simplistic, but that actually works fairly well on a screen this size. The only thing that really sucks about it is that you can't hide the infrequently used apps quietly off to the side in the app screen like you can with Android. You are staring at all the apps at once from the home screen mo matter what. Even all neatly organized in folders it can still be a little hard to find what you are looking for. This coupled with the lack of information on the home screen(such as you get from a widget) would make me really dislike this on a small phone screen. It does work fairly well with the 10\" screen though, and the multi touch gestures make switching between apps and multi tasking a breeze.  This thing is extremely fast as well, you really can't slow it down. 10 browser tabs open, streaming music, playing a game, and checking your email, all while jumping back and forth between them is completely seamless. It literally feels like you can't feed it input fast enough to make it even stumble a little.  The battery life is also excellent. You will be hard pressed to kill it in a day. You would have to be gaming on it for hours to accomplish a dead battery I would think. I think the battery life is the perfect balance, to increase it any would in my opinion probably mean a sacrifice to either performance or weight and size. I typically get about 2 days of moderate use out of it.  For those of you on the edge between this and an Android device(or the constantly improving world of Windows mobile), the App Store selection is about the same. For the types of apps I use there seems to be very little difference, the are both excellent for social media, media consumption, email, and browsing the web. I do somewhat prefer the BaconReader reddit client app for android over what I have found here, but that is a very minor complaint. There are a few apps that are paid on iOS that you can get for free on Android, but at the same time there are more tablet specific apps on iOS, so I think it's a fair trade off.As far as day to day use goes it has been impeccable and I would recommend it to anyone. It has been reliable, fast, and had great battery life, any complaints are minor and subjective. In case Amazon rolls my review in with all the iPad Air models, which they probably will, I have the 32GB white version. I would also recommend avoiding the 16GB, after everything is all updated and the included free apps installed, you will only have a couple GB left for apps and media.", "Date": "March 20, 2014"}, {"Title": "Best tablet for normal people.", "Author": "T. Marble \"Movie fan\"", "ReviewID": "R3LCL3HZ6ENZHM", "Overall": "5.0", "Content": "I've had several tablets... Sony Tablet S, nexus 7, ipad mini, and now the ipad air... This is definitely my favorite.  The screen is big enough to allow for relaxing reading, but it's thin and light enough to carry around without it being a chore. Battery life is amazing. I easily get 10 to 15 hours on a single charge with normal use. Build quality is superb. I have an apple ecosystem at home, so it fits perfectly. My Mac mini, iPhone,apple TV, all seamlessly communicate. This works so well, I've decided to no rush into buying a MacBook Air.", "Date": "December 8, 2013"}, {"Title": "A Transcendent Tablet - Apple Delivers This Time", "Author": "Michael Sullivan", "ReviewID": "R13FGE9ZVT4R5L", "Overall": "5.0", "Content": "The iPad Air is, without exception, the best piece of technology that I have owned, and I have owned nice tablets and computers before.  One of the first things that jumps out about this device, beyond the gorgeous display and excellent speed, is the long lasting battery life.  I have owned this tablet since the day it came out, and I am still averaging about 10 hours of battery life on it.  That is a good thing, too, because if one gets this tablet, they will be using it a lot.  That is, by and large, due to the tremendous versatility that the iPad Air provides it users with.  I have effectively utilized this tablet at both work and in my graduate courses, and by my judgement, my performance has seen a boost by consequence of that.With that in mind, it must be acknowledged that the iPad Air, or more generally, apple products are more expensive.  Critics of the iPad often point to that very fact, but a \"premium\" price boost to a top of the line product is not unique to the iPad - the nicest things are also invariably the most expensive things.  Because this tablet is so well made, there will typically be very little to no frustration associated with it.  It gets the job done across the board, be it for personal or professional use.  It is for that reason that the iPad Air is worth the extra $100-300. As a graduate student, I cringed at my bank account after I purchased this, but at this point, I'm honestly relieved that I got the iPad.  $600 may seem like a lot at first, but by the time a month has gone by, and one realizes how much they actually use this thing, that $600 will start to seem like a small price to pay.  Once a former galaxy tablet loyalist - now firmly in the iPads corner.  Truly, this is such a well made device - it really doesn't get better than the iPad Air right now, and it probably won't until the next IPAs either.", "Date": "November 29, 2013"}, {"Title": "Buyer Beware", "Author": "Voenix Rising", "ReviewID": "R11YB5ZRVSQ3BX", "Overall": "3.0", "Content": "While technically ALL iPad Airs are \"unlocked,\" and can be used on most any carrier, I was extremely dismayed to learn that the Air I received from TechGiant arrived with an IMEI (a hardware identity number unique to every device) that was locked to AT&T.; Because of that lock, it's not just a simple matter of swapping out the SIM card to get it on the carrier of your choice. In my case, Verizon had to scan the IMEI of one of their own devices in order to activate one of their own SIMs to use in this Air so that it could be added to my existing account and used on their network. Yes, in the end it worked, but it was a huge hassle and if I'd known beforehand that the device would arrive this way I would not have purchased it from this seller, instead going directly to Apple or Verizon.", "Date": "December 26, 2013"}, {"Title": "Well Apple you finally got me", "Author": "Danamite", "ReviewID": "R34DQA57YUOFR", "Overall": "5.0", "Content": "I managed to avoid 5 generations of ipad purchases (including the 1st generation mini) but this one finally got me. My eye doctor told me if I didn't stop being ridiculous and using my itouch as an ereader (I know, I know but it was so portable!) I could kiss my 20-20 vision goodbye. Basically Apple can thank my optometrist. That being said this thing is gorgeous. It takes beautiful photos and video, the screen is crisp and clear. While I don't run around in public taking photos and video with it I'm happy it has the capability. It's great for watching movies on the go and I've been very happy with the battery life.So why should you buy this one? It's a reasonable size without sacrificing screen size or quality. I think the ipad mini is cute but I have friends who practically have smartphones with a screen that size. It wasn't worth the price for me. We have other ipad products in my family, I've never been motivated enough to go out and buy my own but this one is a good size. It fits in a normal size bag or purse and makes me feel like I'm carrying around a pad of paper rather than a small laptop.I've had several people ask me why I bought a ipad instead of a kindle fire or the like. As I said, we have a lot of iproducts at my house and I'm very happy with itunes. This way I can easily swap movies, tv shows, ebooks, various apps I need on a daily basis around and basically this has turned into a backup laptop for me. The functionality was absolutely worth it to me.I guess if I were to say anything negative it would be 1) I'm never going to live down finally having bought one after saying I wouldn't for so many years and 2) my iphone and itouch now seem incredibly small. I'm hoping the iphone 6 releases soon and has a bigger screen. First world problems to be sure but there you have it.", "Date": "November 15, 2013"}, {"Title": "Very happy with the purchase", "Author": "Xiaodong Cheng", "ReviewID": "R39R44Y8UD95AG", "Overall": "5.0", "Content": "It is a beautiful unit, with solid construction, gorgeous display, and of course very light and thin compared with older models. It is running very smoothly  when running games. The battery life is really impressive considering its size. After 5 hours of non stopping video streaming, the battery dropped from 100% to 60%! I am very happy with my purchase and have nothing to complain!", "Date": "November 6, 2013"}, {"Title": "iPad air crashes ! ! !", "Author": "Hank", "ReviewID": "RVAGWCG6KOG1P", "Overall": "3.0", "Content": "It's a nice tablet. Fairly fast. I got the AT&T; model and internet connections are fast. However, the darn thing crashes frequently !Very aggravating.", "Date": "February 17, 2014"}, {"Title": "NICE !!", "Author": "Swim Coach", "ReviewID": "R187JTPKIE0CPX", "Overall": "5.0", "Content": "I hesitated buying another iPad when my family already has 6 (different models and gens). These are great products and no wonder Apple is winning the tablet war. This is a testament to Apple's quality and attention to detail. However, the iPad Air exceeds all expectations. It is smaller, lightweight and long-lasting. The Retina screen was an improvement (aside from speed) during the iPad's evolution. The iPad Air is more revolutionary than evolutionary: highly recommended for those considering to replace their notebooks!!", "Date": "February 2, 2014"}, {"Title": "Lover the iPads", "Author": "marie \"teach\"", "ReviewID": "R1HUZW1RS647DS", "Overall": "5.0", "Content": "If you are on this site, you are trying to decide whether to buy the iPad or another tablet such as Samsung or other device. I mentioned Samsung because I love their phones, tv's, etc. However, when comparing the note to the iPad, I opted for the iPad. One very big reason is I love to buy, rent, download movies to watch. Having an iTunes account makes this so very simple. Also, I have a ton of iTunes credit (I always ask for iTune gift cards whenever the occassion arises). In addition to iTunes, I love Pages. When I got this app, it was free! However, if you do a lot of word processing, you might want to invest in this much needed addition. The great thing about Pages is you can send as a PDF or Word doc via email.Some are trying to decide if they should buy a 16, 32, 64, etc. Speaking from experience, a 16 will not be enough for must adults, but would be fine for a child. I know you can store in the \"cloud\". However, you have to have a wifi in order to retrieve from the \"cloud\" unless you have the iPad with a cellular service (which to me, is a waste). So, having your documents available whenever needed is a plus. Therefore, a minimum of 32 would be great.All said, I love gadgets and technology. I love having the latest, and that is why with each new model, I will upgrade. However, I think this iPad air will be mine for many years - of course I say that until the next iPad air comes out with the finger print scanner and I will tell myself, \"must have\".If you own one, enjoy! If you are contemplating purchasing, make the plunge (you can return it if not satisfied to most places including Amazon).", "Date": "January 30, 2014"}, {"Title": "Perfection", "Author": "C. Misra", "ReviewID": "R1XHINKVWKIHWD", "Overall": "5.0", "Content": "I had the retina mini which was great but too small for web browsing comfortably for extended periods.  I exchanged it for the Air.I'm much happier with the Air.  The extra screen space is more than worth it to me.  No more panning and scrolling and zooming endlessly with the mini, that is over with the Air.  The Air also plays video and music beautifully.  I actually felt the mini was absolutely perfect form factor for tv, movies, and e books.  The Air does all these things great too, but mini did them better, in my view.  Sigh.....so long, little dude.I had an ipad 4 from feb to yesterday.  Ten months.  It was great.  I sold it easily on Craig's list for $320.  I wish I priced it higher.  I could have likely gotten $350 for it.  In any event, I paid $180 to use it for ten months or eighteen dollars a month.  Fifty cents per day.  I can live with that.Love my new ipad Air.  It is sleek, light and attractive.  Easy to hold with one hand and I have small hands.  I have known girls shorter than me who had bigger hands than me.I recommend the Air.  A superb investment.  Whatever ur needs.  If you read. Or watch tv and movies, or need a great camera, organizer, music player.  It is a great product.  Just go get it.  Sell other stuff if u have to.  You will not regret.", "Date": "December 29, 2013"}, {"Title": "A little underwhelming", "Author": "Lucky Yona", "ReviewID": "R1HJY4K8FH1E26", "Overall": "3.0", "Content": "This will be relevant for heavy users. I gotta say I have a crash or frozen screen pretty much everyday. Battery life hardly reaches the 10 hour mark even when I'm conservative. I feel indifferent", "Date": "February 3, 2014"}, {"Title": "Not good enough!", "Author": "C. Nguyen", "ReviewID": "RLL1W7Q6ZFXZ1", "Overall": "3.0", "Content": "I love apple perfect hardware and design.  The new iPad air is not a good buy imo.  The bezel is too thin thats its so hard to hold without touching the screen and activate random things.  Apple didn't upgrade the memory in the iPad Air.  It is still 1GB.  I don't know why they do this but with only 1GB the iPad won't be good for more than 2 years.  Same thing happened to the iPad 1 and iPad 2 because of the limited memory that make everything much slower.  I think the 1GB memory is the very bad flaw on the new iPads.  Don't support apple because you own their product or you are their fanboy.  It is very stupid to do so.Although I love apple's hardware and software, I would not buy another iPad or other apple's products unless I see that they don't hold back on the upgrades.", "Date": "January 5, 2014"}, {"Title": "Just what I need!", "Author": "Awesome Possum", "ReviewID": "R2I6EP2UETQM8F", "Overall": "5.0", "Content": "The iPad Air is a fantastic tablet. Just what I need. Thinner and lighter than my sadly broken iPad 3, but now that I have had a chance to really use it, I think I probably would have upgraded even if I didn't break my last iPad. There are not too many changes (and there don't have too be) but the deal makers are the new and lighter design and the the 64-bit A7 chip that will pave the way for better applications and performance. No touch ID which is ok because I don't like having a pass code on my iPad anyways where on the 5S it is greatly appreciated. Same fantastic resolution as its past 2 models but now has better power to push them all. Gaming and productivity apps look and feel great and I can use them to do everything I need.", "Date": "December 1, 2013"}, {"Title": "Best tablet in the market that i could find for my wife THOUGH i am a Android fan!", "Author": "Moze", "ReviewID": "R2NB4JHKWOVJQT", "Overall": "5.0", "Content": "Though it was $15 more from Apple, I am okay with it. My wife loves it. The perfect user device no questions asked.", "Date": "November 26, 2013"}, {"Title": "Best large tablet on the market, but more choices than ever.", "Author": "Nick", "ReviewID": "R1DW9VYGONR4CK", "Overall": "5.0", "Content": "As a stand alone purchase, iPad's are still the best tablets on the market. As an upgrade from prior iPad's, the Air is going to be the biggest reason to upgrade in recent memory. Users from the 3rd Generation down will see substantial benefits to speed alone.What Works:It's substantially lighter. Easier to hold and use while watching movies or reading a book.It's substantially faster. The upgraded processor is so fast that most users will be future proofed for the next two years or more. 64 bit processing will give this tablet some legs.the battery charges substantially faster. This is a nicer reason to upgrade than most realize. The Air's battery is smaller, and holds it's charge very well compared to older models on iOS7. I had problems on my 3rd gen keeping it charged compared to the zippier charging Air.Lightning port is much more convenient, easier to plug in compared to 3rd generation and back.Speakers seem to pack more of a punch.What doesn't work:the screen has a slightly hollow and thin feel on the finger. As a consequence of a lighter tablet it's expected that the display lost some of it's heft.the volume buttons are spaced a little too far apart for me. Harder to press.volume speakers are annoyingly where you'd hold the tablet horizontally.-----That's my impressions with the tablet. My recommendation is if you have $500 or more to spend on a tablet, the iPad Air is going to be your first choice. Android hasn't been competitive in this section of the market. If you're looking for a less expensive, smaller tablet, then you're going to be looking at the Kindle devices or the Android devices.For Apple users, i'd recommend people on the 1st and 2nd gen devices take the plunge, the changes are enough to warrant the upgrade. 3rd Gen users are in the grey area. They are not going to see any difference in screen quality, and the speed of the Air may not be too large to matter for basic use. 4th Gen users are totally fine where they are.", "Date": "November 14, 2013"}, {"Title": "REPLACED MY IPAD 3, WAS IT A GOOD DECISION? LETS FIND OUT. IN DEPTH.", "Author": "Kanwar Anand", "ReviewID": "R104L6A6P3VSAW", "Overall": "5.0", "Content": "This is my third iPad. I decided on a 32GB because I wanted to load movies on it and a lot of music and not worry about space. I mean when they announce a new version of iOS the last thing I wanted to do was delete something dear to me. I was replacing my iPad 3 16GB with an iPad Air 32GB. There have been many changes. Are these changes enough to warrant the need for an upgrade? I am still not entirely certain but I am more happy than sad about doing that. I haven't been able to sell my iPad 3 but its still looking for a new home. So guys, here is what I like about the iPad Air, what I don't like much and what are some key features or new introductions to this device.The Positives of Upgrading to iPad Air -1) It is lighter, the surface area around the display has been reduced, the design is not revolutionary by any length of a realistic understanding of science but it still has the same battery life. It has lost that annoying 30 pin connector which seems so inconvenient to the new lightning port. I can use this one hand, I can expect the same battery life, the volume button on the iPad 3 seemed less delicate, the iPad Air definitely feels a lot more delicate than the iPad 3 which seems so robust now when I pick it up. But overall I would give them 4 stars for the design changes.  I wish it never heated up though but purely from the WEIGHT difference I think its good, the screen for some reason looks better, it must be the upgraded graphic chip.2) The Sound - This is the biggest winner for me. Imagine not having to turn the sound to 100% on your iPad air. It rivals my matchbook air in terms of how loud it is, yes it isn't as loud or roomy or filling but it is more than satisfying. They now have two speakers so its a stereo sound. It is louder than my iPhone 5 and certainly more clear, catchy, bass adoring than I would image from an iPad. This was the surprise winner for me. A bit of a let down in terms of design is that if you're lying and watching a film in portrait mood the speaker sound may be muffled by your stomach/body part in contact with the base of the iPad air. The solution is LANDSCAPE mode. The two speakers are now located on the left and right side of the charging port. No complaints on this. The iPad 3 is maybe 30% as loud as the iPad air.3) Battery Life/Faster Charging Speed - I don't know why but I feel the iPad 3 had a longer battery when it was new. A new apple iPad will last you so long, it will need for you to bore it to death to bring it from 100% to 64%. Yes, this is the case with the new iPad but it isn't as good but overall the fact that charging time seems to have reduced by half is a big big big big winner for me. So overall, no complaints. I don't get 13-14 hours like I used to with my iPad 3. I get 11 hours. Yes, I make the best use of the new sound feature. The fact that it charges faster means I don't need to pull it out before 100% and this is a good thing for the battery. With the iPad 3, I have to wait for it to be 100% charged and it can take unto 8 hours. This has been reduced by almost half and I feel 4-5 hours will give you a 100%.4) Processor - The iOS 7 clearly stalls a bit on the iPad 3. Did I notice this before buying the iPad Air? Yes cause my iPhone 5 was faster than the iPad 3. If you're playing quiz up, everything loads in seconds, if you are browsing, it goes boom boom boom like my macbook air. Well nothing quite compares to browsning on the AIR but this is very good. iPad Air is the best device for youtube because of the loud speaker, I can sit with it for hours and discover various things. The processor seems to heat a lot less. There  is never a lag on anything. It doesnt think so much.5) Camera - Camera has improved from the iPad 3. Both the front and the back is more defined. Do I use this? Why wouldn't i?COULD HAVE BEEN BETTERS' WITH THIS IPAD AIR -1) Headphone Jack Placement/Volume Output -  This isn't as loud when using with headphones as the iPad 3 used to be. It is a more customised sound. The headphone jack is located at the same place where it used to be but because the surface area is smaller, I have found that when I am lying down and using my iPad AIR, the wires often get a bit entangled.2) The iPad Air still heats up. I can't for the life of me figure out why I pay a company so much money when they make a product that heats up on full brightness. This is one hell of an annoying feature.3) The back on the iPad Air, the volume buttons, the power button, the menu button - they all seem a bit too delicate in comparison with the iPad 3. This is just an intuition or impression but I can't help but feel it needs to be treated gently.4) Safari has been needing an overhaul for the longest and I feel they need a better browser than the one they have right now. It often freezes on my iPad 3. It should be perfect like iMessage is perfect, like FaceTime is close to perfect, like email is perfect, it isn't quite up there. I would give it a 6/10 in terms of potential.5) iBooks - I read on my iPad more than anything else but the iBooks software also needs some more options of backgrounds and schemes. Apple plays safe for far too long but they need to give more options to make READERS WANT TO READ MORE.6) Syncing iTunes is a bit confusing. There should be more education given to all customers about preferred type of WIFI networks, sometimes applications don't update, I have no idea why they are doing this. I have to go to airplane mode and then go back up. The iCloud feature needs 10GB and Apple need to stop being a cheapskate.Conclusion  -Get the iPad Air if you are looking for something with good design quality, good battery, an extra lightning cable (half joke) , something faster, smoother...this is about a 31% improvement over the iPad 3. Thats a big deal.Of my iPhone, macbook Air, iPad Air - I have always liked the iPads the most. They have reliable battery and never ever ever die on you like the other two. Its that simple and that keen.If they take into account some of the things I didn't like about this product, Apple can be made better overall. Ha!Buy the BLACK one, a WHITE IPAD a strict no.", "Date": "June 2, 2014"}, {"Title": "Favorite purchase of 2014!", "Author": "Paul B. Miller \"pbm-photos\"", "ReviewID": "RV2GFQ9JB9KBQ", "Overall": "5.0", "Content": "No other way to say it, the new ipad air is simply awesome. Fast, responsive. Great to play games on, manage finances, edit photos, etc. all on a generously sized high resolution screen. I like that mine came with a screen protector. That was a plus. Make sure to buy a protective case and/or apple smart cover - as it completes the whole experience rather nicely. I got a handmade pouch/sleeve to carry it in at a really good price on Etsy, just search for ipad sleeve and there will be many different styles to choose from. Best tip I can give to the cellular device users is to go to Tmobile and pay the $10 fee for a SIM card that will give you 200MB of free LTE data for LIFE! Even though it's true that once you go over the limit, the speed is reduced to 2G, there are no overage charges. It's been great for really light data users such as myself as I only need it when not in the presence of a wifi connection (very rare). And I bought the \"Verizon version\"", "Date": "March 23, 2014"}, {"Title": "Too good", "Author": "Pavan", "ReviewID": "R35NGXXYIHAFG8", "Overall": "5.0", "Content": "Start using it for the past 1 month and love it. This is my first tablet and cudnt any better.", "Date": "March 19, 2014"}, {"Title": "THE BEST", "Author": "yocheckitout", "ReviewID": "RP8KL77KD32MK", "Overall": "5.0", "Content": "The iPad Air is everything I wanted it to be. It is so much better than the older iPads. Its light and its easy to hold onto. If you're looking for a tablet, I'd definitely recommend the iPad air", "Date": "March 19, 2014"}, {"Title": "Gift for my Wife", "Author": "Doyen", "ReviewID": "R3IFOHTMHD4FI6", "Overall": "5.0", "Content": "My wife had the original iPad. This purchase was an upgrade for her. The original iPad was just too old to run some of the new apps.She loves her new lighter, clearer, faster Air. We had no trouble getting on the AT&T; network. One call and everything was up and running in minutes.Shipping was outstanding. Received the iPad in two days in perfect condition.", "Date": "March 7, 2014"}, {"Title": "Rarely needed, always pleasant", "Author": "Tyler Mumford", "ReviewID": "R3OXHCBW592RLO", "Overall": "5.0", "Content": "I use my iPad for things that I could do with a laptop or iPhone, but it truly is more convenient for many of those tasks. I read, watch shows, browse the net, manage email, and take notes, to name a few things.", "Date": "February 18, 2014"}, {"Title": "Fully meets expectations", "Author": "George F. Smith", "ReviewID": "RIBYND44K2AQV", "Overall": "5.0", "Content": "Bought this for my wife as a Christmas present, and she absolutely loves it.  She had been using an earlier iPad so was already familiar with tablet technology.  She uses it for reading, checking email, web browsing, and for taking videos of our grandson during his wrestling matches.  For some reason, iPads are popular among moms and grand moms for taking wrestling videos.  She then transfers the videos to her MacBook Pro, writes them to an optical disc and gives it to the coach for analysis.  Video transfers are achieved when she syncs the iPad Air with her MBP.  She keeps it protected in a pink Otterbox, which gives the iPad a completely different look and feel.iPad Air is thinner and lighter than previous iPads and comes with a sharp Retina display.  I don't know if it's the best tablet for your money.  I do know she keeps it close at all times, and though she doesn't qualify as a geek she's worked in software maintenance most of her professional life.  If she were unhappy with it she wouldn't use it.  From my perspective as her husband it's a winner.My one complaint about all digital gadgets is that they are not nearly as tough as the old HP calculators.  Out of the box the gadgets are beautiful but then you have to stick them in some kind of case if you want to protect them, and the cases are a different look altogether.", "Date": "February 18, 2014"}, {"Title": "Super", "Author": "tct2 \"tct2\"", "ReviewID": "R1SO6X4JJA8GA", "Overall": "5.0", "Content": "I traded in my iPad 2 for the iPad air and could not be happier the performance difference is amazing! And the fact that how much value these devices hold. I received $168 from Amazon for my v2 to put down on the the Air, no other device on the market has the same residual value. I plan on using the air for three years then trading up for the latest and greatest. Read the cnet reviews/comparisons (just search best tablets) on this tablet it is the the cream of the crop and if you keep it in good condition with packaging it will hold its value. Props to Apple and Amazon!", "Date": "February 16, 2014"}, {"Title": "Great Ipad AIr. We love it.", "Author": "Jian Du", "ReviewID": "R16X17BS20UUEB", "Overall": "5.0", "Content": "Thank you providing a great product for easier our life.This is a very attractive product, light & mint and highly effective for work & life usage.", "Date": "February 16, 2014"}, {"Title": "apple i pad air", "Author": "bob f.", "ReviewID": "R23137PS1UPC2A", "Overall": "5.0", "Content": "i considered the apple i pad air since i have used apple products i have often found them easy to use, and ithe  i pad fits right into my computer world.. while others make make great products; i consider apple to be at  the top of the list", "Date": "February 9, 2014"}, {"Title": "Worth Every Penny", "Author": "GTJ3D_shopper", "ReviewID": "R2VDMUVOAX7XI1", "Overall": "5.0", "Content": "Great quality, light, fast, easy to use.  I watch movies, make movies, take pictures and videos, listen to music, and use the apps to get work done.  I love this tablet!", "Date": "January 20, 2014"}, {"Title": "Awesome.", "Author": "Prasuti", "ReviewID": "RANZ97R2E549T", "Overall": "5.0", "Content": "The Apple ipad air is the best tablet made, period! It's light, fast and really easy to use. If you've got an iphone, you'llbe disappointed if you don't get an ipad instead of another brand.", "Date": "January 19, 2014"}, {"Title": "She loves it!", "Author": "JoeBotts \"bottieri\"", "ReviewID": "RX1U3A3YCPAI6", "Overall": "5.0", "Content": "This was a Christmas gift and she loves it.  We took it on out RV trip over the holidays and it worked out perfectly.  No more cumbersome laptop.", "Date": "January 19, 2014"}, {"Title": "Still the best!", "Author": "disks did,e", "ReviewID": "RGY5QBTRH4FJH", "Overall": "5.0", "Content": "I have owned the ipad air, 16gb, for a little over a month now, and it is perfect for my everyday busy life. It is slim, lightweight, and fast! It has the biggest AppStore out there, which is good for my kids. My teenage son loves it because he can do school research on it! No more using an old desktop. This tablet also has  the new a7 chip which makes faster. Even though I did not buy it from amazon, I bought it from AT&T;, you should consider buying it from here too,.", "Date": "January 18, 2014"}, {"Title": "posted earlier", "Author": "Dale Carrison", "ReviewID": "R1OO2UZAD55II4", "Overall": "5.0", "Content": "use it every day  have kids, grandkids, and great  grandkids entertaining us in picture, video, and sound  what could be better", "Date": "January 18, 2014"}, {"Title": "Great", "Author": "gary doyle", "ReviewID": "R1XOLSK5LU10NF", "Overall": "5.0", "Content": "Gave it to my wife for christmas. She is doing dishes . I asked her how she likes it . Loves it 5 stars", "Date": "January 18, 2014"}, {"Title": "Nice iPad air and a great deal!", "Author": "Junevreyes \"Jun\"", "ReviewID": "RRHQC8ICQR1VV", "Overall": "5.0", "Content": "I've been longing to buy an iPad air since it came out. Since this deal came, I took as an opportunity to have one. It's a great deal and I really liked my new iPad air! Thanks*****", "Date": "January 3, 2014"}, {"Title": "Very happy customer", "Author": "Janice \"Janice\"", "ReviewID": "R2FOX3W8I5LSY6", "Overall": "5.0", "Content": "This is my second ipad, when I saw the ipad air I definitely wanted to upgrade.  It arrived quickly and was packaged well.  This vendor is very good.  The ipad air itself is everything you expect from Apple and everything I wanted.  Very, very happy and highly recommend the product and the vendor.", "Date": "January 2, 2014"}, {"Title": "Apple is the Best!!!!", "Author": "BioHazard", "ReviewID": "R1N91OA7RXUSVM", "Overall": "5.0", "Content": "I love the new IPad Air. I got it the day it came out in stores. It starts with the ultra-sharp exterior. If you loved last year's iPad Mini, you'll feel right at home with the Air. Apple essentially built a larger version of the Mini with the Air, by slimming the beveling of previous iPads to achieve a sleeker framework.The lack of heft makes the Air just a little more comfortable: An LTE-equipped Air weighs all of 1.05 pounds. Wrapped in a comfy and protective Apple Smart Case, the Air weighs 1.368 pounds, still lighter than a third-generation iPad by itself. Despite the lack of size, the Air is no less tough. It's sturdy and not at all easy to bend.The Air feels that much more like an electronic magazine. The Retina display, once the standard for all screens but also facing more competition this year, helps that; reading text and viewing web pages on that crystal-clear, pixel-dense screen is the same joy it was when Apple first built Retina screens into its tablets early last year.If this is all Apple did, it would likely still be enough to keep it on top. But the iPad Air does far more, starting with the new processor powering the entire experience, the A7. The same dual-core, 64-bit A7 chip that debuted in the iPhone 5S is in the iPad Air; and initially, this seems like a disappointment. In theory, you expect something more in Apple's flagship tablet, something a bit more powerful, with perhaps more graphical horsepower.In practice, you won't notice a thing. Web browsing and apps still handle as snappily as ever, even if you have a gaggle of things running in the background. Top-tier games such as Infinity Blade 3 continue to deliver. A pleasant surprise is also how quickly some of the beefier games, such as Anomaly 2, loaded, compared to previous iPads. You'll move into and out of levels just a little bit more swiftly, and that helps make the entire gaming experience more friendly and natural. It's hard to know what this really means for Apple gaming, but don't rule out the possibility of more console titles being ported to the iPad.Apple realizes the limitations of the 64 GB storage too, offering a new 128-gig model. You'll pay a more-than-average-laptop premium here ($799 for the WiFi-only model and $929 for an LTE version), but the improved storage is intriguing, especially for those planning for a game-heavy future. I can now easily and comfortably load all the music and movies onto the iPad Air that I want and still have plenty of room left over for games such as XCOM: Enemy Unknown and Civilization: Revolutions.Battery life is steady, even if it's not mind-blowing. Apple claims the iPad Air can get you 10 hours on a charge, and that's definitely true. Even when using Apple's navigation for a long trip to Washington, I easily got through a day without needing to charge; and more casual usage, such as Web browsing and email checks, is no problem.The Air's lone shortcoming is that it lacks the fingerprint identification technology that debuted on the iPhone 5S. But I'd be hard-pressed to claim that this was some glaring omission; every other tablet you're going to use this year lacks such tech, and I've never seen that tech as an absolute must-have.The resulting tablet is as pleasant to use as they come, and it's backed by some consistently solid software. Android has made a tremendous run over the past few years, and a plethora of both Android and Windows Mobile devices are truly intriguing this holiday season. But if there's one consistent shortcoming on those devices, it's the up-and-down support of operating systems.It's hard to know whether this Android tab or that will support Google's latest OS, but that's almost never a problem with iPads. iOS releases are generally consistent and stable, the lone knock on Apple being its lack of Android-like customization.And while the Apps Store and iTunes are also battling competition from Microsoft's stores and Google's Marketplace, Apple's setup continues to set the bar, managing to be intuitive and easy to use and enjoying more and more high-profile digital releases.", "Date": "January 2, 2014"}, {"Title": "Love It!", "Author": "Amy Leftis", "ReviewID": "R9JQAS7K7K0PK", "Overall": "5.0", "Content": "Much faster than the original ipad. A little smaller and lighter in weight. Easy to use and carry with you.", "Date": "January 2, 2014"}, {"Title": "Very Nice!!", "Author": "Cyndi", "ReviewID": "R3MYP9QATDQD5A", "Overall": "5.0", "Content": "I struggle with new technology so I'm still learning about my new iPad Air, but I really like it so far.", "Date": "January 1, 2014"}, {"Title": "ipad", "Author": "raymond dingler", "ReviewID": "R3CKFVGT1KHJZ3", "Overall": "5.0", "Content": "I bought it for my wife & she loves it.It came faster than she expected it.She gives it an A+ .", "Date": "April 14, 2014"}, {"Title": "Son loved this..", "Author": "Melinda Casado", "ReviewID": "R30Q0ZMV11VQXU", "Overall": "5.0", "Content": "It was a gift for our son, and it is his first iPad!  Myself and dad have older model iPads...after seeing and testing the iPad Air, I want one!  Will ask for it for my birthday, and will count myself fortunate if I get one!  It's so much lighter and easier to lug around than older version!", "Date": "April 14, 2014"}, {"Title": "My 1st Ipad !  Did not know what I was missing!", "Author": "GCP1022 \"GC Poli\"", "ReviewID": "R1G8BAVGZIZKCY", "Overall": "5.0", "Content": "I purchased my first Ipad ever and did not know what I was missing, my family and I love it. I read all the reviews on cnet and here!Glad I made the choice, next ipad I will get the 64 gb, due to the great deal on amazon, I could not resist in getting the 128 gb, a lot of apps have already been added and now pictures and movies will soon follow!", "Date": "April 13, 2014"}, {"Title": "My very first apple product... and i really like it alot.", "Author": "IMvVIP", "ReviewID": "RP3R40MNINAWR", "Overall": "5.0", "Content": "I use to have asus t300 android tablet for 2years.But important stuff is i am using android phone for long time.don't need to use tablet that much because my phone does all.however move to ipad.. wow new world.news, email, apps, games, movie, music and cloud storage.so far so good.i am so happy to having this apple ipad air.", "Date": "April 12, 2014"}, {"Title": "Love it!", "Author": "Whoever", "ReviewID": "R1RPV81O35A727", "Overall": "5.0", "Content": "I drug my feet about buying an iPad for a year. Well, I actually bought an iPad retina a year ago and took it back because I was disappointed in how heavy and clunky the unit was. The new changes to the iPad Air makes it soooo much better, and I love it. I checked out the 10\" Samsung and decided it just wasn't enough, and I actually bought the Samsung Tab 7\" last fall, but neither of them hold a candle to an iPad for speed and sharpness. There are a load of androids out there, nothing comes close to an iPad. The battery time on my Samsung Tab 7 is so short I didn't even reconsider the Samsung Tab 10 when I decided I had to have a bigger screen. Great battery time on an iPad.", "Date": "April 8, 2014"}, {"Title": "excelent product", "Author": "Yasmin Porteles Avila", "ReviewID": "R3KSM3CO13GYKO", "Overall": "5.0", "Content": "Excelent product. It arrive on time.  It was a gift to my husband and He really enjoy his ipad. I got to him another tablet before and he use once and never again. With this one he use all the time.", "Date": "April 8, 2014"}, {"Title": "prefer a laptop", "Author": "Suzanne", "ReviewID": "R3CCWOZ6TS37VP", "Overall": "3.0", "Content": "I purchased an iPad as my friend was constantly using hers on her recent visit.  I always heard Apple products were so easy to use.  Probably because I never used Apple before and was accustomed to using Android, I found it difficult to use.  After weeks of reading the manual and trying to play around on my iPad, I tend to still pick up my Android laptop to check emails and search online rather than the iPad.", "Date": "April 8, 2014"}, {"Title": "Fun to learn and may never figure it all out", "Author": "Maggie Anne", "ReviewID": "R2Y3ZE21BE1GB3", "Overall": "5.0", "Content": "I am a new owner and mainly wanted the devise to read books.  But am slowly learning more.  My 6year old great - grand can do then so can I.", "Date": "April 6, 2014"}, {"Title": "We love it", "Author": "Jill Spasser \"Food maven\"", "ReviewID": "R24QZGAR8KGUQD", "Overall": "5.0", "Content": "There is nothing lika an air pad, as the song goes.  It is clear,rapid and portable.  I carry it wherever I travel.", "Date": "April 6, 2014"}, {"Title": "excellent tablet, thin, super fast", "Author": "Coby Moore", "ReviewID": "R1OZ7TFK462GA3", "Overall": "5.0", "Content": "excellent...ultra light tablet,super clear screen, not bulky. This iPad Air is amazingly fast, most apps mirror a desktop/laptop computer which is very nice. The battery is superb, left uncharged overnight and still had 90% battery in the morning...very impressive, also has great WiFi connection...what else can you say..lolno complaints...better than original ipad by far", "Date": "April 5, 2014"}, {"Title": "Great device. Huge improvement from iPad 4.", "Author": "PSB", "ReviewID": "R1MVH9WDWCZH6C", "Overall": "5.0", "Content": "The iPad Air is much lighter than the iPad 4 before it, in fact it’s lighter than all other tablets in its class at just 469g. That’s a drop of almost 200g, or 29%, on the porky iPad 4. That's a huge generational leap.It’s the first thing you’ll notice when picking it up and it really makes a big difference when using the iPad Air for long periods of time. It’s perfectly balanced. You can hold it to read or watch a movie for hours simply by cupping a corner in your palm. Attempt the same with an iPad 4 and you’ll quickly succumb to shaky arm fatigue.On paper the iPad Air’s Retina screen is the same as the one on the iPad 4. It has a 2,048 x 1,536 IPS panel offering 264 PPI (pixels per inch) with scratch-proof and oleophobic protective glass that's resistant, though not impervious, to greasy fingerprints.ProsVery lightRobust and premium designExcellent screenSolid battery lifeConsummate all-rounderConsStorage comes at a premiumNo Touch ID", "Date": "February 27, 2014"}, {"Title": "Great step up", "Author": "Courtney", "ReviewID": "RKV5RTR74QE0B", "Overall": "5.0", "Content": "I upgraded to the iPad Air from the iPad 1 and am very happy.  Very fast, great resolution, and easy to use.", "Date": "February 24, 2014"}, {"Title": "would be five", "Author": "Christina", "ReviewID": "R102X9SL24TEDW", "Overall": "4.0", "Content": "Apple doesn't have a Swype app that works with all applications. If you have any android apps with Swype, then hen pecking will drive you nuts. Unless of course you want to add more money and buy a key board. too bad apple doesn't get with the program  here. people need to be efficient.", "Date": "February 20, 2014"}, {"Title": "The Ipad Air is Good My packaging was BAD", "Author": "Christopher Ralph", "ReviewID": "R2U030Z2K3HBBC", "Overall": "3.0", "Content": "I give this 3 stars because of my packaging. I did not get the Lightning to USB Cable, instead i received the 30-pin. My Ipadair", "Date": "February 13, 2014"}, {"Title": "Lighter, smaller, faster and Retina, what's not to like", "Author": "Ed \"edshull\"", "ReviewID": "ROGIZUDXPCSVG", "Overall": "5.0", "Content": "Purchased to replace a 3rd gen, so obviously a massive improvement. Beautiful screen, nice and compact and very fast. Overall awesome.", "Date": "February 9, 2014"}, {"Title": "Love It!", "Author": "manik sikka", "ReviewID": "RME5DXDZ0KUU1", "Overall": "5.0", "Content": "I liked my new iPad Air,,,It's Fast, Thin, Longer Battery and it's Awesome. Would recommend to all Who wants to buy an iPad...", "Date": "February 7, 2014"}, {"Title": "My review", "Author": "George J. Sliney", "ReviewID": "RPUV5MPD8YYEL", "Overall": "4.0", "Content": "My wife likes it.  Seems like a good tablet.  Not sure I would buy an iPad again though.  That's all.", "Date": "January 29, 2014"}, {"Title": "it was a hit", "Author": "william murray", "ReviewID": "R2JA44776GQE3R", "Overall": "4.0", "Content": "The family loves the christmas gift .It works great.Its attractive ,light weight.Have not had cause to use my protection plan.But i bought it on amazon so i am sure its ok", "Date": "January 27, 2014"}, {"Title": "Very good!", "Author": "Robert", "ReviewID": "R2WEFFHJO218O0", "Overall": "4.0", "Content": "Great overall, super light w/ awesome display! Although the battery could be just a bit better. Still a great buy!", "Date": "January 24, 2014"}, {"Title": "This thing is amazing", "Author": "Claytonss", "ReviewID": "R1V4EI0ADNYXD2", "Overall": "5.0", "Content": "I got the iPad air today and its amazing I had a kindle fire and the iPad air is 50 times better apple has done it again.", "Date": "January 22, 2014"}, {"Title": "Easy to use!", "Author": "Teresa", "ReviewID": "RWPH3WR5X641P", "Overall": "5.0", "Content": "I am not a very tech savvy person, but this ipad air came highly recommended by a person that is. I asked this person what they thought about other tablets, such as Surface, or Android, which were a little less expensive, but he said this would be the easiest for me to \"figure out\"---and it has been. I mostly use it to google things, any where from educational to gossip tv shows and can find everything easily. Not only does it have \"Siri\", you dont even have to type to enter a post on facebook. You just use the microphone thats easily seen, and speak what ever you would normally type. I no im only at the tip of the iceberg with what it can do, but i learn new things everytime i pick it up. Not being able to sit at a computer for very long, Im able to take the ipad to bed with me & look up things easily while resting in bed. I no several people that have them and they all LOVE them---i now see why.", "Date": "January 21, 2014"}, {"Title": "Amazing!", "Author": "killercolors", "ReviewID": "R28S5QDODBOAFL", "Overall": "5.0", "Content": "Let me start out by saying that I am an android user that only recently decided to give apple a try. The only iPad I owned was the 1st generation iPad. Now, that alone wasn't enough to make me change from my android devices, but recently I decided (after seeing how thin this new one was) that I'd give apple another go. -- HOLY COW!!! Where has this tablet been all my life?The Apple iPad air is amazingly light weight, thin, beautiful and crazy fast! This just left my samsung galaxy in the dust with little to no effort involved. Now while I did not get the iPad air from amazon I bought it on eBay, still sealed in the box, brand new, for only $475. That alone was a steal in comparison to buying it on here or anywhere else. I also purchased an iPad air case from walmart so I didn't end up spending over $14 for the case.With that said, if you have a 1st or 2nd gen or are even just now thinking of getting on the apple bandwagon as I have, this is the one to do it with!", "Date": "January 20, 2014"}, {"Title": "Quick & painless", "Author": "kathleen miley", "ReviewID": "R3LMDZ34HOX8XP", "Overall": "5.0", "Content": "Arrived quickly and is a great product! A gift for Christmas for my son,  It's definetly being enjoyed - may. Have to get another.", "Date": "January 20, 2014"}, {"Title": "super", "Author": "Frank Hendrikx", "ReviewID": "R3PRHYSPLT3ODL", "Overall": "4.0", "Content": "quick, smooth, simple really a fantastic machine. only the battery is quite quicke emtpy, thats a pitty. for the rest fantastic", "Date": "January 19, 2014"}, {"Title": "Just what it's supposed to be", "Author": "mikeyyyownz", "ReviewID": "R29YQ94YM16KPM", "Overall": "5.0", "Content": "I bought this for my wife for Christmas. We have Verizon and I wanted an Ipad for her that was 4g, as well as to upgrade her from the  Ipad 2 she already had. The price was more than going through Verizon, but I needed it quick for Christmas, and I had Amazon gift cards so it came out cheaper for me in my situation.Anyways, I'm not going to go into detail about the Ipad Air. There are countless reviews online. I'm just writing this in case anyone is hesitant to purchase from this specific seller. I got the item quickly and didn't have any problems. The wife was able to connect it to our Verizon account and she uses it all the time.", "Date": "January 19, 2014"}, {"Title": "Good product.", "Author": "Foothill Ranch 14", "ReviewID": "R14KHENAP2N3UU", "Overall": "4.0", "Content": "Good product but not as mobile as I thought. I prefer my kindle to read but this to watch prime or Netflix on. Sometimes I feel like I have to use it to get my money's worth. But it's good for my family and I.", "Date": "January 18, 2014"}, {"Title": "A great product", "Author": "John R. Sitzman", "ReviewID": "R3GFOB7XNDFQQ1", "Overall": "5.0", "Content": "Actually light as air and very functional. The first Apple product I have owned but I will definitely buy more in the future.", "Date": "January 18, 2014"}, {"Title": "Crazy thin and light plus beautiful screen", "Author": "sgun73 \"Steve\"", "ReviewID": "RYT21QYXB65Q9", "Overall": "5.0", "Content": "I've had every generation of ipad and both minis and several androids and this tablet right here and now is the best ever made and my clear favorite. The thinness and lightness almost doesn't make sense. I did find myself confused at first as to how such an amazing device could be made by humans. Maybe it wasn't. Could have come from space. Or maybe the Enterprise from the future brought it back to Apple and said here. Enjoy.But seriously, the build quality is wonderful. As light and thin as this tablet is it still feels solid and sturdy. The screen is beautiful and the colors are deep and rich. The colors are actually noticeably better than the first and second generation minis. I've held them side by side and there is a pretty wide gap between the two in terms of richness of color. The ipad air looks vibrant and robust with deep blacks and warm bold colors.Plus it's very fast. I loaded up GT Racing 2 last night and it ran flawlessly fast and looked absolutely gorgeous. I couldn't believe how sharp the cars looked and the backgrounds had such depth. I should stop writing and go play right now.Despite the other great tablets like the Nexus 7 and 10 or the Samsung Galaxies 8 and 10 the ipad air is in another realm. A realm all to itself. You'll never pick up another tablet and be shocked at the miracle of design you hold in your hands.", "Date": "January 16, 2014"}, {"Title": "Happy", "Author": "Ben A. Holliday \"Ben\"", "ReviewID": "R2IHKIXHY3VJG7", "Overall": "5.0", "Content": "It was a gift to my wife and she loves it, so that makes it worth it. As much as she uses the iphone now she at it with the ipad. Shewatches TV and a movie on the iPad at the same time.", "Date": "January 15, 2014"}, {"Title": "Loved It!", "Author": "Ramon S. Reyes", "ReviewID": "R8GCU6Z8NYVVA", "Overall": "5.0", "Content": "This iPad Air was a gift for my wife and she continues to enjoy it immensely.  The unit is much lighter than her first generation iPad and the graphics are definitely better.  She can now use Facetime since this new unit has a camera, one that did not come with her original iPad.", "Date": "January 15, 2014"}, {"Title": "Not worth the upgrade for me", "Author": "Jose J. De Cruz \"Joseph\"", "ReviewID": "R35O799HV2E0NL", "Overall": "3.0", "Content": "Three stars only because this iteration has a better volume and is slightly(almost unnoticeably)lighter. I think ipad 3 and 4 have a better quality built and their retina display is much brighter and colors are deeper than Ipad Air.", "Date": "March 21, 2014"}, {"Title": "Super Thin & Perfect for Me!", "Author": "J. Ferris \"tunawish\"", "ReviewID": "R21T328ZNCRSWK", "Overall": "5.0", "Content": "I made the switch from Windows to Mac about 2 years ago & loved the MacBook Pro while I only liked the older iPad mainly due to the fact it only had 16gb onboard & no memory card slot (it also slowed down noticeably with iOs 6.)I traded my MacBook Pro & old iPad for a new MacBook Air & a 64gb iPad Air & now I love my MacBook AND my iPad.Apple has now made iWorks (Pages, Numbers & Keynote) free with new devices & I've almost cut the Microsoft tether completely (hooray!)The iPad Air is lighter, faster & has a longer lasting battery & a bright, crisp display.All this in a sturdy yet stylish tablet (no cheap plastic here.)I don't know why anyone would want a Samsung or Microsoft tablet (unless they are forced to shop for a cheap alternative of course.)Call me a fanatic if you want but there is no substitute for the quality & ease of use of an Apple product...", "Date": "February 25, 2014"}, {"Title": "Color me impressed", "Author": "J.Page", "ReviewID": "RMP67WLYRCB8E", "Overall": "5.0", "Content": "I was going back and forth over which tablet to purchase for about 3.5 weeks.  I was a previous Iphone user that moved on to Android because I didnt like the size of the 5.  I have two kids so consumer level usability is high on my list especially with a son that has autism.My choice came down to a samsung or the ipad since the nexus 10 2 is still MIA. :)  The samsung had several things going for it.  MicroSD, customization and control, mutliple user profiles but to be honest their overlay is a huge turn off and the plether backing with fake stitching just looks horrid.  I would say that the plastics are fine but why bother with fake stitching? I spent time in a B&M; and the feel was good, but visually as a whole it felt less...high end even with the price being in the same range as the IPad.  With several cloud storage options and knowing that I would be using it for light work related items and sharing it with my kids to some extent the MicroSD while nice was not compelling.  I do wish apple would realize that multiple user accounts would be helpful because that is one of the things that almost moved me to the samsung.  Both screens of course are amazing and I have to give it to the samsung on using a better aspect ratio for media, but the samsung felt klugy when trying to use it in portrait.  So with all this being debated in my head for a few weeks back and forth I decided on the IPad.  As an aside, I love the build quality and would have seriously considers a Kindle Fire HDX but the lack of the google play store put it out of contention.  It is one thing to have a walled garden like apple where just about any app you can think of is available, but it is quite another to have a walled garden like Amazon where you either have to root or sideload to simply get some basic useful apps.  If the Kindle Fire HDX had google play store, this might have been an entirely different review. :)Two things have stood out as I have delved back into the walled garden that is Apple...One, It may be a walled garden, but it is a gorgeous garden.  The app quality and availability is outstanding. If they allowed Google Play Music I would not have any issues at all with the app store.  I think that the tighter development control that apple institutes on its apps is a double edged sword in some respects but I have not had anywhere near the amount of bugs that I find in the android store apps so in that respect I appreciate that 98.7% of the time when I download an app it just works.  I use it with several google services including chromecast and have been very happy with the results. On a side note, the hardware and build quality is meticulous and the IPad itself is even more impressive after prolonged use, but that has been discussed and beaten like the proverbial dead horse.Two, battery life.  Apple seems to know how to eek out the battery life with more finesse than some competitors.Overall I like the IPad Air much more than I thought I would.  I bought it knowing from a techie nerd stand point what I was giving up with the ecosystem and I have had no regrets at this point.  I can use it for work emails and presentations and come home to play netflix or games with the kids.  An outstanding product that I am sure I will use for the next year or two without issue.And my non-verbal autistic son can run this thing like a beast ;)", "Date": "February 15, 2014"}, {"Title": "Absolutely stunning", "Author": "grittynitty", "ReviewID": "R1KA2I41NUYYUG", "Overall": "5.0", "Content": "Finally got a good chunk of cash when my tax return came and decided to get my own iPad (family had an iPad 2 but surely couldn't call it my own). I couldn't be happier. This thing is so well made and noticeably lighter and sturdier than the iPad 2. Very easy to set up as well.I recommend spending a little extra to get more memory. App sizes are just going to get bigger as time goes on. It just didn't make sense to me to pay so much for only 16 GB; I got the 64 GB myself and feel this iPad should serve me well for at least the next three years.", "Date": "February 15, 2014"}, {"Title": "iPad Air..works great, fast, but expensive!", "Author": "Charlie W.", "ReviewID": "R5MQPTZF3DW6N", "Overall": "4.0", "Content": "he iPad Air is a LOT lighter than the iPad 4, much faster (mostly play games on mine) and is solidly built. It's just expensive. All the games that had framerate issues on the 4 play smooth as silk now. Sound has improved as well. Also, the camera has improved. I took some really great photos of a storm that passed through, as well as some video.", "Date": "February 1, 2014"}, {"Title": "Apple products are the best", "Author": "Linda Childs", "ReviewID": "R3FWKY8A5U2QXJ", "Overall": "5.0", "Content": "What I don't understand is, I'm working for the U.S. Navy in Yokosuka, Japan.  You sent this iPad to me at our P.O. Box here.  However, when I went back to Amazon and tried to order a case for it, I received a message that said you could not send computers overseas.  Really?  I just wanted to buy the case and you had already sent the iPad.  Kind of strange don't you think?", "Date": "January 31, 2014"}, {"Title": "Worth Every Penny", "Author": "GTJ3D_shopper", "ReviewID": "R2VDMUVOAX7XI1", "Overall": "5.0", "Content": "Great quality, light, fast, easy to use.  I watch movies, make movies, take pictures and videos, listen to music, and use the apps to get work done.  I love this tablet!", "Date": "January 20, 2014"}, {"Title": "Buyer beware", "Author": "Vertigo", "ReviewID": "R6PRPBDA9FGFH", "Overall": "1.0", "Content": "Nice tablet with a fatally flawed web browser problem.  My iPad Air started with Safari crashing right out of the box.  I put up with it for a month and then had it replaced by Apple under warranty, however, the problem continued.  The experts at the Genius Bar said the problem would be fixed in iOS 7.1.  After upgrading to 7.1 today the issue persists.  Puffin browser seems more stable but still crashes on occasion.  Apple's failure to fix this is unacceptable.", "Date": "March 10, 2014"}, {"Title": "very good device", "Author": "Jin Bolong", "ReviewID": "RWCSQ5SM6LWXR", "Overall": "5.0", "Content": "my friends told me to buy one for him, he really likes it.  why it require so so many words.", "Date": "June 9, 2014"}, {"Title": "very good", "Author": "li Zhang", "ReviewID": "R3G06TOTR9LDBE", "Overall": "5.0", "Content": "It's value for money. I bought it several months ago,and everything is ok. very good quality.I like it very much.", "Date": "June 9, 2014"}, {"Title": "Happy Customer", "Author": "D. Holland \"artist\"", "ReviewID": "RRSPFDYYTIGI2", "Overall": "5.0", "Content": "I've had my new iPad for two days; and so far I love it. I am having to learn some features that I'm not used to as I have always used Windows; but in general, this device is easy to use. All in all, it's an amazing step up in it's technology. I'm now an Apple fan after many years of resistance.", "Date": "June 3, 2014"}, {"Title": "Apple", "Author": "Silvia", "ReviewID": "R1YCWG6FVI6KZK", "Overall": "4.0", "Content": "The exceptional engineering continues by Apple. The new iPad is so light and fast with brilliant picture quality that I watched most of the March Madness on it when I wasn't near a good sports bar. Very fast, love the apple apps", "Date": "June 3, 2014"}, {"Title": "Absolutely Love the iPad Air", "Author": "Ann de Vries", "ReviewID": "R3T5D991D644IF", "Overall": "5.0", "Content": "I bought my 128GB iPad Air with 3G  and had trouble using it because my husband couldn't keep his hands off it. He loved it so much that we got one for him. We bought the Apple cases for both of them and my husband bought the stylus, as well.We  are both very pleased with these tablets. My husband has a neurological condition and the accessibility features and stylus have been wonderful for him. He stopped using his laptop for portability, because the iPad Air does everything he wants. We were afraid it would be too heavy for him to hold, but he has found it to be lightweight and comfortable, and it does weigh less than earlier iPads. Anyone with vision and fine motor skills problems is almost certain to love the iPad Air, especially when combined with the stylus.I dropped my iPad twice when in parking lots, both times from low heights, but on hard surfaces. The case protected it and I have had no problems resulting from the drops.We use our iPad Airs primarily for reading Kindle books. Our joint account has a huge archive and our other devices were not handling it. The K4iPad app and this unit work beautifully together and we have had no problems accessing our books. This iPad is powerful.We were worried about how comfortable it would be to read for long periods because we kept hearing that tablet screens bothered one's eyes. We found it easy to use the settings to adjust the screen lighting, and found an adjustment that has caused no eye problems, even when reading for several hours. It has been very comfortable. We have also read in fairly bright sun with no problems. However, when the sun was actually hitting the screen, it was impossible to read on it.We do use the iPad Air for many other functions. Games, surfing the web, eMail, videos, music, photos, YouTube, social networking sites, and so on, work as well as on a computer. The battery lasts a long time and the 3G is a real bonus when wi-fi is not available.I have seen some negative reviews of the iPad Air, and I don't doubt that some people have had bad experiences. All I can say is that we have had good experiences with Apple. Our iMac was out of warranty and still working when Apple notified us they were replacing the hard drive on all iMacs like ours, because the hard drives had an unacceptable failure rate. When we took it in to the Apple store, I asked them to also check my iPod Touch, which was two years out of warranty and had become very temperamental and glitchy. They found a corrupted file on the iPod Touch and got it set up and working for me, and didn't charge anything.  We have had good experiences with the iPad Air and are extremely happy with both of ours.", "Date": "June 2, 2014"}, {"Title": "Wonderful", "Author": "Brad Potts", "ReviewID": "R1IOW55MJ0WJHD", "Overall": "5.0", "Content": "This is a ergonomic, user friendly, electronic media formate for the casual user.  Apple will be my choice for my next computer!", "Date": "June 2, 2014"}, {"Title": "Used in perfect condition!", "Author": "Sandra J. Howard \"Sandy's How\"", "ReviewID": "R1CQEN04X1KSHG", "Overall": "5.0", "Content": "I had ordered a used iPad Air white/silver with AT&T; cellular, but received black/silver with Verizon! Actually I like the black but was disappointed that I did not get AT&T; cellular which has the best data plans. Product was used but in perfect condition including 20 months of Applecare. I really enjoy my iPad.", "Date": "June 2, 2014"}, {"Title": "Great device", "Author": "Hector Gallego", "ReviewID": "R11C7FJLW2SNR3", "Overall": "5.0", "Content": "I bought the Ipad for my cousin and we need it asap. The timing was so great that the whole family is happy about the arrival of the new apple air.", "Date": "June 2, 2014"}, {"Title": "Awesome device", "Author": "Brandon", "ReviewID": "R2A2SLALS4MY24", "Overall": "5.0", "Content": "I had the Ipad 2 before I got the air. way better in every aspect, worth every penny. Really fast and reliable", "Date": "June 2, 2014"}, {"Title": "Very fast!", "Author": "W. Qian", "ReviewID": "R1QUQ9GW19Y4SO", "Overall": "5.0", "Content": "I've owned a IPAD2 for several years. This one is much faster and the screen is of much better quality. Definitely worth the upgrade.", "Date": "June 2, 2014"}, {"Title": "Suspicious packaging but overall good", "Author": "Jose", "ReviewID": "RZU7Y6FYOWTOO", "Overall": "4.0", "Content": "The iPad itself is great. Beautiful display and very sleek light and overall very pleased.The delivery was fast. I rushed mine and was here less than 24 hours, which was great.One thing however, the package seemed scratched as if it were rubbing up against something. Since it was the outer plastic cover i didn't mind much. What I found weird however, was that the inside too seemed the same. After careful inspection, there seemed to be no damage or any sings of the device being previously (since it was listed as new) and the packaging made it seem a bit suspicious. Overall however, good experience.", "Date": "June 1, 2014"}, {"Title": "I love the IPad - but it cannot be used", "Author": "Mary", "ReviewID": "RKYUEW5R860G6", "Overall": "5.0", "Content": "I went to T-Mobile to get data so I could use it away from home and apparently whoever had it previously, didn't pay for it.  Therefore, T-Mobile couldn't hook me up.  The machine is blocked, locked or something.  I will need to send it back.  I am in the process of finding out how to return it.", "Date": "June 1, 2014"}, {"Title": "He loves it!", "Author": "Mezz", "ReviewID": "RZ8DIDHBLID23", "Overall": "5.0", "Content": "Cant believe I found it for this price! No joke, no gimmick. It's really an Apple newest generation iPad and with this price I saved to spring for a case.", "Date": "May 22, 2014"}, {"Title": "Why would you buy any other tablet.", "Author": "Smokey", "ReviewID": "R2C87HGKLPP1V8", "Overall": "5.0", "Content": "I just recently replaced my iPad 2 with this new iPad Air with Retina display.Awesome.The exceptional engineering continues by Apple. The new iPad is so light and fast with brilliant picture quality that I watched most of the March Madness on it when I wasn't near a good sports bar.I bought  the 128 GB model to put my iTunes library of over 10,000 songs on it and also to work on documents and spreadsheets using Numbers, Pages and Keynote that were free. Owning an iPad has become a necessity due to travel demands and enhanced by the Apple ecosystem tying into my other Mac hardware.I have bought one for every member of my family including parents due to the ease of use, carry ability and quality.", "Date": "May 22, 2014"}, {"Title": "Lightweight and FAST!", "Author": "Brittany", "ReviewID": "R169TVKTCS5RZ1", "Overall": "5.0", "Content": "I went from the 3rd gen to this, only because mine was slowing down and I needed more GB storage. It's a great upgrade. Very fast, love the apple apps, and it's much lighter than the older versions. Just wish it had the fingerprint sensor like my phone!", "Date": "May 21, 2014"}, {"Title": "The ULTIMATE grad gift!", "Author": "Doc W8 \"Librarian\"", "ReviewID": "RYJWOGJY615DE", "Overall": "5.0", "Content": "Four of us gave this to our nephew for graduation. He was thrilled, to say the least. it arrived on time, packed perfectly. We got the package deal, with the iPad, a case, and two screen protectors. He and his wife  ( our niece) had it set up and running almost immediately.", "Date": "May 21, 2014"}, {"Title": "great tablet", "Author": "Björn V.", "ReviewID": "R3PH3Q6LQJTPK1", "Overall": "4.0", "Content": "This is a great tablet. Very fast and intuitive with a great camera as well. Too bad you are locked into Apple and you are not able to add an extra SD card.", "Date": "May 21, 2014"}, {"Title": "Traded in my Dell", "Author": "Carll  K  Rich", "ReviewID": "R1KN8CQPXKYXAK", "Overall": "4.0", "Content": "I would never have believed it as I have always been a PC man for many years.  Had them all since my TRS-80 to include Gateway, Toshiba and several Dell's. Frustrated by Windows 8 I finally jumped ship to Apple and could not be more pleased.  Great machine, no complaints.", "Date": "May 21, 2014"}, {"Title": "The best Tablet out there", "Author": "Saikat", "ReviewID": "R2UEXJGUOIAWA5", "Overall": "5.0", "Content": "This is the ultimate Tablet...very simple to use. Sleek interface. It is like having a computer on the go without the bulk!", "Date": "May 21, 2014"}, {"Title": "android lover no more", "Author": "Wayne Stewart", "ReviewID": "R3O2SMBDZAYRI", "Overall": "5.0", "Content": "I finally gave in and bought the iPad. Android lover in the past but I am afraid that is no more. The lack of control and expandability I can deal with since we are all going cloud anyway. Great device with awesome graphics.", "Date": "May 21, 2014"}, {"Title": "Love it!", "Author": "Agnieszka", "ReviewID": "R1S0GSEL64UAAN", "Overall": "5.0", "Content": "I am just loving my new ipad! It was a great purchase! and I would definitely recommend it to everyone!", "Date": "May 20, 2014"}, {"Title": "Great Product", "Author": "Robert Dunn", "ReviewID": "R27G0OE8HG1XZU", "Overall": "5.0", "Content": "This is a very good product - very versatile and an excellent buy.I will purchase another in the near future", "Date": "May 20, 2014"}, {"Title": "Love the smaller size", "Author": "ALICE P. SMALLEY", "ReviewID": "R2X2ADLWPKX7E1", "Overall": "5.0", "Content": "I have another ipad and wanted a smaller one.  I find this one easier to travel with.  It fits in my large tote bag that I use for travel.", "Date": "May 18, 2014"}, {"Title": "Sleek and fast.", "Author": "djbrian", "ReviewID": "R68ZW8BWYHDJR", "Overall": "5.0", "Content": "This is a great tablet. Very fast. I would encourage anyone considering a tablet to purchase this one. You won't be disappointed.", "Date": "May 18, 2014"}, {"Title": "Great device!", "Author": "Malgorzata", "ReviewID": "R7CNGQRFEIC1G", "Overall": "5.0", "Content": "Everythin's fine, great features. Works perfectly. I'm totally happy. Recommend to everyone, but next time I'd choose 32GB version. Thanks", "Date": "May 18, 2014"}, {"Title": "Beautiful Display:", "Author": "Nick Basile", "ReviewID": "RMKVQ5SQKLXUI", "Overall": "5.0", "Content": "I just bought this as a step up from the original iPad.  What an amazing difference in the display with the new retina display.  Also it is considerably faster and lighter.  Great product!", "Date": "May 18, 2014"}, {"Title": "IPAD AIR", "Author": "Starmacs", "ReviewID": "R3C9DJWI6XU8I2", "Overall": "5.0", "Content": "WHAT CAN I SAY,  THIS IS THE BEST PAD YET,,VERY LIGHT. I UNDERSTAND WHY THEY CALL IT AIR...FAST WITH THE I7 CHIP AND EASY TO USE..", "Date": "May 18, 2014"}, {"Title": "iPad Air - makes my iPhone 5S seem heavy", "Author": "Mark Hilliard", "ReviewID": "R3N4N2DBHQIO2P", "Overall": "5.0", "Content": "I had an iPad \"1\" and wow this is a serious improvement.  It is is light that it makes my iPhone 5S seem heavy.", "Date": "May 17, 2014"}, {"Title": "Fast delivery", "Author": "Trung Tran", "ReviewID": "ROHKW8REH0AFL", "Overall": "5.0", "Content": "Great product as expectedLike the white colorDon't mind the smaller capacityWifi works great for me and easy", "Date": "May 17, 2014"}, {"Title": "Very nice. No regret.", "Author": "Kuli", "ReviewID": "R1XWL8QT4LNDMJ", "Overall": "5.0", "Content": "This was a birthday present for my daughter.OMG this is very light. She uses it to taking a notebook at school. (i hope)She seems to enjoy a lot. So I have no regret to spend this.", "Date": "May 16, 2014"}, {"Title": "AMAZINGG!!!!!!!!", "Author": "Rosa Sanfilippo", "ReviewID": "R296C2DEWI3X43", "Overall": "5.0", "Content": "this is a wonderful product its like a having a mac book that you can carry around everywhere i recommend this product", "Date": "May 16, 2014"}, {"Title": "Light and Fast", "Author": "Ben", "ReviewID": "R30PJH465ED8YV", "Overall": "5.0", "Content": "I love my iPad. I fully acknowledge that I am a bit of an Apple loyalist at this point. Much of that is due to the quality of the products, but much of it is also tied to the way that all of the manufacturers force loyalty to a degree. All of my Apple products work seemlesly together. I might have went with a Samsung or Kindle for my tablet, but that would have meant not having access to apps and content that I had previously from my iPhone, etc. Oh well. It's been a great product, and I have no regrets. I was also able to use the Amazon Trade-in program to exchange some old tech items to help get some Amazon credit that I was able to apply towards the purchase. Every little bit helps.", "Date": "May 16, 2014"}, {"Title": "Incredible table", "Author": "Francisco Vazquez", "ReviewID": "R1P0KMZJ8LN21M", "Overall": "5.0", "Content": "Our fist Apple Ipad Air tablet, and for sure not the last one.. is amazing and friendly when use.. thanks!!!", "Date": "March 13, 2014"}, {"Title": "He loved it.", "Author": "wonno", "ReviewID": "R10X54EO26G7ZD", "Overall": "5.0", "Content": "Gift for my husband who loves it.  Wish I had one, too!  Easy to learn and use and easy to carry.  Graphics are incomparable. Does everything he wants to do and more.", "Date": "March 13, 2014"}, {"Title": "iPad Air lighter and slicker", "Author": "Richa tripathi", "ReviewID": "RVVASSQGWIAH", "Overall": "5.0", "Content": "Definitely an improvement in comparison to the previous versions of ipad. However, it is not as airy as is usually claimed.", "Date": "March 13, 2014"}, {"Title": "Superior tablet", "Author": "CC", "ReviewID": "R32XDY7QSJ4KKL", "Overall": "5.0", "Content": "There are many tablets out there that you could purchase instead of the iPad and save yourself money. For those of us who have to work off Apple systems - purchasing the iPad makes life easier rather then purchasing another brand tablet and having to download various apps to make everything compatible.Apple does make superior products so there's not complaints here for this tablet other than the price. I'm an Apple user and I'm very happy with the iPad air - every aspect of it.The one piece of advice I will give is if you don't need the iPad don't get it. If you work with Apple products and need a tablet then there's no reason you should complicate your work flow with a non-Apple product.", "Date": "March 13, 2014"}, {"Title": "IPad Air", "Author": "Philip L Korenstra", "ReviewID": "R2BCL5H1NCNU6Q", "Overall": "5.0", "Content": "Product is a good as everyone clams.  Delivery was received within 24 hours.  The air is a product for the future.", "Date": "March 13, 2014"}, {"Title": "A wonderful gift / merchandise", "Author": "Carl Harmon", "ReviewID": "R2UYOP3UDSTUL4", "Overall": "5.0", "Content": "Bought this for a friend, as I had one myself. The person isn't near any Apple store, so I wanted to make sure I got them a good one, and with insurance (Square Trade) with it as well.  Was delivered to them in Two days, and they've been having fun with it ever since.", "Date": "March 12, 2014"}, {"Title": "I love it!", "Author": "L. Gabriel \"the frugal cook\"", "ReviewID": "R3JZK2YSN06PVI", "Overall": "5.0", "Content": "After using my old early version of iPad for years I am enjoying the speed, easier downloads, and excellent graphics.", "Date": "March 12, 2014"}, {"Title": "A birthday gift.", "Author": "Julio A. Pieraldi", "ReviewID": "ROUZE655F0BD0", "Overall": "5.0", "Content": "A gift for my wife. She's happy, I'm a hero in her eyes. Now I'm questioning her if I should get one for myself.", "Date": "March 12, 2014"}, {"Title": "Love my new ipad!", "Author": "Cheryl Faulkner", "ReviewID": "R36WC1BGR6DD2Y", "Overall": "5.0", "Content": "I've been an Apple fan for years, so once again I wasn't disappointed -- wonderful product, easy to set up and use, lightweight -- overall a fun device!", "Date": "March 11, 2014"}, {"Title": "Great item!", "Author": "lana mccloud", "ReviewID": "RUGRANQWGY87", "Overall": "5.0", "Content": "I love the size, it is so lightweight and easy to work with.  It is  well worth the price. I would highly recommend this item!", "Date": "March 11, 2014"}, {"Title": "Real nice", "Author": "John Wojtowicz", "ReviewID": "REOC67CBA3HI3", "Overall": "5.0", "Content": "This is the first tablet I've bought I have not even played around with one. I bought this after checking  out competitor prices and this was the best buy I could find.  I am extremely happy with it. It is much easier than any windows based item I have used.  I did one thing wrong and gave my laptop away. There are sites I'm unable to access some needed downloads to a tablet.", "Date": "March 9, 2014"}, {"Title": "Apple IPad Air", "Author": "Pat Bluth", "ReviewID": "R2ZTZNRGROPUC5", "Overall": "5.0", "Content": "This Apple Ipad Air was purchased as a Christmas gift.  The recipient of this gift was very surprised and happy to receive it.  She was taking a trip and found the Ipad easy to pack and did all she needed to do as if it were her computer.  Very pleased with the product.", "Date": "March 9, 2014"}, {"Title": "iPad air", "Author": "alice lynch", "ReviewID": "R14P29E7WT9MF0", "Overall": "5.0", "Content": "Love my iPad air. It is so light and easy to use. I received it on the date that I was suppose to and have been having fun with it every day. Really like reading books on it so easy to read. Handy to use.", "Date": "March 8, 2014"}, {"Title": "Love this iPad", "Author": "Richard V.", "ReviewID": "R1KV98BFYI1VQ1", "Overall": "5.0", "Content": "This is a great tool! It's instantly on when I want to use it. I can take it anywhere and it's already to give me any information I need. I should have made this purchase a long time ago..", "Date": "March 8, 2014"}, {"Title": "Welcome to the age of technology", "Author": "Susan Macosko", "ReviewID": "R17IL5Q5NJ1QTD", "Overall": "4.0", "Content": "Having this kind of technology is a learning experience for me.  I am enjoying using \"facetime\" with my family.  It is much better than \"Skype\".", "Date": "March 7, 2014"}, {"Title": "Awesome new ipad Air", "Author": "Andrew Viernes", "ReviewID": "R3VTONI22U4AO6", "Overall": "5.0", "Content": "Have had every upgraded iPad since it's inception and this is the pinnacle of iPad design, functionality and style. Great battery life, screen resolution and weight.", "Date": "March 7, 2014"}, {"Title": "unbeatable", "Author": "cset", "ReviewID": "R2N3F59CO5YKWX", "Overall": "5.0", "Content": "iPads are still the easiest to use, most versatile and best quality tablets on the market.  Samsung has some nice Android OS ones, but they are just as expensive and with Android you have so many different brands and versions of OS that it is impossible to standardize as a program/App may work on one but not on another brand or model etc. Apple just makes user support a non-issue. Power on and go.", "Date": "March 7, 2014"}, {"Title": "New tricks for an old dog?", "Author": "V. Chevalier", "ReviewID": "R3RQFBRHRN1PCA", "Overall": "5.0", "Content": "When I'm home in my comfy chair, I still prefer using my laptop with the old keyboard and mouse; however, when I'm anywhere else, this iPad is wonderful!  It's fast, convenient and the battery lasts so much longer then my laptop battery.I'm not tech savvy and I have yet to learn a lot (like using word or numbers programs) but so far the old gal is thrilled with it.", "Date": "March 7, 2014"}, {"Title": "Perfect!", "Author": "Luiz Ferreira", "ReviewID": "ROB775JLKVC9A", "Overall": "5.0", "Content": "I choose this raiting because I didn' nothing wrong. Absolutely  PERFECT.That's all I want. Beatiful. Light. Fast. Fast. Faster. Recomend to all my friends.", "Date": "March 7, 2014"}, {"Title": "Love it!", "Author": "avidreaders", "ReviewID": "R1D53BTB8VHP81", "Overall": "5.0", "Content": "I should have purchased this much sooner much easier than carrying around my laptop.  Nice to share with my iPhone.", "Date": "March 6, 2014"}, {"Title": "iPad air", "Author": "Nicole", "ReviewID": "R2X2NC92JEZIAR", "Overall": "5.0", "Content": "Great product and very lite and hd clear better than my ipad 2 on something's it's a all around good product.", "Date": "February 10, 2014"}, {"Title": "Valentines Gift", "Author": "David Ballerini", "ReviewID": "R2UFVHNH3KJY1C", "Overall": "5.0", "Content": "I bought this for my wife. Bottom line, she loves it. As I am tech challenged, my neighbor helped set the device up. Thank God for helpful neighbors!", "Date": "February 9, 2014"}, {"Title": "What can I say perfect product", "Author": "mona ghobrial", "ReviewID": "R1OLTIUVY1Y04B", "Overall": "5.0", "Content": "What not to like!Portability light weight and powerful and I am doing whatever I need to do without being tied to my desktop", "Date": "February 6, 2014"}, {"Title": "Pretty nifty!", "Author": "Jill B. Kettleson \"Sparky\"", "ReviewID": "R183OBAPWSNC4C", "Overall": "5.0", "Content": "This is ideal for just about anything... I have the iPhone 5s and this is a good compliment.  I highly recommend this.", "Date": "January 31, 2014"}, {"Title": "The future is a breeze", "Author": "The Guardian", "ReviewID": "RCZI8SDOCSF1B", "Overall": "4.0", "Content": "The iPad has established itself in four short years as the 'tablet of choice' to which all others are compared, and the Air is the newest and coolest in the family.First of all, the good news. At 467g the Air redefines computer portability and is so lightweight it's hard to tell whether you're carrying it in your bag or have in fact forgotten it, without looking to check. The Air has a fast A7 chip and the screen is a useful 9.7 inches; it's a breeze to use. The design of the graphics is so intuitive that any child or technophobe can master it and feel at home in a few minutes, which makes it the perfect entry-point into IT for someone who has so far avoided computers.One of the clever things Apple have done is the creation of the individual `Apple ID' which means once you enter your ID & password your iPad, iPhone, iPod and Mac immediately share all their files, and everything you created or stored on one device becomes available on them all: photos, music, reminders, address book, documents are all shared. This is probably the most brilliant idea ever in the IT mass market to create brand loyalty among consumers and `locks you in to the corporation for the duration'.Now, the bad news: the software crashes from time to time necessitating a reboot, which is annoying and inconvenient. This fault is acknowledged by Apple, as the software has a few bugs. Also the wireless reception is not all it might be, as it sometimes (mysteriously) fails to connect to even a moderately strong signal.Apple's pricing structure does not reflect the cost of manufacture but is driven by a market segmentation strategy, so the price really cranks up if you want an iPad with more memory or which can use the GSM phone network. The best value is the 16G Air without Cellular, which only connects to the internet via WiFi. 16G is a lot of memory by the historic standards of portable computers and you'll only find it insufficient if you want to store a lot of big files like films or powerpoint presentations.You'll need a carrying case to protect it (scores of different designs are available) and maybe a keyboard, which if you're doing a lot of writing and document creation rather than just surfing the internet is the one essential accessory, as without a separate keyboard the usable screen area is reduced in size. Around one million downloadable apps for Apple devices means you can personalize your iPad and make it into more or less whatever you want. The Air design is aesthetically a work of beauty in its simplicity, cleanness of lines and proportion, and despite some irritating niggles is a pleasure to own and use.", "Date": "January 22, 2014"}, {"Title": "Always love Apple", "Author": "Patricia Coykendall", "ReviewID": "R2Q8KB9C8ZHKQW", "Overall": "5.0", "Content": "All said it would be and more, had the I pad 2 and this is so much faster and lighter", "Date": "January 18, 2014"}, {"Title": "I love it, love it, LOVE IT!!!", "Author": "Maryanne", "ReviewID": "RX8WHXEP7PHLS", "Overall": "5.0", "Content": "I honestly love this tablet like crazy! It has great battery life, just like they claim. I had my younger cousins go on it and even though they were playing games and watching movies the whole time, the battery still lasted all day! The screen is also great, maybe it's not the best on the market but I can barely even tell the difference and it's still exquisite. The processing power is also outstanding and I couldn't need anything faster. Internet is very fast as well. All in all, I've always wanted an IPad and finally when I got it, I was not upset at all and it was actully a million times better than I expected.So, in my opinion, if you want it enough, and your willing to make a big splurge, get it. :D You won't regret it, it's da bomb. But if you really haven't wanted this much and your short on money, maybe you can give the other cheaper tablets a try. Such as the Nexus, Kindle, or even Nook!", "Date": "January 9, 2014"}, {"Title": "Love it, but had connection problem during set up", "Author": "Bookenz", "ReviewID": "R1Q22IXQKRHAIJ", "Overall": "4.0", "Content": "This is my favorite iPad so far, despite an initial wifi connection problem. I bought the original iPad, iPad 2, and iPad 3 (which I returned because of heating issues and thickness/weight and went back to the iPad 2).I was ready to buy a new iPad because my iPad 2 16gb was filled up.  So I decided on the iPad Air. The first thing I noticed when I took it out of the box was that it really is much lighter than even the iPad 2.  The screen is the same size, but the frame is narrower, so it's smaller overall.  I have the white 128gb wifi version.  Set up was problematic though, which is why I've taken away a star.  When asked to put in my home wifi password, I received a message that it was entered wrong. Repeatedly.  Well, it wasn't wrong because it's the same password as my other wireless devices.  Nothing I did would make it take the password, so I called Apple tech support. After being on the phone with the technician for at least 45 minutes, nothing worked. Turning my modem and router off and on did nothing. Changing some of the iPad's settings, again, nothing. I felt disappointed, frustrated, and let down by Apple. Finally, the tech set an appointment for me to take it into the Apple store and see if they could get it to connect to their wifi. Before we hung up, the tech suggested I connect the iPad to the iTunes on my computer and do a complete software restore and see if that would resolve the connection issue.  I did this, which took about an hour, and FINALLY was able to connect to my wifi. The connection has been stable so far.Other than the above initial connection problem, I am really loving the iPad Air. Sharp retina display, thinner and lighter, and faster connection (I use the Mercury Browser, not clunky Safari). The white frame with silver edges is really nice looking. I read a lot of ebooks, so the lighter weight is very much appreciated since it can be held comfortably with one hand. I also listen to audiobooks and this iPad has two speakers instead of one. They're located on the edge of the device, not the back, so you don't have to have the iPad back side up to get unmuffled sound. The sound quality of the iPad Air is superior to the iPad 2, and the volume can be turned up slightly louder. I've only played one game so far, Plants vs. Zombies 2, but it plays great. I don't use the camera and really wish Apple would make a version sans that option. It feels cool when holding--the iPad 3 I had got too warm on one side, which this one doesn't do. I haven't had any other problems and I think this is the best iPad yet. As far as the initial wifi connection issue I had, I'm going to assume this was a fluke with my device, and not something a lot of people are experiencing (although I have seen a few mentions of this on some of the Apple forums).", "Date": "January 8, 2014"}, {"Title": "Its perfect", "Author": "Benedito Eloi Maya \"Maya\"", "ReviewID": "R3PBL8USTW8GYJ", "Overall": "5.0", "Content": "This product is amazing. It's not perfect, but considering that I'll have it for at least 2 years and I've used it every day so far, It's very sturdy and I know it will hold up well, as my other Apple products have.", "Date": "December 30, 2013"}, {"Title": "Great Purchase!", "Author": "mgf", "ReviewID": "R3T4HQE7937J2J", "Overall": "5.0", "Content": "I love this iPad, is so light weight but with a big screen.  The picture quality is great too.  High quality like everything from apple.", "Date": "December 23, 2013"}, {"Title": "I love it, love it, LOVE IT!!!", "Author": "Maryanne", "ReviewID": "RX8WHXEP7PHLS", "Overall": "5.0", "Content": "I honestly love this tablet like crazy! It has great battery life, just like they claim. I had my younger cousins go on it and even though they were playing games and watching movies the whole time, the battery still lasted all day! The screen is also great, maybe it's not the best on the market but I can barely even tell the difference and it's still exquisite. The processing power is also outstanding and I couldn't need anything faster. Internet is very fast as well. All in all, I've always wanted an IPad and finally when I got it, I was not upset at all and it was actully a million times better than I expected.So, in my opinion, if you want it enough, and your willing to make a big splurge, get it. :D You won't regret it, it's da bomb. But if you really haven't wanted this much and your short on money, maybe you can give the other cheaper tablets a try. Such as the Nexus, Kindle, or even Nook!", "Date": "January 9, 2014"}, {"Title": "Love it, but had connection problem during set up", "Author": "Bookenz", "ReviewID": "R1Q22IXQKRHAIJ", "Overall": "4.0", "Content": "This is my favorite iPad so far, despite an initial wifi connection problem. I bought the original iPad, iPad 2, and iPad 3 (which I returned because of heating issues and thickness/weight and went back to the iPad 2).I was ready to buy a new iPad because my iPad 2 16gb was filled up.  So I decided on the iPad Air. The first thing I noticed when I took it out of the box was that it really is much lighter than even the iPad 2.  The screen is the same size, but the frame is narrower, so it's smaller overall.  I have the white 128gb wifi version.  Set up was problematic though, which is why I've taken away a star.  When asked to put in my home wifi password, I received a message that it was entered wrong. Repeatedly.  Well, it wasn't wrong because it's the same password as my other wireless devices.  Nothing I did would make it take the password, so I called Apple tech support. After being on the phone with the technician for at least 45 minutes, nothing worked. Turning my modem and router off and on did nothing. Changing some of the iPad's settings, again, nothing. I felt disappointed, frustrated, and let down by Apple. Finally, the tech set an appointment for me to take it into the Apple store and see if they could get it to connect to their wifi. Before we hung up, the tech suggested I connect the iPad to the iTunes on my computer and do a complete software restore and see if that would resolve the connection issue.  I did this, which took about an hour, and FINALLY was able to connect to my wifi. The connection has been stable so far.Other than the above initial connection problem, I am really loving the iPad Air. Sharp retina display, thinner and lighter, and faster connection (I use the Mercury Browser, not clunky Safari). The white frame with silver edges is really nice looking. I read a lot of ebooks, so the lighter weight is very much appreciated since it can be held comfortably with one hand. I also listen to audiobooks and this iPad has two speakers instead of one. They're located on the edge of the device, not the back, so you don't have to have the iPad back side up to get unmuffled sound. The sound quality of the iPad Air is superior to the iPad 2, and the volume can be turned up slightly louder. I've only played one game so far, Plants vs. Zombies 2, but it plays great. I don't use the camera and really wish Apple would make a version sans that option. It feels cool when holding--the iPad 3 I had got too warm on one side, which this one doesn't do. I haven't had any other problems and I think this is the best iPad yet. As far as the initial wifi connection issue I had, I'm going to assume this was a fluke with my device, and not something a lot of people are experiencing (although I have seen a few mentions of this on some of the Apple forums).", "Date": "January 8, 2014"}, {"Title": "Its perfect", "Author": "Benedito Eloi Maya \"Maya\"", "ReviewID": "R3PBL8USTW8GYJ", "Overall": "5.0", "Content": "This product is amazing. It's not perfect, but considering that I'll have it for at least 2 years and I've used it every day so far, It's very sturdy and I know it will hold up well, as my other Apple products have.", "Date": "December 30, 2013"}, {"Title": "Great Purchase!", "Author": "mgf", "ReviewID": "R3T4HQE7937J2J", "Overall": "5.0", "Content": "I love this iPad, is so light weight but with a big screen.  The picture quality is great too.  High quality like everything from apple.", "Date": "December 23, 2013"}, {"Title": "So very portable", "Author": "Nancy Bell", "ReviewID": "R1TAU6FYPB8B8N", "Overall": "5.0", "Content": "I have a laptop & a small size mini computer, both were obsolete, SLOW, etc. I was pretty much using my ipodTouch5 as my sole computer for everything, so this iPad was a natural progression from the Touch to a bigger screen.  The Air is all you need!!  I find even typing with no keyboard is not an issue.  I am not sure it is any better than an older iPad since it is my first, but if you want a tablet , this IS the one, just because of the lightness of the iPad!  It is easy to use & does it all with ease.  Flawless for me so far.  I am like a walking advertisement for iPad Air!!", "Date": "December 23, 2013"}, {"Title": "christmas present for my mom", "Author": "michael", "ReviewID": "R1YRRYGUE5W27N", "Overall": "5.0", "Content": "i myself love it.  got her this one cause her old 2nd gen is cracked and pretty much dead.  im sure she will love this one", "Date": "December 19, 2013"}, {"Title": "I'm in love with this thing", "Author": "Ashton P. Johnson \"Zepaw\"", "ReviewID": "RD013T1R9OA4A", "Overall": "5.0", "Content": "My title makes it pretty clear how I feel, but I'll try not to go over the top about how much I like it. The big thing is I've always liked the iPad as a concept but I've never fully fallen in love. I bought an original iPad, 2, and 3 but ended up selling them not long after because of a couple reasons. Mainly they just felt a bit like a luxury item I didn't have much use for and they weighed just enough to be uncomfortable to hold for a long period.The weight is now a complete non-issue. I fall back in love with it every time I pick it up because it just feels so perfectly designed for being held and interacted with. It also feels like much more than a luxury because of how much usability it now has. There are so dang many things I can do on my iPad, things I used to need my pc to complete. This is partly because of improvements by Apple but its also the simple benefit of web and app developers designing their services with mobile in mind.I can only imagine this comes off as a completely biased review but know I didn't get this device expecting to be so happy with it. I've been underwhelmed by Apple products before, but not this time. I highly recommend it.", "Date": "December 19, 2013"}, {"Title": "Apple Air Fun", "Author": "Albert C. Marth \"Albert c. Marth\"", "ReviewID": "R1F0R6VV0RKR7G", "Overall": "5.0", "Content": "This I-Pad is definitely a step up from last years model!  It's is lighter!  It is faster!  The picture is the best  I have seen.  The picture shows the pictures in a brilliant fashion!  The thinner all over design is really appealing!The seller and their service was exceptional!  You wont be disappointed", "Date": "December 5, 2013"}, {"Title": "Defective Item", "Author": "Nik", "ReviewID": "RUSB2R1PF1O2T", "Overall": "1.0", "Content": "Purchased this brand new iPad Air 64 GB from TechGiant(Amazon). Was with broken volume button!Was going to return it, but thanks to the Apple Store in Cherry Creek to exchange it for another one.", "Date": "April 27, 2014"}, {"Title": "IPAD AIR unusable, tech support is worthless.", "Author": "Dr. Sarah M. Young", "ReviewID": "R11CXF8RPTZQJW", "Overall": "1.0", "Content": "I purchased the IPAD air last week. When I tried to activate my accounts it would not allow it because apparently since I changed carriers I could not use my old Apple ID because it is tied to the old carrier. I can't establish a new Apple ID because I have an old one and if they delete the old one I lose all the apps I've paid for. I contacted Apple Technical where I was required to purchase tech support before they would do anything.  After doing this I went through multiple calls with multiple levels of support over three days so far with more to come. Seems that if the tech makes a mistake it stops the process and you have to wait 24 hours for them to be able to continue. They promise to call back and so far they have not so I called them to start the frustrating cycle all over again. I can't get the apps I want until this if fixed. I also can't connect to Facebook. For a machine this expensive plus having to pay for tech support for something that is Apple's fault I now believe Apple products aren't worth the gas to go buy one. I've been using Apples since the Apple Plus and I feel abused as a customer for the IPAD AIR. On top of all this they just had the gall to send me an email thanking me for contacting Apple Support. They have charged me for something a user should be able to do online with a new machine that is supposed to be the latest and greatest and it is just a paper weight right now. Can't return it because there is nothing wrong with it. Seems to me Apple is unethical and does not care about customers after a purchase. Dr. Sarah young", "Date": "January 26, 2014"}, {"Title": "Don't buy from Worldwide Distributors!!!  Restocking Fee for Returns!", "Author": "joedc831", "ReviewID": "RAIJ37X44JFHX", "Overall": "1.0", "Content": "They have a 10-15% restocking fee for returns that is not easily found on Amazon's website. Upon returning the unopened iPad Air to them, they charged me a $51.70 restocking fee.  Avoid Worldwide Distributors.", "Date": "January 15, 2014"}, {"Title": "Love it", "Author": "Curt", "ReviewID": "RJ5E3PPGZEGQI", "Overall": "5.0", "Content": "I replaced a Samsung Galaxy tablet I bought just for fun.  It was ok, but was difficult to use, had limited apps, and seemed slow compared to my iPhone.  So I decided to try the iPad even though it was twice as much.I love this thing!  It's fast, intuitive, more apps, and just plain works better.  This tablet does so much more, works so well, I'm seriously considering going Apple instead of PC.  Don't think you can go wrong with an iPad, or iPhone either.", "Date": "June 8, 2014"}, {"Title": "BEWARE of unusable iPad Air!", "Author": "MORE THAN UNHAPPY!", "ReviewID": "R109F1FVFO7ZBB", "Overall": "1.0", "Content": "The iPads I purchased from TechGiant were not as they were described! When I took them to T-mobile to activate these \"brand new ipads\", I was told that they could not activate 4G on any of the 8 ipads I purchased! This was because all 8 were previously owned and blocked for FRAUD! TechGiant is selling previously owned items!  TechGIANT I would appreciate it if you contacted me directly to resolve this asap!", "Date": "June 4, 2014"}, {"Title": "I pad rocks", "Author": "Elizabeth", "ReviewID": "RXW5V6IUCQIZW", "Overall": "5.0", "Content": "I bought this wonderful table for my birthday this month so far I have no problems with it it does everything and more .I would recommend it to anyone this tablet rocks I am a satisfied customer.", "Date": "March 26, 2014"}, {"Title": "I love this thing.", "Author": "Signalshifter", "ReviewID": "R1PG0RSEDGFJ0B", "Overall": "5.0", "Content": "I have had several iPod Touches over the years and I have always wanted an iPad. Well the iPad Air had all of the power, features, and storage space I was looking for.  I was looking forward to it's arrival and when I first started to you use it, it was somewhat of a wa-de-doo-da experience not disappointment but total familiarity because of all of the iPod Touch's I have. Then it started to grow on me, watching Crunchyroll anime, Amazon Prime movies, and it's prefect integration with my Apple TV all of this while being decadent in bed with my Irish Terriers snuggled up around me, total domestic bliss. It is a howler when you accidentally activate Siri while asleep my snoring it gives Siri fits.  I purchase the small Apple keyboard for it and this just enhanced the iPad more, now I have a really nifty alternative to a small notebook computer.  I have not commented of the functionality I suspect most of you out there are like me coming from another iOS device. I do notice some un Apple like bugs in iOS 7.01.and somewhat less in 7.1 but have a PC with Windows 8.1 installed so any minor bugs in iOS-7.1 are nothing compared with this disaster from M$.", "Date": "March 22, 2014"}, {"Title": "Just what we needed", "Author": "Carol L", "ReviewID": "RV8GCGFKFRA88", "Overall": "5.0", "Content": "Large , clear, easy to see. My husband does not like electronics, but he loves his I-pad. Shares what he likes with everyone who will listen.", "Date": "March 21, 2014"}, {"Title": "best mac product", "Author": "mindy rosenbloom", "ReviewID": "R3637KAZKBDYO1", "Overall": "5.0", "Content": "love the size portability battery life looks seek like having appshave the desktop mac air iphone this is the best", "Date": "March 21, 2014"}, {"Title": "Great Device", "Author": "Adam R.", "ReviewID": "R26IVP3W64PC4J", "Overall": "5.0", "Content": "This is a great device.  I am able to be very productive on it.  I pair it with my New Trent Airbender case, and it is almost like having a light laptop.", "Date": "March 6, 2014"}, {"Title": "great device, but beware of third party sellers", "Author": "J. Zajaczkowski", "ReviewID": "R33HKDXO136BFX", "Overall": "5.0", "Content": "I recently got the iPad Air 128GB from TechGiant and immediately after getting it I took it to my local Apple store to get AppleCare+ for it. After talking to 3 different reps and finally a manager it turns out that the model I actually received was the ME898E/A and not the invoiced, and what was on the package, ME898LL/A. After doing some research the manager determined that they could not sell me AppleCare because the model wasn't sold in the US, but instead in Mexico. The Apple store manager then advised me to return the iPad because not only did I not receive the model invoiced but also that if I had any problems with it I would not get any warranty service because warranties are not offered for Mexican sold Apple products.Otherwise, this is the best tablet I have ever used. Like any other mobile device or computer, it does have problems if you open every app without closing them. To close apps on your iOS 7 iPad, simply double click the home button and swipe upwards the apps you aren't working with. This way you can enjoy the cutting edge speed this thing is capable of.", "Date": "March 6, 2014"}, {"Title": "I find it difficult to get used to", "Author": "beatrice j seegers", "ReviewID": "R1SUXXIMMTN7O7", "Overall": "2.0", "Content": "I've tried hard to learn how to use my pad, but still finding it hard to use.I suspect this could be me...but it \"freezes\" up and I do turn it off and start over but some times it does not work.I'm thinking of giving it to my son and getting a laptop.I like the pad and the ease of using the keyboard.The size is perfect and it is not too heavy", "Date": "March 4, 2014"}, {"Title": "Best iPad yet", "Author": "Amazon Review Dude", "ReviewID": "R2QU4ZAJZXRQ92", "Overall": "5.0", "Content": "This is definitely the best iPad I have owned.  I am upgrading from a 3rd gen retina iPad, but I've also owned an iPad 2 as well.  The weight of this thing is definitely one of the biggest draws.  The screen obviously looks just as good as the prior retina models, but the decreased bezel on the side is really nice.  I can almost palm the device and still have a full iPad screen.  I use it as my daily couch device every single day.  I think the iPad has gotten to a point where it can replace the need for a laptop for most folks.  While I still need a high performance desktop for various reasons, the iPad really gets what I need done when I am lounging around.", "Date": "February 16, 2014"}, {"Title": "It's fast.", "Author": "Stenar", "ReviewID": "R2THLW674YDVD", "Overall": "5.0", "Content": "The iPad Air is so much faster, thinner lighter than my old iPad.  I love every minute I am using it.", "Date": "February 16, 2014"}, {"Title": "Entertainment Paradise", "Author": "Jacob Weltchek \"NOTWS\"", "ReviewID": "R1D544EV1WPSS7", "Overall": "5.0", "Content": "Pros:- Battery life (10+ hours)- Thin, and light (about a pound)- Best app storeCons:- Expensive- Proprietary port- Fingerprint magnetSummary:If you want the Cadillac of tablets, then look no further!", "Date": "February 15, 2014"}, {"Title": "I did a lot of research prior to buying!", "Author": "Pamela Paulhamus", "ReviewID": "R3B1QR0WE8X63B", "Overall": "5.0", "Content": "I absolutely love my iPad Air!  I spent months doing product comparisons.  I spoke to many tech geeks at various stores in addition to reading hundreds of on-line reviews.  The one thing I wanted to know was if I could load photos from my camera's SD card into the iPad.  Everyone said no!  Even the people in the stores SELLING them!  They were wrong!  Apple has two items that allow for this.  I purchased the Lightning to SD Card Reader ($27) and it works beautifully.  I took the iPad with me on two recent trips.  It was great being able to transfer my photos daily into the iPad to view them as opposed to trying to look at them on my camera!  With the 128GB of storage, I can keep quite a few photos stored on the iPad.  There are many apps available for photo editing and sharing.  I love everything about the iPad!  It was also nice having it on the long flights....between looking at my photos and playing all the games I have loaded into it, the time just flew by!  Of course, there are many other reasons to love the iPad, but for me, being able to view and edit photos while away from home is priceless.  I wouldn't want to ever fly with my laptop because of the weight.  But the iPad Air...it's a real gem!  Weight-wise...it weighs less than most books I might have taken with me to read!  I highly recommend it!", "Date": "February 15, 2014"}, {"Title": "LOVE it", "Author": "Paige Clark", "ReviewID": "R29Q4FQWDF77IA", "Overall": "5.0", "Content": "I love my iPad! Long battery life, great screen quality, light & portable. You can hook it up to your phone through iCloud and share apps, photos and contacts. You can text (iMessage) anyone in with an apple device from your iPad too! It's great. I use it daily with little to no problems", "Date": "February 9, 2014"}, {"Title": "This is my first Apple product", "Author": "JoanB", "ReviewID": "R1WOGC3X69T2ZU", "Overall": "5.0", "Content": "The learning curve is steep for a previous non-Apple owner but well worth it.Overall I can't think of anything negative to say about the iPad Air.", "Date": "February 6, 2014"}, {"Title": "iPad Air", "Author": "Pat Hackler", "ReviewID": "R1KCPF2I9YOGA0", "Overall": "5.0", "Content": "I love my new iPad Air. It is fantastic! It can do all the things my old laptop could do and more.", "Date": "February 4, 2014"}, {"Title": "My wife loves it!", "Author": "K. Bushaw", "ReviewID": "R1LDL7GFV636V0", "Overall": "5.0", "Content": "I gave one of these to my wife in exchange for her iPad 2 that she also loved very much.So, I got the hand me down which is still in very good condition.The most noticeable improvements over the iPad 2 are the speed and cameras and, of course, it is significantly thinner and lighter.About the only significant downer to this device is common to ALL iOS devices...and that is that you cannot access FLASH-based web sites or information.  Steve Jobs adamantly refused to support it to his dying day and that 'legacy' continues.So, back to the PC when we need to do that.I was concerned about going to the lightning connector but it hasn't been too much of a problem.  She just can't use it with some of our devices that have the original 30-pin docking stations.It's really nice that, currently, T-Mobile will give you 200MB of cellular data per month FREE with this model whether or not you bought it from them or have any of their other wireless services.  I just subscribed this one for my wife a couple days ago.", "Date": "February 1, 2014"}, {"Title": "Ipad Air", "Author": "James R. Valley \"vermont lover\"", "ReviewID": "R1FSBZRO58T0P", "Overall": "5.0", "Content": "Bought it for my wife and she loves it a lot better than her old series 1 ipad can do so much more on it.", "Date": "January 28, 2014"}, {"Title": "Glad I Got It!", "Author": "Bonnie Dreyer", "ReviewID": "R3K1DF6U7VJ3M7", "Overall": "5.0", "Content": "I have an Iphone but wanted something bigger so I could read books and newspapers and just have a bigger screen.  It is perfect for me and I am glad I got it.", "Date": "January 27, 2014"}, {"Title": "My wife loves it!", "Author": "K. Bushaw", "ReviewID": "R1LDL7GFV636V0", "Overall": "5.0", "Content": "I gave one of these to my wife in exchange for her iPad 2 that she also loved very much.So, I got the hand me down which is still in very good condition.The most noticeable improvements over the iPad 2 are the speed and cameras and, of course, it is significantly thinner and lighter.About the only significant downer to this device is common to ALL iOS devices...and that is that you cannot access FLASH-based web sites or information.  Steve Jobs adamantly refused to support it to his dying day and that 'legacy' continues.So, back to the PC when we need to do that.I was concerned about going to the lightning connector but it hasn't been too much of a problem.  She just can't use it with some of our devices that have the original 30-pin docking stations.It's really nice that, currently, T-Mobile will give you 200MB of cellular data per month FREE with this model whether or not you bought it from them or have any of their other wireless services.  I just subscribed this one for my wife a couple days ago.", "Date": "February 1, 2014"}, {"Title": "Ipad Air", "Author": "James R. Valley \"vermont lover\"", "ReviewID": "R1FSBZRO58T0P", "Overall": "5.0", "Content": "Bought it for my wife and she loves it a lot better than her old series 1 ipad can do so much more on it.", "Date": "January 28, 2014"}, {"Title": "Glad I Got It!", "Author": "Bonnie Dreyer", "ReviewID": "R3K1DF6U7VJ3M7", "Overall": "5.0", "Content": "I have an Iphone but wanted something bigger so I could read books and newspapers and just have a bigger screen.  It is perfect for me and I am glad I got it.", "Date": "January 27, 2014"}, {"Title": "iPad Air!!", "Author": "Jade", "ReviewID": "RK2DX2AY1IP6C", "Overall": "5.0", "Content": "This item meets the expectations and is quite beautiful/ The pixels makes each image sharper and more clear. The effect of the camera is like nothing I have seen! I would recommend this product and would purchase it again!!!!!!", "Date": "January 26, 2014"}, {"Title": "New traveling computer: weighs just a pound.", "Author": "Innocents Abroad \"Anglophile\"", "ReviewID": "R2Y2NSY3EUMX33", "Overall": "5.0", "Content": "Light weight, replacing laptop for travels.  Fits a travel case that also carries Kindles and cords.  Photos are easily taken and forwarded. Internet via hotel wifi very easy. Good battery life.  No surprises.", "Date": "January 26, 2014"}, {"Title": "Great!", "Author": "Amazon Customer", "ReviewID": "R3DBX9IECKRAUR", "Overall": "5.0", "Content": "I am a college student and I drag this with me everywhere!  I love it because it is compatible with office note so I can take my notes and they immediately sync so I can access them on my computer at home!  So convenient and light!", "Date": "January 24, 2014"}, {"Title": "Excellent", "Author": "Jayaram Narayanan", "ReviewID": "R2AYWTGM471DRI", "Overall": "5.0", "Content": "Do explain why you liked or disliked this product.Do compare to similar products and share how long you've used this product.Do identify specific attributes (e.g. comfort & fit of a shirt or the battery life of a camera) and whether they met your expectations.Don't describe your seller or shipping experience (you can do that at amazon.com/feedback).Don't include promotional content of any kind or reviews written in exchange for compensation", "Date": "January 24, 2014"}, {"Title": "Great gift for anyone but, especially, the tech-reluctant!", "Author": "Cathleen A. Ellers", "ReviewID": "R8MCIPYA3NZNT", "Overall": "5.0", "Content": "I bought this for my parents for Christmas.  My Dad loves it! When he’s not using it at home, he brings it with him to my Grandfather’s doctor appointments to pass the time. My Mom likes to read magazines or look up recipes and enlarge them on the screen to better view them. It works just like any other tablet or a smart phone, although I’m not sure why it’s called an iPad Air. I don’t think it is significantly lighter than the iPad2, especially, after you put a case on it. However, compared to the iPad2, it does have a bigger processor, significantly better camera and, on the downside, costs about $100 more.  I think this is a great product for those on the go, those who can’t see well and need a bigger font or for the tech-reluctant.  It was the perfect gift and worth the money!", "Date": "January 24, 2014"}, {"Title": "It's an iPad...", "Author": "Amazon Junkie \"Ricky\"", "ReviewID": "R20O8GF5CKTCGP", "Overall": "5.0", "Content": "Works as well as my full size and my wife's mini iPad .  I like the fact that it's lighter for when I'm laying on the sofa, but large enough to see without my glasses.", "Date": "January 24, 2014"}, {"Title": "Great product.", "Author": "shaikh mahiedin", "ReviewID": "R1BDTLS6ACKE0I", "Overall": "5.0", "Content": "Its great for serfing the web and family picture album. The display is awesome. Battery Life is great. Very well made.", "Date": "January 24, 2014"}, {"Title": "Perfect", "Author": "C. A. Arnold \"lazy reader\"", "ReviewID": "R1WDK2DKMEK91P", "Overall": "5.0", "Content": "Great price, great item.  Hate this rating system...Son loved it as it is his Christmas present, and he now takes it everywhere.  MUCH lighter than the normal iPad, which makes it perfect for a purse", "Date": "December 29, 2013"}, {"Title": "o.k.", "Author": "just me", "ReviewID": "R2X18GAYX9HWQW", "Overall": "5.0", "Content": "It's GREAT but I had to have a few people HELP me getting it started, as this is my 1st one and and they don't send you a user paper to tell you anything.... and old folks need a little something to follow along with, if i had a smart phone, they said it's about like that to set up....", "Date": "December 26, 2013"}, {"Title": "Versatile, fast and intuitive!", "Author": "kim joseph", "ReviewID": "R3KZDREU91KCPH", "Overall": "5.0", "Content": "Love it!  It is faster and lighter, then the IPAD. I like it so much, especially for reading and for studying my music.", "Date": "December 23, 2013"}, {"Title": "Looks great; met all our expectations.", "Author": "David W.", "ReviewID": "R22OGLEW2J897D", "Overall": "5.0", "Content": "My wife and I are both familiar with Apple products, but this is the first iPad we've ever owned. Because I'm not a tablet guru or anything (nor was I particularly concerned with the improvements between revisions), I can really only review the product from the simplest perspective: does the product meet my particular needs?My answer is definitely yes. As our first tablet, we were mainly looking for a mobile media hub that also can perform various utilities that we find important (finances, travel guides, recipes in the kitchen, ebook reading). The iPad covers all of those bases nicely, and it's all packaged in a very sleek, attractive design.My primary reason for purchasing this particular model is that I plan on this lasting as long as possible, and I was concerned that an older model would become functionally obsolete faster than a newer model.", "Date": "December 12, 2013"}, {"Title": "Love it!", "Author": "Ginger", "ReviewID": "R22G29I53DF5PN", "Overall": "5.0", "Content": "The iPad Air is as great and better than it looks on the Apple website or commercials.  I had the mini and traded up for the Air.  I made a great decision and no one can come close to competing with Apple.  (Just my opinion).  I love my MAC, iPhone and iPad Air.", "Date": "December 12, 2013"}, {"Title": "stopped working within 2 months of buying", "Author": "Sohaib Aleem", "ReviewID": "R257N3O7VADWE5", "Overall": "1.0", "Content": "for no obvious reason (no spills no voltage issues with other electronic appliances) stopped working. Headache not worth the investment and brand recognition", "Date": "May 7, 2014"}, {"Title": "Fragile", "Author": "Greg Brown", "ReviewID": "R27BMGL1WEQM", "Overall": "3.0", "Content": "Nice device, but very fragile. I've had mine for about 6 months and the screen cracked for no apparent reason. Apple won't fix it - they will only replace it for $300 (on top of the $700 I already spent on it). No thanks.", "Date": "March 17, 2014"}, {"Title": "Waited for 5 gens for this gem", "Author": "David Werble \"davidwerble\"", "ReviewID": "R2BVKVKG7W1YJ8", "Overall": "5.0", "Content": "Even with the case it is light. More importantly it is FAST. I didn't really need the AT&T; hook up (haven;t bought it yet) so unless you are a traveler finding no WiFi I'd go with WiFI only and save some $$$$.", "Date": "February 2, 2014"}, {"Title": "Good entertainment tablet", "Author": "A. Kim", "ReviewID": "R23977JLEDF4M8", "Overall": "4.0", "Content": "I have recently transitioned from PC/Android so I am still learning the rope but my overall experience have been very good.  Initial set up was breeze, Retina screen is pleasure to see, lighter weight means less stress on my wrist from extended use.However there was one issue where I thought people who are thinking of switching from Android tablet to iPad should consider carefully first.iPad has no file system like Android tablet so simple cut and paste file/folder transfer will not work.  Google it first with \"How do you transfer multiple folders to iPad?\" and read what others have said.  You can download third party software that will allow you transfer individual folder content at a time but that is tedious and time consuming if you one to transfer whole bunch of folders at once.If you can swallow the price and the above mentioned \"issue\", then I whole heartedly recommend iPad over Android tablet.", "Date": "January 28, 2014"}, {"Title": "Air or mini, cellular or wifi? The hardest choice.", "Author": "Mumbly Joe \"MumblyJoe\"", "ReviewID": "R1EP8MRB01CCTV", "Overall": "5.0", "Content": "A lot of people have already talked about the merits of this device and the pros and cons. For me the decision wasn't so much which to buy but rather which one I wanted. Originally I got the mini to replace my kindle touch because of the price and the pocketable size. Ultimately I ended up with the air. Here's why:Grip: despite the very comfortable dimensions for 1 handed holding of the mini the extra thin bezel proved problematic. The palm rejection tech is supposed to be quite good but I found it unreliable and for those times I wanted to gets.  Eventually I always wanted to get a hold of it with  the bezel between my thumb and forefinger but either ended up with a thumb right in the middle of whatever I was watching or a hand cramp.Real estate: getting smaller means text is smaller especially on we pages In portrait mode. You can set the text size up for dynamic type but it doesn't work everywhere and when if does work and you change to landscape, then the text is far too big for the screen. Furthermore, in games where part of the screen is used for the controls I ended up wishing for a larger screen.Keyboard: the keyboard ended up being the main reason I went for the Air. While it is surprisingly good on the mini (really it blew me away how good the keyboard was in the mini) typing at that size for any extended period is taxing and it just can't compete with the Air if you plan on writing any amount. Furthermore, using the GarageBand keyboards are fairly awkward on the smaller screen. Unlike the accessory keyboards for the full size iPads, I found the external keyboards for the mini were actually much much worse than the onscreen keyboard.Pocketability: the mini fit quite nicely into a jacket pocket, in the climate where I live jackets are only really feasible about 3 or 4 months out of the year. Other than that it needs bag of some sort, which is really the same situation I'd be in with an Air.Weight: this made the choice the hardest. Holding the iPad mini feels like hardly anything at all. The iPad air feels considerably heavier. That affects everything you do with the tablet and the entire interaction with it. Fortunately it's mostly a matter of perspective. Put down the mini for a day and all of a sudden the air seems  quite light.For me the decision was made for the larger version but what about options?Cellular of no cellular? The free 3G on my kindle touch has gotten me out of a scrape more than once and having access to a no-strings-attached internet connection is guaranteed to come in handy at least once during the lifetime of your tablet. $130 is a lot to spend though, especially if you have a smart phone and free tethering on your plan. Originally I went for the wifi version for precisely this reason. However, the ability to tether is dependent on the carrier you happen to be using. Should you switch phones, carriers or plans or simply lose the phone while traveling tethering May no longer be a option and it's never going to be as convenient as simply opening the settings on your iPad and activating a plan. In addition you also gain the ability to use gps with a cellular modem and gain the benefits of enhanced find my iPhone accuracy in the event that it's stolen and the thieves know enough to keep it off wifi. Finally though, the possibility of a free 200 mb per month with t-mobile and the ability to switch carriers at will ended up pushing me to get the cellular version.So, after having initially been interested by the mini, a lot  of research, even more indecision and having bought, lived with and sold multiple versions of this thing I can safely say that the iPad Air with cellular is the  version I'd pick. If you don't plan on typing a lot with it though or watching movies, go for the mini.", "Date": "January 9, 2014"}, {"Title": "First Ever Apple Product - First Ever iPad - LOVE IT", "Author": "JoHarley", "ReviewID": "R1X2GEOQACNWD2", "Overall": "5.0", "Content": "The has become a great tool for my photography needs. I got it around mid November so I haven’t had it that long. I've been tired of carrying a laptop when going on a trip which I used to download daily the photos taken that day. Thought I’d give the iPad a try.Pros:- It’s super light in weight which makes it ideal for carrying.- It’s fast. Apps run very nicely.- Great camera and photo tools.- Beautiful screen! Photos look super nice on display.Cons:- BIG, BIG CON! You can’t connect an external, off the shelf, drive to it for backing up my photos. Ended up spending twice the money for the Seagate Wireless Plus, 1 TB. It took a bit of setting up but it does do the job. BUT STILL! Why on earth can’t I simply connect a $70 one TB drive to the unit?? Seems a bit petty to me.- Connectors costs a bundle! I needed an SD card reader, an HDMI connector for streaming video to TVs in hotels, and a Micro SD connector  for my smart phone and other devices. The HDMI connector itself was $50.00. This thing probably cost $0.50 to make, but I WAS warned  about Apple’s marketing tactics…- The manual leaves a bit to be desired. I’ve learned more from friends then I have from their manual. Ended up with the book “My iPad” for Que. Good book…Still got some learning to do with this device but it has been fun to figure out. And for photography work, it’s going to be nice to have.", "Date": "January 4, 2014"}, {"Title": "Safari Crashes Constantly", "Author": "Philly Music", "ReviewID": "R228PDSRURQMT7", "Overall": "2.0", "Content": "As a MacBook Pro user and Apple supporter, I'm surprised and very disappointed that Safari on my brand-new iPad Air 16G crashes constantly.  It's obviously a known issue, as the discussion boards are filled with similar reports.  This could not have been missed during product testing. Inexcusable.", "Date": "December 13, 2013"}, {"Title": "Padman", "Author": "Joe Consumer", "ReviewID": "R25QATJS0DQ09G", "Overall": "5.0", "Content": "Lighter by far.  I love the large screen, but till now would find myself using the iPad Mini most of the time.  The iPad Air is light and comfortable to hold. The Mini is now the backup as I love the Air.  Speed increase, overall case size reduction, and weight reduction are all solid reasons for the upgrade.", "Date": "November 12, 2013"}, {"Title": "Great Purchase", "Author": "Art Lover \"Art Lover\"", "ReviewID": "R18PG2QYWEFW0V", "Overall": "5.0", "Content": "As expected, an excellent product. Great battery life and graphics as well as availability and variety of apps.I am very satisfied with my purchase.", "Date": "May 23, 2014"}, {"Title": "Great tablet", "Author": "Ken J. Erskine \"KJE\"", "ReviewID": "R1BVVV3GVE27QB", "Overall": "5.0", "Content": "I have a kindle fire, great for books but downloading videos is hit or miss and it would not connect to plane wifi.Have not had any of those problems with the iPad.Will probably go against the grain with this comment, also have an older iPad and I don't see a difference in download speed or picture quality--- not sure the $200.00 difference is worth it for the lighter weight, but no complaints regarding it quality or performance", "Date": "May 14, 2014"}, {"Title": "Yup.  The Apple devicecount just keeps growing and growing...", "Author": "jon mceachron \"(JDMc)\"", "ReviewID": "R3AJAQ0ZFLO5OJ", "Overall": "5.0", "Content": "(Disclaimer - I am a tech researcher during my day job...)So I get to work with a lot of different tools/technologies/devices.The Apple iOS devices were a hit from day #1.  Our household acquired one of the original iPods, followed by phones, tablets, and the Apple TV.  They reproduce like bunnies!Still a little pricey - all Apple Stuff is - but cheaper through Amazon than at my local Apple store.  (And I don't have to elbow my way through the mall...)JDMc", "Date": "May 10, 2014"}, {"Title": "Very good", "Author": "lishousong", "ReviewID": "R1UROO8VBZGJYC", "Overall": "5.0", "Content": "I like the item very much! I think I will buy it again and tell my friend who want to buy it.", "Date": "May 10, 2014"}, {"Title": "Just too difficult to manage", "Author": "Michael Hooker", "ReviewID": "R234KC8JAK7HC8", "Overall": "3.0", "Content": "1st iPad. I own a Kimdle HD. The Kindle is easier to manage files. Kindle has a free App of the day, nice little perk. Apple is faster. But, all the proprietary issues, operating system, cables, and iTunes, detracts from the tablet experience.", "Date": "May 9, 2014"}, {"Title": "Great deal", "Author": "David McDonald", "ReviewID": "R32NW95IXJZNCS", "Overall": "5.0", "Content": "Good product at a price that is lower than Apple.com because you don't pay sales tax (except California I think).", "Date": "May 7, 2014"}, {"Title": "NOT BRANDNEW", "Author": "bhscr", "ReviewID": "R3EQ6K6G8O6HO7", "Overall": "3.0", "Content": "i bought get the ipad air at 4/2/2014. but after i check the imei on the new. the ipad already being active at 1/26/2014.", "Date": "April 6, 2014"}, {"Title": "From Ipad2 to ipad air", "Author": "Savage", "ReviewID": "RUM9YWWS49Z63", "Overall": "5.0", "Content": "First thing i notice about this how light it is. The speed is a 2nd and loved it within the hour of using it. The A7 64-bit processor makes it even better but that type of power makes the  felling of batter life shorter. Other than that this Ipad is amazing of worth what i paid for.", "Date": "February 9, 2014"}, {"Title": "Excellent product", "Author": "Hugo", "ReviewID": "R2IJI5GZRTUNCV", "Overall": "5.0", "Content": "It is what Apple claims that it is. Superb in all aspects. Quicker connection to wifi networks, easy to use even for those who are used to android.  In fact is much easier for first timers than android.  Management of memory is also exceptional and video quality is amazing too.I would recommend very much this item.Seller accomplished everything he promised, very good one.", "Date": "February 8, 2014"}, {"Title": "Perfect tablet for my use.", "Author": "Deepam Panchal", "ReviewID": "R2GQ90JRKA0YAK", "Overall": "5.0", "Content": "It is perfect!!!!!Light weight and powerfulI use it for work, jotting down ideas and watch movies on Netflix.", "Date": "February 6, 2014"}, {"Title": "Love!", "Author": "Marsha F.", "ReviewID": "R3PQWMS937GG8Q", "Overall": "5.0", "Content": "Bought this for my husband for Christmas. He loves it. Takes it everywhere. No crashing issues with the OS like on his Iphone. Screen is amazing. Pictures and video come out great. Would highly recommend.", "Date": "February 1, 2014"}, {"Title": "User manual is not preloaded", "Author": "Thomas G. Field, Jr.", "ReviewID": "R3O5X6J8W8BDR7", "Overall": "4.0", "Content": "After a couple of weeks, I stumbled onto the manual (using my macbook). After a few hours, I figured out how to locate it and  load it on the iPad. Now, I'm trying to figure out why it wasn't pre-loaded. I'm sure there's a good reason that will come to me shortly.", "Date": "February 1, 2014"}, {"Title": "More Than Satisfied", "Author": "Ed Shuey", "ReviewID": "R21NZ3JDKOOJDZ", "Overall": "5.0", "Content": "Waited years before purchasing, read dozens of reviews, tried other manufacturers' products, and listened to others' opinions.Apple is at, or near, the top of their game obviously.Design, tooling, functionality, aesthetics, all of it really, are on the mark. Throw in the \"it\" factor and this is what you get.", "Date": "February 1, 2014"}, {"Title": "What you've come to expect from Apple", "Author": "jerome hammond", "ReviewID": "R3RO0MZNFFJVAY", "Overall": "5.0", "Content": "This was an upgrade from the original iPad, which was still in top working condition and being used daily. The product arrived earlier than expected in perfect condition. I've been using it now for 24 hours and my assessment is that it's exactly what we've come to expect from Apple - a product that feels great in the hand, looks great to the eye, and operates exactly as the mind would have created it. I look forward to 3 more years of trouble-free use from this outstanding Apple product.", "Date": "February 1, 2014"}, {"Title": "They were who we though they were", "Author": "Scott Crabtree", "ReviewID": "R3MRVFN9AKYGGG", "Overall": "5.0", "Content": "This is one of the pricier tablets, but I never have any problems with it.  The picture is great on it, and there's a ton of apps.  One gripe is having to download a browser that can handle flash.  That is just nitpicking at this point.  I mostly use it for netflix, hulu, xfinity streaming, and surfing the internet.  It is everything I thought it would be.", "Date": "January 31, 2014"}, {"Title": "Gift for my wife", "Author": "Mike Lockridge", "ReviewID": "R39TI6FZE4GSZ8", "Overall": "5.0", "Content": "My wife is really enjoying her Ipad Air.  She likes the size to watch her videos.  She enjoys playing her games on it anywhere she goes.  Also the picture is the best we have ever seen and we have seen quite a few desktop monitors, laptops, phones and tablets.", "Date": "January 30, 2014"}, {"Title": "IPAD AIR", "Author": "rudy", "ReviewID": "R2QTYC587U6C6J", "Overall": "5.0", "Content": "Its better that i expected i like it so much also the wife likes it tooI will buy 1 more for my daughter", "Date": "January 30, 2014"}, {"Title": "great product", "Author": "Thomas C. Heagy \"heagy1\"", "ReviewID": "R1Q58O72DBZAJ6", "Overall": "5.0", "Content": "I wasn't sure if the difference between my old iPad and the iPad air would be worth it, but they really are. The lighter weight, longer battery life, better picture quality, and faster processing are all great.", "Date": "January 29, 2014"}, {"Title": "I Am Impressed with this iPad", "Author": "Joe Wright", "ReviewID": "R1WA8OV12YX1AP", "Overall": "5.0", "Content": "I have heard reviews of Apple products for years and I have watched all the commercial hype that surrounds new devices. This one actually lives up to the hype. It's easy to use, it's reliable so far, and it functions so much smoother and better than anything that is Windows based that I have ever used. After purchasing a tablet that used Windows 8 and going through the usual maze of useless moves and things that didn't work, and then having the unit fail all together in less that 2 months the iPad Air was a welcome change. I definitely recommend the iPad Air.", "Date": "January 28, 2014"}, {"Title": "I like it", "Author": "Björn Herbert", "ReviewID": "R3EPN5MWYYZ17A", "Overall": "5.0", "Content": "I like apple, so I like it! It has everything I need and great new features as well! Keep going!", "Date": "January 27, 2014"}, {"Title": "wonderful equipment", "Author": "Mark", "ReviewID": "R1Q4AZM5B4PTQ1", "Overall": "5.0", "Content": "It is a newest ipad air, and that is a wonderful equipment. It allow me do many things and I could not use my laptop.", "Date": "January 27, 2014"}, {"Title": "Great gift!  I'm a Hero!!!!!", "Author": "Ramboette \"Anythingspossible\"", "ReviewID": "R1587BSHNBPTHD", "Overall": "5.0", "Content": "My 11-year old Goddaughter is so happy and busy!  She picked out these and I paid, but it was my pleasure! Thank you!", "Date": "January 26, 2014"}, {"Title": "great", "Author": "dara hasan abdulkarim", "ReviewID": "R2LLW53G9QRKC7", "Overall": "5.0", "Content": "Great device  i would recommend every one to buy i really enjoy it This latest generation iPad is so much lighter than previous versions.", "Date": "January 15, 2014"}, {"Title": "My I pad", "Author": "brian mooty", "ReviewID": "R3BSDXYS2VKJ7", "Overall": "4.0", "Content": "I love the I pad air it's everything that I expected it to be and more and my wife has took it over lol.", "Date": "January 14, 2014"}, {"Title": "Excellent Xmas present delivered on time!", "Author": "Jim Taylor", "ReviewID": "RMTJO3EUI6KU1", "Overall": "5.0", "Content": "My brother had his old iPad stolen while in hospital for a serious operation.  All local stores were sold out. Amazon came through!", "Date": "January 10, 2014"}, {"Title": "Great product.", "Author": "J. Solorzano \"drummer\"", "ReviewID": "R3CP2FGC5M94PD", "Overall": "5.0", "Content": "My daughter and I like apple products very much.  As soon as she learned about the iPad Air she wanted one, and she is very happy with it.", "Date": "January 10, 2014"}, {"Title": "This was a Christmas present.", "Author": "Padmini Kadaba", "ReviewID": "R38NAXUHMD8AXB", "Overall": "5.0", "Content": "The girls simply loved this gift. They liked the latest version and how fast, light and efficient the product really is.", "Date": "January 9, 2014"}, {"Title": "It is a great product!", "Author": "Jennifer Martinez", "ReviewID": "RGALICKAT2UTH", "Overall": "5.0", "Content": "Have used an Ipad 2 and this is so much nicer.  Better resolution, good screen size, but still nice and compact.", "Date": "January 9, 2014"}, {"Title": "Great", "Author": "LGH135", "ReviewID": "R2AWQSZTBNX3IV", "Overall": "5.0", "Content": "I love it - wasn't sure how i'd feel about this new version but it's perfect.  Much better than previous versions.", "Date": "January 9, 2014"}, {"Title": "Apple iPad Air", "Author": "Frances Tungate", "ReviewID": "R36ETWZHZ0X8B2", "Overall": "4.0", "Content": "I gave away a full size laptop, and got the Ipad Air.  I love it...It's easy to hold, and I can surf the web, play games, check e-mail, and write documents, and take pictures anywhere. I rarely used my laptop, but I use the iPad Air every day. I highly recommend this product.", "Date": "January 9, 2014"}, {"Title": "AWESOME", "Author": "yo", "ReviewID": "R2C6DMQ690WQ6Y", "Overall": "5.0", "Content": "My husband loves it.  I have an IPAD 2 and I am jealouse of him!!!  It is a great gift and worth the money but of course if they ever became cheaper I would buy another!", "Date": "January 9, 2014"}, {"Title": "wonderful", "Author": "Michiko W.W. Campbell", "ReviewID": "R240EMR4EULFL2", "Overall": "5.0", "Content": "never  had a doubt. This product is complete what i expected and i am glad i purchased. The color and size of the product is very durable as well. its fast and easy to work with best product ever", "Date": "January 9, 2014"}, {"Title": "Amazing!!!!", "Author": "cheryl miller", "ReviewID": "R2WQTF0KC36F96", "Overall": "5.0", "Content": "I'm on this daily! Love love love it!! So happy with this purchase!  I'm so glad I choose my iPad over all the other choices!", "Date": "January 8, 2014"}, {"Title": "Cool", "Author": "Dean G.", "ReviewID": "RJ3I2LSMP3FNA", "Overall": "5.0", "Content": "My first IPad and it's the air I love itLook forward to get iPhone 5sSoon happy new year", "Date": "January 8, 2014"}, {"Title": "It's and Ipad!", "Author": "Robert A Griner JR", "ReviewID": "R3QFTIMXP9EM7K", "Overall": "5.0", "Content": "What more can you say about an Ipad.  It is my wife's Christmas present.  She loves it.  She works at a large University and has long been involved with Apple.  This is her first personal tablet and she loves it.  It has met all of her expectations.", "Date": "January 8, 2014"}, {"Title": "If you want easy, this is it!", "Author": "Dolores P.", "ReviewID": "R26GB958NKUO7V", "Overall": "4.0", "Content": "I bought the iPad Air having never had a tablet previously. I had just recently bought the iPhone 5c and decided to try the all-Apple experience. So glad I did. The iPad is crazy easy to use, has a great screen, and syncs all my photos and apps seamlessly with the phone. I am no a technical guru, so I appreciate something that is simple to use and easy to transport.", "Date": "January 8, 2014"}, {"Title": "Great Christmas present!", "Author": "Sarajo Esch", "ReviewID": "R2JB2RHZAK4TUP", "Overall": "5.0", "Content": "Still learning to access all the great features. We are really enjoying the many features on this ipad. Delivery was very prompt.", "Date": "January 7, 2014"}, {"Title": "made for old people", "Author": "the truth", "ReviewID": "R2S9WWPOATJ4SN", "Overall": "2.0", "Content": "I just bought it to try it out.  No � customization.  No sd card slot, sub par camera.... Just overall...... Lacking!!!!", "Date": "November 25, 2013"}, {"Title": "spend the money on a year's books & classes at your local J.C. instead", "Author": "Mike Schmidt", "ReviewID": "R1SQTW5PLP5I3H", "Overall": "2.0", "Content": "These people with the \"perfect,\" 5 star, ratings are hysterical.  This little thing depreciates faster than a falling brick.  It's a tech fad and you're paying about 300% over value  to fit in.  It's like 1975 and lava lamps craze - with a lot more conformist culture and people into it. Except, Lava lamps aren't anti-social and waste your time. Get an iPad - it has that apple logo that makes everybody realize that you're cool now.", "Date": "November 23, 2013"}, {"Title": "Bad taste", "Author": "Jeffrey Funk", "ReviewID": "RXKVUH328JER7", "Overall": "1.0", "Content": "I was stupid and sent this as a gift to a woman that didn't work out ,but am sure she is enjoying it on my dime.", "Date": "March 17, 2014"}, {"Title": "Crap!", "Author": "iPad Air Expert", "ReviewID": "R299FHI9ANQC7R", "Overall": "1.0", "Content": "It won't even turn on. Why is that!  :( ahhhhhhhhh what is going on. And it also didn't come with a charger!", "Date": "November 6, 2013"}, {"Title": ".4 lbs lighter WOW what a pointless device!", "Author": "Deimos \".\"", "ReviewID": "R2JBOFZJ3AG6LC", "Overall": "1.0", "Content": "So you get the same OS, the same capabilities as every other Ipad or slightly \"faster\" and .4 of a pound lighter?  Who the hell in their right mind would buy this pointless device.  If you have any other more capable tablet or any other version of the apple store shackled limited Ipad you do not need this peiece of junk.  If I held this up facing toward you with a first gen Ipad, and an Ipad 2, you would not be able to tell the difference, you know why that is....becasue there is none. Ohhh the new version of IOS has slightly different looking icons....it's still the same locked, limited, crippled Iphone OS on a larger screen.  It's a giant, thinner iphone. A total waste of money, espessially when there are vastly better options available from Microsoft and Android that can outperform this toy any day of the week in features and power.", "Date": "December 9, 2013"}, {"Title": "Lol.", "Author": "Max \"Boston\"", "ReviewID": "R28WHNGRGRKWRU", "Overall": "1.0", "Content": "People are going crazy for an ipad coming out a tiny bit thinner, and a little bit more powerful (because we know that app really requires the mega power). Meanwhile a revolutionary, world changing product like Google Glass is getting very little buzz. Appletards really have their priorities straight, huh?", "Date": "November 4, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00G2YDKK0"}}