{"Reviews": [{"Author": "Brian Bair \"Brian\"", "ReviewID": "R30XPMS2F2H9TT", "Overall": "4.0", "Content": "I didn't buy this tablet through Amazon.  Got it on black Friday from we be toys.  I really like the functionality, and the built-in stuff.  It is responsive, seems to work very well.  We got it for $100.  Our first one was dead on arrival (white screen of death).  Took it back, and got one that worked.  However, as soon as you get maybe 5+ apps downloaded, you start to get messages about the storage being full.  It has some weird settings that only allow you to have about 500mb of storage for apps.  That's ridiculous!!  It's an 8gb tablet, and I have a 4gb microSD card, and I am only able to download the Youtube app, amazon app store, AngBirds, AngBirds Go, Temprun, temprun2, and that's it.  It's telling me I don't even have the 5mb available required for AngBird Go update!  Something needs to be done to allow you full use of your 8gb.  I think there is way to move apps to the SD card, which might help, but I haven't figured out how.  But, basically, now that my 500mb is all used up, it won't even function when you try and do anything involving running or downloading apps.  And, trying to get help from Polaroid???  Forget about it.  Their website doesn't even list the product, let alone have anything useful.  If anyone has any insight, please share!!", "Title": "Like the tablet - but storage is weird!!", "Date": "January 8, 2014"}, {"Author": "Randy Fee", "ReviewID": "R130ZU2YDQY709", "Overall": "3.0", "Content": "The recommended case with keyboard included a cord that did not fit the outlet on the tablet.  This required a second cord to be purchased.  I like the touch screen.", "Title": "Fun to use - still learning the ins and outs of functions", "Date": "February 2, 2014"}, {"Author": "Deb", "ReviewID": "R10YJS0RJXY6OT", "Overall": "5.0", "Content": "I love it. I bought it form my husband for Christmas and it does just what we need it to do. It's a little slow but it's not bad.", "Title": "It works just fine for my purposes.", "Date": "January 20, 2014"}], "ProductInfo": {"Price": "$131.31", "ProductID": "B00GPG6YBW", "Features": null, "ImgURL": "http://ecx.images-amazon.com/images/I/41oP%2B2o3DTL._SY300_.jpg", "Name": "Polaroid Google-Certified S10 10-in. Android Tablet"}}