{"Reviews": [{"Author": "Craig Davis \"compulsive reader\"", "ReviewID": "R2NLANBXFVQB0X", "Overall": "5.0", "Content": "Since I've received this  device, I've barely touched my Ipad Mini  Retina. This is an insanely good table for a first offering, and it  includes a free Nokia Power Keyboard if you bought it in time.10 stars.", "Title": "Best table value by FAR", "Date": "December 3, 2013"}, {"Author": "Nicholaus C Lyschik", "ReviewID": "R3JW0I6HPP8G73", "Overall": "4.0", "Content": "Huge fan of Nokia products.  This one is no exception.  Great build quality that has been typical of Nokia of the past several years.  The polycarbonate back is easy to grip and feels great in the hand.  Battery life is amazing and will only get better once the keyboard arrives via the free offer.Also something to check on is that At&t; near me was offering a deal on a phone/tablet combo so I got both for extremely cheap.From what I have seen this device competes easily with the iPad Mini retina at a much cheaper price point.  Value added features include Skydrive and Office baked in at no additional cost.  It has a micro hdmi and mini USB 3.0 but with Skydrive I don't really need either.Only reason for dropping a star is because the screen while amazing in all lighting conditions is a fingerprint magnet.  No big deal I just keep a microfiber cloth with me but it doesn't need cleaning no less than 5-8 times per day depending on use.  I also am picky about my screens being clean so this may not be as much an issue for you.", "Title": "Competes with the iPad Mini retina no problem", "Date": "December 9, 2013"}, {"Author": "ATL_Tech_Guy", "ReviewID": "R34AYUC8M7JLL8", "Overall": "5.0", "Content": "This is the best of the lightweight, thin Windows 8 tablets with 4G anywhere access.  At 1.2 pounds, it's much thinner and lighter than the Microsoft Surface.Update Mar 8: Installed the new Windows 8.1.1 RT update, and so far loving the changes.  Reading mode in IE 11 (better formatted web pages with easy to read fonts); bing search is built in now, integrates with multiple apps, works well, gives pleasing/stylized results (press search, type in song name, press play); new Microsoft apps like health and fitness, etc..  I'll post a full review later on.Update Feb 6: I'm just now realizing how much value is here, with the keyboard case you get the full tablet experience, desktop experience, laptop experience, and ultrabook experience.Update Feb 13: Nokia's power keyboard is now available to buy (see review further below), if you want the desktop/ultrabook experience.Update Feb 21: New Wi-Fi drivers have resolved the standby connectivity bug, so now the software is working perfectly.As typical with Nokia, the build quality is amazing.  It feels more like a smartphone than portable laptop, and the optional Keyboard Case just adds to the appeal.To do all that, Nokia ditched the kickstand and full sized USB ports.  But it's so light and easy to prop up with your leg while sitting down, you won't care.  The keyboard case lets you prop this up correctly as well.I agree with Nokia that 4G anywhere connectivity is the way to go.  This should work with AT&T;, T-Mobile, and possibly some low cost providers (if they can give you a tablet sim).Being Windows RT, the battery life is just that much better and the optional keyboard gives you 18 hours of use with 1 week of standby.  The high output charger recharges the tablet quickly.  Windows 8 is just soooo much better on a tablet than a laptop, it's so easy to use the on-screen keyboard and Internet Explorer is a breeze to use.  Split screen works great, with a video on one side and Internet Explorer on the other side.  Using this in Portrait mode (sideways) to read an e-book is allot easier that other tablets, but I still prefer to lean it against something. The quad core processor is super fast, runs cool, boots very fast, and 99% of websites load with no lag.  Wi-Fi works great, and I did note some very old Wi-Fi routers would loose connection on standby.. which required flipping the tablet's Wi-Fi off & on on.The speakers actually face you directly, so audio is crystal clear unlike other tablets with the speakers on the bottom.  The included headphone jack works great.  The screen is ultra bright with great color & video, although I did buy the anti-glare film which makes a huge difference in screen quality.Comes with front and rear cameras, and Nokia's emphasis on high quality cameras still shows on the tablet.I only want to install apps, so I'm not concerned about running legacy Windows programs on Windows RT.  64GB is enough storage space for apps, pics, and voids, and a 2nd 64/128GB card can be added. I set the camera to 720p, as 1080p recording would use allot of space.  This does come with Office 2013 which just adds to the value, and gives you productivity options.  This can be used as a portable laptop, with the included HDMI video and USB ports for mice and keyboards (or use Bluetooth).Even more value, the included Nokia apps let you download vids and video edit right on the tablet.  The included NFC chip lets you \"tap and upload\" pics & vids right from your phone.  Nokia also includes their high quality mapping apps, which is SOOO much easier to use on a tablet than google maps.Apps download automatically from your Windows 8 laptop if you sign in with a Microsoft email address (or any common email address registered with Microsoft).Windows RT has most of apps I use like Facebook, Hulu, Netflix, Weather, RSS/Weave, and for missing apps I just added internet shortcuts next to the apps/directly to the start screen.Update: Feb 6th:Received the Nokia power keyboard, and once again the quality is perfect.  The desktop is now FULLY useable.  The 2 included full size USB ports will now let you use a wireless mouse, charge a phone, and possibly run a 2nd or 3rd display.  The 2nd battery also registers now in power management, so you can keep an eye on it's consumption.  The power connector is perfectly positioned to be out of the way when using the keyboard case, and charges both batteries.  The whole case has a nice rubbery feel and cuts down on \"slippage\" seen with other tablets.The tablet easily snaps and releases from the holder, securely holds the tablet in place, and this is the easiest way to dock I've ever seen.  The magnetic holder is much more thought out on this tablet, as it just holds the screen securely to the base.  The case also securely holds the screen in place, so it does not \"flop around\" like with other tablet's kick stands or cases.  Just like a real laptop, the screen will turn off if you close the case, and I assume will go into standby (makes me nervous, I always turn off any device before closing it).  You can also press standby on the keypad.The keyboard is nicely recessed for easy typing, the keys are typical 92% sized and spaced far enough for easily typing 85 word per minute.  The keyboard tray makes the whole case nice and stiff, so it is solid when typing on your lap.  Yes, the \"lapability\" is good, with the stiff non-flexing feel and perfect viewing angle.  The keyboard layout is nice.  Like most newer laptops, the function keys control setting first and functions second (ie F1, F2).  That makes more sense to me, I prefer changing the volume without having to press the Fn key.  I'm assuming this can be switched to the traditional method in settings as well.  The pg/up, pg/dwn, home, and end buttons are integrated into directional keys, and I found activating them with the Fn key or caps lock (Fn lock) fairly easy to do.  Same with the number pad.  There are separate buttons for brightness, app list/switcher, context menu, and print screen.  The more advanced Windows 8 shared buttons are here to, for switch screen, adv/context search, devices, share, advanced sleep.  Plus volume controls, play, pause, skip.The mouse/track pad supports full gestures for \"two finger\" scrolling, side swipes to bring up Windows 8 functions, pinch to zoom in, etc..  The pad itself is smooth and rubbery, and the button style is \"press and hold\" vs \"press and click.\"  That works fine for most desktop apps.  I am a bit concerned about the mouse pad being on the \"closing flap.\"  Even with the re-enforced bump in the closing flap, that much flexing combined with excessive lap use could affect the mousepad.  I'd recommend not constantly typing while on your lap to cut down on the flexing.Pros:  Nokia build quality, lightweight, thin, great screen, audio, speed, boots fast, battery life, fast recharge, keyboard case/second battery, camera, touchscreen experience, full desktop mode experience, full ultrabook laptop experience, Microsoft Office is included, Nokia apps, Windows 8.1 is much better on a tablet.Cons: Typical new product, day 1 annoyances... I had to reinstall the Nokia apps to resolve a bug.  The NFC \"pairing\" with your phone to upload vids & pics works great, but it is a little slow.  Buy the anti-glare film .. it makes a huge difference, like most tablets/laptops the glare is annoying.  You may want to zoom the Internet Explorer app from 125% to 150% or more, but it still works great.  Windows 8.1 \"Swipe to switch apps\" is annoying, switch to \"Swipe to see app list.\"", "Title": "Best of the lightweight, thin tablets.", "Date": "December 26, 2013"}, {"Author": "shame", "ReviewID": "R27Z7S4GRRNLMY", "Overall": "5.0", "Content": "Absolutely love this.  Good Battery.  Smooth UI.  App selection that gets bigger each day.  Got it second day it came out.  Do not regret this at all.", "Title": "Absolutely love this.  Good Battery.  Smooth UI.", "Date": "December 6, 2013"}, {"Author": "efficacy", "ReviewID": "R1O1ES6KTI7IUM", "Overall": "5.0", "Content": "First and foremost, you don't need to purchase a data plan from AT&T; to use the Lumia 2520. That's probably obvious to most people out there, but just like any other tablet, boot it up and connect to a WiFi network - then you're good to go. You have the option of connecting to an AT&T; HSPA+ or LTE network the same way you would any WiFi network, and when you do so it'll prompt you to activate the pre-installed SIM card. Otherwise, no monthly data plan required.Pros:- Screen is gorgeous. The 1920x1080 IPS display has magnificent viewing angles, the brightness is more than good enough for reading and browsing outdoors on a sunny day.- Performance screams! The Snapdragon 800 processor made me raise an eyebrow at first, but I suppose they went that route for the LTE capabilities. It's as good or better than any of the Intel counterparts. 1080p video plays perfectly without skipping a beat, games look great, screen animations and transitions are zippy and smooth.- The soft touch plastic the case is made from is great to hold. There's something to be said about the magnesium case of the Surface 2, or the anodized aluminum of the iPad air...but the plastic on the Lumia 2520 doesn't make it feel any less sturdy by any means. In fact, after using it for a couple days, I like it better than the Air.- Sound - I don't know where it comes from, but it's stereo, and it sounds as good as my MacBook Pro.- Battery Life is fantastic. The rated 11+ hours is dead to real. I spent an hour and half or more browsing the internet at 50% brightness with the battery at 7% before it told me to save my work and shutdown.Cons:- Windows RT. Nothing more needs to be said really. With RT you're limited to whatever apps you can find in the Windows Store, and it's slim pickins still years after release. Obviously the largest companies have really well designed apps that work as well as any other mobile OS's, but there aren't really any startups or independent software companies making good apps for this ecosystem. You don't even have to install a lot of apps to see that this is the case. The app icons in most cases are so severely lacking that you wouldn't even consider clicking on them to begin with.- Funny enough, the screen is also a con somewhat. For as gorgeous as it is overall, the one I received has really bad backlight bleeding on the right edge. On the bootup screen when it's entirely black, it's super obvious. When you reading in low light conditions it's also very obvious. I'm considering returning it because perhaps I just got a lemon.Other thoughts: I think the Lumia 2520 has a niche - and it fills it perfectly if this is what you're looking for. If you're always on the go and don't always have access to WiFi, or don't want to bother friends and family for their WEP/WPA passwords when you're at the their house, this tablet is great. Also, if you require access to Office applications on you tablet, the experience is second to none. If Windows RT will suffice for your needs, and you need a tablet with LTE, gorgeous screen, and great battery life, you can't do much better.", "Title": "One of the best RT Tablets out there! Don't need LTE Plan to use!", "Date": "January 17, 2014"}, {"Author": "D. Schiopu \"Zvery\"", "ReviewID": "R1MUQXQD3GV0OF", "Overall": "5.0", "Content": "Got mine at At&t; also, as a bundle with the Lumia 1520. Love both. I wanted this tablet since it got announced. I'm a student and it exactly the tablet I need. Has Office, Skydrive, NFC, offline maps and much more, plus you can't compete with Nokia quality, feels great in hand and it's very light. I also filled an application for the free power cover Nokia was offering on their website, hopefully they still have some left. The screen is a fingerprint magnet, but like somebody else said, I always have a cloth handy to wipe it once in a while.P.S. Haven't touch my Ipad mini since I got the tablet :D", "Title": "Love my new tablet.", "Date": "December 11, 2013"}, {"Author": "Pablo", "ReviewID": "RTQMBY0Q23DWU", "Overall": "5.0", "Content": "I had been mulling over which tablet I should get for school to replace my iPad 2. It was a tough decision between the iPad Air, The Surface, and the Nokia Lumia 2520. After considering, I decided to go for this tablet.The look and feel of the tablet overall is incredible!The ports and buttons are in optimal places as well.I have not regretted purchasing this tablet at all. I did hear one complaint amongst owners and potential buyers was that the charging port plug was \"uninspired.\" True it is a 2.5mm round power connector, but this connector plugs in to the device and requires some pushing to really get it to go in. It does not feel like the cheap car chargers for flip phones of the 90s. Personally, I am ok with the fact that it is a round connector like that as it keeps the tablet thin enough.As far as storage, once you free up space by uninstalling unnecessary apps and backup the restore image to a flash drive, there is ample space. Adding a 64 GB UHS1 Class10 MicroSD card will also give you plenty of space to do whatever you need to on this tablet.The only thing I did wish AT&T; did with this tablet, was offer it in red. But that is what the Nokia Power Keyboard will be for, whenever it gets released here in the US.", "Title": "The replacement for my iPad 2", "Date": "January 31, 2014"}, {"Author": "V. Martell", "ReviewID": "R2TSGRIB06IG7D", "Overall": "5.0", "Content": "I was hesitant to purchase this tablet due to all of the horror stories I've read re: lack of apps. Having now owned the 2520 for two months, I have yet to have any problems finding apps that I need as well as great apps for sports, games, news, weather, social media, health, fitness, etc. The only app I missed (at first) from my iPad days was NHL Gamecenter, but I can connect to the NHL Gamecenter site and log in and watch games on here just as easily as with the app. The screen is spectacular for photos and videos, the sound is amazing and having Office built in is the icing on the cake. I haven't used any other tablet since buying this one. One of the best purchases I've made in a long time. I'm now considering a Nokia Lumia phone to replace my iPhone as well. If the phones are half as good as this tablet, I'll be thrilled. Don't hesitate to pick this one up.", "Title": "Love my 2520", "Date": "March 19, 2014"}, {"Author": "Mariateresa \"Mariateresa\"", "ReviewID": "R1OYDB09M09B0R", "Overall": "5.0", "Content": "Best tablet. It has replaced my iPad. It is super fast and responsive. It's very solid. I'm waiting to get the keyboard.", "Title": "Best tablet", "Date": "February 15, 2014"}, {"Author": "Jon Day", "ReviewID": "R34AV3NGOYYBOC", "Overall": "5.0", "Content": "This may be Nokia's first offering in the tablet market, but this is a great device.  I have a small station set up in my living room for it with a wireless keyboard and mouse from Logitech and use the USB 3.0 port to attach my hard drive and then connect it to my flat screen TV through the HDMI port.  I also just got my keyboard and I must say that this slaps all of the ZAGG offerings right in the mouth.  Extra battery life and an extremely responsive keyboard and track pad.  Simply fantastic.", "Title": "Incredible Tablet", "Date": "February 1, 2014"}, {"Author": "G", "ReviewID": "R3QGT6N8EXRHVN", "Overall": "5.0", "Content": "I order from AT&T; when they had the deal of getting the Lumia 1520 and Lumia 2520 together and you can get the tablet for 200, which I still think to this day as a steal, because this tablet is fast, and it have one of the better display out of any tablet. If its your first time to Windows tablet, then this would be a perfect choice to start with. If you buy it before the deal end you can get a free keyboard that also pack a battery in it, which make the tablet last more then 15 hours", "Title": "Best Tablet Ever", "Date": "December 20, 2013"}, {"Author": "LBI Doc", "ReviewID": "RPW00FGDB7KWT", "Overall": "5.0", "Content": "Gorgeous full HD screen, solid but lightweight build, and if you bought this during the promotion a free power keyboard to go along with it. Definitely a contender! I haven't used my iPad since I got this and I am a big iPad/iPhone fan, but rapidly becoming a fan of the Windows 8.1 upgrade and Windows Phone 8, many more apps in the store and very fast, fluid, and customizable interface. If you are an AT&T; mobileshare customer (or want to become one) only $10 a month to add this to your plan for the 4G data. Very highly recommended.", "Title": "Gorgeous full HD screen and solid build make this a great tablet, especially for the price.", "Date": "December 12, 2013"}, {"Author": "francisco vega", "ReviewID": "R3CN4695HBZ3DY", "Overall": "4.0", "Content": "Great tablet. Use every day for entertainment, play and productivity.Pros: Fast, brilliant screen (1080p movies look incredible), light and easy to hold, micro sd expansion, price is right and exceptional battery lifeCons: Keyboard cover expensive (unless you got a free one), USB 3.0 is not standard can not find cable at any of the local stores (reason i dinged it a star) and although i do use office the screen is a little small to work excel.I would highly recommend this tablet for an amazing overall tablet experience.", "Title": "Lumia 2520 Nokia got it right on the first try", "Date": "December 11, 2013"}, {"Author": "Michael C", "ReviewID": "RVGZUGJ3MXMZ2", "Overall": "1.0", "Content": "I have spent hundreds of hours working with Nokia and AT&T.;  2520s do not work consistently.  Do not buy.First purchased on 12/2/14.  Crashes, crashes, crashes all requiring full reinstall of Windows, not just a repair or refresh to fix.  Took 4 weeks of constant calls to Nokia and AT&T; to get it replaced. When problems just getting replacemnt, I asked to simply return it under AT&T;'s 14 day \"no questions asked\" policy, but still took 4 weeks to get it done.  AT&T; does NOT treat this device like a cell phone.  Completely different process that doesn't work!!!!  1/7/14 new unit purchased under NEW order from AT&T; arrives (Not refurb or repaired warranty device, new!).  Doesn't crash but has various occasional hangs, touch failures, etc that require restarts 3-4 times a day (I have an MS Surface tablet that exhibits problems like this maybe once-a-month).  Finally in Feb the Nokia Power Keyboard arrives.  When docked w/keyboard the 2520 hangs, touch screen hangs, keyboard unresponsive at least once EVERY 30 minutes of use - requires restart to fix.  When docked in keyboard hangs EVERY time goes to sleep for longer than 15 minutes.  EVERY TIME!  5 weeks of constant calls to Nokia, 5 weeks of reinstalling the OS, reinstalling drivers, redoing all of the Windows updates, posting videos of problems for Nokia support to see, of redoing all of my mail settings, my preferences, etc, again and again and again at the request of the Nokia support team, all to no avail and Nokia FINALLY agrees to replace 2520 tablet.  I send it in, 3 weeks later they send me back my original device.  WRONG!  And they damaged it, huge scratches all across the display.  They included a report stating it passed automated functional testing.  Obviously pretty terrible test criteria not to catch all these problem.  Also, the report indicated that nobody in customer service actually passed on to the repair department what the problem was so they didn't even know what to test for.  Great communication.3 days of phone calls and Nokia finally admits they made a mistake and agree, AGAIN, to replace 2520 and now the keyboard as well.  A further 3 weeks on and Nokia has both my keyboard and tablet, I have nothing.  No replacement in site.  No argument from them that they owe me the hardware, just no commitment on when, if ever, I'll actually get it.  Nokia says supply issues, yet it is available in all my local AT&T; stores, the local Microsoft store, I can purchase it on line from AT&T;, Verizon, and Microsoft, but supposedly they don't have any stock to replace my device and I've been waiting 6 weeks from their original commitment.If 1 thing is brutally apparent, Nokia has spent decades doing business behind wireless resellers who support their products.  Nokia never learned how to work with the public, with consumers.  Not my opinion, I've been on the phone with numerous people in Nokia support mngmt and Nokia Complaints dept that say they are just waiting for Microsoft to take over because they are overwhelmed by supporting a Windows device directly.  Pathetic.", "Title": "Beautiful hardware - if only it worked - Nokia has worst support ever", "Date": "May 2, 2014"}, {"Author": "Allen Straith", "ReviewID": "RJ4KOZ8EM7EIS", "Overall": "4.0", "Content": "So, let's make this quick. The tablet is, so far, fast and fun. It's light and easy to use. Sure, doesn't play any old PC software. Does an iPad play legacy Mac software? No? Well, why would you expect the Lumia 2520 to do that then? But, if you need a tablet with keyboard accessories and Microsoft Office (the only app I need) ... then this is what you should get.", "Title": "Nokia Lumia 2520 = Awesome", "Date": "March 6, 2014"}, {"Author": "Brad Luyster", "ReviewID": "R3FO9HEEY2SLL0", "Overall": "5.0", "Content": "Nokia has done it. They have made Microsoft cool. This tablet has all the features you want, MS Office productivity including Outlook, gaming, Wifi and 4G with a huge bonus, battery life! If you purchase the 2520 the must accessory is the power keyboard. The optional keyboard has a battery and gives the user an extra 4 to 5 hours of extended battery. I have tested the combination over the last two weeks and through heavy usage I do not need to recharge my battery for about 1-1/2 days. Amazing! The other bonuses: USB ports (1 on tablet + 2 on keyboard), HDMI port and expandable memory (I put an extra 64GB in the microSD slot).I love how Windows has given me a seamless environment: OneDrive (aka SkyDrive) is the perfect tool, OneNote helps me stay organized, and the whole productivity list goes on and on. Apple and Android have been left in the dust with this tablet. Windows RT is a great OS, Nokia has the hardware and the rest is history.", "Title": "Best tablet on the market", "Date": "February 16, 2014"}, {"Author": "R. Lindfield", "ReviewID": "R22RGYJDU0Y78M", "Overall": "5.0", "Content": "The app store is lacking, but the tablet and OS are pretty solid. I'm pretty happy with it over all. I try all the new devices and tablets and up until now  nothing besides an Ipad has seemed like a polished, solid product. The part that hurts is that app store. Your core stuff is there, for me it was Office, Mint, Amazon, Netflix, Amazon, Facebook, Twitter, and Kindle reader, but once you get outside of the super mains-stream stuff, say Angry Birds, it falls off very quick. Tons of junk apps in the store and not much that's useful. It does most of what I HAVE to have but nothing on the list of what would be really nice to have. For instance, no WebEx, no Cisco VPN client, No Adobe Connect or GoToMeeting. Navigation apps seem a little screwy too. I think once this catches on it's going to be fantastic but for right now you KNOW you're in new territory. My rating here is for the Tablet itself, just wanted to disclose the caveats of Windows vs Iphone / Android. It's .1% mature in comparison of apps.", "Title": "New kid on the block, but he's gonna do OK", "Date": "February 6, 2014"}, {"Author": "D. Tyo", "ReviewID": "R2XVS5DGH4H62P", "Overall": "4.0", "Content": "I bought the 2520 for my wife to replace her older/larger laptop and she's been very happy with it.  I would have purchsed the MS Surface 2, but it does not have built in GPS like the 2520, which I consider a big mistake for a tablet product.  Also, while I don't have the 2520 on a data plan, that option is available.  The biggest issue is the lack of the keyboard that Nokia advertizes!  The tablet is functional without it, but it isn't a real laptop replacement without it!", "Title": "A great tablet, but not happy that the keyboard is not available", "Date": "January 17, 2014"}, {"Author": "Dan", "ReviewID": "R2TKVYG446QVQF", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1C41UURUME27VembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1C41UURUME27Vrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1C41UURUME27VchiDiv\").innerHTML = document.getElementById(\"cv_mo1C41UURUME27VhiddenPre\").innerHTML;\n};\ncv_mo1C41UURUME27Vrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1C41UURUME27Vso;\t   \n\n\nfunction cv_mo1C41UURUME27VloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1C41UURUME27Vso = new SWFObject(swfLocation, \"cv_mo1C41UURUME27VAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1C41UURUME27Vso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1C41UURUME27Vso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1C41UURUME27Vso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1C41UURUME27Vso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1C41UURUME27Vso.setAttribute(\"height\", swfHeight);\n          cv_mo1C41UURUME27Vso.setAttribute(\"width\", swfWidth);\n          cv_mo1C41UURUME27Vso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1C41UURUME27Vso.write(\"cv_mo1C41UURUME27Vflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1C41UURUME27V', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1C41UURUME27V';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1C41UURUME27V', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1C41UURUME27VloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1C41UURUME27V\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"183-9332584-4522527\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1436VBYWDCL89\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1436VBYWDCL89\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2TKVYG446QVQF\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1436VBYWDCL89/183-9332584-4522527\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/183-9332584-4522527\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1C41UURUME27Vduration')) {\n      document.getElementById('cv_mo1C41UURUME27Vduration').style.display='none';\n    }\n    cv_mo1C41UURUME27VloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1C41UURUME27VloadSwf(movieID, playerVersion) {\n   return _cv_mo1C41UURUME27VloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1C41UURUME27VnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1C41UURUME27V', 0, h);\n}\n\nfunction cv_mo1C41UURUME27VresetPlayer(w,h,bw,cc) {\n  cv_mo1C41UURUME27VnewHeight(h);\n\n  cv_mo1C41UURUME27Vso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1C41UURUME27Vso.addVariable(\"cacheCode\", cc);\n  cv_mo1C41UURUME27Vso.setAttribute(\"height\", h);\n  cv_mo1C41UURUME27Vso.setAttribute(\"width\", w);\n  cv_mo1C41UURUME27Vso.write(\"cv_mo1C41UURUME27Vflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1C41UURUME27VRollOverImg = new Image();\ncv_mo1C41UURUME27VRollOverImg.src = \"http://ecx.images-amazon.com/images/I/71YvDSW3kqS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1C41UURUME27Vpreplay = document.getElementById('cv_mo1C41UURUME27VpreplayImageId');\nif (cv_mo1C41UURUME27Vpreplay) {\n  cv_mo1C41UURUME27Vpreplay.onmouseover = function() {\n    cv_mo1C41UURUME27Vpreplay.src = \"http://ecx.images-amazon.com/images/I/71YvDSW3kqS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1C41UURUME27Vpreplay.onmouseout = function() {\n    cv_mo1C41UURUME27Vpreplay.src = \"http://ecx.images-amazon.com/images/I/71YvDSW3kqS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1C41UURUME27Vpreplay.parentNode;\n\n  var cv_mo1C41UURUME27VcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_mo1C41UURUME27V/183-9332584-4522527?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1C41UURUME27VcurrentClick) {\n      return cv_mo1C41UURUME27VcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 3:19 MinsThis is a video review from the DarGadgetZ YouTube Channel...This is a great Windows RT 8.1 tablet that stands up to the competitors. The tablet doesn't come with a keyboard, which I recommend. The screen is one of my favorite parts of the tablet, it just looks great in any situation.Enjoy the video!PS - You should subscribe to the DarGadgetZ YouTube channel!", "Title": "Solid Windows RT Tablet", "Date": "December 26, 2013"}, {"Author": "Rodney Duckworth", "ReviewID": "R1AE2N4SVT271P", "Overall": "2.0", "Content": "I don't normally write reviews, but I think it may be warranted here. Let me first say, I love Nokia and Microsoft. I'm typing this review on my Lumia 920 and I think Windows 8 is fantastic. I've loved Microsoft since 1996, when at 12 years old, I got my first Win95 PC. This was a replacement for a company iPad I lost and I really wanted to love it. To the point, the hardware specs, design and connectivity options are great. In practice, though, the tablet was very buggy. Spontaneous reboots would happen, on average, every couple days. Responsiveness of the Windows button on the screen would become hit or miss when I had several apps running. Bear in mind that Windows RT is not an iOS competitor. This is full-blown Windows with some limitations that stop you from installing software outside the Store. It comes complete with services.msc, regedit, you name it. This is a PC through and through. And there inlies the problem. It has the same power options as PC, including sleep, which is what it does after the screen has been off for a few minutes. It halts everything and goes to sleep - even file transfers. Transferring some movies before a flight was almost the end of me when I found myself copying the same 2GB file for the 4th time and hoping I didn't forget to touch the screen every couple minutes to keep it awake. Wireless network speeds were also terrible - on the order of about 2MB/s actual throughput. Skype quality was awful, even when my phone had no trouble on the same WiFi network. After a weeklong vacation with it, I was done. Packed it up and sent it back. MS needs to either dump RT and start putting the windows phone software on tablets, or really gut RT to make it a tablet OS.", "Title": "Great hardware, bad software", "Date": "April 4, 2014"}, {"Author": "Fingschlyster", "ReviewID": "R3DP9KF22DXZ42", "Overall": "3.0", "Content": "Overall the 2520 Lumia is a decent tablet, but it has some issues.The scrolling will freeze occasionally for no apparent reason. Freezes often enough so as to be irritating. The freeze will clear itself about 75% of the time, but a restart is needed 25% of the time. Tablet also has difficult time opening links. I've taken it back to AT&T; store twice and of course it didn't act up for salesperson. AT&T; store employees are never very helpful in checking into problems very thoroughly anyway. The battery life is outstanding as is the picture quality. One other black mark against Nokia is lack of availability of accessories of any type for the 2520 tablet. I purchased this tablet the first day AT&T; made it available, two months or more ago. The keyboard everyone is making such a big deal about has yet to be released. I've noticed in other reviews that the 2520 was given only one star because of the 'fictional' keyboard.Tablet has Microsoft Office Home & Student installed...a very welcome touch, and it's Windows 8.1 so no need to use upgrade to 8.1 link.", "Title": "Has its share of quirks", "Date": "January 12, 2014"}, {"Author": "HK", "ReviewID": "R1M4ASCV66ROQX", "Overall": "2.0", "Content": "Everything clashes from apps to software. It's a nightmare to connect any bluetooth, Very limited apps and most of them you have to pay for it. When browsing the internet, it's really annoying that it doesn't \"click\" whatever you want to on first try and you have to click several times in order to make it work. I don't use Xbox, so it's kind of useless for me.Specs: doesn't have a regular \"usb\"; the earphone plug and power connection is on the same side and it's very confusing time to time. And sometimes it's just runs very slow.  And for tech support, you will have to mail it to Nokia and be without service (if you have a sim card) while there unless maybe if you can find a Nokia or Windows Store.If you are looking for apps, forget it, I don't recommend at all. It's only good to use basic stuffs like MS Office and Internet.", "Title": "Limited apps and crashes all the time", "Date": "June 10, 2014"}, {"Author": "Deean R. \"deean225\"", "ReviewID": "RCXZ60B7AH3MU", "Overall": "3.0", "Content": "this tablet is a great tablet and I actually gave up my laptop and use this exclusively.  There are two big issues though.  When it goes into sleep mode, it is very, very hard to get it turned back on.  Secondly, the AC 300 charger used with this equipment, is prone to falling apart and giving a fairly big electric shock.  This charger was pulled off the shelves in Europe it was such a big problem.  Mine fell apart as I was unplugging it and I suffered a big shock that left my hand numb and tingling.  Just be very aware.  Otherwise it'd get 5 stars from me.", "Title": "CAREFUL!  The charger electrocuted me", "Date": "June 3, 2014"}, {"Author": "Heavyrain2408", "ReviewID": "R2Z0KZNN0BIYLE", "Overall": "5.0", "Content": "I love love love this device. Screen is crystal clear. Full HD, make it on par with the iPad retina. It is very responsive too. I think this is even better than the Microsoft Surface. If it get the Sufface kickstand, would be awesome.Cons: a little heavy to use for long period of time. Feel a little bit hot after watching movie with 4G. No other mobile browser than IE :(", "Title": "Awesome device", "Date": "May 15, 2014"}, {"Author": "Kevin", "ReviewID": "R39I2RT1EQ9D9", "Overall": "5.0", "Content": "But only problem is getting a warranty and connecting to Bluetooth after it has gotten connected before. Had to remove then reconnect", "Title": "awesome", "Date": "April 3, 2014"}, {"Author": "ski dude", "ReviewID": "R20INI7B2ZVPVJ", "Overall": "5.0", "Content": "I have had this tablet for about 3 weeks and wow. I have a surface 64gb as well and I like this more. I writing the review on it right now. The only things I have gripes with are the lack of good cases and you can't find extra power adapters easily. Win 8.1 rt is great, Microsoft did a great job on this one. I bought mine from ATT and got a 100 line credit so that's awesome.", "Title": "WOW", "Date": "March 21, 2014"}, {"Author": "Maksym", "ReviewID": "R2I5LWGWNSRWVJ", "Overall": "5.0", "Content": "Can somebody tell me about 4G? Will it works with another carrier? Or I need to unlock it by ATT? I want to use it in Europe. Thanks", "Title": "Does it unlocked or only ATT?", "Date": "January 13, 2014"}, {"Author": "jfranco", "ReviewID": "R2J2DN90JA3QL1", "Overall": "5.0", "Content": "I have been using the 2520 for about 2 weeks and so far so good. Since using the tablet I have not experienced any issues. Nice quality design, fast processor making it very responsive, great build quality. The video playback and audio quality from the front facing speakers are superb. I have learned to favor the snap dragon processors over NVIDIA. I owned the transformer prime and the infinity and after owning this I gave those away. My only issue with this is more of a windows issue but, at this time you can not modify the registry to install the apps to sd like you could before the update to windows 8.1. The whole reason why I purchased a class 10 64 gigabyte card was primarily for that reason. It would of been better if Nokia offered a 64 gig model. When you first purchase the tablet you only have about 17 GB left to use. Nokia should of had the keyboard ready at the time this tablet was available for purchase. Once it becomes available I will update my review.", "Title": "great windows based tablet", "Date": "January 12, 2014"}, {"Author": "The Reviewer \"To be, or not to be.\"", "ReviewID": "R15374XVQYU0R", "Overall": "4.0", "Content": "Looking for simple? Its here. I love this thing. Add a micro SD to hold your files. I love Windows it's great.", "Title": "Powerful enough for the common user", "Date": "December 29, 2013"}, {"Author": "Shirley", "ReviewID": "R1054PJD9MTR14", "Overall": "1.0", "Content": "The tablet itself looks cool, but the touchscreen is constantly not working, and the tablet will freeze up often if not reset all the time. I hardly even use it for anything. My boyfriend bought it for me as a valentine's gift, and I'm not one to complain about a thoughtful gesture but damn this tablet sucks.Talking to at&t; is the most annoying process ever!! They will send you to another store, and when you get there they will tell you to go back to the one you just left! If you are having problems with your 2520, just go to a corporate store and demand a refund right away. They will give you one if it is within 14 days, but they will damn sure try to make it an inconvenience in hopes that your 14 day money-back guarantee expires. I am upset with this product and at&t.; Do not recommend! Save your money and buy something more reliable.", "Title": "Glitchy tablet, horrible customer service", "Date": "March 7, 2014"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B00GMUTQWK", "Features": "NULL", "ImgURL": "NULL", "Name": "Nokia Lumia 2520 4G LTE Tablet, Black 10.1-Inch 32GB (AT&T;)"}}