{"Reviews": [{"Author": "Eliot Cohen \"Eliot\"", "ReviewID": "R3BDZAC9M2PGJF", "Overall": "4.0", "Content": "We bought three of these in different colors for our Grand Daughters. 7.9 and 12.  They were always \"borrowing\" there Mom's more expensive tablet.  Now that they have their own, no issues and they do everything the more expensive one does for a fraction of the price.", "Title": "Great substitute.", "Date": "December 9, 2013"}, {"Author": "Chris", "ReviewID": "R2QR1SI6C5J5T6", "Overall": "1.0", "Content": "I have left it plugged in for ten hours . Over ten hours actually and the tablet still won't run on! I guess I have to return it. It looked like a nice tablet too.", "Title": "Won't turn on", "Date": "December 3, 2013"}, {"Author": "Blake", "ReviewID": "R3VH8IRHY2O2I7", "Overall": "5.0", "Content": "I purchased this for my 10 year old for his birthday he has not played it down it was it works really good on wireless internet and we can ride in the car and he's playing his games that he got off Google Play.", "Title": "really good for the money", "Date": "December 2, 2013"}, {"Author": "Dianna L. Honeywell", "ReviewID": "R6YZLDILMID0Y", "Overall": "1.0", "Content": "I bought this tablet fory son for a 6 hour plane flight.  I tried to charge it but it would not turn on.  It turned on once long enough for me to download a couple of his favorite apps.  Now I can't get it to turm back on.  We couldn't use it on our trip and now I have to go through the hassle of trying to figure out how to return it.  Big bummer!", "Title": "Would Not Charge/Turn On", "Date": "November 30, 2013"}, {"Author": "Deanna Neece", "ReviewID": "R3UM9N0Z6YB34J", "Overall": "4.0", "Content": "Not sure yet as this is a Christmas gift.  However, the person I bought it for loves to use mine, so as long as it works she will love it too.", "Title": "NOt sure yet, this is a gift", "Date": "November 27, 2013"}, {"Author": "flojo", "ReviewID": "R1C23DVR6Z0YYX", "Overall": "1.0", "Content": "very poor, assistance none existing several calls for help per instructions that came with device sorry we purchased although we were warned of the poor quality.", "Title": "Poor Quality", "Date": "January 10, 2014"}, {"Author": "Barb", "ReviewID": "R5609FH9XIDQQ", "Overall": "1.0", "Content": "This was the big gift for my teens and my sons would not turn on after following all instructions and now I am going thru a pain to get this returned and get him his gift before his break is over. He gets to watch his sister enjoy hers and it is very disappointing to a mother. He is such a good kid and didn't deserve to have his biggest gift turn out to be crap and not useable. Now his break has been the usual video games. Stinks!!!!", "Title": "Sad for my 13 year old son", "Date": "December 30, 2013"}, {"Author": "Divinely Beautiful", "ReviewID": "R2Y2L2B310B6OS", "Overall": "1.0", "Content": "The resolution is not good enough eve for A 2 year old. Ordered two for each of my kids and the pictures are just horrible", "Title": "This tablet is horrible !!!!", "Date": "December 27, 2013"}, {"Author": "River", "ReviewID": "R2MXX9UV7MB4V0", "Overall": "1.0", "Content": "This was second 1 of these I had. the 1st one was DOA. The 2nd one worked for 2 days and locked up twice showing nothing but lines, it did reset finally but was really slow. I think the processor is not very good and the internals do not play nice together. The battery life seemed really short too. I cannot recommend these.  Buy an HP 7 at Wally world a much better tablet for about $10 more.", "Title": "Not Good", "Date": "December 22, 2013"}, {"Author": "Dana Robinson", "ReviewID": "R193C6KNWRCOE8", "Overall": "1.0", "Content": "Well, looks like we have to return this tablet. Literally in less than an hour of opening and setting it up, the screen started to fail on us.We liked being able to choose from the different colors as we got multiple tablets for the older kids to choose from. But alas, they just won't work. We give up and are shipping these things back.", "Title": "Returning", "Date": "December 19, 2013"}, {"Author": "Taylor Fehr", "ReviewID": "R3AX1XTMMCHZMR", "Overall": "4.0", "Content": "This is a very good tablet for the price. People failed to mention in past reviews that they understood the screen was made of glass so be extremely carefuk , this would do great with a case and charges fine. Shipping was fast too. Get it, its more of a tablet to fool around on though. Not a school tablet.", "Title": "very nice.", "Date": "March 19, 2014"}, {"Author": "dennis", "ReviewID": "R236MJM4WXI5DD", "Overall": "5.0", "Content": "thank you so much i llike so much now thank u again have a good day i give u 5 i wish can give more star", "Title": "hey", "Date": "March 18, 2014"}, {"Author": "Wayne Kiefer", "ReviewID": "R2O5GYOV53SZG2", "Overall": "4.0", "Content": "Everything works just as I expected except the battery life is very short.  They could add a stronger battery and it would make it much better.", "Title": "Works good", "Date": "March 18, 2014"}, {"Author": "karmatheone29", "ReviewID": "R26QKETT9907TE", "Overall": "4.0", "Content": "we bought this item for my boy friends kids my boyfriend plays it way more the then kids although we had some minor issues with it at the beginning it tends to be a bit slow and sometimes the screen freezes up I am happy with the product overall", "Title": "very nice  to have for kids", "Date": "March 17, 2014"}, {"Author": "Linda Kornilieff", "ReviewID": "R1O5LL6L47M0CE", "Overall": "3.0", "Content": "I ordered this thinking it was better or as good as my kindle fire and it is.. no descrepency there. however 3 days later if found this same item on EBAY for half the price. it has good quality videos and takes good pictures but I'm now unhappy that I found it just 3 days later. this to me is not right. and the price on ebay is not a bidding price it is the actual buy it now price. same exact item all the same colors etc. this is priced to high for sure. sorry but it is. thinking about returning it and purchasing the same thing for $44 off ebay and also free shipping. the truth is the truth", "Title": "very similar to Kindle fire Hd", "Date": "March 16, 2014"}, {"Author": "Cody", "ReviewID": "R30ZWD6BZVLBJI", "Overall": "2.0", "Content": "I need to return this item. It wont charge. It worked fine for a few months.  Now it's completely dead.", "Title": "dragontouch tablet", "Date": "March 16, 2014"}, {"Author": "amie", "ReviewID": "R33Y7LS9P1A41O", "Overall": "5.0", "Content": "It works great for what I need and want. hold a charge for all day. I love it thank you", "Title": "amie", "Date": "March 13, 2014"}, {"Author": "Channell Carmon", "ReviewID": "RU4WEZNL17GT5", "Overall": "2.0", "Content": "It works slow I would pefur this to any one at allBut it is a nice price really. Thank you", "Title": "i wouldn't bye this product again", "Date": "March 13, 2014"}, {"Author": "Jose", "ReviewID": "R21WJCT28YK04Y", "Overall": "1.0", "Content": "It worked till the return date expired and now I am stuck with a tablet that doesn't work. At first I would have to hold the power button for several minutes for it to turn on but now nothing and will not power on. Also the camera stopped working before that.", "Title": "Don't waist your time.", "Date": "March 1, 2014"}, {"Author": "taunya", "ReviewID": "R24P9RWNP8PJE5", "Overall": "5.0", "Content": "This handy little tool is great for kids to learn and for travel. My niece is have a great time with this product.", "Title": "tablet", "Date": "March 1, 2014"}, {"Author": "Stephen Carroll", "ReviewID": "RW1K7MBL5380C", "Overall": "4.0", "Content": "I liked it fine until it decharged and refused to budge.  No idea if it's the charger or the tablet even.  Plugged it in later, and Voila!  it started charging.  Will keep you posted here about the miraculous resurrection ;)  ratings going from 1 to 4 depending on current status", "Title": "Died after two weeks :( ...then came alive again!!  whooo hoo!", "Date": "February 28, 2014"}, {"Author": "Classic City Cockatiels \"Classic City Tiels\"", "ReviewID": "RQ0Z9QYD7JOYR", "Overall": "5.0", "Content": "I am so impressed with this little tablet.  great acces to google apps, nice looking case that stands out from most others being red and then having a dragon on the back as well!!  Size, Price,& shipment was super as well!!  delivered during our first snow storm!!  Would buy another from here if I had the need \"\"LOVE IT\"\"", "Title": "DRAGON TOUCH", "Date": "February 27, 2014"}, {"Author": "Anita L Day", "ReviewID": "R6GO1C1I68JOW", "Overall": "1.0", "Content": "This has lasted only 4 weeks and will no longer turn on. When you do get it to turn on it takes 20 minutes. I ordered this on 1/16/14, shipped on 1/18/14 and received 3 to 4 days later, not sure of exact date. The return police expired on 2/22/14.  $80 bucks down the tubes and one very unhappy grandson. If there was less then a 1 star I would give a zero!!!Due to an on going problem with Dragon Touch Tablets that they are very well aware of. We received a replacement for the 1st one around the 1st week in March. 2 1/2 weeks later the 2nd is doing the same thing. Now CS Tablet Express wants us to do a fix that THEY knew about at our expense of $30 for a mini SD card to POSSIBLY fix it. I asked for a refund as we had less then 3 weeks. They now inform me the 30 day warranty has expired and I would be generous enough to give me 70% back. No wonder people are leaving bad reviews. Bad tablets and very poor service!!!!!", "Title": "Very disappointed,", "Date": "February 26, 2014"}, {"Author": "trashika", "ReviewID": "R1OEWFENXV0E16", "Overall": "4.0", "Content": "I give it 4 stars it's great. My 10 yr old niece loves it. She is on it constantly before and after school", "Title": "4 stars tablet", "Date": "February 26, 2014"}, {"Author": "Tina", "ReviewID": "R2ZUT3RUWWTT5Q", "Overall": "1.0", "Content": "Have purchased 2, which both had to be returned for defects. This product is not worth the money, or the disappointment it put my daughter through. If you are considering a tablet, skip this one. It is junk.", "Title": "Not worth the trouble", "Date": "February 25, 2014"}, {"Author": "yanira", "ReviewID": "R16PV4UPWNFLE3", "Overall": "1.0", "Content": "its slow it came broken and damaged it doesnt want to turn on and came with a cracked screen . i want my money back or a ima send it back", "Title": "i dont liike it", "Date": "February 25, 2014"}, {"Author": "Nicole L Walker", "ReviewID": "R1ZYUJMDIY0BBV", "Overall": "4.0", "Content": "I was worried, based on the reviews, but my boyfriends daughter absolutely loves it.  She got it for Christmas and uses it almost every day.  She watches movies that I have downloaded or Netflix and plays games with no problem.  I haven't heard her complain once about it.  She is only 8, but at her moms house she has an Ipad and she says it isn't as fun, because of the lack of movies and the games aren't as fun.  So, based on her own experience I'm giving it 4 stars.  It is a little slow for me, but great for kids.", "Title": "Not bad", "Date": "February 24, 2014"}, {"Author": "cathy nusbaum", "ReviewID": "R19ZF7JJ5HA73U", "Overall": "3.0", "Content": "The verdict is still out on this one.  Good starter tablet but we bought 2 and one has to go back.  The camera didn't work.  The other is doing ok.  Not exceptional but good for the price.", "Title": "Good starter tablet", "Date": "January 17, 2014"}, {"Author": "Kdee", "ReviewID": "R1KF0VY4HAZM66", "Overall": "5.0", "Content": "I brought this tablet as a Christmas gift for my 10 year old daughter who loves it.  It's perfect for her.  I read the other reviews before I purchased this tablet and everyone was right.  The tablet is easy to use and the price was right!", "Title": "Awesome", "Date": "December 29, 2013"}, {"Author": "Few Edmund", "ReviewID": "R1O3LD035YJQ8X", "Overall": "4.0", "Content": "I love everything about it, I just wished it had the Bluetooth enable, yet it is a great product for the price.  Thank you so much Amazon !!!!", "Title": "Love the Dragon", "Date": "December 10, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00G3Q4GWS", "Features": null, "ImgURL": null, "Name": null}}