{"Reviews": [{"Title": "Pleasantly surprised!  excellent product", "Author": "O.Aku", "ReviewID": "REZFD7SELO2LQ", "Overall": "4.0", "Content": "I returned an iPad Air for this one and I am happy I did.  I use the S Pen a lot and my notes get synced on Evernote.  The big surprise was having a meeting and had to make a quick call.  I made a call right on the tablet, while working on on a document.  Love it.", "Date": "December 29, 2013"}, {"Title": "It calls like a phone as well.  Fast,  YES!", "Author": "Scott", "ReviewID": "RM3102WV5O05", "Overall": "5.0", "Content": "You will only get hspa+ unless you are in a few small areas the have 2100 lte freq.  T-mo has a few spots they say.  Anyway,  I get HSPA+ about 6gb down.  It  is  fine for what I need.  The amazing thing is you can make phone calls because it has a phone chipset I am assuming is what you would call it.  It works speaker or bluetooth.  And just as good as any phone.The tablet it self is just awesome.  I am writing on it right now and am typing as fast as I possibly can and it doesn't miss a heartbeat.  The pen is great and some great sketch apps are out that I have had fun making pictures with.  One I had blown up on canvas at Costco and it's hanging on the wall.  People trip out when I tell them that I did it.  I used a sketch brush and it looks like a picture that took a month to draw.  I love it.So this is my new everyday connection for everything.  The typing is even phenomenal.  I have never had that before.  This is with google, Samsung, and swift key keyboards.  It doesn't matter what I seem to throw at it is just does everything perfectly.  I  recommend the moko case.Only change is the charging port is on the bottom.  I just flip it upside down when charging is nesseccary.  That's a pain though when it is in a case.  Battery life is well past a full day of Max use.  Even GPS on.Good job Samsung.  Rock on.Interested to see the Xperia z2 tablet.  That looks cool but will it come in lte?  And,  will it make phone calls?", "Date": "March 5, 2014"}, {"Title": "High quality and very satisfying to use.", "Author": "Dalesky \"Dalesky\"", "ReviewID": "R33GKYQHHPI2S8", "Overall": "5.0", "Content": "I bought a refurbished unit. It did not include all of the perks of a new one. It is in perfect condition, and came in original packaging. If I had not found this used one I was going to buy a new one.This looks like new, and performs that way also. I have the 32GB unit, with another 32GB SD card mounted. If you look at settings you can see how to load as much as possible on the SD card.The unit is a little smaller and lighter than the iPad previous generation, but has a bigger screen. The resolution side by side is a bit better that the iPad. It has a very sharp and bright screen, and I keep the brightness turned way down to save battery.It is a great Kindle reader, with all the features that an actual Kindle has. It also works well with my Amazon MP3 account, and the dozens of albums I have purchased through that account.Having external memory is a great boon for things like a lot of music or photos.This is a very responsive tablet, as fast as I had hoped for. It updates apps regularly, just like the iPad, has a great number to choose from, and is a wonderful music player, with at least 3 programs to choose from for playing. Also a choice of sound profiles (preset equalizer) settings.It is simple to create folders, and name them, which then allows you to drag similar app shortcuts inside. Same for making more pages, removing items, adding wallpaper, etc. I really have no negative criticism of the device.It has hung up a couple of times but a restart is all yo need to fix it. I did find that I was unable to play music thru a DAC amplifier, which is what I use for the Samsung music player I have, and a Kindle tablet, my phone, and an iPod player. Don't know why that is. It does have plenty of power to drive large headphones, but I suspect the sonic quality of the music could be improved.The speakers are quite good, but direct the sound to the side too much. If I cup my hands behind the speakers the sound is greatly improved. Really, not the way to play music in the first place with a tablet. It would be better to just use the headphone output jack to feed another device that has an amplifier of its own. Like a Bose radio, which has an input for aux.You read that I have compared it a couple of times to the iPad, which is also an excellent device. If I had to choose just one device I would prefer the Samsung because it is more flexible. The fact that there are less apps is not an issue, since I find plenty to choose from. The very occasional OS glitch is a minor issue for me.One unique and very useful feature is the ability to use a split screen. Really helpful for reading a stored document while writing an email, or things of that nature. Well done Samsung!I found an excellent Belkin leather case that works perfectly with it.I am very happy with my purchase.", "Date": "May 23, 2014"}, {"Title": "sweet", "Author": "John S. Seppanen", "ReviewID": "R3DC5IW36WT752", "Overall": "5.0", "Content": "this tablet is the best on the market. it is an unlocked model for which i will get a sim card soon. it is simply fantastic. if you like capability in a tablet...here it is.", "Date": "January 21, 2014"}, {"Title": "Please aviod this item if you are in the USA", "Author": "cmoorefun1", "ReviewID": "R2Y93F9TQ3XAMP", "Overall": "1.0", "Content": "this item was sold to me but Samsung said that they would not allow me to register the tablet and that they would not honor the warranty because the tablet is an international version and the item could only be repaired in Malaysia. I was advised by Samsung to return this item for the USA version. Please avoid this item if you live in the USA", "Date": "January 8, 2014"}, {"Title": "absolutely amazing", "Author": "Keon Hinds", "ReviewID": "R33L7A5UYVJUD", "Overall": "5.0", "Content": "great instrument. alot of thought was put into its creation. Samsung has again exceed my expectations by  competing against itself", "Date": "April 5, 2014"}, {"Title": "If you are having problems with your LTE or Internet please read below.", "Author": "antoine harris", "ReviewID": "R1I3KSANK3ZJXN", "Overall": "5.0", "Content": "THIS DEVICE WILL NOT GET LTE. It will however get H+. I normally get about 15mg download. If you cant get it to work with your sim you should know the following. Please be advised I have found a fix for the problem. \"The sim card used must be registered for cell phone service and not tablet service through the carrier, because this device is also a phone and accesses the H+ through the phone provision a sim card used for a tablet will block this function. Simple have your carrier fully provision the sim and restart the devise.", "Date": "April 15, 2014"}, {"Title": "BEST TABLET EVER", "Author": "Daniel Lockerby", "ReviewID": "R1ZKA2MZBVD3SF", "Overall": "5.0", "Content": "I have worked with several tablet types. Samsung got this one right.I love being able to run multiple apps in the multi windows. I was working beside a guy with an IPAD and he was amazed at what I could do that he sais he couldn't.Adding this to your cell service may be challenging. I went to my Sprint store and they said they had no way to add it.I purchased a simcard kit from another carrier and got the data working. No 4G LTE, but fast enough for my needs.", "Date": "April 12, 2014"}, {"Title": "Xander in Houston, TX", "Author": "Xander", "ReviewID": "R3TU60JZ18WJ69", "Overall": "4.0", "Content": "Short and Sweet:Time of Arrival: Received in 7 days Great!!!Bad: Standard International power adapter purchase US adapter from phone carrierLanguage: Use styles to change the language from Chinese to English or whatever your language is.Overall: Excellent!!!!I'll follow up later, using external portable 1TB HD and external power adapter to view movies and charge devices while traveling.", "Date": "January 9, 2014"}, {"Title": "Galaxy note 10.1 2014 edition", "Author": "Micah D Pace", "ReviewID": "R2TDC109LYHQB5", "Overall": "5.0", "Content": "Purchased this unlocked Galaxy note 10.1 2014 edition for work.  It is amazingly responsive and helps me stay productive while in travel or working in the field.  I slipped my sim card into and use it as my cell phone too!  Really cool product.", "Date": "June 7, 2014"}, {"Title": "Amazing tablet", "Author": "Isac J Dymesich", "ReviewID": "R2XB2ONFU8DJG0", "Overall": "5.0", "Content": "I bought this tablet for my wife, she did not have a cell phone so I thought I would get her this tablet so she could text message me if she needed to. It not only gets data very well, but it also can make phone calls. The graphics are amazing with the high resoultion of the screen. One of the best features is how very well the tool to convert hand writing into text works, it is really easy and reliable and works with almost all apps. There have been no problems yet encountered with this device. It does not come with ear buds, so I am purchasing some for her. The seller included plugin so that the charger will work with the american electrical system, otherwise it takes the standard micro usb like most phones.", "Date": "March 11, 2014"}, {"Title": "no cell phone service for att  cant make CALLS", "Author": "B-Swift", "ReviewID": "R3DDP6EA9BQX8H", "Overall": "3.0", "Content": "I just got this tablet  i think it works good  however i tried using this tablet to make a call  i get an error and i called att and they said the sim card recognizes it as a tablet so i cant make phone calls", "Date": "May 1, 2014"}, {"Title": "Finally a Samsung with a good Display", "Author": "Veli-Matti Sivonen", "ReviewID": "RT9W22UPDMCC2", "Overall": "4.0", "Content": "It works fine as expected but the Battery Life is not so good as it could be - maybe it could use a little bit larger Battery.However the best Samsung that I have so far. The Screen is beautiful sharp and vibrant.I also have Ainol Spark 9 with Retina Display (the same as iPad) and 10000 mAh Battery. Its Battery Life is Better than Samsungs.Its Display is not Bright as Samsungs. But Spark 9 don't have in buid GPS, Bluetooth or Phone that Note 10.1 2014 has.Samsung is easy to take in use as all the basic Programs are included and Samsung has user Manuals in the Net and in the Device.  Samsung could automatically updated by the Kies, so one don't need to know much about how to update Android device manually.", "Date": "January 21, 2014"}, {"Title": "Ram reality for 2.4 gb", "Author": "Efrain Urbaneja", "ReviewID": "RXH9SWLNOKND4", "Overall": "5.0", "Content": "For very good for in reality model p-605 memory ram is free 2.4gb not' 3 gb and android 4.3 fiware MJ4", "Date": "December 25, 2013"}, {"Title": "Excellent purchase", "Author": "Puig", "ReviewID": "RPAVE5ENDDQDL", "Overall": "5.0", "Content": "Very satisfied with the tablet and the purchasing experience. Recommended to anyone looking for an attractive and powerful device.The S-Pen rocks!", "Date": "January 2, 2014"}, {"Title": "perfect", "Author": "hatem motawe soliman", "ReviewID": "ROBZMXT4DJCH9", "Overall": "5.0", "Content": "the tablet is amazing v.clear screen and v.fast and vendor is honest and delivered exactly on time but don't recommend it for android superusers coz Samsung used new security system called knox", "Date": "December 21, 2013"}, {"Title": "Meets requirements", "Author": "Elisyl", "ReviewID": "R27XAD3H75ZVYC", "Overall": "4.0", "Content": "Nice to use, all what is expected is there, except perhaps radio FM receiver.Too bad not for sale in Europe", "Date": "January 29, 2014"}, {"Title": "Way over price, old OS", "Author": "Tione", "ReviewID": "R2Y07M1IU3RTP6", "Overall": "1.0", "Content": "This device is way over price and it doesn't even have the latest OS, Kit Kat. Samsung takes way too long to release the new software update, battery life is not good and should I mention again that it's way over priced.", "Date": "January 20, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00GEGD0M4"}}