{"Reviews": [{"Title": "Not bad for the price.", "Author": "Maegan Beard", "ReviewID": "R7RH3EIRV14IQ", "Overall": "4.0", "Content": "I have the 8\" version of this tablet. Things I like about it: great price, nice screen quality, sounds great with headphones, perfect for what I need it for (Pinterest, Facebook, checking email, watching videos, reading books and magazines), fairly user friendly. Decent battery life.My biggest complaint is the sensitivity (and lack thereof) of the touch screen. Sometimes it takes many taps for it to register that I'm tapping. It can also be overly sensitive (like when using the keyboard, or tapping on a link very close to another tappable area). It will often type the letter next to the one I selected or open the link next to the one I tapped. This might be avoided by using a stylus. The sound is also pretty bad unless you're using headphones, which I prefer anyway, so it's not an issue for me.For now, it's been a good choice and gets the job done. It's true that you get what you pay for...don't expect perfection, but for the money you'll spend on this, it's really not that bad. I'm pretty happy with it.", "Date": "March 1, 2014"}, {"Title": "No support for this tablet", "Author": "Michele", "ReviewID": "R2AOROEXJFP81O", "Overall": "1.0", "Content": "Although I did not buy from Amazon, I purchased this tablet for my daughter for Christmas. She unfortunately let the battery run down one too many times, and by mid-January, the tablet needed a new battery. I looked everywhere locally, but no one carries the battery. I then emailed the company and received an initial response a couple of days later indicating the tablet needed to be taken apart by the company for battery replacement.  This seems a bit odd. I emailed back and asked what the process was, and again, it took a couple of days to receive a response (to the effect of: we need serial number, date of purchase, etc., and is the screen cracked(???), so I called their 888-number.  I had to leave a message; that was a week ago, and I've heard nothing. Bottom line: child loved the tablet, but don't let the battery die!!!", "Date": "February 10, 2014"}], "ProductInfo": {"Price": "$60.99", "Features": "Screen Size: 7\"\nOperating System: Android 4.1\nProcessor Type: Not Available\nProcessor Model: Not Available\nProcessor Speed: 1.5GHz", "Name": "HKC Tablet with 8GB Memory 7\" | P774A-BBL", "ImgURL": "http://ecx.images-amazon.com/images/I/517EMyF89iL._SX300_.jpg", "ProductID": "B00GAC8J5U"}}