{"Reviews": [{"Title": "Extremely happy with this tablet!", "Author": "Peter Schuessler \"schuess\"", "ReviewID": "R1DXPPEQNVL0E8", "Overall": "5.0", "Content": "I switched over from a Motorola Xoom to the iPad mini because I have an iPhone 5 and wanted a tablet that was compatible. I couldn't be happier. Its light weight and perfect size for my needs. My only complaint is I wish it had a slot for additional storage as I have already nearly filled the 32GB of memory on board.", "Date": "January 30, 2014"}, {"Title": "Flawless, worth the extra money. 100% Satisfied", "Author": "Tushar&Catherine", "ReviewID": "R2MG38BKILK3HX", "Overall": "5.0", "Content": "I don't normally write reviews however this time I feel the need to express my absolute amazement over the iPad mini retina display. I read a ton and have been finding myself squinting in bed to read off the iPhone and noticed I have been getting awful headaches. I sucked it up and ordered the 32GB with 4g network in case I ever do need it. I went back and forth between the prices and capacity for about 2 weeks and decided the bigger would be better for the long run. I plan on using it for awhile and I have a ton of investing apps which I use daily.As for the iPad mini, the picture is stunning. We already have an iPad 3 which basically my 2 yr old took over but I did a comparison between the two and the response time and picture quality is flawless. I am used to the iPhone 5S resolution and I could ask for more. If you are stuck between the old verisimilitude iPad mini for the simply fact of cost, don't waste your time. The response rate when opening applications along with the resolution and sharpness is hands down worth the extra money.To make sure this stays clean and protected, I paired this with a Kavaj leather iPad mini case. It is beautiful, sophisticated and professional for my work related business trips.", "Date": "April 18, 2014"}], "ProductInfo": {"Price": "$699.00", "Features": "Display - 7.9-inch (diagonal) LED-backlit Multi-Touch display with IPS technology, 2048 x 1536 (326 ppi)\nChip - A7 chip with 64-bit architecture and M7 motion coprocessor\nCommunications - Wi-Fi 802.11a/b/g/n dual channel (2.4GHz and 5GHz) and MIMO, Bluetooth 4.0 and Cellular Network\nCameras - 5MP iSight Camera with HD (1080p) recording & FaceTime HD Camera with 720p HD video\nBattery & Power - Built-in 23.8 watt rechargeable lithium-polymer battery, up to 10 hours of surfing the web on Wi-Fi or up to 9 hours of surfing the web using cellular data network", "Name": "Apple iPad mini with Retina Display (32GB, Wi-Fi + Verizon, Silver) NEWEST VERSION", "ImgURL": "http://ecx.images-amazon.com/images/I/41xjIRGO%2BLL._SY300_.jpg", "ProductID": "B00GQFFDE6"}}