{"Reviews": [{"Author": "Brian Upton", "ReviewID": "R3787J9NJCNBLJ", "Overall": "5.0", "Content": "I have a 1st generation iPad and decided to upgrade to the iPad Air as I found some of the newer apps on the market are not compatible with my older iPad. The first thing you notice is the increased speed of the processor and the iPad Air is so much lighter. The camera and video functions are nice additions even though I have not used them yet. The unit walks you through the set up process and linking up with your Wi-Fi very quickly and your good to go! Don't hesitate if your on the fence about upgrading from the first generation to the new iPad Air. You'll be glad you did.....", "Title": "I decided to upgrade.....", "Date": "June 4, 2014"}, {"Author": "Deepak", "ReviewID": "R31T6VQE70T5CK", "Overall": "2.0", "Content": "It says that its a new piece but i got a used one, it says Moma's ipad when i connect to my laptop. It has a password lock too, i dont know what the password is...Please help me...", "Title": "A used peice with password protected...", "Date": "June 3, 2014"}, {"Author": "Wade A Carr", "ReviewID": "R1OFWPERK71Z05", "Overall": "3.0", "Content": "I replaced my iPad 4 w/ Retina Display for the iPad Air.  I should not have wasted my money.  It really isn't that much lighter.  The frame is smaller on the Air so to be prepared to purchase another case.  The cases available for the Air are not as nice as the Ipad 4 cases.  The only person that wins on this deal is my nephew--he gets a free iPad 4.", "Title": "If you already have the iPad 4; keep it!", "Date": "May 11, 2014"}, {"Author": "George Grammick", "ReviewID": "R2FN2773JBXU73", "Overall": "5.0", "Content": "Great product plenty of room for apps and photos and music. Needed extra room to up load photos while on vacation.", "Title": "Apple Ipad Air 128 GB", "Date": "June 8, 2014"}, {"Author": "Mike Talboy", "ReviewID": "R3FWHIADDHJAHW", "Overall": "5.0", "Content": "Perfect condition and very happy with the speed and updates on delivery. Highly recommend these folks for your electronic needs.", "Title": "Quick and easy", "Date": "June 7, 2014"}, {"Author": "Bruce Berndt", "ReviewID": "R20R31T9RK1Q1B", "Overall": "5.0", "Content": "This is a great machine, much better than the old iPad (as  expected). Brighter, faster and lighter with many more features!", "Title": "iPad Air", "Date": "June 7, 2014"}, {"Author": "Nancy Zawisza", "ReviewID": "R2MG9RLEFGK3F8", "Overall": "2.0", "Content": "I am not sure why this happens but when I am on Facebook the IPad will go back to the desktop. This happens whether it is in the case or not. Also, I can rarely play a video clip without resetting and even after resetting the video sometimes does not play.This is an expensive computer and I am very disappointed. I like my other iPad better.", "Title": "IPad Air", "Date": "June 7, 2014"}, {"Author": "Bruce", "ReviewID": "R2KEIU17XARH6S", "Overall": "5.0", "Content": "This was given to me as a Father's Day gift and I am very pleased with it. The colors are so vibrant compared to the ipad 4. I also like the upgraded features.", "Title": "I pad air", "Date": "June 7, 2014"}, {"Author": "S. Rowe", "ReviewID": "R25I6IMIR7XIM8", "Overall": "5.0", "Content": "Much easier than driving out to the apple store. This product arrived 3 days after I order it just as promised. Set up was easy and the iPad is just as promised.", "Title": "As advertised. New,in the box and the most recent version.", "Date": "June 7, 2014"}, {"Author": "Nixon", "ReviewID": "R1KTA4F139C42Q", "Overall": "5.0", "Content": "Too bad it does not have a USB plugor direct wireless printing to an HP printer which isa major challengeotherwise it works well. Very fast.Have not used it to play music yet but very soon.", "Title": "Great product", "Date": "June 6, 2014"}, {"Author": "Ed Figueroa", "ReviewID": "R34LEURRB2WPBZ", "Overall": "5.0", "Content": "Love this thing. It's super thin, the battery lasts forever, and the screen looks amazing. My only minor complaint is that the stereo speakers are both on the same side of the device. Hope a future iPad has Left and Right stereo speakers.", "Title": "Almost perfect", "Date": "June 6, 2014"}, {"Author": "William J. Austin", "ReviewID": "RO1SROCJ4RX1Z", "Overall": "4.0", "Content": "Delivey was prompt and the only problem was the white with silver was not available and I had to settle for black. However, that was communicated to me in a timely manner and I did agree to change rather than cxancel.", "Title": "Good experience", "Date": "June 6, 2014"}, {"Author": "William S \"Book Worm\"", "ReviewID": "R1N9Q5JJTTIOQL", "Overall": "2.0", "Content": "I tried using an IPAD to download a simple MP3 file but it could not do something that simple.  It required me to first create an account on Itunes but before doing that I had to give them my credit card information.  I will never buy another Apple product again.", "Title": "Beware of Apple Products", "Date": "December 22, 2013"}, {"Author": "Carter \"O.C.\"", "ReviewID": "R1DESD22LJW71S", "Overall": "3.0", "Content": "It's not a bad tablet by any means... one of the best BUT i'm slightly annoyed that it doesn't have the features i'm so use to using. My friend got me this as a gift to try to win me over to apple products... I gave it a go but It's just not for me. I decided to stick with my Samsung Galaxy Note 10.1 2014... I love using two screens at once.Pros: Really just the new design although I tend to have issues with the new bezel when holding it, you have no choice but to have one finger on the screen which sometimes causes issues with apps. and its smooth which is greatCons: Not enough features, and boring. This was cool years ago but with tablets out there that allow multi screen and other amazing stuff...I gave it a go guys, and I really wanted to not be bias in my review. Hopefully you were able to see that. I think if you like the other Ipad's you will be happy with this for sure. If you want a much more amazing experience then i'd say go with the Samsung Galaxy Note 10.1 2014 or even a surface tablet.", "Title": "I tried but wasn't for me", "Date": "November 5, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00G309HEG", "Features": null, "ImgURL": null, "Name": null}}