{"Reviews": [{"Title": "Perfection in a tablet.", "Author": "sgun73 \"Steve\"", "ReviewID": "R2BF03GTHM20QQ", "Overall": "5.0", "Content": "I'm using the retina mini right now as I write this review. I loved the original mini because of the amazing build quality and comfortable size. Now it's essentially all the good things we had before but with crystal sharp display and faster processor.This device reeks of quality and craftsmanship. I sold my Nexus 7 and Nexus 10 to buy the retina mini and I've made an excellent choice. While the Nexus tablets are great they feel like budget tablets. I prefer the smaller size tablets like the mini and Nexus 7, but I found the Nexus 7 to be a tad too small. It's even smaller than 7\" because of the onscreen buttons. I'm much happier with the size of the mini for writing emails, surfing web pages, and most of all reading books and comics. Sharp as real paper right up close.If money is not an issue the retina mini is totally worth the $399 price tag. I thought the original mini was worth more than the $329 they charged for it. I'd have paid $349. It's that good. So I'm okay with the retina mini price. I would say Apple is the Acura of tablets. Classy, elegant, and high quality.", "Date": "November 19, 2013"}, {"Title": "All around great", "Author": "Jake", "ReviewID": "R1PGSYJYBS78HZ", "Overall": "5.0", "Content": "Background:I have been an Apple fan for a while but I (try) to keep my ratings objective. I bought this to replace my aging iPad 1, which sadly is too underpowered to stop from randomly crashing. The model I purchased was the 16gb black, WiFi only model.Form Factor: 5/5Like most Apple products, the iPad mini feels really solid while still being thin and light. It is light enough that you can easily hold it up with one hand, yet heavy enough that you can tap the screen or push the buttons without pivoting it too much. Size wise, it feels small when carried, but when you are using it feels like you have significantly more real estate, which leads me to my next category...Display: 5/5I was initially hesitant coming from a 9.7\" tablet that I would be losing screen space. This, however, is not a big problem, since the retina display lets you see much smaller text with significantly less eye strain. This is what ultimately sold me on the tablet. When I was in the store, I brought up an online math textbook on this iPad, the non-Retina mini, and a Galaxy Tab 3 7\". The iPad mini retina simply looked the best.Power: 4/5I think it is a bad idea to directly compare tablet power in PC terms (processor speed, memory, etc.). A better metric is how responsive the tablet is. I find that this iPad is very quick to respond to finger taps and button presses. Web pages load much, much faster than on my original iPad (which is to be expected) and my iPhone 5. However, this power comes at the expense of heat. When downloading large files or using high-power applications, it tends to get a little warmer than I would like. It's not problematic, but it is just something to be aware of.Battery: ?I haven't fully drained the battery yet so I'm not going to give it a rating yet, but I have noticed it drains about 10% in an hour of web browsing + streaming music, so I expect it gets about 10 hours. This is in line with what Apple claims, so I expect this rating will be a 4.5 or 5 out of 5.OS/Apps: 4/5I personally don't like the look of iOS 7, but it gets the job done and done well. While it doesn't have the nitty-gritty customization that Android has, it is very integrated. Control Center is a nice addition; Music, Mail, Newsstand, Calendar, and Maps have all been improved upon and function well. iOS may not be very interesting but it does a fine job, and of course you have the whole App Store to find 3rd party apps in case you don't like the Apple-designed ones.Storage Space: 4/516gb is tiny (there is no doubt about that) BUT physical storage space is becoming less and less relevant. Because I use Spotify and Netflix/HBO Go for most of my media consumption, I don't use more than 3-4gb of space on the tablet. What's left is space for apps and documents... 16gb holds quite a few apps. But, if you like having a large offline media collection, go for the more expensive models, which brings be to my next point...Price: 4/5What? 4 out of 5 for price on an Apple product? Yes, I said it. If you don't use that much offline space, this iPad is a solid value at $399. My experience with Apple products is that they last longer than average, so you can expect to get 3-4 useful years out of it, which is most or all of high school or college. Now, I feel paying $100 for an extra 16gb is outrageous, but I'm not reviewing that model. Don't get me wrong, this is a premium product, but for what you get $399 is fair.Camera: 4/5Don't take pictures with a tablet. That being said, the front and rear cameras are fine for video-chatting (which I suppose is what they are really meant for). Aside: I don't understand video-chatting with a tablet. All you see is the underside of someone's face.Comparison to other tablets: 5/5Let's face it: there are other tablets on the market with features that the iPad doesn't have. The Surface can run PC applications. The Galaxy 3 and Nexus are both a bargain. But when you put the entire package together, the iPad wins every time.I suppose these average out to a 4.5, but I'll round to 5 stars because of useful miscellaneous features, including the smart cover, Lightning port, and dual-speakers which are pretty good for a tablet.", "Date": "December 4, 2013"}, {"Title": "The perfect tablet.", "Author": "Ford", "ReviewID": "R3SANGXV47MV4Z", "Overall": "5.0", "Content": "This is my second ipad but my first mini, I'll never go back to full sized again.  This is what tablets should be, easy to use, blazing fast, comfortable to hold, crips & clear screen.  When the mini first came out last year I fell in love with the form factor, but the specs didn't live up to what I wanted in any computer.  The old mini was out dated before it launched, it was using 2 year old internals and a screen that was 1/2 the resolution of not only competitors but the other iPads.  Not only do I feel that this new retina mini has top of the line specs it truly is so adhead of its time with a 64 bit chip and second stand alone co-processor, this thing will be relevant for years to come.iOS and the AppStore that comes with it make the iPads worth the extra money over samsung and amazon, but this hardware is amazing.  It's the perfect companion and bridge to my technology at home when im at work or out on the town.", "Date": "November 22, 2013"}, {"Title": "upgrade form original iPad mini", "Author": "Jerrod Kowalski \"Jerrod Kowalski\"", "ReviewID": "R1NM5NDFPKY1T0", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moWQH5B5SMB590embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moWQH5B5SMB590refresh_preplay() {\n\ndocument.getElementById(\"cv_moWQH5B5SMB590chiDiv\").innerHTML = document.getElementById(\"cv_moWQH5B5SMB590hiddenPre\").innerHTML;\n};\ncv_moWQH5B5SMB590refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moWQH5B5SMB590so;\t   \n\n\nfunction cv_moWQH5B5SMB590loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moWQH5B5SMB590so = new SWFObject(swfLocation, \"cv_moWQH5B5SMB590AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moWQH5B5SMB590so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moWQH5B5SMB590so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moWQH5B5SMB590so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moWQH5B5SMB590so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moWQH5B5SMB590so.setAttribute(\"height\", swfHeight);\n          cv_moWQH5B5SMB590so.setAttribute(\"width\", swfWidth);\n          cv_moWQH5B5SMB590so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moWQH5B5SMB590so.write(\"cv_moWQH5B5SMB590flashcontent\")) {\n          fp_resizePlayerSpace('cv_moWQH5B5SMB590', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moWQH5B5SMB590';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moWQH5B5SMB590', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moWQH5B5SMB590loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moWQH5B5SMB590\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"181-2711000-9110405\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1532TRGPMDUXA\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1532TRGPMDUXA\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1NM5NDFPKY1T0\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1532TRGPMDUXA/181-2711000-9110405\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/181-2711000-9110405\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moWQH5B5SMB590duration')) {\n      document.getElementById('cv_moWQH5B5SMB590duration').style.display='none';\n    }\n    cv_moWQH5B5SMB590loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moWQH5B5SMB590loadSwf(movieID, playerVersion) {\n   return _cv_moWQH5B5SMB590loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moWQH5B5SMB590newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moWQH5B5SMB590', 0, h);\n}\n\nfunction cv_moWQH5B5SMB590resetPlayer(w,h,bw,cc) {\n  cv_moWQH5B5SMB590newHeight(h);\n\n  cv_moWQH5B5SMB590so.addVariable(\"resetBandwidth\", bw);\n  cv_moWQH5B5SMB590so.addVariable(\"cacheCode\", cc);\n  cv_moWQH5B5SMB590so.setAttribute(\"height\", h);\n  cv_moWQH5B5SMB590so.setAttribute(\"width\", w);\n  cv_moWQH5B5SMB590so.write(\"cv_moWQH5B5SMB590flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moWQH5B5SMB590RollOverImg = new Image();\ncv_moWQH5B5SMB590RollOverImg.src = \"http://ecx.images-amazon.com/images/I/91GJDtkrrnS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moWQH5B5SMB590preplay = document.getElementById('cv_moWQH5B5SMB590preplayImageId');\nif (cv_moWQH5B5SMB590preplay) {\n  cv_moWQH5B5SMB590preplay.onmouseover = function() {\n    cv_moWQH5B5SMB590preplay.src = \"http://ecx.images-amazon.com/images/I/91GJDtkrrnS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moWQH5B5SMB590preplay.onmouseout = function() {\n    cv_moWQH5B5SMB590preplay.src = \"http://ecx.images-amazon.com/images/I/91GJDtkrrnS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moWQH5B5SMB590preplay.parentNode;\n\n  var cv_moWQH5B5SMB590currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_moWQH5B5SMB590/181-2711000-9110405?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moWQH5B5SMB590currentClick) {\n      return cv_moWQH5B5SMB590currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:43 MinsI am writing this as an upgraded view not as a first time iPad buyer. i actually got the 64GB version but i do not see it listed on Amazon at time of writing this so i'll review the 16gb. i bought the black, i had the white. i went black because as beautiful as the white is i found myself looking at the bezile often. the bright white distracted me from the screen sometimes. the bezel fades out of view when black and i find myself seeing more of what is on the screen.the retina display is a huge upgrade. i have corrective lenses and need 1.25 reading glasses. reading all text on the retina is worth the upgrade for me. while i do not have an iPad to compare the color gamut i can say that i think the colors are fine. the display is a worthwhile upgrade consideration. as much of an improvement the screen is the processor is an even bigger improvement. i use to see load time of a game called Field Runner2 HD (there is a free version too if you want to check your mini) of 40 seconds or so, the new mini loads twice as fast. i wish i took a video of the two side by side before i sent my old one to a friend. it was amazing how much faster the new iPad loads games. i did do a video on the retina loading the game.i would like to say the iPad mini should have had the fingerprint scanner and all Apple products are overdue for built in wireless charging. still this is a really nice product and i am glad i spent the money on the upgrade.", "Date": "November 26, 2013"}, {"Title": "Solid Tablet, Read for the Negative Points", "Author": "word2ya", "ReviewID": "R3AH2TL33L59Y6", "Overall": "4.0", "Content": "So many glowing reviews on this, so I'm just going to stick on the negatives.- I've felt that this was the model that should have came out when Apple first released the 1st gen mini. Retina has been the standard for a while on Apple products, and felt that Apple were letting down its customers with the low-res display. But that's the cost of being an Apple customer, they give you just enough for you to want it but not need it, until the next model comes out.- Retina Display looks absolutely gorgeous, the high amount of ppi, 320 or so, is definitely evident in pictures and sharp text. What they say about the colors not being as vibrant as the iPad air and the 4th gen iPad is unfortunately true. Colors do look a tad washed out, and it's especially noticeable on the reds such as on the Youtube app. Not really issue for me, didn't really notice it myself until detailed reports came out on it. It will be an issue for anyone depending on color accuracy, but that portion of the market is probably getting the Air for the bigger screen size anyway.- Webpages can be a bit of a hassle to navigate. Coming from a full size iPad I've found that I have to zoom in and scroll side to side much more often. This is the price of portability and having a small screen, not a big deal for me, perhaps for you.- Missing Touch ID. Maybe not a necessity as much as a phone, since most tablets are kept in the security of your home, but it would have been nice to have that feature nonetheless.- No option to create and switch users? I understand the need to sync through iTunes/iCloud , but I think it's time for Apple to allowing its customers to create guest accounts. Not needed in an iPhone because it's personal, tablets on the other hand are usually shared between families within a household. It would be nice to be able to keep designated accounts for your child especially.Conclusion. I think that this is the ideal tablet for the casual tablet user. True there are other small tablets out there that are less expensive and better spec-wise, but the iTunes App store is the best store for tablet-oriented apps on the market. I've yet to purchase an actual paid app, but have found tremendous value in the free ones for my interests and needs. Don't let the color gamut issue dissuade you from purchasing one, you won't be disappointed.", "Date": "December 2, 2013"}, {"Title": "Coming from a 2012 Kindle Fire HD.", "Author": "jbw", "ReviewID": "R3CZ5A50ABPW2P", "Overall": "4.0", "Content": "I am/was a very light tablet user for until about 2 months ago (as of writing this review). I got a second hand Kindle Fire 7\" HD from a family member who upgraded and I really liked having the KFHD. I got the new (as of writing this) iPad mini w/retina as a Christmas gift.There is a LOT to like about this tablet, and I am very grateful for the gift, but when I compare it to the Kindle Fire HD 7\", I wonder if it is worth the premium cost. So rather than review this item comparing it to nothing, I will compare it to my previous (and much less expensive) Kindle Fire HD 7\".Pros:- syncs up with my two Apple computers and iPhone perfectly, Kindle does/did not do this- uses iMessage so I can respond to most text messages from my iPad- the hard is absolutely beautiful, second none compared to ANY other tablet, in my opinion- the retina display is absolutely gorgeousMAJOR PROs:- Being an Apple device, you get access to the best app store on the planet. I know that sounds like an Apple commercial but compared to the Kindle marketplace, I have such a better variety of GOOD apps and games to play. I never gamed on my Kindle Fire for more than 10 minutes, I found myself playing some App Store games, upwards of 45 minutes; I never thought I would game on a tablet for that long- The Operating System seems more stable. My apps crash less often, and I feel more in control of my apps. With the Kindle Fire HD 7, you can't 'close' apps; it's just not how it works (by close I mean actually stopping the apps from running in the background, when you double click the home screen and swipe them up to 'stop' them). Everything seems more fluid and less clunky as well, compared to the KFHD. This gives a huge benefit to the ease of use category for the iPad.Cons:- Something is awkward about the speaker placement on the iPad Mini compared to the Kindle Fire. I -think- the sound is better on my Kindle Fire overall and the speak placement is definitely better. When holding the iPad in landscape mode (the only mode I use) your hands easily cover up the speakers, so a lot of the time you are muting or attenuating the sound, which gets annoying. This was not an issue with my Kindle. I work in audio and this gets under my skin; I am surprised they (apple) haven't discovered that people really enjoy landscape mode and should take that into consideration when placing the speakers on the device. I almost feel like they want me to use it in normal (portrait) mode, but that's not going to happen.- Although the OS on the iPad seems more stable and fluid, I feel (as of having the iPad for almost 5 days) that I prefer the layout of the Kindle Fire devices over the iOS layouts. I really liked the carousel on the Kindle and the way everything was laid out. This might change as I use the iPad more, but I still think I prefer the Kindle layout.- The form factor is a little different than the Kindle Fire HD; the iPad is wider, even though the screens are about the same size. This makes holding it a little more of a challenge than the Fire. I find searching for a comfortable landscape position on the iPad a little bit more of a challenge than on the kindle fire. Just the other day I was 'face timing' with a friend and I kept covering the microphone (which is on the back of the device) with my hand causing the person on the other end to have to repeatedly ask me to repeat myself and inquire as to what is up with my microphone. This never happened with the Kindle Fire on Skype calls or the similar.- The price, but I got this as a gift, so I can't really complain about it.========The verdict:Overall I prefer the iPad to the Kindle Fire HD 7\", but the Kindle Fire is a VERY close 2nd to it. If I was making the purchase myself and not getting either as a gift, I would have a hard time justifying the extra 200 (or 180) dollars for the iPad.Hope this helped someone.", "Date": "December 28, 2013"}, {"Title": "Great Tablet", "Author": "White Lotus", "ReviewID": "R27HGZ5BZ0ON3H", "Overall": "4.0", "Content": "What I Love About it:- Very tight integration with software and hardware. Apps launch quickly and are optimized for this tablet.- Screen is extremely responsive and colors look accurate, whites look white, brightness is good. The retina screen makes text and icons very crisp and sharp.- The 8\" size makes it easy to tote around, not to mention it was $100 cheaper than the Air.- The side switch can lock orientation which really comes in handy.- Safari is a treat to use with multiple tabs being easier to navigate with the latest update. Love the fact that Bookmarks get added to my iPad automatically when I add them via my iPhone or my iMac.- Love the fact that the Settings menus is optimized for tablet and laid out in an easy to use way rather than hidden like on the iPhone.Cons- Maybe it's just my unit but I've been experiencing an awful lot of crashes. Maybe I should reboot mine or something? It will crash when I am running a certain video in Safari or running a game seemingly at random. This is why I docked it 1 Star. The crashes have happened enough to the point where I got the impression that the software is not stable enough.- Takes a long time to fully recharge, at least several hours.- Typing on the touch screen is kind of tough in landscape mode. Would have been nice if they could split the keyboard into halves so I didn't have so much area to cover.- I'm aware of the lack of color gamut compared to the iPad Air, I don't care, the screen still looks smashing!- Sound could be a bit louder. The loudest setting is quite audible on Youtube and other music and videos but it seems to me like the loudest setting should sound loud.Other ThoughtsI got the official Apple Case for it (not Cover). I love it. It is really light in weight, holds the tablet snugly, and looks really good too. It also turns the screen on and off when you open and close it. I got the black case because I noticed other cases might get dirty and it shows and doesn't look so good. Black will never look dirty. It feels kind of soft, like pleather. It's a nice feel. Using the cover as a stand isn't the greatest, it's a bit unstable but is useable.I decided on Space Gray because the white models have a thin black line that goes round the screen. It's subtle and most won't even notice it, but I notice little things like this. The black bezel also allows me to focus more on what's on the screen so it gives a more uniform and professional appearance.Also got the 64GB model because 16GB is just not enough for a tablet. Some games are 1GB in size and I wanted to put movies on mine as well. I wanted the TMobile LTE model but it's nearly $130 more and I didn't want to spend. Got mine from Best Buy before the holiday rush. Feel sorry for those who want one now and can't get it.Rushed to get this tablet. Originally had the Samsung Galaxy Tab 7\" (first gen) which could actually make calls. It was basically just a big Android cell phone. Never used it, but have used my iPad religiously, even taking it to my trip to San Francisco. It held up fine and provided some great entertainment for me and others. IMO this is the best tablet out there regardless of size. App and game selection can't be beat. Waiting on dedicated game controller to use with it. :)*****UPDATE 1/16/14*****Love my iPad! Took it 3 weeks trip to Taiwan and Japan. Could slip it into my backpack or fanny pack with ease. Also slipped into the front pouch on the airplane without making it bulge. Battery life is good enough so I can charge it overnight and use it most of the day. Use it with Origami case and Apple bluetooth keyboard as a standalone workstation. Works very effectively to type long passages. Pair it with Oontz bluetooth speaker because the speaker is just not loud enough. I use the keyboard to control the volume.I still use my iPad every day pretty much. Tried putting one of those stickers over the home button but it didn't fit. Maybe the home button is slightly smaller than the iPhone? Then tried another sticker and I was unable to close the case properly so out went that. Bought a dual USB plug for higher amps (tablet) so I can charge my iPhone simultaneously.Tried the keyboard trick suggested by the commenter and thanks. It really works but the keyboard kind of small, kind of hard to type on. Don't like the placement of the letter \"b\", it should be on the left side, not right. I keep reaching for it instinctively and it's not there. Every keyboard I've ever used that was split (Microsoft Ergonomic Keyboard and others) has the letter \"b\" on the left side.", "Date": "December 3, 2013"}, {"Title": "Very nice", "Author": "Jason Conover", "ReviewID": "RANSCCYJ9QFD7", "Overall": "4.0", "Content": "I like this. I put this tied for best small tablet with the asus memo pad hd. The pad does not have the specs the iPad has. But it does have a lower price. Battery life that's almost as good. sd card slot. The biggest reason why I don't think the iPad mini retina is above the pad. Is because for 400 dollars I think it should've came with a 32gb drive.", "Date": "December 18, 2013"}, {"Title": "Average tablet in a well made shell", "Author": "BigEd", "ReviewID": "RX97C3LWVFR8B", "Overall": "3.0", "Content": "The ipad is a very average machine in terms of day to day use.Bluetooth will not transfer files to any other mac computer, Airdrop will only connect to iPads and iPhones you have to physically connect to your mac to transfer files. There is iCloud but that is Apples way of forcing you to part with cash the whole system is based on what Apple wants not the consumer.No in built connections for memory card, video, software like ios7 is very poor no full screen browsing in Safari and no Flash player still. There is a sound issue with the iPad mini it is either all or nothing, there is no gradual progression of sound levels when using the volume buttons. The list goes on and on, I have used mac for many years but I have seen far better tablets for a lot less money, retina screens don't cut it any more with tablets offering better for less.The only plus side for me is the build quality, but then once your tablet is in a case who would know.In a nutshell you can get a HD screen tablet, expandable memory to allow you to enjoy movies etc, less restrictive software and more practical functionality at half the price.", "Date": "March 14, 2014"}, {"Title": "Great", "Author": "C. Misra", "ReviewID": "R5YSINMPDCBN7", "Overall": "5.0", "Content": "I read in the news today about it becoming available.  Bought one and love it.  Will be disposing of my iPad 4 as soon as possible.  The mini with retina is better in every way.  This is what a tablet should be.  Using the iPad 4 after using this just feels very cumbersome and unappealing.  I like this tablet a lot.It's very light.  I never get tired from holding it.  The display is superb.  It's very fast.  I really think apple achieved perfection with this jewel.  It can't be improved, I've been brainstorming how from the time I started using two days back.  There is zero chance of me going back to regular size ipad or tablet.The processor is the A7, rather than the A5 in the first mini.  It's much faster than the first mini.  Geekbench timed it as three or four times faster depending on activity.  It has the same resolution as the Air, but on a smaller screen, therefore the ppi, pixels per inch, is higher than the Air.Much ink spilled about the color gamut issue, namely that the mini only reproduces sixty three percent of the gamut.  I think it is true the colors are a bit washed out.  I had an ipad 4 before this, and the display of my mini, while beautiful and very sharp, does seem subdued over my ipad 4 screen.  But it could be psychological bc of the smaller screen.As to the debate of mini vs Air.........if you are the stationary type, the Air is probably better.  I dunno though, I AM the stationary type and I still like the mini tons better than my ipad 4.  It's amazing we as a people have become spoiled to the point a 1.5 lb like the ipad 4 seems heavy.  But it does.I think the mini is awesome for reading but everything else too like TV and movies thru netflix or iTunes or whatever.  The minis form factor can't be beat.  You can hold it in one hand, and I have very small hands.  It weighs only .75 lb.  it is such a great product.  I have never spent a better four hundred bucks in my life and I regret having to spend nine months with that behemoth that wuz my ipad 4 when I could have been canoodling with a mini that whole time ;(", "Date": "November 22, 2013"}, {"Title": "Tablet Perfection Achieved", "Author": "S. Furlong \"luvtomeeturfeet\"", "ReviewID": "ROZBZ3BX7G9NU", "Overall": "5.0", "Content": "I just got this tablet 2 days ago, wifi edition.  My wife uses the 4G LTE edition, and we both love them!  The craftsmanship, design, speed, superb display, and refined iOS apps help to make this tablet the best one yet.  I love that I can finally hold it above my head in bed with my index finger and thumb on my left hand and use my right hand to touch the display.  I bought a cheap clear back and smart cover for around $11 or so on ebay from 2 different sellers.  I came from an ipad 3 (the new ipad), and the difference is night and day.  I also like that they are including the office and media creation apps for free if I ever need them. Another plus is that they have it $100 cheaper than the Air and kept the same processor and graphics in it, so I don't have to worry about being hindered.", "Date": "November 21, 2013"}, {"Title": "Mighty Mini!", "Author": "PaganDeva2000 \"pagandeva2000\"", "ReviewID": "R1I365MN58SH54", "Overall": "5.0", "Content": "128gb Here!  I had the original iPad mini, which was phenomenal for me because of the portability.  I was completely happy with my 64gb tablet and had no real interest in the retina display.  So when I heard of another mini coming out, my mind said \" Meeh...\" UNTIL I saw that the new one would be 128gb.  I was sold before it even came out...I'm an app hound.  I want whatever I own mostly available to me.  I listen to music while reading from my Kindle app or doing photo editing, so I expect loads and loads of pictures to be stored.  It has the Amazon Prime Video app, so I'm not missing out on my year of prime videos.  I do yoga, meditate, breathing exercises, play games, create my family tree...you name it.  Listen to Amazon cloud player for my purchased music. Download a boatload of movies while going on trips.Did I get rid of my 64gb original mini?  Not on your life.  That's the one I take with me when I go out.  Loaded with games.  I'm one that doesn't feel like managing.  I'm happier than a pig in mud.  I love you Apple.", "Date": "November 26, 2013"}, {"Title": "iPad mini", "Author": "Judi Hi", "ReviewID": "R221Q8OHUC6V7V", "Overall": "5.0", "Content": "I absolutely love my iPad mini with Retina Display.  It beats having to carry around a large laptop at home or when traveling.", "Date": "March 6, 2014"}, {"Title": "Ipad Mini w/Retina display", "Author": "Ajaya K Kesavarapu", "ReviewID": "RD7E77W0119K3", "Overall": "4.0", "Content": "Got it on time and mini is in good condition.My son liked it and enjoying the Ipad. Great service.", "Date": "January 20, 2014"}, {"Title": "Great Tablet", "Author": "Tone", "ReviewID": "R10UPFDLFRE45F", "Overall": "5.0", "Content": "I've always owned an iPad and finally with this one I was able to go small. Sold my iPad 4 and had the air for a little while but decided to go with this after it was released. Great decision on my part , in my opinion.", "Date": "January 11, 2014"}, {"Title": "Awesome!", "Author": "dennis gutzmer", "ReviewID": "RUUXV9KWDF8FC", "Overall": "5.0", "Content": "I am writing this review on my ipad mini!Pros: great battery life, good gaming, portable, brightCons: very easy to dent on the back( you can just get a case)", "Date": "February 16, 2014"}, {"Title": "The best tablet", "Author": "Alejandro", "ReviewID": "R1DO2U80T99ZT9", "Overall": "5.0", "Content": "It's an amazing gadget. Fast, slim, small yet Powerful. I think this is the best site - weight for a tablet.", "Date": "January 24, 2014"}, {"Title": "Love it!!!", "Author": "lalo", "ReviewID": "RD6CZPTGL9NHD", "Overall": "5.0", "Content": "I bought this iPad yesterday, I haven't put it down. This is some of apples best work. It's fast, perfect battery life that you have to use forever to get to die, and the display is absolutely beautiful!!!", "Date": "December 25, 2013"}, {"Title": "If you can afford it, it's worth it", "Author": "Jaketh3SNAK3", "ReviewID": "R2ITFX1J4NLM3H", "Overall": "5.0", "Content": "I am currently writing this review on my new retina iPad mini and I have to say it is incredibly easy to type with. I was considering the new nexus 7 and the kindle fire hdx. The hdx looks very nice and it's easy to use but what you see is what you get. You can't customize the background at all which is ok but it just seemed very limited and I don't have amazon prime. The graphics and sound we're great though. The nexus was my next choice because of the price range and the good display. However the sound quality was not to my liking which is very important to me. I do like the selection of apps and the android interface. But I did not like the aspect ratio on the nexus as I am mostly going to be using the tablet for movies and games. The iPad mini to me was the best option because of the awesome speakers, retina display, perfect aspect ratio, endless apps and the incredible build quality. Watching movies and playing games are perfect for this tablet. It is less than a pound and it is sporting all of the same features as the iPad air. I am very happy with my purchase. I usually have buyers remorse but I have not had a second thought about this one", "Date": "December 17, 2013"}, {"Title": "Love it", "Author": "ash", "ReviewID": "R1RAU5XRTIAFWC", "Overall": "3.0", "Content": "The iPad mini with retina display is great my Husband loves it and my son likes to watch his tv shows on it too", "Date": "May 3, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00GMSZLC6"}}