{"Reviews": [{"Title": "piece of junk", "Author": "moses eason", "ReviewID": "R3KH53EQX6TU8W", "Overall": "1.0", "Content": "I cant even put headphones into the jack the whole thing is not even lined up right, the sound is awful and you can not see the picture very well its to dark in thats the lightest it goes, what a waste of money", "Date": "March 24, 2014"}, {"Title": "not 3g", "Author": "chris", "ReviewID": "R1QIHDNZ9MDU1C", "Overall": "2.0", "Content": "I bought this because it said 3g in the title.  It's not however 3g, it's \"3g dongle capable\", I've tried 2 different dongles to no avail.  As long as your not looking a 3g tablet, this will do.", "Date": "June 5, 2014"}, {"Title": "POS...Don't buy!", "Author": "Robert Leonard", "ReviewID": "R3HD2SIPWFP1LY", "Overall": "1.0", "Content": "Delivery took forever then when it finally arrived the screen didn't even work right. The screen is not very bright and you can not use it in a brightly lit room or outside. I tried explaining tbe problem with the screen to the seller but they are not very knowledgeable about their products and were no help. They offered for me to ship it back so they could look at it but they wanted me to pay for shipping on the broke item they sent me. I can barely use the dam thing since a portion of the screen doesn't respond to touch and is completely useless. I WOULD NOT recommend this product to anyone. I would save a little more $$$ and buy a decent tablet. A one star rating on this product is to high of a rating IMO.", "Date": "April 12, 2014"}, {"Title": "cool product", "Author": "melissa rowe", "ReviewID": "R350Q5757HF7VX", "Overall": "5.0", "Content": "it awesome worth price had no problems. worth getting i check whole bunch before this one but doesn't come with hdmi cord", "Date": "April 1, 2014"}], "ProductInfo": {"Price": "$69.99", "Features": "CPU: AT7021 Cortex A7 1.3GHZ ANDROID 4.1\nGravity: 360 degree gravity induction\nStorage Device: 8GB, Memory: 512MB,Support external TF card, maximum capacity of 32GB\nLCD: Size 9\", TFT LCD The capacitive touch screen 5 points\nBattery: 3.7V/3800mA rechargable battery,stand-by time: 5-10H,By Wifi about 3-5H", "Name": "SVP® 9 Inch Dual Core ANDROID 4.1 8GB Tablet WIFI 3G HDMI 3D E-book Google Play Store capacitive Touch Screen Tablet PC 9\"", "ImgURL": "http://ecx.images-amazon.com/images/I/51w5%2BHrvpGL._SX300_.jpg", "ProductID": "B00GP5ILZK"}}