{"Reviews": [{"Title": "Semi-Perfect Hardware Configuration - I am not an HP fan", "Author": "dklingen", "ReviewID": "R2J29LDI8G5O2C", "Overall": "5.0", "Content": "I have been doing two things:1) Waiting for a BayTrail tablet using the Z3770 CPU (currently the fastest Atom CPU) - check2) Waiting for any MFG other than HP because I have not had great experiences with them in the past (my hope was ASUS) - missPros:1) BayTrail Z3770 is very fast.  I previously bought and own an ASUS Vivotab Smart which is a great tablet other then the Z2760 CPU can be a tad slow.  I have been using it for over 6 months while I patiently awaited a faster 10\" tablet.2) 10\" screen size with a resolution of 1920x1200 (1920x1080 was my target).3) Full real Windows 8.1 (not the RT junk) so everything works (including flash sites).4) Very good battery life, sound, and has a micro SD slot for an additional 64GB of storage expansion.5) Killer price for $350 makes this $150 cheaper than the comparable Dell Venue Pro 11.  I don't believe there is another full Win8.1 10\" tablet out there at this low of a price.Cons:1) I waited and waited and Amazon never even listed this product so I went to Office Depot (sure now it is on Amazon). I considered taking it back and buying from Amazon, but it is not worth the hassle.2) 2GB of ram, most people seem to think Win8 needs 4GB, but I have not noticed any performance issues (Win32 bit vs Win 64 bit).3) Finger print magnet like all tablets seem to be.4) HP doesn't seem to know this product exists since their website doesn't really list or support it clearly.  Also a severe lack of tablet cases/covers for this is prevalent at this time.  It would be nice to get a case/cover like the iPad (basically a light weight folding stand).5) This product is way under the radar of everyone for some reason - try to find a review on the internet and it is close to impossible.  I don't know why this is; unless HP has built bad will with everyone and people ignore their products.Anyhow - this is a fantastic tablet considering what you get for the price and how well it works!!!The perfect tablet would be a Win8.1 that weighs less than 1lb - a 10\" screen seems to be the best for web viewing and not being awkward to handle.Update: I have now had the table for a month.  There are a couple additional items worth noting:1) There is no power led on this tablet - sounds trivial - it is not since you cannot clearly tell when the unit is \"charging\" or \"on\" if the SCREEN is out (ie black).  I have twice now had the tablet drain the battery after a Windows update and it would not power on.  Plug in the charger & press the power button, if the screen does not slightly illuminate it is still off.  If you press the Windows key in the center of the tablet it will vibrate no matter if the tablet is off or on.  This is kind of a crazy oversight by HP.  The first time this happened, I thought I would not be able to get power back on and that I would have to RMA the tablet - but it eventually came back after I pressed the power button enough times (crazy magic).2) What crazy engineer at HP thought it would be a good idea to a) have the volume key partially inset around the back of the tablet and why would anyone put the main ports (micro usb, charging, and micro hdmi on the bottom landscape edge of the tablet).  This makes things fun (irony) when you put a case/cover on the tablet and cannot reach the volume button and more entertaining is when you stand the tablet in landscape and all of the ports are now in contact with table/desk you are sitting it on. Try to connect to the micro usb like this...Ah...so you ask do these issues change my overall opinion and rating - the answer is no, this is still a great tablet for the price & hardware that you get!Update 2 (6/7/2014): I now have three of these (used by my brother, my daughter, and myself) and they all work as described above with no issues or problems.  The most recent one I purchased was at the $299.99 price which is a wonderful deal (realize the first two cost $400). Even more shockingly HP has issued an actual BIOS update (which implies they finally realize this is one of their products).  Since Intel is about to release their newest low power CPUs for tablets (likely Q3 for availability) this tablet will fade into oblivion - who knows how low the price will go until stock is depleted...it is definitely worth considering!", "Date": "December 28, 2013"}, {"Title": "Unbeatable Value", "Author": "tac", "ReviewID": "R1UPZJLPHITWCI", "Overall": "5.0", "Content": "Heading into 2014, tablet buyers are spoiled for choice.  All three major platforms offer excellent designs and roughly comparable hardware.  In this environment, the \"best\" platform is primarily a function of individual preferences and use cases.  People who want to forget they're using a computer should buy an iPad.  Those who want a subsidized tablet with more flexibility should buy a Nexus device.  For those who want a single device to do everything, a Windows (not RT!) tablet is the way to go.  Among the new \"Bay Trail\" Windows tablets, the HP Omni 10 is the best value.  If you want the best computer $400 can buy, stop reading and order one.If the Omni 10 is so great, why isn't it the best choice for everyone?  The answer is complicated, but the bottom line is that Windows tablets require active participation from the user to realize their benefits.  I used an Acer W510 \"Clover Trail\" tablet daily for more than a year, and Intel's drivers never fully resolved intermittent WiFi connectivity problems and occasional hard lockups.  Intel is the world leader in semiconductor technology, but their driver teams leave much to be desired.  When I took my Omni 10 out of the box, it froze most of the time on wakeup.  Frankly, I'm amazed HP shipped a product with such buggy drivers, as they must be aware of these problems.  Updating the display drivers improved things, but the device still freezes every few hours.  If I had to guess, I would say this instability explains why the Omni 10 is readily available from only one vendor, and why HP continues to pretend the device hasn't been released (as of late December 2013).Why put up with immature drivers, when competing platforms can go weeks or months without a single reboot?  Because everything else about the Omni 10 is fantastic.  The Atom Z3770 is a very fast processor, the 1920x1200 screen is gorgeous (though I recommend turning off auto brightness and dynamic refresh rate, as these cause the flickering that some reviews have complained about), and the battery lasts all day.  Competitors offer more pixel density, but the Omni 10's 224 ppi is right at the limit of what can reliably be interacted with using a fingertip on the 100% desktop (Windows 8.1 has improved scaling, but the traditional desktop UI still looks best at 100%).Granted, most modern tablets have fast processors, beautiful displays, and great battery life, and the Windows Store has a smaller selection than others.  The advantage of Windows tablets is that they offer enough \"Modern UI\" apps to handle the vast majority of casual tablet activities (browsing, social media, streaming video, etc...), while providing access to a massive catalog of legacy software.  The breadth of x86 applications that can be run on a Windows tablet makes other platforms feel like ridiculous toys.  For real productivity facilitated by free software, no alternative comes close.  That the Omni 10 includes touch-optimized Office Home and Student 2013 is just a cherry on top.Some compromises were necessary to reach this price point.  32GB is adequate for a core set of applications, but leaves little space for future additions (the Omni 10 has about 15GB free after Office is installed).  A 64GB model is mentioned in HP's specifications, but is not available at this time.  The microSD slot allows expansion, and 64GB cards are inexpensive, but their performance is far inferior to that of the eMMC internal storage.  2GB of RAM feels restrictive for a Windows machine, as only about 1GB is free for applications.  The new Atom supports 4GB and 64-bit, but the \"connected standby\" version of Windows is 32-bit only for now, so the 2GB configuration is understandable.  Finally, while it would be nice to have an active digitizer, this is a reasonable omission in a value device.Taking a step back, the Omni 10 is a very good effort from HP.  There are some odd decisions, such as the 1-meter power cord, but the Omni 10 clearly wins the value comparison for this generation (among devices announced thus far).  Some of the choices made by Intel and Microsoft appear to be aimed at protecting margins on high-end devices, and it's a little frustrating that this year's tablets represent essentially no progress in terms of RAM and storage.  That's not HP's fault; the Omni 10 is a great device.", "Date": "December 29, 2013"}, {"Title": "Best option for the price", "Author": "Wayno", "ReviewID": "RDQGV3VQ9JLR5", "Overall": "4.0", "Content": "There aren't too many reviews of this tablet yet so I thought I'd throw in my 2 cents. I currently own a 1st gen Nexus 7 (Android OS) which I like and still use daily.  I actually purchased the 2013 version but returned it due to a color gradient on the LCD which bothered me (I tried 2 and both had the issue).  I do notice a little of the same on the Omni but it is nowhere near as apparent.  It was easier to justify the purchase of this tablet because it's quite a bit different from the N7.  I get more screen real-estate and I'm able to utilize Win 8 when I need it.  The device was not available here so like others I purchased it at OM when it was on sale.  I didn't get the $25 Microsoft store credit as some did even though it was purchased during the promotional window.  I do not know why but perhaps they ran out.For the money I think this is the Win 8 tablet to have.  I think the Surface is too heavy and if I need that much processing power then I'll get it from my desktop or work laptop.  The Omni 10 is still usable as a tablet without without being too bulky or heavy. I didn't want to see pixels and with the screen resolution and the 10.1\" size I'm more than happy in that regard; but less so with Windows' 8 font scaling abilities.  It's nice to be able to surf full web pages, which the device does extremely smoothly in Internet Explorer.  Firefox is next best, albeit it's pretty far behind, with Chrome running really poorly for some reason.  I assume this has something to do with optimizations for the processor but I do not know for sure.  Other Windows apps I've tried run just fine.  In fact, I'm able to play System Shock 2 on it without any issues.  I'm also satisfied with screen brightness but not so much with how it attracts fingerprints.  It's probably to worse screen I've seen in that regard HOWEVER you don't see the smudges when you're using the device (and the backlight is on).  So this review doesn't run on I'll summarize my opinions below:Screen: Very satisfied with resolution and brightness but not so much with the fingerprints.  I'm still somewhat bothered by the slight yellowing of the screen when not looking at it straight on but now wonder if it's a gorilla glass thing...On board storage memory: I would have gone for the 64GB it if was available.  You have the option to add a microSD card but read and write performance is really poor relative to the internal storage.  Internal storage read/write is about 175/58 MB/s while my class 10 Sandisk card clocks in at 23/11 (on my desktop the same cards runs at 45/14).  I do not know if performance is so poor due to hardware or drivers but if it worked faster it would have gone a long way to alleviating the low on-board storage memory (~15GB usable).  It IS still usable however, and most desktop apps can be installed there.Memory: With only 2GB AND shared with the graphics card, I would have expected this thing to fall flat on its face but even running extended desktop on and external 1920x1200 screen it chugs along at about 80-90% memory utilization with a number of programs open.  CPU utilization was around 25% at the time.  I'm surprised but it works and I can't really complain (even though I want to and would have preferred 4GB and a 64 bit version of Win 8).Expandability: It would have been nice if USB3 (even if it had to be at reduced \"non-spec\" output power) was enabled instead of the just USB2.  The port does work with everything I've plugged into it so far (you'll need to buy a USB OTG cable, to convert it to a full size port, which are really inexpensive).  MicroSD card is nice but it's very slow and I would have preferred a full size SD card option instead.  There's no docking port which is a disappointment as I would have liked to see some full size ports, card reader, HDMI connection, fast charge, etc, that a dock could have provided.  This thing would be more that adequate of a PC for the majority of people out there.Charging: As others have mentioned the charge chord is really short and the plug is circular with 12V output at 1.5A.  This means that you won't be able to use a battery \"power pack\" to recharge the unit if an AC source is not available.  Also, the proximity of the ports causes interference if you try to use an angled microUSB plug (like many OTG cables have) and have the unit plugged in at the same time so buy an OTG cable with a straight plug.20140202 Update: The electrical connection of the charge cord has been giving me problems.  When I insert it into the device I always need to make sure that it's making contact (via the onscreen icon).  I've had a few instances when I've plugged the tablet in and it didn't charge at all because it didn't have a good connection.  I do not like having to fiddle with these things and here's another good reason why HP should have stuck with a standard micro-USB charge plug.MicroHDMI: Tried it; worked fineBuild quality: Seems really good so far.  I'm pleasantly surprised as some HP devices I've owned have fallen short in that regard.Wireless display:  Unfortunately I don't have a compatible receiver so I could not test.Speaker: Good separation but no better than average overall.  I wasn't expecting much on this front and since you can connect headphones/speaker via headphone jack or bluetooth it's not an issue for me.Cameras: Work fine for Skype but overall they are no better than average.  The main camera performs very poorly at low light so don't expect to be using this for photos or videos unless you're in a bright environment.  CORRECTION: There is a pretty cool photosphere mode in the camera app but the inaccurate eCompass causes it to behave erratically on occasion.eCompass: All over the place (does not work well) and I could not find a way to calibrate it.  Android figure 8 method had no effect.  Looks like no augmented reality night sky viewings with this device unless the compass can be re-calibrated somehow.Windows 8: I knew the app store was bad but I didn't think it was going to be this bad.... thankfully you can use full websites instead of installing apps you would probably normally do on an Android or iOS device which has the added benefit or not using storage space (aside from the cache data).  Some desktop apps, like Google Earth, are very difficult to use without a mouse.  I find the Win 8 softkeyboard more difficult to use than Swype (which is not available) on my android phone and tablet.  In desktop apps, the keyboard needs to be activated manually via the taskbar.  Word suggestions appear by the text and not by the keyboard so hand removal from the tablet is required... WHY DID MS DO THAT?  I wish there was more customization options or 3rd party keyboards available (of which there are none that worked to my satisfaction).UPDATE: As W. Dillon pointed out in the comments the spacebar can be swiped and tapped to choose a suggested word.Issues:  Recorded sound (videos/voice recorder) contains some kind of electrical noise. UPDATE: Noise is from the unit's WiFi radio as turning the WiFi off eliminates the issue.  It's not very loud but I think it's causing issues with voice recognition because it does not work nearly as good as Google voice recognition on my android devices.  I also had a couple of bluescreens but I think that had something to do with an old driver so I'm not going to count it against the tablet.  I've also had my bluetooth keyboard and mouse disconnect a couple of times for no apparent reason.  Cycling bluetooth power off/on on the tablet resolved it for now.UPDATE: The Google app catches my comments at least as well as on my Nexus 7; I wish that the MS voice recognition software worked as well.  Additionally, the blue screen was a result of a \"USB Netserver\" program that I installed because it happens every time I run that particular piece of software.Surprises and delights: Very usable as a laptop replacement with bluetooth keyboard and mouse and an inexpensive stand.  Comes with MS Office H&S; which is great to use on the tablet in portrait mode and the tablet is so easy to flip on its side that I actually use that \"feature\".  There is a microSD card included with the recovery options should you need to use it.  I find this to be a much better alternative to taking up on-device storage space a la hidden partitions.Summary:  I'm torn regarding this tablet because of some of its shortcomings (it's so close to being a perfect 5 stars) but it's just such a nice package and performance has thus far exceeded my expectations.  In comparison to the other tablets in this price range I think this one has them all beat even with those shortcomings.  I like it!20140202 Update: Even with all issues I've pointed out in this review I still really like this tablet a lot and I'm glad that I kept it.  I'm concerned about its future, however, as there are very few places that stock it and it still does not seem to be getting the support from HP that it deserves.", "Date": "January 6, 2014"}, {"Title": "great for early adopters", "Author": "Amazon Customer", "ReviewID": "R1K6TR9CN68GBZ", "Overall": "3.0", "Content": "Update!  Within roughly 60 days of owning the product, I did not charge it for a week because I was not using it.  When I went to turn it back on it would not respond.  I charged it over night and it would still not turn on.  When I called HP support about the problem initially they said to charge it and it would turn back on.  When I called back because it would not turn back on, they had no other troubleshooting tips and had to send me an entirely new unit.  They said it was probably bad because it was overcharged.  Not sure if I believe it and I might have just recieved a lemon, however I would be cautious and make sure to back up regularly.I really like the tablet. The set up took a bit of time to upgrade from Windows 8, which it shipped with to 8.1.  Got rip of my iPad 2 for this device. I like that it is a full blown computer and can run MS Office. It is a little weird that the app side and the windows side do not sync up. For example, I installed the Dropbox app, which did not give me access to Dropbox on the desktop. I say its great for early adopters because unlike ipads the accessories are currently very limited. Trying to find any kind of case right now is basically impossible. Like many people said the 32 gig hd less than half is available because of the size of windows. Getting SD card doesn't help much because you cannot install apps or programs on it and many programs will not let you save to it. That brings me to the next minor issue, it is all micro ports. Micro sd, micro hdmi, micro usb. I went to three stores and there is not a lot of micro stuff available. My final issue is the charging cord. Instead of being some kind of usb charger it is a weird like audio jack type charger.  With all that said it is still way better for me to use as a secondary work device than the iPad ever was.", "Date": "January 4, 2014"}, {"Title": "Great Atom Tablet at an awesome price", "Author": "Rakesh Koul", "ReviewID": "RNY6URNZR7TNJ", "Overall": "4.0", "Content": "Pros:A Full HD 1920x1200 PanelWindows 8.1 - Intel x86 Quad Core CPU - Full Windows Application compatibility8MP/2MP CamerasMicro-USB, micro-HDMI and SDHC CardPretty good in terms of weight at 1.43LB.Includes Microsoft® Office Home and Student Edition 2013 - activatedCons:I haven't seen a 64GB Version of the tablet  yet.I bought this at $349 for 32GB Version and at that price, it would beat many tablets out there.- RakeshDisclosure: I do work for Intel, but my comments here are personal.", "Date": "December 16, 2013"}, {"Title": "Replaced wife's laptop with this great tablet.", "Author": "R. Burrous", "ReviewID": "R3C9C6SN8TL39B", "Overall": "5.0", "Content": "Very fast and snappy tablet.Added a 32 GB card, got a USB adapter for keyboard, mouse, and printer.Plugged into an HDMI monitor.Wife very happy, works better than her old laptop and have not had one problem.Battery power is very good.Only thing I do not like is the proprietary A/C adapter, but it not that big of a deal.I want to go buy another one for me!!!!", "Date": "January 23, 2014"}, {"Title": "omni hp q10", "Author": "jeff rosen", "ReviewID": "R1VUWS0T1RE27L", "Overall": "1.0", "Content": "have owned this item for approx 2 months. the worst touch sensitivity of any touch screen. You would think for a windows 8 touch screen device that it would be darn near perfect. redundant touches are just about always necessary. Extremely frustrating when operating device.", "Date": "April 6, 2014"}, {"Title": "Great value tablet!", "Author": "speechman", "ReviewID": "R1FIXD1RPFJMNL", "Overall": "5.0", "Content": "I purchased the Omni 10 about a week ago.  First let me say that this is a full blown windows computer.  It is not the DOA windows RT that will die a short death because the price between RT and full blown windows is dwindling to nothing with this tablet.  The new windows 8 operating system takes about a week to get used to because, unlike Android, you have to memorize a few actions.  For instance swipe in from the left, right, top, bottom.  To kill an open app, you swipe in from the left..it lists your apps, you then drag the app you don't want open toward the bottom of the screen.Anyway, the tablet is fast, it has a great screen, the battery life is simply amazing (have used it just about all day with no recharge), the 10\" screen is just the right size.  It doesn't have an official HP keyboard, but I have found one that works great..holds the tablet up without needing to lean on the table (it works on my lap).  I admit 32gig may be a little small...I'm down to 12gig without really loading anything on it, but I plan to install a microsd card to get more room.One of the greatest things about the tablet is that it is full windows.  You can map network drives, use printers in a normal way (not the painful hack that is associated with android).. with real drivers, it runs old regular windows programs, etc.I was on the fence about getting the dell Venue 11 or the Omni 10, but chose the Omni 10 because:1) There have been reports of the Dell crashing, etc.  I have not had a single crash on the Omni 10 over the week I have had it.2) For me the Omni tablet $300 was $150 cheaper (50%) than the Dell $4503) I also have an HP slatebook x2 (Android) that has worked great over the 3 months I have had it - so it has renewed my faith in HP hardware.For those on the fence, I think this tablet is a winner compared to the long line of tablets I have owned (mainly android)Asus infinity, Iconia a500, ipad 1, kindle fire, HP slatebook x2", "Date": "March 1, 2014"}, {"Title": "Best windows tablet for its price !!!", "Author": "Siddharth S.", "ReviewID": "R16F73IGVKS5MK", "Overall": "5.0", "Content": "Bought this after trying surface pro which was too heavy and the text looked too small on the screen. I returned it the very next day. Then bought sony vaio flip tablet cum laptop with 8GB Ram and 500 GB HDD for $699. Returned it as it had wifi issues and had major lags and issues with the touch screen.on browsing through amazon and bought this laptop and after reading the reviews wanted to give it a try as it was a very decently price tablet. and wow what a buy it has been. Super fast speed, full HD screen, full  and licences microsoft office and awesome form factor (weight and size). I would recommend it.The only downside is the storage space. Only 16 GB is free but expandable. Bought a bluetooth keyboard and i have now a full fledged windows laptop. Its the tablet for on the go people.. might not be as powerful as other laptops but gets the work done without any lags.Happy with the purchase.", "Date": "February 8, 2014"}, {"Title": "A solid tablet running windows 8", "Author": "AL", "ReviewID": "R1PO6XVMSQRJ42", "Overall": "5.0", "Content": "I was worried that there won't be enough space left on C, and was really happy to see more than 15G available on C after setting up a couple user accounts and activated MS office. The tablet is responsive for web browsing, email, and document editing. It can be easily paired with Bluetooth keyboard, and miracast devices such as PTV-3000 for a more productive platform.I have considered Asus T100, but really prefer a screen with higher resolution. At $350 from Office Depot when it was on sale, it is a much better value compared to Dell Venue Pro 11 with slightly better specs (64 G SSD, full size USB 3).", "Date": "January 3, 2014"}, {"Title": "Worked great when it worked, Freezing issues", "Author": "Shaun TM", "ReviewID": "R332T165N6MON8", "Overall": "3.0", "Content": "I was one of the lucky few to stumble upon this great concept product and decided to purchase it due to the great overall reviews (reviews actually exceed any other full Windows 8 tablet that I considered).  Upon arrival, we were pleased with the overall hardware build, the software implementation, features, etc.  Not too impressed with the lack of accessories from HP or other vendors.  The device is practically unknown on the web as a tablet.There is little that compares with the hardware within the price range, however, we experienced freezing which made the device unstable requiring intermittent hard reboots.  After researching many blogs and threads about the issue (where I found the problem was actually somewhat more common than I originally suspected) and performed the proposed mitigations that could supposedly fix it, I tried just about everything, even a couple factory resets, but the freezing occurred nearly right out of the box within the first hour or 2 of use, before and after software updates, so it was hopeless.  We couldn't go one day without it locking up regardless of settings, drivers, updates, any software that was in it.  Fairly certain it was hardware problem.I am hoping that I just got a dud, and I will probably be ordering a replacement because we were so impressed with it and it is difficult to find anything that comes close for the money.  I am hesitant because even if it works initially like everyone else is mentioning in their reviews, the same thing could possibly happen outside the 30 day return window sometime down the road which would leave me dealing with HP support.***UPDATE***Received a replacement since there was little within my budget price range for the 10\" tablet market with a baytrail. I really loved the speed and response of the Baytrail Z3770 and the full HD resolution so I was forced to take a chance and purchase another.  Good news, this 2nd one has worked flawlessly for 1 week so far, which proves the previous did have a hardware issue.I did manage to install all updates without any issues.  Functionality is great, purchased a universal keyboard folio case for 10\" tablets and it seems to function as a small netbook.  Please note that this was purchased mostly for web surfing/video conferencing/ and as a media player.  I just can't stand mobile pages / browsers and have yet to find any Android / IOS device which can browse the web with no issues exactly like a desktop would.  Also, some of mobile dual core chips on other Win8 tablets cannot really handle Win8 and get bogged down, so this fits the bill with my necessity for speed and response.  I have a smartphone so if a mobile page was good enough, I would just use the smartphone, however, with a tablet, I believe there should be no sacrifice, it is practically a touchscreen netbook so it should ideally function like one.Complaints to note:Camera QualityCharging port quality / locationvolume locationimage color is just slightly on the \"cool\" sideScreen resolution is great, but brightness is lower than most tabletsWhen brightness is turned up such as in sunlight, battery life degrades drasticallyI typically write reviews based on quality and not price since prices fluctuate over the lifespan of a review.I know there are better devices out there, and depending on the persons preferences/needs, but most will probably be in a different price range altogether.If I were to give a rating based on quality/price, it would be a 4-4.5 based on what I paid at the time.  It is hard to expect more from a 10\" tablet under $400.", "Date": "March 29, 2014"}, {"Title": "perfect tablet. just needs the right accessories", "Author": "stephen kunkel", "ReviewID": "RZNABQQGZLHW0", "Overall": "5.0", "Content": "Great battery life for something so small and powerful. My only complaint is a lack of accessories to buy for it. Hopefully as this great deal becomes more popular there will be more options for cases and keyboards. Luckily it has Bluetooth so any Bluetooth keyboard works. Don't pass up this deal!!!!", "Date": "December 24, 2013"}, {"Title": "Good tablet, crappy charger", "Author": "Kevin Courcey", "ReviewID": "R1HBXVILJRFVK5", "Overall": "3.0", "Content": "this is a really nice tablet, very much like a windows version of the ipad.  Unfortunately, a tablet is only as good as its charger, and HP foolishly decided to use a proprietary charger with this device rather than the standard micro-USB charger that most phones and tablets use.  And we are now on our 3rd charger in 2 months of use.  Admittedly, HP has been good about sending out a new one each time, one time even replacing the tablet, as the battery had completely died and the unit wouldn't power up.  The problem is, you never know when the charger will stop working.  You think you have the tablet plugged in and charging, and you get up in the morning and you've got a doorstop instead of a tablet.  They really need to redesign the charger on this unit.  When they do, it will be a great tablet.", "Date": "April 26, 2014"}, {"Title": "Great Win 8.1 Tablet", "Author": "J. Penegar \"Golfer393\"", "ReviewID": "R3EJVWTT7P9T3", "Overall": "5.0", "Content": "Researched all of the sub $400 Win 8.1 tablets and decided that the Omni 10 was the best one for the money.  I looked at he 8\" Dell and Lenovo and liked the size and weight, but 8\" is just too small for Windows desktop.  The 10\" screen is small in desktop, but usable.  The Omni 10 has the best Atom processor available and a much better screen resolution.  The other feature that I really wanted was an HDMI out, which it has.  I used this tablet today hosting a GoToMeeting presentation at a customers office.  It worked beautifully.Pros:1. Excellent battery life.2. Full Windows 8.13. Microsoft Office (less Outlook) included.4. Excellent screen resolution5. Very good screen clarity, sharpness, and brightness6. HDMI out7. Almost the exact size and weight of my iPad 38. Stereo speakers that sound good9. Excellent microphone10. Nice rubberized back that feels good in the hand11. Excellent fit and finish as expected from HP12. Excellent speed and performance13. Bluetooth which allows a keyboard and mouse14. Micro USB allows use of USB devices with a $10 adapter15. Good front and rear cameras16. Much better form factor than the Surface Pro, and much less expensiveCon's;1. Only 2 GB ram2. Win 32 bit OS3. Average WiFi performance4. Very limited cases availableOverall, I really like it and I'm very happy with this purchase.", "Date": "March 27, 2014"}, {"Title": "Good Product", "Author": "Matthew Letson", "ReviewID": "R3MQIDZSNDZPY6", "Overall": "5.0", "Content": "A great product. It was easy to set up. I wish it would have had a Full USB 2.0 port like the ASUS T100T. You have to get a Micro USB Adapter OTG cable. It doesn't costs but $2.00 or so. I got one on Amazon.com too for that price and I was up and running. It's worth noting that that cable is not included. This Tablet does include Office 2013 home and student which is very nice. I would have bought the ASUS but the local stores were out of it. I have always had good luck with HP products. Most of my home products are HP. I prefer HP even over Dell at times. I know that some would not agree with that statement. I do however recommend this product to others. The only thing I would have liked also along with the USB port is a longer battery life. It has 8 hours but would have liked the 11 hour battery life like the Ipad and Asus T100. Oh well you have to make sacrifices somewhere. It does have a nice Full HD screen if I'm not mistaken.", "Date": "February 21, 2014"}, {"Title": "No propblems so far.", "Author": "M. Schlenker", "ReviewID": "R2XTQ114BY13ET", "Overall": "4.0", "Content": "This was the only tablet to meet my requirements of :Z3770, 10\"-11\", HD screen (16:10), 64Gb (missed that but added a 32Gb micro SD card that’s class 10), relatively thin and light, HDMI (Mircast is still new) out and 8hr battery.The 32Gb storage is my biggest con, but there is a Registry edit that will allow the Microsoft Store Apps to load to the SD card and that should help the storage limitation. HP is doing a really poor job of marketing and very few accessories available.I bought mine at Office Depot for a fantastic price of $350 w/$25 Microsoft store card, Amazon did not/does not have them in stock", "Date": "December 31, 2013"}, {"Title": "Almost perfect.", "Author": "Raul Bonilla", "ReviewID": "R2BLPO9OH0ONJ6", "Overall": "5.0", "Content": "I have been really impressed my Omni 10, a fast computer, with high resolution, the truth I loved the Windows 8.1 operating system. I would have liked it had 4GB of Ram and the possibility to buy it with 64gb of flash memory. The number and variety of apps available is limited, as are accessories, which are also difficult to find, but to be honest is a Tablet-PC does not need accessories. The gorilla glass 3 gives you almost all the security against scratches. In resume, the quality, performance and price is almoust excellent. If you want a good Tablet PC with Windows 8.1, the Omni 10 is the best you can find low cost.", "Date": "May 3, 2014"}, {"Title": "as good as laptop but light and portable", "Author": "Edward G. Pollard", "ReviewID": "R28W2TJMMMTNC7", "Overall": "5.0", "Content": "not much else to say. great for plane travel. nice screen and video. micro usb and hdmi ports. works as promised.", "Date": "April 11, 2014"}, {"Title": "Decent full Windows 8 tablet", "Author": "stephen stratton", "ReviewID": "RTJUV0SXX2JD2", "Overall": "4.0", "Content": "I was looking for a reasonably priced tablet that would run the full version of Windows 8, not RT.  This hit the mark.  I wavered back and forth between this machine and the Samsung Note 10.1, but chose the Omni 10 because of Windows, which I feel more comfortable with.  The only feature I would have really liked is a good stylus/handwriting recognition feature, which the Note has, but it was not enough to pull me away from Windows.Pros:Fast tablet with full Windows 8.  Starts right up, easy to learn and use.  Comes with Windows Office.  Clear, bright screen and decent speakers.  Long battery life.Cons:Not many choices for cases/accessories (really wanted to get a case with bluetooth keyboard, but not many options).  Some screen flicker.  I tried to attach an external hard-drive, did not accept it very well (could be the converter cable I was using, so not docking the machine for this). Not a fan of their proprietary charger.Overall I am happy with this device, and for the price is a great deal!", "Date": "April 8, 2014"}, {"Title": "I didn't want Apple", "Author": "Jim McNeely", "ReviewID": "RPBD58OCTSVT9", "Overall": "5.0", "Content": "I had been looking for a Windows 8 based tablet at a reasonable price for some time. I ran across the HP Omni 10 and it seemed to have all the features I was looking for. The tablet was delivered when Amazon said it would be and packaged well. The operation was smooth and fast. I have really enjoyed using it. I did have a problem loading Microsoft office but after a phone call to Amazon I realized what I was doing wrong and they helped me through the process. All my dealings with Amazon have been pleasant and enjoyable.", "Date": "April 2, 2014"}, {"Title": "Omni Tablet", "Author": "Bob Carpenter", "ReviewID": "RDKO124DWQHM8", "Overall": "4.0", "Content": "Lightweight, fast, easy to use.  Would have been nice if it also had a full size USB connection but none of its competition does either in this configuration", "Date": "March 10, 2014"}, {"Title": "Very good tablet for OTG researcher", "Author": "Amanda", "ReviewID": "R2HESVC4VEXV5R", "Overall": "5.0", "Content": "I am a research scientist and wanted flexibility in a tablet for using MS Word, PowerPoint, Adobe Acrobat, and a high-level data analysis/graphing program, all running under Win 8.1  Also mail, browser, and a Kindle app.  The HP Omni 10 tablet fits the bill beautifully including a Kindle app that gets my books seamlessly.  SkyDrive/OneDrive keeps my research files available online/offline on my desktop HP Windows workstation and my Omni tablet while traveling.  I just need a wifi connection.  The Omni wifi capability is excellent.  I did buy a Bluetooth mouse since finger/stylus tapping is not efficient especially for my analysis/graphing program.  I could not make the analysis/graphing program function without the mouse for filling in bubbles and data easily.  The mouse I chose was the HP X4000b.  It paired easily and works well.  The tablet keyboard is sufficient for my needs since I don't do a lot of manuscript preparation on the tablet.  I have a 32 GB sd card that works well.  Also micro usb to female usb cables.  The Omni 10 sees my 64 GB flashdrive using the cable from CableMatters.  My one criticism is that Win 8.1 does not allow me to increase the size of icons with the 10 in screen to my personal preference.", "Date": "March 6, 2014"}, {"Title": "A couple of problems but all great ever since.", "Author": "J. Wu", "ReviewID": "R34RFMCKZXLUHZ", "Overall": "5.0", "Content": "I am bypassing all the great things such extremely fast system and internet browsing speed and all day battery life.  You'd get close to ultra book performance and even longer battery life but very cheap price.  I got mine from MicrosoftStore only for a promotional sale that I get to save me one Ben Franklin.  :)The day I got it, after full charge I unplugged and then installed all the updates.  After a few reboots, all excited, I plugged it back in and it stopped charging.  Tried several outlets and more reboots and not working.  The next day morning, tried it again, still wouldn't charge.  Took it to Microsoft store, and the clerk plugged it in and it's charging.  He later showed me how to install windows update and treated me like a grandma using PC for the first time.  I felt so humiliated but just took it in.  It's been charging just fine every since.The charger is not USB standard and is listed on HP.com for $35 to rip us off.  Here's my get around.  Go buy this for half the cost: http://www.amazon.com/gp/product/B00CWR39TI/ref=oh_details_o00_s00_i00?ie=UTF8&psc;=1.The other problem I ran into is that it wouldn't shut down.  Again, I tried so many things such as remove software and drivers but not works  When I was about to do a restore from D drive (the SD card), I realized that the drive is not seen by OS.  Removed the card and put it back in and the drive is back.  And that's it, win8 can shut down again.If this tablet is on sales again, I will definitely jump on it and buy another one.", "Date": "March 3, 2014"}, {"Title": "HP.....how far you have fallen!", "Author": "TeeDub \"TeeDub\"", "ReviewID": "R20XXUOGZUQBUJ", "Overall": "1.0", "Content": "HP continues to amaze me how far they have fallen.  They used to make good printers, plotters, calculators, and computers.  I have a programmable calculator that I bought in 1983 that I still use 31 years later.But I am returning this piece of junk Omni 10 tablet computer.The unit discharges itself to ZERO after charging while still plugged in to the charger.HP said that I am supposed to unplug the charger after 2 hours - REALLY?!?!  That's a nice feature!Also, if you manage to get it charged, it then won't save energy by invoking the screen saver....it just keeps the screen on until discharged, even though the power settings are at BALANCED and the screen should turn off after a certain number of minutes.Lastly, there is no LED or indicator on the computer nor the charger that tells you whether it is connected to power or charging.These are simple things to test before releasing a product and major oversights.HP just burned their last chip with me....no more buying of HP products for me at any price.", "Date": "April 14, 2014"}, {"Title": "No Longer Happy", "Author": "C. Heffernan", "ReviewID": "R2KIVKASBD8NNW", "Overall": "2.0", "Content": "My time with this tablet has been limited but so far I have been quite happy.  I came from a Surface RT tablet and have to say that having a full version of windows has been refreshing.  The Surface RT had nice hardware and I actually miss the kick stand, but the Omni has resolved the two biggest complaints I had before:1 - Video Support - I was able to install a video codec pack and can now watch all of my videos, including MKV and Media Center recordings.2 - Wireless Display - I can now use Miracast to wirelessly connect to my TV. I guess HDMI out is a good alternative but wireless lets you control things from a distance.A few more observations: The screen seems fine to me and the resolution is great.  I actually prefer the 16:10 ratio vs the Surface's 16:9.  The Wi-Fi is a bit weak at times but good enough for my needs.  Hooking up at 5GHz works fine for streaming HD recordings.  The CPU is great.  Browsing the web on the Surface RT was slow but the Omni is quick and responsive.  The main negatives so far are that the back of the tablet can get very hot at times and the speakers are pretty bad.Overall I am quite impressed with this tablet.  Perhaps any tablet with full windows support would have made my day after the hassles of RT, but the HP Omni has proven to be a solid tablet given the affordable price.------UPDATE------Well after just a couple weeks I've run into problems.  Suddenly one day running Internet Explorer started causing my tablet to freeze up.  I tried rebooting several times and each time encountered the same problem.  When I tried doing a system restore to a time before some Windows updates, my tablet stopped booting altogether.  It just hangs at the HP logo now.  And it turns out that since I failed to create a recovery disk while things were working, I can't restore the system now without ordering a recovery USB stick from HP.  What a disappointment.  I think I may be done with Windows tablets.", "Date": "March 29, 2014"}, {"Title": "Way better than an iPad", "Author": "T. Soczka \"Hurtin' Bombs\"", "ReviewID": "R265FYS27YB4KG", "Overall": "5.0", "Content": "I've used an iPad 2 and mini along with a Nook HD and laptops.  This tablet by far exceeded my expectations in performance and graphics.  Setup was very easy.  HP also sends it with a help application & windows 8 help.  The videos & explanations really helped this Win 7 guy move to windows touchscreen.I purchased this tablet specifically as a cheaper alternative to the SLATE so that I can run Intuit's Point of Sale (POS) software on it.  This way I can keep my counter nice and clean while still having the flexibility of a full MS OS machine.  It runs the POS software great!  Not only does it have the POS software, but I've also loaded the MS Office (which comes with it) & a few other applications and still have 12Gb internal space available.Since it is fairly new, I've had a little more trouble finding appropriate cases and stands for it.  However, there are a few options out there that will work fine.  Just remember that the connections for power, miniHDMI, & mini USB are scrunched in the middle of the long end.  You will need a stand that holds the corners & not a shelf.Battery life is very good.  I've used it for over 2 days and still had charge left.  Some people complained about the separate power cord and not miniUSB charging.  The power charges at 1.5V, much higher than USB port.  You want this if you want a fast charge.Only drawback is the weight.  It is pretty hefty compared to a newer iPad.  After awhile, you'll want to have it rest on your lap/arm instead of holding it in one hand.  This is such a minor issue for me that I am not going to dink the rating for it.Enjoy!", "Date": "February 10, 2014"}, {"Title": "Maybe good as a cost-effective laptop, not as a tablet.", "Author": "Sin Jeong-hun", "ReviewID": "R1SGIXO5TVPW7S", "Overall": "3.0", "Content": "I have used it for about 4 days now. And this is my first Windows 8(.1) tablet. I own (or owned) numerous Android tablets/iPads, and I have been using Windows 8(.1) on my desktop for a while.Cons1. Very bad screen (the biggest con to me)Yes, the resolution is 1080p, but the quality sucks. I compared it with those of my GT 10.1, GT 3 10.1, iPad 3, and this is the worst in viewing angle, color reproduction and brightness. The color is washed out. I used to think Nexus 10's screen was washed out. I compared Omni to my friend's Nexus 10, and what do you know, Nexus 10's screen suddenly looked colorful and bright! That is, Omni's screen is that bad.I bought this tablet as media consumption device, but with this screen, I gave it up. Also the screen's brightness sometimes slightly flickers even though I have disabled all LCD power saving features and auto brightness. Cheap HP, couldn't you put a nicer screen?Update: the flickering became unnoticeable when I restored the default LCD settings. This is weird because I thought disabling LCD power saving features would make the screen look better, not worse.2. Bad speakersWell, I did not expect much but the speakers are also the worst among all the tablets I have. It is not pleasant listening to music with these speakers. The sound breaks in high volume (Galaxy Tab, iPad do not).Update:The Windows default sounds sound awful on these built-in speakers. For me this became as bad as the first con.I cannot enjoy YouTube or music. I did not realise sound on a tablet is this important.3.Body build qualityThe screen near the middle of the left edge is slightly sunken, so when I hold it, the frame's sharp edge hurts my thumb. I am sure HP did not intentionally sank that part, it must be manufacturing issue.4. FreezesI have experienced freezing about 4 times. Especially when opening the camera. I had to long-press the power button to reboot.Update: It freezed three times while I was playing an old Direct X based full screen game. I found that a lot of people posted about freezing on HP's support page. This is really frustrating. I have never seen any smart device freezes so often as much as this these days.5. Heat problem.If you set the screen brightness to the maximum (you would have to, because the screen is not so bright), and use it for a while, the bottom part of the tablet gets hot even though you use lightweight apps or browsing the web. If you charge it, the bottom parts gets very very hot, almost hurts my hands.Update: I copied a few GBs of files from my desktop over Wi-Fi, having the screen turned off. The center of the backplate got really hot.6. Microphone noiseThere is a very loud constant electronic-like noise (beep beep beep..) while recording through the built-in microphone.Update: After searching Google for this, I found that one user asked about Wi-Fi and microphone interference. I put the tablet into the Airplane mode and recorded my voice. The noise got smaller! So the Wi-Fi signal does seem to be one of the culprit. However the noise still remained, meaning you cannot get clear recording even if you put it into the Airplane mode. If you want to use this tablet for voice chat or recording sound, you might want to think otherwise...Pros1.Very fast processorEverything works so smooth and fast, even though it has a high resolution screen.Update: This is still true. Very pleasant to use Metro IE due to its fast speed. No stutters like I have experienced on my Android tablets or iPad3.2. High resolutionI have already written that the screen's color/brightness/viewing angle suck. That being said, if you are using it as a laptop, and doing some word processing, texts look sharp due to the high resolution. Good for text, bad for other things.3. Good stand-by battery consumptionMake no mistake about this, if you turn on the screen and sets its brightness to the maximum, the battery goes down fast. But when I turned the screen off, the battery went down 2% after about 6 hours. I have a power meter, though I do not remember the values exactly, here are the power consumptions.  Charging, screen on doing nothing : about 17 watt, Fully charged, screen off doing nothing : 0.2 watt, Fully charged, screen on, doing nothing: about 7 watt, Fully charged, screen off, playing an MP3: about 0.8 watt.4. You can turn on the tablet by touching the capacitive Windows key.Normally, on Android devices, you can only do this with a physical home button. But this device's capacitive Windows key works when the screen is turned off. I can easily turn it on when the device is laying on the table. The Windows key has vibration, but it feels cheap (does not feel good).Conclusion.If you want a easy-to-use tablet, forget it. This tablet is just impossible to use it holding in hands for a long time. Not good for entertainment purposes. You would rather buy a Galaxy Tab Pro 10.1 or iPad Air. But if you connect a keyboard and a mouse, this could be a cost-effective fast Windows laptop.Question.This is my first Windows 8 tablet, and I find it is fun (not all times, though) to use. Omni 10 could have fit my needs but the screen and unstability just failed me.Is there any Windows tablet that*has a bright colourful screen whose resolution is 1080p or higher.*Good stereo speakers.*Not heavier than Omni 10 (650 grams, I think)*Not smaller than Omni 10 (10 inch or larger)Of course I am willing to pay more than I did for Omni 19.", "Date": "March 14, 2014"}, {"Title": "the price is falling so this is a great deal", "Author": "®", "ReviewID": "R1IQTUT66HUL3B", "Overall": "4.0", "Content": "A full window 8.1 os on a tablet for almost $300 is a good deal.  I had an 8\" lenovo window 8 tablet, but returned it within a week.  The screen were to small and everything you touched was wrong.  10 inch it is now less frustrating as I also have a touchscreen 11\" sony tab and it works fine too.  the bigger screen are 1080p not the tiny 720 for the odler 7 & 8 window tablets.  For awhile the window icon didn't work but after some updates it work again, odd.  Since it is window os you can use ash site and at full web rather then android and apple mobile web without much issues.If you wait a month the new window 8 tablet will be coming out that are 64bits processer.  These new tablets will have 4gb of ram rather then the 2gb of the 32bit window 8 tablet here.  So this makes this product a good value for the money.", "Date": "June 2, 2014"}, {"Title": "Excellent product for a Great Price", "Author": "Connie Pena", "ReviewID": "R3KEBFRG118OAE", "Overall": "4.0", "Content": "So far this has been an excellent product for our shop, Would definitely recommend this to other body shops should have probably ordered 2.", "Date": "June 2, 2014"}, {"Title": "everything I wanted in a tablet", "Author": "Jim Reader", "ReviewID": "R3MV9DRNVHYNGK", "Overall": "5.0", "Content": "It has a high res screen and I'm even learning Win 8.1, and learning to like it too!  The location of the charging port and the type of charger connector could be better chosen, but the battery lasts so long that sometimes it doesn't need charging for days.  I'm very happy with it.", "Date": "May 28, 2014"}, {"Title": "works well but....", "Author": "joseph medrano \"debjoe221\"", "ReviewID": "R2F63Z4XTVS8KB", "Overall": "4.0", "Content": "like the features and do use the windows platform. not real happy with the apps available with this but with the desktop doesn't really matter.  only real problem happen when i tried to add the old style start menu..tablet took a sh.. but rebooted from Microsoft and all was well as long as i don't add the old start menu. its fast enough for what i do but stalls on occasion and they don't make a small enough stylus. some times i have to enlarge the screen to touch the right icon.  last is the charger...what were they thinking(cord is too short and the charging hole...) with that size cord(about 3 feet) i stopped working with the tablet if i had to charge it so i didn't yank the cord out of the wall or out of the tablet.  seems someone was looking for repair money!", "Date": "May 18, 2014"}, {"Title": "Stopped charging after 1.5 months! I WOULD BUY A DIFFERENT TABLET", "Author": "Darrell B", "ReviewID": "R11U4K2SY1S44", "Overall": "1.0", "Content": "FIrst, I have yet to contact HP or Amazon about any problems, so this review will be revised as my problems are fixed.That said, my tablet worked perfectly up until last night. I haven't used it for much other than reading and watching a few shows. The battery had been working fine and holding a nice, long charge. Until last night that is... I had my charging cord plugged into a surge protector in my room, and that's the only place I had ever recharged the tablet. I watched one show and the battery was down to about 12%, so I decided to get the charger, as well as an extension cord, since the supplied recharging cord is a mere 3ft long. Well, I plugged it all in and nothing happened. I plugged it in multiple outlets, including the surge protector I'd always used, and still, nothing. Restarted it and tried again, shut it down twice and tried again, no charging. So, I'm done trying myself.When I first received the tablet, I thought how flimsy and short the recharging cord was, was disheartening. Seriously, all electronics companies seem to be cutting costs by shortening the power cords. I guess they want us running new outlets or running extension cords all over our houses. Then, the stupid tablet doesn't even tell you it's charging. Sure, it has a little white LED that goes on and off when you turn on or off the tablet and even blinks for a split second when you connect the charger, but it doesn't stay on continuously to let you know how the charging is going or to let you know its fully powered. Seems like engineering 101 was skipped here.Anyway, I'm not sure how I'll resolve this issue. I'll check with HP and Amazon and see what they can do. I may try to get a refund and find a device that seems sturdier. It's not like they can reconfigure my hardware and give me a sturdier power port and charging cable. This review will update as soon as my issues are resolved.Update: HP sent me a replacement charger after doing zero actual diagnostics and telling me that there was no problem with the tablet but there was a problem with the charger. HP customer service was friendly and helpful, slightly hard to understand, but the phone call took 40 mins just to get a new charger. It took about a week to receive my new charger after it sat at a the local Fedex distribution center for three days. That was annoying. When I finally received the charger and tried it out, it worked!...For about two weeks!!! I planned on just exchanging this product from Amazon but I'm passed the 30 day window so I guess Ill go through HP again and see if they can do something better this time. I WOULD NOT BUY THIS PRODUCT IF I WERE YOU. Maybe I got a lemon, but two chargers in two months? Thats ridiculous.", "Date": "May 17, 2014"}, {"Title": "A Good Tablet", "Author": "Gene", "ReviewID": "R258026YUXWI1G", "Overall": "5.0", "Content": "A good tablet and platform for running Windows 8. I had no problems with the setup, and the operation is straightforward.", "Date": "May 12, 2014"}, {"Title": "A good buy.", "Author": "Bruce Weidner", "ReviewID": "R13J7EUE3BVXIW", "Overall": "4.0", "Content": "This tablet works fine & is compatible with Windows software, which makes it very adaptable for me. (I have HP laptops, too) The graphics and speed of this tablet are also very good.", "Date": "May 2, 2014"}, {"Title": "Not too bad", "Author": "Stevie L", "ReviewID": "R2SQZCC1AFZ8OO", "Overall": "3.0", "Content": "First thing, I noticed the memory cover was not secured.  Took me a long time and I just couldn't get it to fit.  HP still uses the old fashion power adapter on this tablet.  Only mini USB & HDMI port available.  Back camera is OK but no flash.  I'm stuck with this unit because the software I used only have very few choices.It is pretty light weight and easy to carry.  It is pretty hard to read the screen out in bright sun especially the camera function.  Speed is very fast.  Stay cool even after a long period of usage.Another issue which is not related to HP.  I couldn't find the right profile case to work with this unit.  There are plenty of cases, but there isn't one made with a back camera hole.", "Date": "April 28, 2014"}, {"Title": "a mini computer", "Author": "Alicia Bacock", "ReviewID": "R15V98B3PMZCUN", "Overall": "5.0", "Content": "I had no problems with the Omini10. I think if I did not have prior use of Windows8 on a desk top, I would have been frustrated. But I found shortcuts after playing with the different screens. The only problem I had was it overheating and it needed replacing. I had better costumer service through Amazon than I did through Hp. After months of research and comparing different products including another laptop, I was lucky to purchase this on sale. If it still has a decent price, I will get another despite Hp services. A definite good buy if you want slim, easy to use and worth the cost.", "Date": "April 13, 2014"}, {"Title": "I love it/I hate it", "Author": "lj", "ReviewID": "R1O7LCGGWHX2JC", "Overall": "4.0", "Content": "The quick start guide that comes with it is about 2 x 4 inches and is almost useless.  The quick start guide tells you to connect the tablet to the charger and follow the prompts to start Windows.  This is very misleading because after you plug in and turn on the tablet, nothing happens -- nothing happens for hours.I wish I'd thought to search for an online manual before using the tablet.  Days later, I did look for one and found it.  I recommend downloading that _before_ starting.I had to stop part way through setting up windows.  When I came back it had completed on its own and I had no network connection.  I started tapping on things randomly, including going into the control panel, etc.  Since I knew nothing about Windows 8, I didn't even know how to find the control panel or the device manager. Finally, I held my finger down on the network icon in the taskbar and, from there, loaded the network manager which, all on its own, said my wi-fi card needed to be set up and did so.  Wow! (Apparently, holding your finger down on an item, as opposed to just tapping, is equivalent to a mouse right-click.)Luckily, I had set up a local account.  I did eventually set up a Windows Store account, but never use it.What I love about it is that I use my windows applications, including Firefox.  What I hate is Windows 8.  But it's great having a tablet that lets me work with the same applications I use on my desktop.I did have some trouble installing some legacy applications, but after purchasing and inserting an SD card and putting the apps on that, everything was fine.I'm also pleased that, despite knowing nothing about Windows 8 (I'm trying to learn fast) and, thus, messing things up on occasion, this tablet still soldiers on.  It did freeze up on me twice. I just held down the power button until it shut down.  It restarts just fine.I'd buy it again.  Great price.", "Date": "April 4, 2014"}, {"Title": "New Tablet for Use While Traveling", "Author": "Dennis", "ReviewID": "R1AG79CB9ZEKZQ", "Overall": "4.0", "Content": "Tablet seem to be working good.  I am having a little learning curve as this my first tablet and Windows 8.1 operating system.Would have given it 5*s but package had been opened and had a couple of finger prints.", "Date": "April 4, 2014"}, {"Title": "Impressed - but too many problems", "Author": "Randy R.", "ReviewID": "R19HZBNG568QCL", "Overall": "3.0", "Content": "Got this to replace an old laptop (XP) we use when traveling. Of course with this I will be able to get more use out of it while not traveling :-). I am giving it an early 5 stars due to its ease of use and value for the money. One thing none of the descriptions included was that it came with a 4g sd card already installed. Office 2013 Student version included at no cost was a big bonus too! I upgraded it with a 32gb card and now use the 4gb one for a spare on my camera. I will definitely update this after our upcoming trip.Update.... At first it was great, especially for travel, but I ended up having enough issues that I have decided to return it.1. Sometimes it does not want to go into charge mode. End unplugging/plugging back in or having to shutdown and restart before it will charge. The first time I just assumed it was charging until I found out the next morning it had not. Not sure if it is tablet or charger related, but as I said it has happened a couple times.2. System hangs that require powering fully down and back up, or cases where it would not let me log back in with an error saying resources were not available??? Nothing was running!!! Power down/up again.3. Touch sensitivity is not always working in outer edges, so it was either drag out my Bluetooth mouse or try a reboot.4. Screen randomly flickers.I had high hopes for this, and assume products will get better over time.", "Date": "March 25, 2014"}, {"Title": "Don't buy it!", "Author": "Lau Chun Kuen Perry", "ReviewID": "RH7VWRZRY9GLC", "Overall": "1.0", "Content": "Don't buy it! One day after non-charged slept then black screen, screen no responsive. Even complete shut down and power up, still black screen. Contact HP forum asking for help, just talking rebuild windows 8.1! WTH they don't full test their machine before pull to the market? I check HP forum and find out a lot of customers related to this problem and most of them HP tech no solution to them at all!", "Date": "April 8, 2014"}], "ProductInfo": {"Price": null, "Features": "Windows 8.1 OS\nIntel Atom Z3770 Processor\n32 GB Flash Memory, 2 GB RAM Memory\n8.5-hour battery life, 1.4 pounds\nMicrosoft Office Home & Student 2013", "Name": "HP Omni O10-5600US 10.1-Inch 32 GB Tablet (Graphite)", "ImgURL": "http://ecx.images-amazon.com/images/I/31Wsv9UMVvL._SX300_.jpg", "ProductID": "B00GSPW2QG"}}