{"Reviews": [{"Title": "Great device", "Author": "Honest Input", "ReviewID": "R3MW9AG6OIBKG5", "Overall": "5.0", "Content": "This is a great device comes with windows 8.1 and office student (word, excel, PPT, one note). After going through the standard initial turn on and sign in - I created my own problem with loading programs and encountering malware. I ran norton internet security then malware bytes. After removing the malware the device would not boot into windows. So I got to use the built in recover tools right away. This worked great and I was back up and running with all the previously installed apps removed. Lesson-learned- startup your antivirus tools first before loading your programs. I used Norton Internet security and malware bytes without any issues. Office activated without issues. I was concerned about other reviews and the small print for this device. It turns out that explorer and office programs allow you to magnify your screen area easily with touch and two fingers. So as far as productivity it works great. There are still some windows like in the control panel or in the office programs for selecting options that can't be magnified controlled by touch. I highly recommend a touch pen. It helps allot. I used a micro SD card 64gb by Sandisk microSDXC UHS-1 without issues. Upon ejecting it you will need your fingernails to remove it - was not difficult. Through the micro USB I used flash drives (only had 8gb on hand) and external drives (their own power) up to 1TB. A 3TB drive could not be recognized. My guess is 32bit windows vs 64bit. This interface also could not power a larger drive I had that relied on USB power. For what it is though, the problems were minor. The mate micro HDMI worked except it could not get into duplicate mode. I'll update this as I figure it out. One other issue was finding a micro HDMI connector to work. Two I bought from amazon (1 by monoprice and 1 by afunta-mall) worked intermittently. I thought it was the encore after that since the connection shows some play in it. My third try - bought two cables locally that worked great, no intermittent connection at all after moving it around. The $10 one by ONN from Walmart is what I kept. The other was $25, looked nice and was longer - but didn't need it in the end. Again minor issues, but I did have to have some knowledge of computers to work them out. Hopefully this feedback might help someone.", "Date": "January 30, 2014"}, {"Title": "another great toshiba product", "Author": "Erin", "ReviewID": "R2K63SNTEGQ105", "Overall": "4.0", "Content": "I have to admit, it took me awhile of fiddling with it to get it to turn on, and even then, I didn't know what I did to get it to turn on. After some research though, I figured out that the way to do it is by holding down the volume down button then the power button (right above the volume buttons) for 5 seconds. It works like a charm now. I'm so delighted that it comes with Microsoft Office, which is great for a student like myself. I can type out all my notes, look up pictures or examples of things we're talking about in class, buy and use an e-book to save money all while referencing things in class. That was my major reason for purchasing this tablet. The one thing I don't like is that I cannot hook up my external hard drive, so all my music and video files have to be transferred to a micro sd card, I believe; however, according to radio shack employees, there are no tablets, even ones with usb ports, that will allow the connection of an external hard drive. I'm glad I stuck with the 64gb for that reason. It'd be nice to have some video or music to watch or listen to between classes. I wish the speakers were dual sided, but the sound quality is still absolutely great. A stylus isn't the worst idea for this 8\" tablet, but I find it easy enough to use the encore without one.I keep my encore on the charger almost constantly, so I don't have information on the battery life. Overall, I'm really happy with my choice. The windows 8.1 operating system makes it familiar and east to use.Quick switching between apps is nice. All my programs work great with it. It's a great Windows tablet, and Toshiba is a solid, reliable company. This tablet is just more proof of that.NOTE: I did not buy this product from Amazon because they screwed up my order on 2 occasions, and lied about the product. Originally I paid for a 64gb, and it got lost in the mail. It was during Christmas time. The second time they sent me a 32gb one, even though the receipt said 64gb, and it took me days to realize it was the wrong one. Then amazon said they didn't sell the 64gb. I ended up having to wait for Toshiba to put the product on sale on their own website, so I could get it for what Amazon was charging for it. The whole ordeal left me without my Christmas present til some time near New Year's Eve. I don't blame Amazon for losing it, and I know it was Christmas, so it was crazy, but it was honestly a big ol' mess trying to get this product through Amazon. Obviously they have better prices though, and as long as it's not the holidays, things should be fine.Just make sure you get the 64gb encore if that's what you paid for. :)", "Date": "April 30, 2014"}, {"Title": "Sweet, sweet Windows 8.1 Tablet", "Author": "E. A. Summers \"Liz\"", "ReviewID": "R1IU82NZ0JWBVD", "Overall": "5.0", "Content": "I am an independent consultant, i.e. \"hired gun\" programmer of custom software.  I have Windows 8.1 on my work system and I have a Windows phone.  I loved my Kindle Fire, but this tablet put me in all Windows world and I LOVE it.I also bought the MS Wedge keyboard and the soft sculpt mouse for \"working\" at my kitchen table.  I'm comfortable with the tablet itself and find the onscreen keyboard works fine for short stints of typing but for anything more I really like the detached keyboard.In addition to being able to test development apps from a tablet, I had a thought to get me away from my desk for meals and to the kitchen...not working, cooking is a hobby and I have a number of cooking blogs I follow.  I work from a home office and was eating at my desk too often.  Sounds silly, but the change of location and machine is nice.I had a Nokia Lumina 2520 in my hands but it is RT AND it just felt too big.  I had a Kindle Fire and liked that size.  So this tablet replaces the KFire for reading, full Office 365 and my entire work environment and I can run my development apps.I guess I might give this 4 1/2 stars if I could.  The screen seems a bit less responsive than my phone (Lumina 928) BUT, I have the 928 on high and I'm wondering if it is a \"cold hands\" issue.I got the 64GB so that I can install Visual Studio and SQL Server.  I'm not sure that I will - being able to run the apps might be enough.  But the fact is I CAN for ER debugging on the go if I want that.I'm used to the Kindle app on my phone and this works the same.I love the Windows and Office sync between tablet and my laptop.And, oh...it is darn cute :) !!", "Date": "March 23, 2014"}, {"Title": "Great small tablet", "Author": "Larry P. Edwards", "ReviewID": "R13ZEBTM8KZ2PG", "Overall": "4.0", "Content": "Unit failed after 2 weeks. Returned for credit since company did not have any left.  Will order another unit when it is restocked.Lost one star for failing.", "Date": "January 31, 2014"}], "ProductInfo": {"Price": "$349.99", "Features": "memory\nhard drive", "Name": "Toshiba Encore Tablet 64 GB 8\" - WT8-A64", "ImgURL": "http://ecx.images-amazon.com/images/I/41fc7yQtmTL._SY300_.jpg", "ProductID": "B00G2IBJN6"}}