{"Reviews": [{"Title": "Apple has done it again!", "Author": "JNH", "ReviewID": "R1S1FRBCJZZ97Z", "Overall": "5.0", "Content": "Design:This new iPad is so thin and light it’s amazing. It comes in weighing a little over 1lb.I upgraded from the iPad 3 and you can defiantly feel the difference. When reading with the iPad 3, after a few minutes my arms would be tired of holding the iPad up. With the new iPad Air, that is not the case anymore. I can read for much longer now and my arms don't feel tired. The unit is also easier to hold (much thinner than previous versions of the iPad)It’s built of high quality aluminum just like every other iPad is and constructed to last.PerformanceThe new iPad air is fast! It has an A7 processor in it which is defiantly an upgrade from the previous iPads. The Wi-Fi is even quicker to connect and I notice I can achieve more of my potential in bandwidth speed using this iPad. The new front facing camera makes video chatting much better and the M7 chip makes editing and slow motion shooting fun and a breeze.StorageI upgraded from a 16 GB iPad 3 to a 128 GB iPad Air. Why you ask? Well because I do a lot of traveling for work and Apple is notorious for sneaking in extra stuff on your hard drive that takes up space. My iPad 3 came with only 13.8 GB useable space and after a month I had 3 or 4 GB of “other” storage that no one could figure out how to remove or clear.I mentioned earlier I travel a lot for work so I enjoy watching movies on the plane rides. With my old iPad I never had room for all my movies I had to use a wireless hard drive  (Seagate Wireless Built In Streaming STCK1000100Just to watch my movies. Now with this new 128 GB hard drive I can fit tons of movies on it and I no longer need the old wireless hard drive. (One less thing to lose on travel)Final thought:For people who have an older iPad (like I did) then this is a no brainer buy this new iPad you won’t be disappointed! It is much lighter than previous versions. Wayyy faster! And still sleek and built to last as every other iPad is. The new storage options give you the ability to carry more pictures, movies, books , games with you and the battery life is superb coming in at 10+hours. Overall I am happy with my purchase. It might be a little expensive, but if you buy smart you'll have this tablet for a long time with no problems.", "Date": "December 27, 2013"}, {"Title": "Bad crashing problems, NOT ENOUGH MEMORY Major Fiasco", "Author": "P. Krumpter", "ReviewID": "R1KNHC7CNC2UP2", "Overall": "2.0", "Content": "I bought the ipad air when it first came out. I am a multitasker, and I open multiple tabs in my browser. The browser crashed every 5-10 minutes, losing log in status and work.The apps crashed constantly. The ipad air rebooted to the springboard constantly.I went to the Apple store and recreated the crashes and reboots on every ipad air in the store. This was after the Apple employees denied ever seeing a problem on the ipad air.It turns out that the ipad air has the same amount of memory as a 3 year old android phone- 1GB.All the quality tablets that came out in the last quarter have 2-3 GB RAM, except the ipad air.Somehow, it is being covered up. By Apple. If you go in their forums, there are plenty of (new users) people reporting crashing problems. Then you have the level 6 and up users denying there is a problem. Many posts are being censored and deleted by Apple.The 64 bit processor needs more memory than a 32 bit CPU - so in effect, the ipad air has LESS memory than the ipad 4.Do yourself a favor and dont buy the ipad air. It is already obsolete. If you must have an ipad, buy the 4th generation one, or wait until the next one comes out. You have been warned.", "Date": "February 4, 2014"}, {"Title": "Great if you have the money for it", "Author": "ReG Masse \"Love to Read\"", "ReviewID": "R344K1L81PTEM0", "Overall": "4.0", "Content": "Compared to the older models, it is  much lighter, so that means easier to use throughout the day. The specs are about the same as the New Ipad (iPad 3) and iPad 4. I would definitely get an iPad Air over an iPad Mini, even with the Retina Display, as what made the Mini desirable was the smaller weight and size. The Air is really light, more manageable for someone who uses it continuously.All in all, if you can afford it, it is a great gift, to yourself or seomone else (you really like :)).", "Date": "November 27, 2013"}, {"Title": "iPad Review from an Android user!", "Author": "Jason Wang", "ReviewID": "R3MRBK7OU4EGHS", "Overall": "4.0", "Content": "I purchased as a long time android user because I needed something for textbooks and the 4:3 aspect ratio works a lot better for text books than 16:9 (I tired the Nexus 10 for a week as well)..Here is my review after  a week:The first thing I noticed was how light and compact it was, coming from the Nexus 10 I was surprised how easy it was to hold with one hand (although you still wouldn't for long periods of time) and how compact it was for a 10in tablet. The tablet is as fast as anything out right now, to be honest I don't play games but in terms of everyday use everything was fine...but at the same time every iPad that I've used before felt fast as well, I have heard of some issues with tablet optimization for iOS7 but I haven't encountered any. The screen is bright and sharp, text is really easy to read vs a higher PPI tablet (nexus 10) I really couldnt tell a difference with the extra pixels. The color on the iPad is very good once again this is to be expected as Apple always makes high quality devices.The only Cons I can't think of is the speaker placement and feel of the glass (as mentioned in other reviews). The iPad has \"stereo speakers\" which are located on the bottom, I really wish they would have put one on each side instead of both on one side. Watching youtube or netflix in landscape is kind of weird since all the side comes from the right side, kind of defeats the purpose of stereo speakers imo since I never watch fullscreen videos in portrait mode. The nexus 7and 10  have  really good desigsn for speakers that I wish Apple would've adopted.The other con is the feel of the screen, to be honest it feels a bit cheap...compared to previous iPads and the nexus devices the feel of the screen on the iPad air is the worst. It feels like plastic and it just doesnt feel solid when you push down. I'm sure this is a sacrifice that Apple had to make in order to reduce the weight to me the benefits of having a lighter, smaller device outweigh the feel of the screen (something that I'll eventually get used to).Other notes: I haven't used the camera, sorry but I never use the camera on a tablet to take pictures but from what I hear from reviews it takes pretty much what you would expect from a camera on a tablet. I probably wouldn't upgrade if I had an iPad 3 or iPad 4 unless your someone who has to have the newest tech or is absolutely miserable with the weight.If you do want to purchase it you can get it for 479.99 + Tax, go to Walmart's website or you can have any other retailer price match it.All in all this is an excellent tablet besides the minor gripes...the only Android tablet I can see competing with the iPad is the Nexus 10 v2 if it ever comes out...and while I preferred the Nexus 10 for media viewing, real stereo speakers and OS, reading textbooks felt a little cramped and since I'm using this tablet primarily for \"school\" the 4:3 factor fit my needs better.So there it is proof that you can be a fan of both Android and iOS :)", "Date": "November 13, 2013"}, {"Title": "Great Experience", "Author": "Dragember", "ReviewID": "R3RZ0F8IARVY1A", "Overall": "5.0", "Content": "My first tablet was a Nexus 7, and while I enjoyed it immenseilly I was ultimately disappointed in how slow it eventually got (speedy at Christmas, snail slow come April despite factory reset and other attempts to speed it up. Bought my brother a new nexus 7 that summer only to discover its speed was on par with the Nexus I currently owned. Very bizarre). I was skeptical whether or not I would enjoy a tablet experience, so the Nexus 7 was none the less a great first tablet. It could do anything any other tablet could without putting a dent in your pocket.I decided to get the iPad Air this season, specifically the wifi 32gb space gray version.Never owned an iPad before, so I can't really tell you how the models compare,However some things I note, the screen is rather large (duh) which does make typing with the onscreen keyboard difficult. However the screen real estate and quality is stunning, and if typing is a huge issue for you there is the iPad mini and other tablets. That's the trade off, and this is always a choice you have to make between 10 inch vs. 7inch tablets, no matter what brand you're looking at.The glass does feel rather thin, and I am concerned about its durability. I have read that the screen is durable however, and this perception is due to the lightening of the device causing the screen to sound thinner. Supposedly I will be able to confirm this with a case, as the addition of the case will give the tapping of the screen a deeper sound. Apparently it all comes down to acoustics - though a specification on glass thickness versus previous models would be nice.The design of the tablet is exquisite, definitely some top of the line material choices. The tablet has a VERY sturdy feel.Lots of free apps come with this tablet, which all work excellently and efficiently. There is no hesitation between tasks, and the speed is phenomenal.Overall I noticed the quality of apps and how they work on the operating system is MUCH better with apple than it was with android. However, the apple App Store isn't very easy to navigate. Google store is much more user friendly.No widgets, makes customizabibility limited.Multitasking is an ease with this tablet due to gestures. I love how well the gestures work. You can swipe between apps.Battery lasts insanely long, mine averages 12 hours of use.Hasn't overheated (vague warmth can be felt), even with gameplay.Sound from speakers at bottom of iPad sound full. Other tablets I've played with have a tin-metal quality sound emit from them, as though the speakers strain to emit a hearable noise.All iPad Airs, according to Apple's website, come with a complimentary one year limited warranty.Cool front AND back microphones work together to cancel out noise when using skype and FaceTime. Sounds very clear and crisp, I recommend you check out some videos on it.Overall I would say an A+ tablet. I mainly listed some concerns and observations, but that aside this thing is amazing! I love and, it from what I've heard of previous models, I'll hopefully be using this tablet for years to come (number one selling point for me is that apple devices function excellently passed a year).Update December 3, 2013:I've noticed a bizarre memory leak that occurs whenever I watch videos using Apple's video app (love them digital copies). I was testing the video streaming and after I noticed entire GBs were gone! After shutting down the app and fiddling around I realized that the iPad stores memory it buffers and keeps it hostage. However, after going back to the app and quickly loading the same movie and exiting before it begins to buffer the memory reappears. That being said, I wouldn't be surprised that if you watched movies completely through your memory would be restored each time. Still this is a rather large flaw on Apple's part, and I'm not sure if it occurs with any of the other video streaming apps. I'll be sending them a message to see if they're working on a patch for it.", "Date": "December 1, 2013"}, {"Title": "The best tablet just got better", "Author": "G. Ware Cornell Jr. \"anotherlawyer\"", "ReviewID": "R1M0P0IQSS4RK5", "Overall": "5.0", "Content": "When the first iPad was released in the spring of 2010, it was accompanied by a cacophony of jokes about its name and its size. Three and a half years later, the release of the iPad Air, the fifth full-size tablet Apple has offer, has been much calmer. This is the fourth full-size iPad I have owned, beginning with the AT&T; 3G model which was released in May, 2010, about a month after the first WiFi only iPads arrived. Every one of my iPads has had an AT&T; cellular data.Until this model I have purchased the largest capacity solid state drive Apple has offered. This year there is a 128GB iPad, which costs about $100 more than my 64GB model. Here is the reason I did not select the higher capacity-iCloud. Data stored on iCloud is instantly available across multiple IOS and OSX devices. With all that storage (I buy 50GBs annually) why duplicate it on a hard disk?The iPad Air is incredibly light(about a pound) and has a slightly smaller external footprint than previous models. The retina display actually seems sharper, if such a thing is possible. It also holds a charge for even longer than before.Beyond the physical beauty of the iPad Air is its amazing utility. As a trial lawyer I can easily access the firm's network. This means that  every file and every document is instantly at my command. In just a few years time I have learned that I no longer need to drag loads of paper files and depositions with me to court.Over 400,000 apps are built exclusively for iPad, and well over a million iPhone apps run on my device as well. It is an incredibly powerful platform, well on its way to replacing laptops for all but the most labor intensive tasks. When I travel, I typically bring only my iPad-no laptop, no hard copy of a file.  I didn't really appreciate just how dependent I had become on the iPad until this June when a federal judge held that  I could bring  either a laptop or a tablet into the courthouse. I chose the iPad.My weapon of choice-the iPad. This is the one tablet to buy if you are serious about using a tablet. It's pricy, but it may well be, the perfect tablet.", "Date": "November 2, 2013"}, {"Title": "Best full-sized tablet on the market", "Author": "R L", "ReviewID": "R211Y1YLSW1J97", "Overall": "5.0", "Content": "I almost bought a smaller screen tablet, but when I held the iPad Air, I couldn't believe how impossibly thin and light it feels. Plus, the rounded edges on the back make this really comfortable to hold for long periods.I'm glad I went with Apple, because the quality is unbeatable. For something I use everyday, like a tablet, it really is worth the investment. As powerful as a computer, but an absolute dream to use. The iPad Air now comes with the feature-rich word processor and spreadsheets apps, called Pages and Numbers. With included cloud-based collaborative features that can even be accessed from a PC.While there may be cheaper tablets on the market, you certainly get what you pay for. For something that you'll use everyday, from the sofa to the bed, to the coffee shop and your next flight, I would choose a quality companion. You can't do any better than this.", "Date": "November 27, 2013"}, {"Title": "Great tablet (Fanboy/tech jargon-free, short review)", "Author": "J. Kraft", "ReviewID": "R2J5HWWAKE9XUD", "Overall": "5.0", "Content": "I gave this as a gift to my wife this Christmas and she absolutely loves it. I have a Samsung Galaxy Note Tab 2 and right away I noticed the weight of the iPad Air. It felt like a feather compared to my tablet. The display is crisp and VERY sharp, I was amazed by that. The only thing she had an issue with compared to my tablet, was that the speakers on the iPad are placed at the bottom and not on the front facing you, like it is on the Galaxy Tab. We turned it up all the way and it definitely gets loud, so it's not like the speakers aren't good. It's a minor gripe for an overall great tablet experience. I would buy with full confidence if you are in the market for a new tablet.", "Date": "December 26, 2013"}, {"Title": "Excellent, but could be unbeatable", "Author": "JE Craig", "ReviewID": "R34PGIBEBQG7TV", "Overall": "4.0", "Content": "First of all, I have never owned an ipad before but I have used other's ipads and was impressed with them.  I also have a motorola xoom and it doesn't even come close to the ease of use and just generally aesthetics of this ipad.  Its probably best that I break it down into pros and cons to give the most accurate picture I can of what I have found since I bought myself, my wife and my son all the new ipad Airs.--The Good--The business apps I use are all exactly what I hoped for.  I use Chrome for browser and it looks incredible.  When tablets came out, this is what I imagined browsing the internet should look like on a tablet.  The form factor is great, and the Air is as light as advertised.  Despite other's claims of durability issues, I have found it to be quite durable even with my minimal case.  Movies in correct format play flawlessy and my music sounds great.  Paired with some good headphones, long plane trips become tolerable in the worst of seats.  Facetiming with family is a breeze and the 'cool' factor is definitely still present.--The Bad--There are also some cons which I think takes the Air down a half star to a star.  First off the 16GB model which I purchased for my wife from a big box store after I purchased my 64GB from Amazon is simply not enough memory.  I know thats a choice etc but for those that are purchasing for the first time, do NOT buy the 16 GB model unless you plan on mostly using for browsing the internet.  Apps + music + movies will fill up your 16 (actually less after what IOS takes up) gigs very quickly.Second, they should have put a little more RAM in.  The browser occaisonally crashes and there is definitely some latency on scrolling for more content intensive pages.Lastly a few random complaints; the screen also seems dimmer than the ipad with retina (last generation), there is no additional storage, and there seems to be a growing number of junk apps/games.--The Ugly--I will preface this with this: only power users are likely to encounter the ugly.Synching with Apple TV is not as easy as advertised.  Sometimes the air icon shows up, sometimes it doesn't.You can play MKV files but it is painful.  You need a third party player, then you have to transfer movies via http (drag and drop doesn't work), and you will not see where that space went, should you forget about things you've transferred via that method.If you have a home media server and use a PC, itunes + network drives + adding files to the ipad reminds me of the days of the 2400 baud modem.  You wait, and you wait, and you wait.  Anything you really want to transfer, transfer it from your network drive to your pc, then add to library, then transfer to ipad.--Overall--I still prefer this to my android pad or any other tablets I have encountered. The pros outweigh the cons if you have the money to spend considering how much more these are than comperable android tablets.", "Date": "December 30, 2013"}, {"Title": "Wifes Toy", "Author": "victor a. quaranta jr", "ReviewID": "RMRD11B7V8WY8", "Overall": "5.0", "Content": "My wife is very thrifty and seldom ask for anything. She wanted a I Pad and i purchased her a kindle Fire, wound up sending it back she was unhappy. Picked her up the I Pad Air. She absolutely loves  this thing . Had to spend a little more but all the apps she wanted down load and its a lot more user friendly. T.Q........", "Date": "December 18, 2013"}, {"Title": "Very happy with the purchase", "Author": "Xiaodong Cheng", "ReviewID": "R39R44Y8UD95AG", "Overall": "5.0", "Content": "It is a beautiful unit, with solid construction, gorgeous display, and of course very light and thin compared with older models. It is running very smoothly  when running games. The battery life is really impressive considering its size. After 5 hours of non stopping video streaming, the battery dropped from 100% to 60%! I am very happy with my purchase and have nothing to complain!", "Date": "November 6, 2013"}, {"Title": "Good but should have included the fingerprint features", "Author": "redrover", "ReviewID": "R1RBYETUIF6IS9", "Overall": "3.0", "Content": "UPDATE 11182013:A number of comments seem to take issue with my statement of \"not feeling like glass\" but that is JUST MY PERSONAL FEELING. Others about the brightness...indeed I do have it cranked all the way up but the brightness is nowhere as bright as what is found on the Samsung Note 10.1 2014 edition, nor the iPad4 and my most recent purchase the Samsung Note 8. All 3 when cranked all the way up are much brighter than the iPad Air.I will be buying the new Google nexus 7(even with all the GPS and multi-touch issues) for the upcoming holidays but even in the store, that too seems much brighter...I am very dismayed at this lack of brightness from the Air but it is still more than adequate for indoors. I have not tried it outdoors nor will I as this is not my \"outdoor\" tablet...lol.I like Apple and the tight integration of their apps and the reason many including myself continue to buy their products. I do feel the price for this latest iteration is them trying to make money at our expense. WHO HERE DOES NOT KNOW IN THEIR HEART THAT APPLE IS TRYING TO GET IN ON THE CHRISTMAS RUSH AND PUT THE AIR AND THE NEW MINI WITHOUT THE FINGERPRINT FEATURES FOUND ON THE NEW IPHONE...COME MARCH MAYBE APRIL, APPLE WILL UPDATE THE IPAD AIR TO INCLUDE THAT FEATURE.I will continue to buy Apple mostly because their store has apps that are better, with more choices and work extremely well with their devices. I think this product is a 3 1/2 Stars at best and mostly for the size and weight reduction that is very significant. I feel the \"glass\" is too thin but seems to be durable as I have really been typing a lot on it as well as playing several games that require a lot of tapping. I am very happy with the size reduction but feel the brightness is not up to par with other new tablets or the iPad4.Recently the Safari browser has been \"crashing\" a lot over the past week in that when you tap on a hyperlink, the browser will basically disappear off the screen. None of the tabs close but it just disappears and returns you to the home screens. I also am finding the browser will get stuck/freeze for several minutes before resuming. I have several calls in with apple support and they are looking into the issues.Other issues is the VIDEO app, if you play a video via streaming not downloading and leave it somewhere like the middle or so on, it actually reduces your available memory by the amount you have watched from what I can glean. IT IS LIKE DOWNLOADING THE MOVIE TO THE POINT YOU HAVE WATCHED IT TO EVEN THOUGH YOU SELECTED THE STREAMING LINK. If you do this with several movies, you can basically wipe out your free memory. I find it difficult to clear the buffer and have basically learned to tell the app not to display any movies then to display movies then play the movie but move the slider to the beginning and press stop playing then done. Of these many steps I eventually clear the buffer but I am not sure which of all these steps actually is what does it if any!Oh lastly, the WI-fi is fantastic.FINAL RATING IS 3 1/2 STARS...MAYBE 4 IF NOT FOR THE BRIGHTNESS ISSUE.First I own iPad 2 and 4 and Samsung Note 10.1 2014 edition.I like...not love...the new iPad Air as it is faster both in operating the software apps and graphic intensive apps. The apps continue to be fantastic for all the pads not just the Air.Apple did a great job on the weight but FEEL STRONGLY THAT THE NEW SCREEN IS NOT NEARLY AS BRIGHT AS MY iPad 4 NOR DOES IT EVEN FEEL LIKE GLASS.As I type this review on the Air, the \"cheap tapping\" feel of this glass leaves me wondering how durable this glass is. It feels thin and makes a tapping sound not found on the more solid glass on my other two iPads.Oh I am keeping the Air for the faster processors but feel Apple has put out a product whose screen will not be as durable as prior pads.I can see it flex when I push down on it with minimal effort and have some light distortion when I press down like old type LED TVS.Apple over prices their products because they can and really did so on this iteration of their iPad. In my estimation the glass feels like plastic and the brightness is much diminished when compared to my iPad 4 and so must have a higher profit margin with all these cost cutting that resulted in a new iPad that for all practically purposes is just faster but not as solidly built as prior pads.Time will tell on the screen and maybe this is the way all tablets are headed to achieve the weight reduction and thinness. I love the ability to hold the Air in one hand comfortably for much longer than any of my current tablets. I am OK to sacrifice the glass quality as long as the touch screen does not suffer or long term screen reliability.I wish Apple would splurge and include a 6 foot charging cord...OMG $600 for 32GB and the cord is so short still after all this time...lol.", "Date": "November 18, 2013"}, {"Title": "Very nice hardware for the price! Lightweight, a joy to use", "Author": "Gearhead Mania", "ReviewID": "R3K3EAML83WH3K", "Overall": "5.0", "Content": "I've been using Android products mainly, but I first delved into touch devices with the first generation iPod Touch so I am familiar with iOS to an extent. For the past few years I've used Android FroYo, Gingerbread, Ice Cream Sandwich, and now Jelly Bean. I also have a Kindle Fire HD. The iPad Air is my first iPad, and I chose to go with the iPad Air because it has a much higher resolution than the best Android Tablets, with a really slick dual-core CPU and quad-core GPU. The Samsung Galaxy Note 10.1 is a close second but is more expensive than the iPad Air which was on sale during a Black Thursday promotion. The Galaxy Tab 3 just doesn't even come close with the screen resolution.The iOS 7 interface is OK. I prefer Jelly Bean's interface. Although clean and simple, the iOS interface isn't intuitive. There are too many sub-menus interwoven in odd areas. To change language, I have to go into no less than 2 sub-menu layers. Siri is fine, but Google Now/Google Search was far more intelligent and effective. Siri's default US female voice is much more realistic and smoother, but Google Now's other voices along with IVONA rectify that situation fairly well.The battery life on the iPad Air is very good. After an hour or so, I'm still above 90%. The WiFi is fast, and the overall UI is smooth. The movie/graphics playback is super fast. I can watch Flash based movies/video within the Safari browser without any hiccups.Compared to my 7 inch Kindle Fire HD, I felt that the 9.7 inch (Air's display size) or 10 inch screen size is just right, but only because the iPad Air is extremely thin and lightweight. The 7 inch KFHD is large enough to be usable for reading magazines, but it is not a good use of space. I have to flick through 2 or 3 screens while the iPad Air will show the entire page (in a very legible font size) in one screen. The KFHD is also heavy, so hopefully the new KFHDX is thinner and lighter.I used to make fun of Apple for going with the Lightning connector, but after using it up close, I can understand why it is innovative. It is made out of a solid chunk of metal with contacts on both sides. There's no \"right\" way of plugging it in, unlike USB where I constantly flip it around trying to figure out which side is up. But I still feel micro-USB is the right way to go, due to its universal acceptance with devices. The included 12W power adapter can actually charge the iPad Air at up to 14W of power based on what I saw with my Kill-A-Watt.With respect to the hardware and design, the iPad Air is outstanding at this price point. Aside from the hardware, the bulk of the iPad Air and Apple experience centers around iTunes, iCloud, and other Apple software. This is an area where I feel Google far surpasses Apple. The Apple ID system is cumbersome and annoying to use. I had to login probably a dozen times during the registration process, and buying/installing free apps required me to enter my password each time. It didn't seem like all of Apple's programs were tightly integrated because I had to use my Apple ID each time I fired up the apps for the first time. Once everything was setup and installed, it seemed fine. That said, installing and running Google's apps on the iPad was significantly less painful. The first time I used my Google account for an app (I believe it was YouTube), all of the other Google Apps recognized me and started syncing. Google Now/Google Search also puts Siri to shame, albeit Siri seems more \"human\" with basic functions. For instance, asking about the weather, Siri actually told me (In Chinese and English) that the weather wasn't very good at 27F. Doing basic searches, Siri and Google Now are about equal, but Google Now seems more intelligent with some of the intermediate activities like unit conversions or advanced searches.I never liked iTunes in the past, and my opinion has not changed with ITunes 11. It is overly complex to use. With Google/Android, I can access Play with a browser and have new apps sent to my devices with the greatest of ease. Syncing calendar events, email, contacts, etc... is also far easier with just using a browser versus the iTunes program on my PC. The good news is that iTunes isn't too bad to use on the iPad. Running Zinio, Conde Naste magazine apps, and other apps was smooth and problem-free.For those that like to use their tablet for browsing or reading magazines, or watching videos, I'd highly recommend a 10 inch display (the Air is 9.7\" but falls in the range). My 7 inch Kindle Fire is fine to use, but it is frustrating to use for magazines due to the amount of panning that is needed. After using the iPad Air, my Samsung Galaxy S3 feels claustrophobic with its 4.9\" display.Overall: 5/5 stars, the iPad Air is a well-designed device with great hardware especially with the Black Thursday/Friday promotions. However, Apple has a lot of catching up to do with respect to its software designs. I very much prefer Google's ecosystem as it is more \"cloud-based\" than what Apple is trying to do. Google's ecosystem feels almost seamlessly integrated while Apple's ecosystem felt more separated.", "Date": "November 29, 2013"}, {"Title": "Superb", "Author": "kalip", "ReviewID": "RQPH5B045CWYY", "Overall": "5.0", "Content": "This is my second iPad, I purchased an iPad 4 around a year ago.This iPad air is all I thought it would be and much more; it's muchthinner and the 64-bit A7 processor makes it faster it is also quite narrower although the screen sizeremains the same 9.7 inches.The retina display is  stunning and the battery life is great. You just can't beat Apple for quality.The first thing I noticed when picking it up is the difference in weight, this iPad air feels almost halfthe weight of my iPad 4. I can easily hold it in my hands for long periods.Like one reviewer alluded to earlier..... and judging from the comments of some, it seems thatthe major gripe most folks have about the iPad  Air is the price.I am almost sure if the price of the iPad was dropped close to that of those lower quality and lower pricedSamsung or Google Nexus; these same folks would be singing the iPad's praises.I have hesitation in recommending this product.", "Date": "December 6, 2013"}, {"Title": "Not disappointed", "Author": "Jadaros", "ReviewID": "RJNCYTJZMUC2R", "Overall": "5.0", "Content": "I bought this because I wanted to download epubs from the jw.org website and it works great for that.  The publications download easily, after you download the free ibooks app.  Once downloaded, the publications have all the scripture links embedded, pictures, etc.  This makes jumping from publication to Bible unnecessary at meetings because the scripture references are all right there in the publication.  The books are located in your library as books, too. The iPad Air is easy to set up, easy to use, lightweight and the battery lasts a long time.I have two older Kindle Fires and downloading non-Kindle books was a pain.  I had to get help from my geek speaking son to convert the files, the scripture links weren't always there, they didn't appear as books, but as downloads without a cover picture, and the pictures inside were messed up.  I love the Kindle for reading Kindle books and watching movies, but the iPad Air is better for downloading and reading non-Kindle books.", "Date": "March 29, 2014"}, {"Title": "I love it and it is light!", "Author": "Dr. Oceanfront \"Oceanfront\"", "ReviewID": "R20QAYXRGADNIY", "Overall": "5.0", "Content": "First my background...I am an Apple user with a lot of Apple gadgets. I need to be on the computer for 7-12 hours a day.I already own a MacAir, which I love, but as light as it is, it still weighs about 3 pounds ( still, I highly recommend and love my MacAir!).Anyway, I also have an ipad 3 and an Ipad mini, iphone etc., you get the idea. The reason I am mentioning this, is because I have a bad back and that is the only reason I have been updating devices. I am trying to find the \"perfect\" computer for my use. If I can help even one other person out there in my situation ( and save them a ton of money I had to spend <g>), I will be happy! :)First let me tell you a little about the Ipad Air...IT ROCKS!!Although the speed on the Air is much faster then my Ipad 3, whether syncing with iTunes, browsing the web or just getting emails, the speed was not the reason I upgraded. I am not a game player or a number cruncher so the speed of the ipad 3 was just fine for me.What did get my attention was the weight! I had already bought the new ipad mini, which is super cool and a lot of fun.I actually intend to keep it. However, as good as it's screen is, I cannot see me using it 10 hours a day. If I had 20 year old eyes, it might have beat out my Air! ;-)The a Ipad 3 was about 1.7 pounds. That may not seem like a lot, but for me it could not be a one handed device. I needed to put a case on it, making it 2 pound device. Compared to the Ipad Air, which is about 1 pound, that was almost a 50% reduction in weight! The reason the reduction is so much, is I do not feel I need a case with the Air. I have covered it with clear coat all over and that is it. I do not seeing it slipping out of my hands. However, when I travel, I will use a 5 oz cover or just a Smart Cover (3.5 oz).I know it can be dangerous, not using a case, but I am extremely careful and i bought the special Apple warranty. Besides, isn't the reason we spend so much on these because they weigh so little and are aesthetically pleasing?It is too beautiful to cover up. So far, no regrets at all, but I need to find something to lean the Air against while lying down.If my review helped you, please click \"helpful\" below. Thanks :)", "Date": "January 8, 2014"}, {"Title": "love it", "Author": "M. Feldman", "ReviewID": "R3RJBL6E94L09V", "Overall": "5.0", "Content": "yes I love it.  I've had an iphone for years as has the rest of my family.  I have to admit I read all about the new Kindle Fire HDX 8.9 and I bought it two weeks ago. the specs were awesome for the price. the only thing is a lot of the things I needed were not compatible with it. then my granddaughter tried to facetime with me and of course I couldn't because  Kindle doesn't have facetime. I told we would both have to download Skype to teleconference with eachother and she said forget it. too much trouble.  then I'd have to buy new extra chargers/cables etc. just too much incompatibility. so I returned it and bought this and I'm thrilled and happy with it. if I wasn't used to Apple products I would have kept the the Kindle. just being honest as I don't want anyone to think that the Kindle wasn't good", "Date": "November 21, 2013"}, {"Title": "Disappointed first time apple customer", "Author": "Ginfx", "ReviewID": "R3PXX0AJCUBKMP", "Overall": "3.0", "Content": "I was excited to purchase my first apple product. This unit was purchased from another retailer as part of a bundle and offered flexible payments. I was looking at the Air laptop, but then heard iPad air was coming out.  Sadly it will be going back.  iPad air is thin, lightweight, perfect size screen.The color is super sharp.  Super fast typing and going from app to app,, when it wanted to work. Which meant I really couldn't tell you if they worked well or not.  I'd only had it for a day and the screen froze.  Could only go back to the home screen, then loose any work one might have done. Couldn't turn it off. Then, when I was getting ready to put it back in the box, amazingly it decided to work. The set-up wizard was super fast helping this technically challenged person set up and link  all her accounts.  I REALLY liked that it was a tablet and a small laptop as it came with an awesome keypad. So then I started downloading music and wanted to hear the small ball speaker that came in the bundle. The female plug in the air was not quite the right size. I couldn't get a snug fit, also tried with the ear buds and another speaker. And as I fidgeted with the plugs to get a secure connection to receive a signal, the song would stop playing and the volume on the screen kept going up and down. Is this supposed to happen???? As for the sound, I wasn't expecting much from such a thin tablet. The speakers were on the back side but I'm not sure if speakers could be placed in the front. But since the speaker plugs won't fit, what's the point? You'd need to buy some blue-tooth speakers to really hear better soundIt would be hard for me to compare the ipad air to other tablets as this would have been my first touch-screen device other than my android smart phone.I'd have to agree with previous reviews. I also feel this device was rushed on the market before X-mas. With the screen freezing and the plug being poorly made, is a good indication of frantically putting something together and getting it on the market for the holidays. I really hope that the next generation iPad air will be greatly improved as I really like apple products,and software, and was hoping this would be the first.Apple, I am disappointed. You can do a lot better. Quit cutting corners and please remember you have a reputation to protect.", "Date": "December 5, 2013"}, {"Title": "Love It - Even If I Don't Like Admitting My Spouse Was Right ...", "Author": "delicateflower152", "ReviewID": "R1DLRVVT9CG06G", "Overall": "5.0", "Content": "Because I love my Kindle Keyboard, I was firm in my resolve to upgrade to the Kindle Fire HDX 8.9\".  The need for both color for children's books and my own need for a white background to provide contrast when reading were my primary motivators.  The price and versatility of the Kindle were better than other options available.  I do not use my device as a media player, but that seemed to be a nice option.  However, my spouse insisted I look at the \"Apple iPad Air\" before I made any purchase.After looking at the Kindle Fire HDX 8.9\" and the \"Apple iPad Air\" side-by-side in the big electronics retailer, I had to admit it, he was right!  Clarity on both devices was excellent, particularly as I intended to use the item primarily as an e-reader.  However, the Kindle Fire HDX 8.9\" kept freezing up; the blue shirted employees said that was a frequent occurrence.  The \"Apple iPad Air\" connected easily to WiFi and navigation was smooth and seamless.  The ability to use many of the same programs I have installed on my PC is a plus.  Downloading books is quick and the \"Apple iPad Air\" does not bog down so that it seems painfully slow when I try to change from a book to the main menu page.  Using the \"Apple iPad Air\" is intuitive, even for those individuals - like me -who are not especially tech-savvy.  Based on recommendations and the fact that I would use the tablet when traveling, I purchased the \"Apple iPad Air\" 16 GB with the ability to connect to AT&T.;The principle downside of purchasing the \"Apple iPad Air\" is its initial cost.  Individuals who are debating between purchasing a Kindle Fire HDX 8.9\" and an \"Apple iPad Air\" should look at the two side-by-side; consider their primary uses and personal preferences; and evaluate the price difference in light of those factors.  While I don't like having to admit my spouse was right, I do love my \"Apple iPad Air\".  If it fits your needs, you may find the \"Apple iPad Air\" is a tablet you will love, too.", "Date": "January 16, 2014"}, {"Title": "Perfect iPad", "Author": "Mak", "ReviewID": "R1N47LPBW4W011", "Overall": "5.0", "Content": "Excellent iPad, much better than predecessors. Everything you could want (thin, light, retina display, A7 processor, better battery life). Highly recommend this iPad if you are looking to upgrade or get your first one.", "Date": "December 6, 2013"}, {"Title": "Nice, but some issues.", "Author": "Bobby Anderson", "ReviewID": "R1CLBFHLSBQIWC", "Overall": "4.0", "Content": "Love it overall.  Amazing product.  I have an ipad 4 and this in my house now.  The size and weight of this is terrific, though the comments about the brightness being less and the screen feeling a little cheaper rang true to me as well.I am also having the memory loss issue on the ipad air some have mentioned.  First, there is an ipad 4 in my household and it is also 16gb and, having passed it down to a family member, was very happy with it.  That said, the 16gb Ipad 4 has about 13.5 gb of usable space prior to loading anything, while the air somehow has 12.8.  Not really a big deal.  However, I have noticed my usable memory dropping dramatically (500 mb) on the air when doing streaming or using facetime.  I don't recall that happening on the ipad 4.  The memory does not recover afterwards, even after days and seems to continue to drop 100mb every other day even when I'm not using it.  It is not the apps or newspapers loading, as I pulled a lot of stuff off to check it.  I'm a light user of apps and don't store content, so 16gb was enough in my prior ipads, but on this one I'm getting worried. I was able to free the memory back up, but only after doing a full restore of the ipad as new and letting my cloud stuff stream back.  I really don't want to have to do full restores every few months.  For those interested, when connecting to itunes, it is the \"other\" category of memory that keeps expanding.  Tried calling Apple several times, but all they could offer was to do the restore.", "Date": "November 18, 2013"}, {"Title": "Why did I wait so long", "Author": "RUSH46", "ReviewID": "R3TO3MYT3N3189", "Overall": "5.0", "Content": "Bought this specifically to download and use some speech therapy applications for my wife who had a stroke.  The delivery was timely.  The applications are loaded and have been very useful.  All the other things we can do are a bonus.  We use the games after therapy in the morning.  And we can even check our e-mail.  We are getting along in age and were hesitant to spend the money on something so modern, but it really is not that difficult to use after a few days.", "Date": "May 19, 2014"}, {"Title": "The best tablet on the market when you consider the ecosystem and support. But not without some downfalls due to recent changes.", "Author": "Sean Cushman", "ReviewID": "RNGUUYGUJBQ80", "Overall": "4.0", "Content": "Alright so I know if you are reading this then you already have your mind set on a new iPad and hey you know what? That's great. I'm a dual user. I love my PC products and Android and I love my mobile Apple products as well. I don't take sides or at least only when it concerns the best bang for the money at least. I've been using iPad's since I bought my mother her first one at release (she is disabled and iPad's (or tablets in general) are wonderful tools for those less than capable of using a keyboard and mouse. I also fell in love with it , the design was just amazing , the feel was great and the capability was very impressive when you consider at that time tablet's were barely around at the consumer level. Seeing the look on her face made it worth every single penny. Prior to getting the iPad she suffered a horrible infection and was hospitalized for 4 months fighting it , nearly losing her life in the process. She lost the capability to stand and only has use of her left hand now (with about 80 percent capability) and couple that with MS and you get someone who can't really use a mouse and keyboard setup easily.I wanted to state that before what I'm sure I will be accused of being a critical troll about the latest iPad version compared to a recent Android tablet I bought.Now onto the experience thus far with this new iPad , here is a list of what I like :1. LIGHT. Seriously , incredibly light. I can hold it in one hand very comfortably and its not meant to be held in such a way for the regular Joe ( I got big hamhocks for hands). I love it when technology trims up as it shows that its forward march is continuing without pause.2. FAST. Even over the iPad 4th generation this lean machine is even faster at multitasking which is good because it will help versus the recent Android tablet I bought which is a multitasking god.3. THIN BEZEL. If there is one complaint I have for the consumer electronics of the world in general its that we haven't done enough to remove overly large bezels from products. I hate them. I find they are a waste of real estate but I also realize that this is part of the technical limitation and the need for space for various reasons (board hardware , batteries and so on). The iPad Air's bezel is at least half of all previous iPad's. Very much appreciated Apple.Those are the biggest reasons to buy an iPad Air and they are really good ones in my mind. If you already own an iPad 4th gen though I don't think they are enough to justify the upgrade unless you really want the reduced weight (the iPad 4th gen is a pound and half while the iPad Air is only a pound flat).Now to the cons. And there are some that are very concerning and especially so if you tend to treat your products poorly (many people do..) :1. THIN PIECE OF GLASS. So while I realize that Gorilla Glass 3 is very impressive and amazing tough for its extremely thin profile .. I also feel its wildly out of place with a product like the iPad. People who buy iPad's and especially families tend to treat them pretty rough. I've seen children as young as 4 drop a 3rd gen iPad like a brick onto hardwood and it remained intact without a mark to bare. This new iPad Air has a very thin piece of GG3 that helps reduce the weight (and I would imagine the cost of manufacturing for Apple) but its recently been shown in several Youtube videos that when it comes to endurance its actually pretty fragile. Its very easy to crack it and especially so if it lands on its side. So while all the previous generation iPad's had a nice thick piece of glass to help protect the product this new one .. does not. It also sounds hollow when you tap it. And for some that drives them crazy. I don't mind this as I know its glass and not plastic like some \"claim\".2.COST. Since Apple did so much to slim down the cost of this new iPad and they used the EXACT same guts as the iPhone 5 (with a different layout and power profile) and yet they also trimmed down the battery size then how come this isn't any cheaper? The iPad mini is supposedly Apple's response to critics about the fact that its always the same price in each iteration. Apple , Android has fantastic alternatives now and the Google Play marketplace is becoming quite a fleshed out competitor , its time to start taking Android more seriously as a competitor and stop living inside your own eco bubble.3.SUB PAR HARDWARE VERSUS PRICE. Even with a new 64-bit chip (which isn't supported very well but that will change) the iPad is quite a puny product in terms of hardware specs. NOW BEFORE YOU FREAK OUT.. I know that Apple has optimized it heavily and that living in a very closed ecosystem (versus Android) gives it this advantage HOWEVER.. for what you are paying for you should be getting more. 1GB of RAM for instance? That's what I expect in a mid to low end smartphone these days. I can imagine those who complain (and have for a while now) about the random crashes because of running of memory would really love an extra 1GB of RAM for the iPad. I would also imagine it would do wonders for those who love to open programs by the truckload and not have to worry about random crashing errors due to running out of memory.Could you imagine a quad core A7 chip with 2 GB's of RAM? That beast would sing and you could do even more with an iPad that powerful. I would bet that when Apple moves towards 4k resolution that we will be getting those exact specs to run at that monster resolution but still I would have loved that right now.So my remarks about a recent Android tablet purchase.. I bought a Samsung Galaxy Note Pro 12.2 and I just have to say its a real beast and outshines Apple's best in many ways. The resolution is higher (2500x1600) and it comes with the S-Pen and S-Pen software plus an office suite of apps. Now the Note Pro 12.2 is made for business applications the price of it versus 64GB iPad is about a hundred more. But for that hundred more you get massive hardware support , with an OTG USB cable you can connect external hard drives to it , you can also add memory through SDXC cards (up to 128GB's) and Samsung's Touch Wiz is getting quite mature and really offers a very set of apps. Not to mention the screen size of 12.2 inches versus 9.7. However the iPad beats it in terms of weight , the Galaxy Note Pro 12.2 has a massive battery (but it lasts about 11 hours with heavy use) and the weight puts it into a class that speaks more towards laptop replacement that competitor to the iPad. However you can buy the non-pro versus for $100 less (you won't get the S-Pen) and still a get a monster solution.Android's tablet app market is getting better and better each week and there are plenty of apps that support landscape mode without issue. One thing I always thought Android did better was application scaling , something Apple could learn from frankly. The Galaxy Note 3 Pro in my mind is a Android finally getting its ducks in a row and Apple is going to have pick the pace to keep with Android's MASSIVE market share which is over double what Apple's is now.THAT BEING SAID.. I'm keeping the iPad Air. I love the Galaxy Note Pro 12.2 and its just a great tablet but I don't really have need of its business level features. But if I were going to recommend a tablet for a business minded individual I would recommend they go for it because it blows the iPad away for business use. The free office app it comes with is more fleshed out than MS Office for the iPad and the extra screen real estate is a big bonus for anyone attempting real work on it. But for a guy like me the iPad has an easier to consume profile and that's what I really love about it.If you intend to buy this product however (the iPad Air) I HIGHLY recommend you buy the Apple care warranty. You will be extremely glad you did with this powerful but more fragile new version of the iPad.", "Date": "April 20, 2014"}, {"Title": "As a Laptop Replacement, No Real Downsides So Far", "Author": "Marc Kennedy", "ReviewID": "R135BX9BW5FCYG", "Overall": "5.0", "Content": "I'm a grad student and when my laptop went on the fritz, this was my replacement.Pros - The Apple App Store is easier to navigate and more trustworthy in my opinion than the Android app store.- like my iPhone, the interface is clean and much less cluttered than my Samsung tablet- the onscreen keyboard is very useable- there are a lot of available accessories, as should be expected- this seemed like less of a toy to me than a Kindle Fire- free iWork apps- so lightweight- great battery life- the screen is beautiful- I can download all my docs from DropboxCons- the external button to put it to sleep is small- it may just be the screen protector I purchased (Tech Armor clear), but the distance between the home button and the edge of the bezel is small and the screen protector will not seal there- no fingerprint scanner like the iPhone 5s- there is currently not a flawless PDF app for iPad, so using Adobe reader on my laptop was a better experience", "Date": "March 23, 2014"}, {"Title": "Ipad Air", "Author": "Sallyann Wagoner", "ReviewID": "R2QCORPE8PPSFZ", "Overall": "5.0", "Content": "I absolutely love this!!  I use it to replace my computer when I am just doing web searches and reading magazines.  I love all the apps it has available and I have even gotten my husband to use it too.  This replaces my original Ipad which I received for Valentine's day the first year the Ipad came out.  It still works great, but is slow and has no camera.  Buy this now!!!Sallyann", "Date": "January 20, 2014"}, {"Title": "Fantastic iPad air", "Author": "Tiffney Brink", "ReviewID": "R14ZBL4XU2RQKJ", "Overall": "5.0", "Content": "It was brand new right out of the factory package. It has an amazing battery life and a beautiful display.", "Date": "January 20, 2014"}, {"Title": "Much better than my iPad 1.", "Author": "Herb Lippe \"Indi\"", "ReviewID": "R3KVEPIVAK1A9", "Overall": "4.0", "Content": "I bought this to replace my iPad Generation 1.  Much faster, clearer, LIGHTER, and more powerful.I think I made one mistake that has caused a minor problem with Safari. Instead of setting everything up from scratch, I downloaded everything from my the Cloud Storage for my iPhone 5S. The problem is I can get TABS in Safari.  I bypassed this by using the Mercury Browser and, as soon as the Christmas panic dies down, I'll bring it in to an Apple store and see what I did wrong.Definitely worth the upgrade.", "Date": "December 27, 2013"}, {"Title": "Lives up to the hype", "Author": "S. Harrison \"LovePinkCJ\"", "ReviewID": "R3OMLOHS67H7YF", "Overall": "5.0", "Content": "I've been true to Apple for many years but recently took the plunge and went to Samsung for my smartphone.  I almost got the Samsung tablet but just couldn't bring myself to it.  If you love Apple...  you'll love the newer, leaner, and cleaner design and OS. If you're technologically advanced...  I'm sure you'll find the flaws but you'll still enjoy the iPad Air.", "Date": "December 21, 2013"}, {"Title": "Awesome", "Author": "Helena R McMaster", "ReviewID": "R2QNSUH3ZH2LAQ", "Overall": "5.0", "Content": "This is my first iPad.  So I can't compare to any of the others.  It looks great feels great, and most importantly it works great and once you get the easy setup process done it operates great and very easy to use.  I did feel the need to purchase a case because it is very thin and light weight.  I purchased the survivor case.  Great for this case, makes the weight heavier but protects if dropped.", "Date": "December 14, 2013"}, {"Title": "iPad air crashes ! ! !", "Author": "Hank", "ReviewID": "RVAGWCG6KOG1P", "Overall": "3.0", "Content": "It's a nice tablet. Fairly fast. I got the AT&T; model and internet connections are fast. However, the darn thing crashes frequently !Very aggravating.", "Date": "February 17, 2014"}, {"Title": "The fastest and thinnest tablet around", "Author": "inspector gadget 007", "ReviewID": "R2OB5FIBY7GFDJ", "Overall": "5.0", "Content": "A anniversary gift for my wife and she loves it. The 32 GB was the right size as she takes lots of pictures,  downloads aps and watches movies and the video quality is excellent. I'm glad I went with the iPad Air as it works great with her iPhone. So far its worked flawlessly.", "Date": "December 25, 2013"}, {"Title": "Great Christmas Gift", "Author": "danny", "ReviewID": "RM4AEM9CLPYEV", "Overall": "5.0", "Content": "This iPad is so beautiful. It's unbelievably light, and thin for a full size tablet. This iPad  also extremely fast and made me finally realize just how slow my iPhone is.  The screen on this thing is also sharp and beautiful. The only bad thing about this product is that the screen attracts a lot of fingerprints, but a screen protector can easily fix that.", "Date": "December 25, 2013"}, {"Title": "Daughter's Christmas & Birthday Present +", "Author": "C. Martin", "ReviewID": "R3KMC3ACXK9QJ8", "Overall": "5.0", "Content": "1st off - better prices are available now (figures!) @ other stores. That being said, my daughter loves it! She and my son-in-law love the Retina display, the overall speed and capability of the Air. She uses it both @ home and work. I'm writing this on a Windows PC and I'm already saving up so that when this dies I can move on up to Apple!When I plugged her Air into my wall for the initial charge (12 hrs. one time only), it immediately recognized my Wifi net as well as those of my closest neighbors! If you use a Windows PC then you know the hoops you go thru sometimes to establish and connect to your own net! This Air handles the data processing my \"kids\" need at work in the airline industry without any difficulty at all and whisks through various cloud (Google or Apple) services.", "Date": "December 21, 2013"}, {"Title": "A new Air in my life", "Author": "Francisco Jose Garcia Galicia", "ReviewID": "R3OGJZ6A6IKXKE", "Overall": "5.0", "Content": "I am an old guy (54) who has have a lot of trouble trying to adapt my self to this world full of technology. I am suffering early Parkinson since 14 years ago. But with the new iPad air, everything is easier.", "Date": "December 17, 2013"}, {"Title": "Very happy!", "Author": "Iva Hardisty", "ReviewID": "RYES28LQLNSGR", "Overall": "5.0", "Content": "I love the iPad air! So light and easy to use. I have played with other iPad but this is the first one I have owned and I love it! Also a great price! 15 dollars cheaper than if I had ordered from Apple it's self! 15 dollars might not be much but it was enough to also get me a case! Over all very pleased! It also came a day early which  was great I was so excited when I got it.", "Date": "December 15, 2013"}, {"Title": "Seems to me to be the best tablet out there (but you've got to be willing to pay a premium for it)", "Author": "Kenneth Cooper", "ReviewID": "R3HOQ64T6OMR9F", "Overall": "5.0", "Content": "Some of these reviews from people who have supposedly purchased or used this device are a bit bogus (comments that don't match with the reality that actual device owners are experiencing).  Let's hope that those who are coming here for 'guidance' are also reading professional reviews from trusted media sources .. and .. talking to actual users of the product.My review: After trying several of the latest high resolution tablets on the market I returned all but one, the iPad Air. I can't find a thing about it to complain about (except the price). It's just outstanding in every way (display, size, weight, available apps, and operating system). It also addressed certain niggling complaints I had with my earlier iPads. With regard to other devices I tried, the latest Kindle Fires were excellent (great displays - and the price was right) but not sufficiently versatile to meet all my needs. The LG 8.3 was another excellent Android tablet but it didn't seem like a truly finished product (couldn't, for instance, lock it in landscape mode - very frustrating when trying to use it while lying in bed). It also seemed a bit pricy for what it was at nearly the price of an iPad Mini Retina (a tablet I was seriously considering for its portability). For what it's worth, the only tablets I tried, or even wanted to try, were those with very high pixel density displays. Later I also ruled out the true 7 inch devices with their 22 square inch displays (the iPad Mini's is 30 square inches, the LG 8.3's is 31, while the iPad Air's is 45). In other words, most of what else was out there had screens that were either too small or displays that were not sufficiently retina like.", "Date": "November 24, 2013"}, {"Title": "Receive a used one when pay for new", "Author": "Tommy Le", "ReviewID": "RNMMX58FSREJA", "Overall": "2.0", "Content": "Bought iPad air 128GB. Needed in a hurry so pay for one day shipping. I do a lot of online trading s I need something fast n reliable. My iPad 3rd generation seem to required charging all the time and loading seem to slow down.love the new iPad air. Fast ,sleek, love every thing about it. After set up and download and update all my apps I start using the search engine and look at the history that's when I realize that this iPad has been used. The history list was long. I'll be contacting amazon today to return this and get a new one. Good luck to all.", "Date": "February 19, 2014"}, {"Title": "Decent tablet, but expensive and takes away all user control.", "Author": "Serge", "ReviewID": "ROZMH0V6Y2OOR", "Overall": "3.0", "Content": "The hardware part is quite good, but connexion to external storage devices is only possible with a $30 add-on from Apple, and then only supports image files and completely ignores images taken with mobile phones other than Apple's.", "Date": "January 14, 2014"}, {"Title": "Nice product", "Author": "Alan Prouty", "ReviewID": "R32BP7047YJ23N", "Overall": "5.0", "Content": "This is just modern technology at it's best.  When the first iPad came out a few years ago, I scoffed.  \"Who would buy one of these things?  They're useless!\"  Bot, was I wrong.  It took a while but we finally decided to take the leap.  My wife's laptop died and I thought this would be a good replacement for her since she mostly consumes data (YouTube, Skype, Facebook, etc.) rather than inputting data (e-mail,word processing, spreadsheets, etc.).  It's a nice addition.  Also purchased the wireless keyboard to go along with it for longer e-mails and stuff like that.  It's easy to setup and has long battery life.  Kindle installed so all books go with it.", "Date": "December 28, 2013"}, {"Title": "Love it", "Author": "J. Nguyen", "ReviewID": "R14KF5GAH6YAJJ", "Overall": "5.0", "Content": "Bought six of them after using one to give to my nieces and nephews. The best iPad to date. We stop using laptops now.", "Date": "December 15, 2013"}, {"Title": "Great iPad.. Step up from other older versions", "Author": "bigbeezy209", "ReviewID": "R2E69RJV1RXYHP", "Overall": "5.0", "Content": "Love this iPad air.. It's so light & sleek that it's not a burden to carry around everywhere you want to go... Screen looks beautiful and build quality is just like every apple product.. A+", "Date": "March 18, 2014"}, {"Title": "excellent", "Author": "arthur", "ReviewID": "RRTKCTTR95PTK", "Overall": "2.0", "Content": "i like it and hope word could be used when I open the apple ipad air.in fact ,I can not find the difference between ipad 4 and ipad air", "Date": "March 18, 2014"}, {"Title": "had to buy charger", "Author": "robert bennett", "ReviewID": "RBLALTKNUFLOU", "Overall": "4.0", "Content": "Ipad is great! Charger was not. Would've given 5 stars but charger had short in it had to buy new charger.", "Date": "March 17, 2014"}, {"Title": "ipad mypad!", "Author": "Rita Runyon", "ReviewID": "R2OZSMS2AY9QU9", "Overall": "5.0", "Content": "I love it… I just haven't figured out how to use it… I can't get to the Apple store at the mall, for help, they do not have electric carts and I can't get inside without assistance. I have been using it to do some reading online and it's great! I sold a cherished antique to buy this and I'm so glad I did! I'll get this figured out.", "Date": "March 8, 2014"}, {"Title": "First tablet...it is awesome", "Author": "Sonya B Dean \"webrose\"", "ReviewID": "R37EBVPXPZC5I1", "Overall": "5.0", "Content": "this is my first tablet so take that info into consideration...I have an iphone 4 so was able to sync all my apps and contacts and everything else including music very easily.", "Date": "March 8, 2014"}, {"Title": "Tablet decision", "Author": "Kathy Bridges", "ReviewID": "R10NM0VW1A1TF2", "Overall": "5.0", "Content": "I debated which tablet to get for over a year, sitting on the fence, afraid to make a move. Finally, I decided that since I had an I-phone, this was probably the easiest move for me. I am so pleased, was up and going in about 5 minutes. Donating my nook to the 2 year old granddaughter today.", "Date": "March 8, 2014"}, {"Title": "The  best on the market", "Author": "Kathleen D.", "ReviewID": "R1DR1EZ8NHQO2J", "Overall": "5.0", "Content": "I really like my I pad it takes beautiful pictures. Plus we took it to the ice rink where my 5 and 7 year old granddaughters takeskating lessons. we took video's of them and they loved watching them. over and over.", "Date": "March 6, 2014"}, {"Title": "IPAD AIR", "Author": "Bishnu D Piya", "ReviewID": "R3GVHH63R8Z7R4", "Overall": "4.0", "Content": "awesome device much lighter and smaller thann the regular ipad's.Easy to handle. Much faster in processing than the old ipad's", "Date": "March 6, 2014"}, {"Title": "I-pad air 32 GB", "Author": "J. morford", "ReviewID": "R28Y58SFLRMTQB", "Overall": "5.0", "Content": "I love my new I-pad air!!!  Faster, lighter and perfect in every way!!!  love it!I would highly recommend. It!!", "Date": "March 6, 2014"}, {"Title": "in love", "Author": "Justin & Sarah P. \"Creature... For a while.\"", "ReviewID": "R90TN1B948FSF", "Overall": "5.0", "Content": "of course I am in love!  Came a day earlier than expected...it was like Christmas morning for me!  iPad is the way to go!", "Date": "March 6, 2014"}, {"Title": "Everything I thought it would be", "Author": "Don DiFiore", "ReviewID": "R32B3191K976UN", "Overall": "5.0", "Content": "All apps synced perfect. All my Apple products work exactly as advertised, across the board through the cloud.  Worth the money difference if you use Apple products.", "Date": "March 6, 2014"}, {"Title": "Apple delivers", "Author": "Hershey Ogden", "ReviewID": "RPG0HN6WAQMIR", "Overall": "5.0", "Content": "The iPad has never had any problems, does what it is supposed to and continues to build on the features of iPads past.", "Date": "March 5, 2014"}, {"Title": "None Better", "Author": "Cherie J. Hepburn", "ReviewID": "RHUJYE0HQ6W7F", "Overall": "5.0", "Content": "I haven't actually received this one as yet but I've had three since the iPad came out and they are the best.  I tried the MS Surface and it's very good I have to say that but it's really heavy to lug around.  So it ends up sitting on my desk and not doing what I purchased it to do, move around with me or attending meetings at Starbucks.  Back to the ole scratch pad which just doesn't work for me.  Expensive lesson for sure.", "Date": "February 28, 2014"}, {"Title": "Great device. Huge improvement from iPad 4.", "Author": "PSB", "ReviewID": "R1MVH9WDWCZH6C", "Overall": "5.0", "Content": "The iPad Air is much lighter than the iPad 4 before it, in fact it’s lighter than all other tablets in its class at just 469g. That’s a drop of almost 200g, or 29%, on the porky iPad 4. That's a huge generational leap.It’s the first thing you’ll notice when picking it up and it really makes a big difference when using the iPad Air for long periods of time. It’s perfectly balanced. You can hold it to read or watch a movie for hours simply by cupping a corner in your palm. Attempt the same with an iPad 4 and you’ll quickly succumb to shaky arm fatigue.On paper the iPad Air’s Retina screen is the same as the one on the iPad 4. It has a 2,048 x 1,536 IPS panel offering 264 PPI (pixels per inch) with scratch-proof and oleophobic protective glass that's resistant, though not impervious, to greasy fingerprints.ProsVery lightRobust and premium designExcellent screenSolid battery lifeConsummate all-rounderConsStorage comes at a premiumNo Touch ID", "Date": "February 27, 2014"}, {"Title": "Great step up", "Author": "Courtney", "ReviewID": "RKV5RTR74QE0B", "Overall": "5.0", "Content": "I upgraded to the iPad Air from the iPad 1 and am very happy.  Very fast, great resolution, and easy to use.", "Date": "February 24, 2014"}, {"Title": "would be five", "Author": "Christina", "ReviewID": "R102X9SL24TEDW", "Overall": "4.0", "Content": "Apple doesn't have a Swype app that works with all applications. If you have any android apps with Swype, then hen pecking will drive you nuts. Unless of course you want to add more money and buy a key board. too bad apple doesn't get with the program  here. people need to be efficient.", "Date": "February 20, 2014"}, {"Title": "The Ipad Air is Good My packaging was BAD", "Author": "Christopher Ralph", "ReviewID": "R2U030Z2K3HBBC", "Overall": "3.0", "Content": "I give this 3 stars because of my packaging. I did not get the Lightning to USB Cable, instead i received the 30-pin. My Ipadair", "Date": "February 13, 2014"}, {"Title": "Lighter, smaller, faster and Retina, what's not to like", "Author": "Ed \"edshull\"", "ReviewID": "ROGIZUDXPCSVG", "Overall": "5.0", "Content": "Purchased to replace a 3rd gen, so obviously a massive improvement. Beautiful screen, nice and compact and very fast. Overall awesome.", "Date": "February 9, 2014"}, {"Title": "Love It!", "Author": "manik sikka", "ReviewID": "RME5DXDZ0KUU1", "Overall": "5.0", "Content": "I liked my new iPad Air,,,It's Fast, Thin, Longer Battery and it's Awesome. Would recommend to all Who wants to buy an iPad...", "Date": "February 7, 2014"}, {"Title": "My review", "Author": "George J. Sliney", "ReviewID": "RPUV5MPD8YYEL", "Overall": "4.0", "Content": "My wife likes it.  Seems like a good tablet.  Not sure I would buy an iPad again though.  That's all.", "Date": "January 29, 2014"}, {"Title": "it was a hit", "Author": "william murray", "ReviewID": "R2JA44776GQE3R", "Overall": "4.0", "Content": "The family loves the christmas gift .It works great.Its attractive ,light weight.Have not had cause to use my protection plan.But i bought it on amazon so i am sure its ok", "Date": "January 27, 2014"}, {"Title": "Very good!", "Author": "Robert", "ReviewID": "R2WEFFHJO218O0", "Overall": "4.0", "Content": "Great overall, super light w/ awesome display! Although the battery could be just a bit better. Still a great buy!", "Date": "January 24, 2014"}, {"Title": "This thing is amazing", "Author": "Claytonss", "ReviewID": "R1V4EI0ADNYXD2", "Overall": "5.0", "Content": "I got the iPad air today and its amazing I had a kindle fire and the iPad air is 50 times better apple has done it again.", "Date": "January 22, 2014"}, {"Title": "Easy to use!", "Author": "Teresa", "ReviewID": "RWPH3WR5X641P", "Overall": "5.0", "Content": "I am not a very tech savvy person, but this ipad air came highly recommended by a person that is. I asked this person what they thought about other tablets, such as Surface, or Android, which were a little less expensive, but he said this would be the easiest for me to \"figure out\"---and it has been. I mostly use it to google things, any where from educational to gossip tv shows and can find everything easily. Not only does it have \"Siri\", you dont even have to type to enter a post on facebook. You just use the microphone thats easily seen, and speak what ever you would normally type. I no im only at the tip of the iceberg with what it can do, but i learn new things everytime i pick it up. Not being able to sit at a computer for very long, Im able to take the ipad to bed with me & look up things easily while resting in bed. I no several people that have them and they all LOVE them---i now see why.", "Date": "January 21, 2014"}, {"Title": "Amazing!", "Author": "killercolors", "ReviewID": "R28S5QDODBOAFL", "Overall": "5.0", "Content": "Let me start out by saying that I am an android user that only recently decided to give apple a try. The only iPad I owned was the 1st generation iPad. Now, that alone wasn't enough to make me change from my android devices, but recently I decided (after seeing how thin this new one was) that I'd give apple another go. -- HOLY COW!!! Where has this tablet been all my life?The Apple iPad air is amazingly light weight, thin, beautiful and crazy fast! This just left my samsung galaxy in the dust with little to no effort involved. Now while I did not get the iPad air from amazon I bought it on eBay, still sealed in the box, brand new, for only $475. That alone was a steal in comparison to buying it on here or anywhere else. I also purchased an iPad air case from walmart so I didn't end up spending over $14 for the case.With that said, if you have a 1st or 2nd gen or are even just now thinking of getting on the apple bandwagon as I have, this is the one to do it with!", "Date": "January 20, 2014"}, {"Title": "Quick & painless", "Author": "kathleen miley", "ReviewID": "R3LMDZ34HOX8XP", "Overall": "5.0", "Content": "Arrived quickly and is a great product! A gift for Christmas for my son,  It's definetly being enjoyed - may. Have to get another.", "Date": "January 20, 2014"}, {"Title": "super", "Author": "Frank Hendrikx", "ReviewID": "R3PRHYSPLT3ODL", "Overall": "4.0", "Content": "quick, smooth, simple really a fantastic machine. only the battery is quite quicke emtpy, thats a pitty. for the rest fantastic", "Date": "January 19, 2014"}, {"Title": "Just what it's supposed to be", "Author": "mikeyyyownz", "ReviewID": "R29YQ94YM16KPM", "Overall": "5.0", "Content": "I bought this for my wife for Christmas. We have Verizon and I wanted an Ipad for her that was 4g, as well as to upgrade her from the  Ipad 2 she already had. The price was more than going through Verizon, but I needed it quick for Christmas, and I had Amazon gift cards so it came out cheaper for me in my situation.Anyways, I'm not going to go into detail about the Ipad Air. There are countless reviews online. I'm just writing this in case anyone is hesitant to purchase from this specific seller. I got the item quickly and didn't have any problems. The wife was able to connect it to our Verizon account and she uses it all the time.", "Date": "January 19, 2014"}, {"Title": "Good product.", "Author": "Foothill Ranch 14", "ReviewID": "R14KHENAP2N3UU", "Overall": "4.0", "Content": "Good product but not as mobile as I thought. I prefer my kindle to read but this to watch prime or Netflix on. Sometimes I feel like I have to use it to get my money's worth. But it's good for my family and I.", "Date": "January 18, 2014"}, {"Title": "A great product", "Author": "John R. Sitzman", "ReviewID": "R3GFOB7XNDFQQ1", "Overall": "5.0", "Content": "Actually light as air and very functional. The first Apple product I have owned but I will definitely buy more in the future.", "Date": "January 18, 2014"}, {"Title": "Excellent!", "Author": "fabian", "ReviewID": "R1POO9PM2B6MFH", "Overall": "5.0", "Content": "I had the samsung galaxy player and now I have just bought this product and I'm totally in love of this, it's fast, beautiful, elegant, lighty, if u can buy it!!!", "Date": "May 31, 2014"}, {"Title": "Great technology", "Author": "Dean L.", "ReviewID": "RSRUFSVUOOSIA", "Overall": "5.0", "Content": "Easy to use as is most Apple products.  Screen looks like my Apple desktop.  Sometimes a little hard to listen to radio broadcasts.", "Date": "May 30, 2014"}, {"Title": "I love my Ipad", "Author": "David \"David\"", "ReviewID": "RI1EW93KEAPD", "Overall": "5.0", "Content": "I wanted a ipad for years and finally bought one. I wish I would have got one sooner. I have been having a blast using it in work and play.", "Date": "May 30, 2014"}, {"Title": "Apple rules!!", "Author": "BigDInTexas", "ReviewID": "RMI5I4XT13GXH", "Overall": "5.0", "Content": "Bought this iPad Air for my wife for her birthday.  Replaced her 1st generation iPad.  The new iPad is fast, has a beautiful display, is very responsive, and oh yeah, did I mention it's FAST!!!  I could not have made a better purchase.  Oh BTW, we still use the 1st generation iPad as well.  Still alive and kicking.  Let's hope Apple supports the new iPad for a few more years.  Highly recommended.", "Date": "May 29, 2014"}, {"Title": "It is easy to use.", "Author": "JUNGAO", "ReviewID": "R320AE6M64IE0X", "Overall": "5.0", "Content": "This is the first ipad I have ever brought. It is very fast and light. I like it very much.", "Date": "May 29, 2014"}, {"Title": "Premium Product", "Author": "Jimmy", "ReviewID": "R1MS58LGUDLPHC", "Overall": "5.0", "Content": "There are thousands of reviews on this product and why arguably the best tablet on the market in 2014, so I'll keep my review to some of the less obvious points I noticed.First, I found the length of the lightning cable a little short, so I can't really move it freely around my desk or on my bed if an outlet is more like two feet away. The total length of the lightning cable is approximately 3.25 feet. Being used to longer cables, I've accidentally yanked this thing a few times but that hasn't done anything to my iPad Air... yet. However, you can probably purchase a longer lightning cable online.Also, I found the rate that the iPad downloads apps is about 5x slower than even an iPhone 4. Apple support told me this is usually because newer devices have a lot more to do like connecting to iCloud for the first time, etc, but I don't buy it. I think it's just because iPad apps are a lot larger than iPhone so I don't expect this to change, but I'll update if it gets any faster. UPDATE: Yes, my iPad does download at fast speeds now after one day, so don't worry if you encounter the same issue at first!While these two points are on the negative side, keep in mind that my overall experience is easily still 5 stars. I would definitely recommend this if you are in the market for a tablet.", "Date": "May 29, 2014"}, {"Title": "Hoping for happier Days.", "Author": "Brown", "ReviewID": "R2RONGLY7GAXM6", "Overall": "3.0", "Content": "It looks just as pictured. But for some reason the screen shuts off without warning or reason. I will have to trek to the Apple Store find out why this happens.(I was trying to avoid the hustle and bustle of going in the Apple Store that's I made the online purchase in the first place. )", "Date": "May 28, 2014"}, {"Title": "Love it!", "Author": "Peggy W. Yarnall", "ReviewID": "R2CVLOK71CSBAO", "Overall": "5.0", "Content": "I love this ipad air.  It is lightweight and user friendly.  It is everything I expected and more.  I would highly recommend it.", "Date": "May 27, 2014"}, {"Title": "2nd one", "Author": "T. E. Harris-Moyer \"mstiff\"", "ReviewID": "R1ASO9EN2ESR7T", "Overall": "5.0", "Content": "Love love love this IPad. So much I bought one for my husband. Great picture and so easy to use.", "Date": "May 27, 2014"}, {"Title": "Exact as I expect", "Author": "Gustavo F Smorigo", "ReviewID": "R22WEJ4A05VNV5", "Overall": "5.0", "Content": "The new Ipad is very light and thin. The screen is magnifc and very quick. I have a Ipad3 and the new ipad performance is amazing.", "Date": "May 26, 2014"}, {"Title": "Love it", "Author": "CB", "ReviewID": "R26XX0MX1GF0F7", "Overall": "5.0", "Content": "Love it,feels heaver then 1 lb with the otter box I put on it , so I can't hold it that long,but all in all best apple device I have ever owned.", "Date": "May 20, 2014"}, {"Title": "Gift for my daughter", "Author": "Liv Torkildsen", "ReviewID": "RBHOHOHI04B4H", "Overall": "5.0", "Content": "I am taking it with me to Europe, so she will set it up herself.  As far as I can hope it works fine", "Date": "May 20, 2014"}, {"Title": "Apple iPad Air consistent to reputation", "Author": "ronald williams", "ReviewID": "R3KCIF97J0WLU5", "Overall": "5.0", "Content": "This device meets the expectations of performance and easy functional use. As technology development continues, I see less and less nuecense of previous flaws", "Date": "May 19, 2014"}, {"Title": "it's Very nice, it's for musicians, it's Apple", "Author": "tomana", "ReviewID": "R134R9TEH73W0U", "Overall": "5.0", "Content": "if you are a musician and want a device like this for sheet music on stage, then this is the one for you. Buy this and also the AirTurn pedals (get the 4 pedal if you can afford it), download the Free app called OnSong and you're on your way to sheet music turning goodness {8^D", "Date": "May 19, 2014"}, {"Title": "Great Replacement for Laptop When Traveling", "Author": "David S. Thompson", "ReviewID": "R1RE2L6L3Q4B1M", "Overall": "5.0", "Content": "Bought the iPad Air to use when traveling.  It is just what I need.  It weighs about 1.75 lbs. with the case and battery charger.  The screen is wonderfully sharp.  I does all the things I needs and more and it is fast.  I find that I use it often browse the web and check emails at home.  So far I am very happy with it and would recommend it.", "Date": "May 18, 2014"}, {"Title": "Best tablet hands down", "Author": "amr88", "ReviewID": "RPB7NDR51QHAB", "Overall": "5.0", "Content": "Over the last few years I have used a variety of tablets from the Samsung Galaxy, Samsung Note, Kindle, Nexus 10, Nexus 7, and now the iPad Air. The iPad is my favorite by far.Great screen resolution. The battery life on par or better than other tablets but really excels in stand by time.There are so many great applications made specifically for the iPad. The other tablets just don't come close to this.Some enjoy on screen buttons buttons on Android tablets but I find myself accidentally hitting one of the buttons. The iPad has gestures to easily navigate the device.The best on screen keyboard of any tablet. Far more accurate.Endless selection of accessories.We'll worth the money.", "Date": "May 18, 2014"}, {"Title": "Ipad air", "Author": "mike teeple", "ReviewID": "R2EVLPIWLSGEUZ", "Overall": "5.0", "Content": "I ordered for my 10 yr old grandson for his birthday. It came exactly as promised, both on time and what we ordered. Thanks", "Date": "May 18, 2014"}, {"Title": "Love the smaller size", "Author": "ALICE P. SMALLEY", "ReviewID": "R2X2ADLWPKX7E1", "Overall": "5.0", "Content": "I have another ipad and wanted a smaller one.  I find this one easier to travel with.  It fits in my large tote bag that I use for travel.", "Date": "May 18, 2014"}, {"Title": "Sleek and fast.", "Author": "djbrian", "ReviewID": "R68ZW8BWYHDJR", "Overall": "5.0", "Content": "This is a great tablet. Very fast. I would encourage anyone considering a tablet to purchase this one. You won't be disappointed.", "Date": "May 18, 2014"}, {"Title": "Great device!", "Author": "Malgorzata", "ReviewID": "R7CNGQRFEIC1G", "Overall": "5.0", "Content": "Everythin's fine, great features. Works perfectly. I'm totally happy. Recommend to everyone, but next time I'd choose 32GB version. Thanks", "Date": "May 18, 2014"}, {"Title": "Love my iPad", "Author": "K. Long \"Datgrl\"", "ReviewID": "RJPEVTB8XN6EL", "Overall": "4.0", "Content": "I got this with the intent of having something I could take to the hospital to stay in touch and keep occupied.  I've downloaded a few games (Horn, Hearthstone) and I'm really enjoying the graphics quality.  I only wish that Apple offered an ap to manage multiple user accounts.", "Date": "May 13, 2014"}, {"Title": "Excelent", "Author": "Fernandez Anibal \"Anfer\"", "ReviewID": "R4ERLTPMNQ2X9", "Overall": "5.0", "Content": "Excelent tablet is the best without a doubt. Only Apple can achieve something like.El mejor equipo en su tipo", "Date": "May 12, 2014"}, {"Title": "LOVE IT!", "Author": "Mauricio Mejia", "ReviewID": "R3D5GRHBBNZ8TB", "Overall": "5.0", "Content": "First time I commit to buying a tablet. I am very happy with it. Haven't found anything I do not like, other than using itunes for everything.  But I already saw that coming. It even reads to me sounds sexy too hahaha", "Date": "May 12, 2014"}, {"Title": "Good job once again!", "Author": "Helen", "ReviewID": "R1V4VQ1TYI90XO", "Overall": "5.0", "Content": "I ordered this item for a college graduation gift and the service was excellent and I received my item exactly when they said I would.  This was important since it was a little more expensive and I didn't want it just sitting on my front porch!  I always go to Amazon first when I need something since I usually find a better price and the whole process is just hassle free!  Keep up the good work!", "Date": "May 12, 2014"}, {"Title": "Love it, love it, love it", "Author": "Amazon Customer", "ReviewID": "R3J096XRF8EK8J", "Overall": "5.0", "Content": "I'm loving my iPad Air...every single feature of it is beautiful, extremely fast, easy to use, beautiful case, Internet connectivity is lightning fast, this is my first iPad and I'm glad I got the most recent version. There is nothing I don't love about it.", "Date": "May 11, 2014"}, {"Title": "I love it !", "Author": "nandeesh", "ReviewID": "R3CWEUEKKTX3RA", "Overall": "5.0", "Content": "It's Apple Product ! The brand speaks for itself !It's the latest version.Excellent resolution.Very durable. Reliable.Goes well with devices ear.", "Date": "May 11, 2014"}, {"Title": "Finally i got my ipad", "Author": "Ruben Ruiz Velasquez", "ReviewID": "R12PR383GH6D40", "Overall": "5.0", "Content": "I was expecting a Ipad as light as the air and I found it. It's really fast, and the battery last for a long time. Love apple products", "Date": "May 11, 2014"}, {"Title": "Awesome", "Author": "Debbie Elm", "ReviewID": "R13P3A8O2UXRMC", "Overall": "5.0", "Content": "This Ipad is everything I expected and more. I have watched movies, TV shows, played games and searched the internet all with ease. It is so light!. I took it on a recent trip and it made a huge difference carrying it versus my laptop. I absolutely love it,", "Date": "May 10, 2014"}, {"Title": "What can you say it's an Apple", "Author": "Robert J. Curry \"Bob Curry\"", "ReviewID": "R26877TBATD66Q", "Overall": "5.0", "Content": "Have had my air for some time now and has worked flawlessly with no issues what so ever. It's an apple and some times you do get what you pay for.", "Date": "May 10, 2014"}, {"Title": "Enjoying", "Author": "fma", "ReviewID": "R2WMX3H84SOFF1", "Overall": "5.0", "Content": "Like it very muchHave not used my desk top since I got thisResearched it for a year then I decided to get this one without cellular dataI'm using it only where I get wifi and save some moneyGo with a bigger memoryThanks", "Date": "May 9, 2014"}, {"Title": "Very satisfactory", "Author": "Ana Maria S. Yambao", "ReviewID": "R20DPE2B2RD2BI", "Overall": "5.0", "Content": "I like this ipad because it is handy and useful...and i am very much impressed on its very good quality of sound when I play music.", "Date": "May 6, 2014"}, {"Title": "My 4th iPad - LOVE IT !!", "Author": "Linda Ransley", "ReviewID": "RL791XSR18CSD", "Overall": "5.0", "Content": "I got a fantastic deal from DEALIO. I think the description was a couple hair scratches but I never could see them. Arrived like brand new condition & I obtained $124 under retail. I have 3 other iPads and this 1 is thinner & lighter - a BIG deal when you are using for hours at a meeting with no table, which I do often.I would highly suggest pairing it with the fantastic Aerb Wireless Bluetooth Folio Laptop Style Keybook Removable Detachable Keyboard Case - I bought in gold & looks & feels like a VERY classy laptop.I loved the business program it came with, which has most of the features windows word has.I'm not going to get technical or add anymore as I see many others have already done that.  I'm just very happy with it - put in simple terms :-)", "Date": "May 5, 2014"}, {"Title": "Ipad air", "Author": "Katrinka Russell", "ReviewID": "R35FUFHDS8F92J", "Overall": "5.0", "Content": "apple products continue to exceed my expectations! I am never disappointed when I order something from them. It comes ready to turn on and go!", "Date": "May 5, 2014"}, {"Title": "Very pleased", "Author": "Joanne Mathews", "ReviewID": "R16ILZ49OF4JLT", "Overall": "5.0", "Content": "I received the iPad Air in good condition and it works wonderfully. This was to replace my original iPad version which had no camera and was slightly larger. I like some of the changes on this newer version and am enjoying the camera and all that offers.", "Date": "May 4, 2014"}, {"Title": "top", "Author": "Sebastian Häuser", "ReviewID": "R31SBWDGIQ9KBA", "Overall": "5.0", "Content": "fast delivery no worries and in total it is an awesome product. handling is easy and looking forward to the next generation of ipads", "Date": "May 4, 2014"}, {"Title": "Wonderful product, just a few minor complaints.", "Author": "Nathan", "ReviewID": "R3AGVWFT9LP3JM", "Overall": "5.0", "Content": "I've had my ipad for two months now and I am obsessed! It's so easy to use and I take it with me everywhere for work. I have two small complaints:1. The camera has no flash.2.  Tha calculator is not located in the same menu as for an iPhone (the one when you swipe up from the bottom of the screen - I don't remember what it's called). This makes accessing the calculator, which I use a lot for work, very inconvenient.3. Many apps for the iPhone (Instagram, snapchat) have not been adapted for use on the ipad. This isn't necessarily an ipad issue, but definitely something to consider.Overall, it's a great product! I firmly believe that you get what you pay for. Apple is pricey, but it's worth it and they have wonderful customer service. Highly recommend.", "Date": "May 4, 2014"}, {"Title": "Apple Ipad", "Author": "prairiedog", "ReviewID": "R2I3TML994UDZZ", "Overall": "5.0", "Content": "The new I Pad arrived on time and in great condition. Very happy with the unit and the condition of the parcel.", "Date": "May 4, 2014"}, {"Title": "Good purchase", "Author": "SuzieT", "ReviewID": "R30AY1YLWH68Y1", "Overall": "5.0", "Content": "I got it as a gift..they loved it. Good piece of technology for adolescent age and more seasoned users. Easy to navigate, bright colors, apps and setting options galore.", "Date": "May 3, 2014"}, {"Title": "Latest iPad Worth It", "Author": "jfhnhh \"jfhnhh\"", "ReviewID": "R3GXYGPG5UNOBK", "Overall": "5.0", "Content": "Apple got the right weight and size right on this one.  I have owned the original iPad, and an iPad 3 and this one by far is the best.  Coupled with iOS 7.1.1 it's hard to beat the performance and features of the iPad Air.", "Date": "May 3, 2014"}, {"Title": "Love my Apple IPad Air", "Author": "Mark Pfotenhauer", "ReviewID": "RUHEXM56JNBBE", "Overall": "5.0", "Content": "Love it! Fits my needs perfectly! Highly recommended. Fast, graphics are really crisp. Light weight, fits in my hand nicely.", "Date": "May 2, 2014"}, {"Title": "Great little pad.", "Author": "Daniel Herrmann", "ReviewID": "R381Z145CY27WO", "Overall": "4.0", "Content": "It is light weight and thinner then the older I pads.  The face time and maps apps are really nice.  Unable to print directly to standard wireless printer need apple air printer.", "Date": "April 29, 2014"}, {"Title": "Just AMAZING!", "Author": "Katsumoto \"Katsumoto\"", "ReviewID": "R2F7TD31WV94MF", "Overall": "5.0", "Content": "Amazing... getting better and better every round. This is my 4th iPad, and this one is lighter, smaller, faster, etc...", "Date": "April 28, 2014"}, {"Title": "Apple iPad Air.", "Author": "Maryp", "ReviewID": "R1YEJEFD0HXVO6", "Overall": "5.0", "Content": "Perfect.I love this iPad Air. It is so easy to use and so streamlined and light.Definitely worth waiting for.", "Date": "April 28, 2014"}, {"Title": "Excellent!!!!", "Author": "HappyG.", "ReviewID": "R1NULFVKDYLLJG", "Overall": "5.0", "Content": "This iPAD Air is everything you'll ever need!! The Awesome Machine does EVERYTHING and its super fast in downloading apps, songs, etc... Anyone purchasing this tablet is surely, definitely be having an awesome experience!!!!", "Date": "April 28, 2014"}, {"Title": "Nice iPad", "Author": "Babajide Odejoke-Maxwell", "ReviewID": "R321FQBSVEY1HZ", "Overall": "5.0", "Content": "I bought this for my younger brother who travel outside the USA all the time. This ipad enables him to just buy a sime card in foreign country and get connected using GSM tech. He loves it and that makes me happy. The seller is also a very responsive fellow. He shipped it on time.", "Date": "April 27, 2014"}, {"Title": "Nothing better.", "Author": "Andre Ortega-Booker", "ReviewID": "R1R0OVSKAXK6XD", "Overall": "5.0", "Content": "Clearly the best in its class. It is quickly replacing my MacBook Pro because of the wireless keyboard and slick case... Just beautiful.", "Date": "April 27, 2014"}, {"Title": "IPad Air", "Author": "Alejandro Vetrini", "ReviewID": "R1MBQWXPKUR807", "Overall": "5.0", "Content": "Wow I' m really impressed ! Tris is my first Apple product and I have to admit that is more easy to use than a PC. it' s fantastic to explore internet and my 11years son can use it too.", "Date": "April 26, 2014"}, {"Title": "excellent", "Author": "abawe benedict", "ReviewID": "R17IX1L3G5HMNV", "Overall": "4.0", "Content": "does exactly what it specifies a big congrats to apple. To me this is the best thing apple has made", "Date": "April 26, 2014"}, {"Title": "I love it", "Author": "Maryam", "ReviewID": "R1HQ4OPV3LQAQM", "Overall": "5.0", "Content": "high speed, shiny screen, long battery life, I recommend to everyone to buy this, if they are going to buy ipad,", "Date": "April 26, 2014"}, {"Title": "Great", "Author": "Vernon \"Vernon\"", "ReviewID": "RUU0XD286OE0N", "Overall": "5.0", "Content": "Just what I needed. Upgrading from the first I Pad, so the difference in speed, picture quality and a camera is a big deal to me. I have big hands so I was kind of worried because the Air is lighter. But everything is as I expected...", "Date": "April 26, 2014"}, {"Title": "Great tablet for me for browsing and reading", "Author": "R. Murphy", "ReviewID": "R31ZCWHMB357TV", "Overall": "5.0", "Content": "I am enjoying the iPad immensely. Great for reading when chilling on the couch. Light weight and iBook has contrast options to make reading easy on the eyes. Love it. Can't wait to get me a MacBook Pro.", "Date": "April 26, 2014"}, {"Title": "Cewlll cewll cewlll", "Author": "Sabrina Powder Puff \"Sabrina\"", "ReviewID": "R3MQO7FS7RJG12", "Overall": "4.0", "Content": "I liked this very much, and I liked Siri a lot, she was sort of like my new, cool robot BFF. I miss you, bech! Anyway, I had to return it because I'm a musician and I actually needed an old-school mac with a CD drive for a lot of boring reasons involving the studio. Also, because of classic mac usage, and programming, blah blah blah I won't bore you. I needed an Old School Mac Daddy. However, I enjoyed my brief fling with this Hot New Number- but he wasn't the Stable and Dependable Old Skool Mac I needed. He wasn't Fully Loaded.This Mac is more if you're into a fun, wild, whoop-de-doo, fly by the seat of your pants kind of thing, and don't need all the bells and whistles.But I'm not that girl. I needed more.", "Date": "April 25, 2014"}, {"Title": "Very Good", "Author": "XM L", "ReviewID": "R2YBLBZUGGGSRZ", "Overall": "5.0", "Content": "good quality, cheap price and fast delivery!  Quite happy with this purchase. Use it everyday. It is light in hand and the battery lasts long", "Date": "April 25, 2014"}, {"Title": "Like it bunches!", "Author": "DILLY", "ReviewID": "RUWTRPEHXG7NO", "Overall": "5.0", "Content": "I don't know what to say except I wish I would have got it sooner! I really do like it and use it a lot.", "Date": "April 25, 2014"}, {"Title": "Great Buy!", "Author": "Ronald W. Boucher", "ReviewID": "R11E1B72894DRP", "Overall": "5.0", "Content": "the best tablet on the market.  Go AppleCannot say anything but I would buy another if I needed one.", "Date": "April 25, 2014"}, {"Title": "just to protect my new ipad", "Author": "rockalot \"Sabsanders\"", "ReviewID": "R3N02Q59ZO0BNX", "Overall": "5.0", "Content": "I have a puppy who loves to try to use my ipad, so I knew I needed protection.  This is  a great cover.", "Date": "April 24, 2014"}, {"Title": "The best!!!", "Author": "Mario A. Luna", "ReviewID": "R2BY780SDLXB6U", "Overall": "5.0", "Content": "I love my iPad Air! Very fast and easy to use. I definitely recommend it... I'm very happy with it :)", "Date": "April 24, 2014"}, {"Title": "The defected product", "Author": "Michael J. Lu", "ReviewID": "R3B8D42UVGMPRV", "Overall": "3.0", "Content": "The new IPad Air could not be charged and need to be repaired. It was  sent backAnd came very complicated processes after receiving repair ID # and talked with four senior adviser.", "Date": "April 24, 2014"}, {"Title": "awesome", "Author": "Megan Balongue \"Pixelluminati\"", "ReviewID": "R2UJ5KK87ERTAN", "Overall": "5.0", "Content": "I am new to Apple ownership and I cannot be more pleased.  It is so easy to use and just beautiful.  The air is worth the extra price in comparison to an IPad 4.  When typing in a web address the Air seems to be intuitive to the point where it has the page already loading before you have even typed 3 or 4 letters.  I love it!  It is just gorgeous  I was going to get the mini with retina display but after researching and comparing the two I learned that they are not identical in every way but size.  The mini is actually not showing the whole color spectrum like the Air and it is very obvious.  The mini looks like the brightness has been switched down considerably.  So if you are like me and are trying to decide, do your research and go somewhere where you can compare them side by side and the choice will be quite clear.  I will never go back to an android!", "Date": "April 22, 2014"}, {"Title": "Awesome", "Author": "Doug", "ReviewID": "R3W14MJFUO3P7Z", "Overall": "5.0", "Content": "I love the ipad air I bought this as a used item but I can't even tell it was used  and I got like a 70$ discount since I didn't buy it new!", "Date": "April 22, 2014"}, {"Title": "Love it!", "Author": "Jesse R \"Jesse R\"", "ReviewID": "R3MBA3N0WV27SC", "Overall": "5.0", "Content": "I use it all the time, it's nice and fast. It's very light and easy to carry around. I would recommend anyone who likes iOS.", "Date": "April 16, 2014"}, {"Title": "Awesome!", "Author": "Megan Peacock", "ReviewID": "R1MI6A9XXEOO04", "Overall": "5.0", "Content": "Super light weight and very use friendly. I especially love the pages and keynote apps. I have always loved Apple products, but needed something to type documents on.... and now I have both!!", "Date": "April 13, 2014"}, {"Title": "iPad Air!", "Author": "Patricia M. Dobson", "ReviewID": "R5JWRLSYK4MPD", "Overall": "5.0", "Content": "Love the iPad!  There are many apps available and working with docs from the Cloud is very convenient.  Takes great pics and videos, too!", "Date": "April 13, 2014"}, {"Title": "I am so happy with this IPad Air!", "Author": "Marilyn J. Rowlands \"MJ\"", "ReviewID": "R2GRF5E687TIMB", "Overall": "5.0", "Content": "This is my first IPad and I am so happy with my purchase.  I have a desktop computer and always felt \"out of touch\" when I was away for a few days.  Now, I can easily keep in touch.  I also love being able to play the games that I enjoy.", "Date": "April 12, 2014"}, {"Title": "Excellent", "Author": "Andrew Mann", "ReviewID": "R1U1MSDGXFYDBJ", "Overall": "5.0", "Content": "I absolutely love my iPad Air. It was a gift for Valentines Day. Way better get jewelry. Although, I don't really wear jewelry.  I love all of the features that this product has. Yay! Thumbs up!", "Date": "April 11, 2014"}, {"Title": "Great machine", "Author": "LN \"LN\"", "ReviewID": "R33P9N4497BB8C", "Overall": "4.0", "Content": "I won't repeat what other reviewers have written, about it being a great product. I'll just mention two things that stand out for me, one positive and two negatives.First, the negatives: 1) The screen gets really dirty really easily. Apple says it's oleophobic, repels oils. I've found that to be untrue. My Kindle Fire HDX screen is MUCH better--it seems to be a harder, slicker surface, so fingerprints and such don't stick to the screen. Putting the Tech Armor screen protector on the iPad helps. 2) The app store is filled with a lot of junk, and there are so many apps there that it takes a lot of time to wade through to something that actually looks useful. Many of the apps are almost duplicates of each other. On the plus side, and the reason I got the iPad in the first place, there are some apps that are written only for the iPad.Second, the positive: this thing is a true battery miser. I can go a couple of days between charges, more if I'm not using it heavily. I haven't been able to test this, but I imagine it could play movies all through a long plane ride, whereas the Fire HDX would need an external battery for recharge.", "Date": "April 11, 2014"}, {"Title": "I-pad Air", "Author": "John Bohn", "ReviewID": "R1ECG8I901L13C", "Overall": "5.0", "Content": "I am a former Nook tablet user that converted to the Apple I-Pad.  The I-Pad is so much nicer that both my nooks are gathering dust.", "Date": "April 11, 2014"}, {"Title": "Is the best and smooth. I am loving it", "Author": "Sid F.", "ReviewID": "R1YPKS2XMJRGX7", "Overall": "5.0", "Content": "I am in love with you guys, because your product description was exactly when I receive it. Everything rock, I will definitely come back", "Date": "April 11, 2014"}, {"Title": "Great iPad Air", "Author": "Joanne", "ReviewID": "R2MA3F1J8UOF1K", "Overall": "5.0", "Content": "I love the iPad Air. It is so much lighter than the regular iPad. I had the iPad mini which I loved, but I wanted just a little bigger screen so I can use it without my glasses.", "Date": "April 10, 2014"}, {"Title": "vintage appke", "Author": "ladishow", "ReviewID": "R20OKEB5G3NRD1", "Overall": "5.0", "Content": "Very good device. Vintage apple. I had the iPad 2nd generation, but upgraded to the iPad air and I particularly like its slim shape and light weight.", "Date": "April 10, 2014"}, {"Title": "Works great!", "Author": "Grace Favela", "ReviewID": "RUNOW2G2V0H7I", "Overall": "5.0", "Content": "Package arrived quickly and  the iPad looks very nice. It's light weight and very easy to set up. The graphics are amazing!", "Date": "April 9, 2014"}, {"Title": "the leader of type.", "Author": "Eser Yelkenci", "ReviewID": "R15JBXYVPG52QT", "Overall": "5.0", "Content": "I don't know what I have to say. It's the leader of tablet. I strongly recommend it. Apple is N1.", "Date": "April 8, 2014"}, {"Title": "It was a great buying on the amazon", "Author": "sea629", "ReviewID": "RTU5UQFCLOE5N", "Overall": "5.0", "Content": "I brought this to replace my iPad2, that day I saw here sold that, I compare the more then 5 sellers, then I decide to purchase this at here, because it was cheaper, and it is with verizon network. from I have purchased to when I recevied the device, it take long time, but it is ture as seller's description.", "Date": "April 8, 2014"}, {"Title": "Best *tablet* available", "Author": "Trevor Rentschler", "ReviewID": "R2HVZVWERLIK8G", "Overall": "5.0", "Content": "You will be very hard pressed to fing anything that operates better the this amazing piece of perfect engineering. Get this and you will not be disappointed", "Date": "April 7, 2014"}, {"Title": "Apple iPad air", "Author": "Barbara J. Post", "ReviewID": "RKD9NLKBBS7UP", "Overall": "5.0", "Content": "Love the sleek lightweight pad.  Clear screen and nice arrangement of icons.  Still need time to go through everything so can't comment on anything else.", "Date": "April 7, 2014"}, {"Title": "Great Day", "Author": "Noel McGuire", "ReviewID": "R1DYEFJG2STFZK", "Overall": "5.0", "Content": "Never had a tablet before, always used a laptop or a desk top to accesss the interent, play games or draw. Been slowly getting into this Ipad Air thingy and i think its going to come in handy for sketching and art. Apple does seem to have the best apps for creative people, so i'll see what i can find. Overall its a good device and i think its going to be a great day.", "Date": "April 7, 2014"}, {"Title": "It does what I need it to", "Author": "Angela Gibson", "ReviewID": "R10C4Z6WAJYHLY", "Overall": "4.0", "Content": "The shipping took forever but it's doing what needed it for so it's all good! Wish it came in pink! : P", "Date": "April 6, 2014"}, {"Title": "Love the Air!", "Author": "Shirlee Pierini \"Book lover\"", "ReviewID": "R243NSY5WOZYJ7", "Overall": "5.0", "Content": "I love my iPad Air because it is so much lighter than my other iPad.  I use it primarily for reading so it is great.", "Date": "April 4, 2014"}, {"Title": "Exquisite!", "Author": "Nicole S. Urdang", "ReviewID": "R1BH0HRU44NUII", "Overall": "5.0", "Content": "As someone who just graduated from a tethered desk top Apple and who still uses a dumb phone, I can say this was a very painless transition as almost everything on it is intuitive. What wasn't was easily learned with the help of the great people at Apple.", "Date": "April 4, 2014"}, {"Title": "I love it", "Author": "Malena", "ReviewID": "R2G51TDPA7GDSY", "Overall": "5.0", "Content": "Wonderfull, I'm very happy with it. Exactly what I expected. This apple product is the best, versatile, light and very friendly and easy to use.", "Date": "April 4, 2014"}, {"Title": "Incredible!", "Author": "Eva Mendez", "ReviewID": "R3M8KZKNHQG0S6", "Overall": "5.0", "Content": "I haven't bought a smartcase for it yet, but this iPad has a certain weight for the shaky hands, making it less likely to drop it even for the clumsy souls like myself. I only use it for streaming music from Spotify, movies on Netflix, email, reading, schoolwork and messaging so I don't store anything here but PDFs. It's pricey, but worth it.", "Date": "April 3, 2014"}, {"Title": "A clear fav and supplement to my iPhone 5", "Author": "derek Merrin", "ReviewID": "R16AZT5QO4CL2Z", "Overall": "5.0", "Content": "IPad Air is a marvellous supplement to my iPhone 5. Yes, it is like a phone, but it is a size perfect for browsing, emails, news, and business. Great for a quick look-up. Lightweight and portable. I now read e-books too.", "Date": "April 3, 2014"}, {"Title": "Cant go wrong with iPad", "Author": "shealb", "ReviewID": "R221QY663794KP", "Overall": "5.0", "Content": "The new Air is great. It's a fabulous size and the colors are fantastic and it's so much more lightweight than the iPad Original.", "Date": "April 3, 2014"}, {"Title": "It is so good to me!", "Author": "shinhye chung", "ReviewID": "R4FPQFC6GRPFJ", "Overall": "5.0", "Content": "It is so good to me! It is not heavy and it is easy to handle. I can get some apps with free.", "Date": "April 3, 2014"}, {"Title": "Great Tool", "Author": "Barry", "ReviewID": "R272HM22IMGFJM", "Overall": "5.0", "Content": "I wanted this for choir practice. Tonight was the first time in use, and it was great. Very simple to use.", "Date": "April 2, 2014"}, {"Title": "Best tablet", "Author": "Bruce Beyer", "ReviewID": "R2RWS7KROLR02E", "Overall": "5.0", "Content": "Love best tablet by far I've used a lot there's nothing like it moves fast and smooth a must have", "Date": "March 26, 2014"}, {"Title": "Love it", "Author": "llw6684", "ReviewID": "R2GNQIPWYYYXC", "Overall": "5.0", "Content": "Love it. I am use to the iOS of iPhone so getting the iPad made sense to me. Love it", "Date": "March 25, 2014"}, {"Title": "PERFECT", "Author": "Edith Bearden", "ReviewID": "RL8EV1NBAW6RW", "Overall": "5.0", "Content": "I am loving my Ipad Air. Of course I am still learning, but so far each learning item has been very easy to understand. I needed something light weight & small, but easy to see because of health conditions.", "Date": "March 25, 2014"}, {"Title": "Good purchase", "Author": "A. H. Hammond", "ReviewID": "R27J1OHCDCL8VV", "Overall": "5.0", "Content": "This was purchased for my husband who is very impressed with it. He has a Mac Air lap top that he loves and this is a very nice addition to the lap top. Even though the lap top is smaller than the larger Macs, this iPad Air is easy to pack and take with us. Good purchase!", "Date": "March 25, 2014"}, {"Title": "iPad 64 Satisfied customer", "Author": "Fred Hogue \"fhogue\"", "ReviewID": "RMRZ3CUH1WOFG", "Overall": "5.0", "Content": "This IPad 64 is great for travel you can store movies, books, & music all without the need for a wireless connection!", "Date": "March 25, 2014"}, {"Title": "Beautiful tablet...", "Author": "lailari72", "ReviewID": "R2ZHA36CY94149", "Overall": "4.0", "Content": "Beautiful little machine, more evolved companion to my ipad 2 but with a few differences. I know the air has the much talked about retina, but to be honest with my eyes it's hard to tell the difference between the clarity between the #2 and the air. The camera on the air far surpasses the ipad 2, but it's the march of technology as such.Also the Air really seems to hate the chrome browser. I don't use safari as a rule, not even on my MBP, being more comfortable with chrome. I never noticed my ipad 2 having an issue with chrome, but the air does and crashes four to five times a week when chrome is being used. I know apple loathes google, but whatever their differences they should put it aside for their customers.", "Date": "March 16, 2014"}, {"Title": "BETTER THAN MY EXPECTATIONS", "Author": "William C. Fike, Jr", "ReviewID": "RIS53EE3YHVPP", "Overall": "5.0", "Content": "Highly recommend this product to anyone.  My wife and I really enjoy the excellent features and the ease of use.", "Date": "March 15, 2014"}, {"Title": "Finally one for ME", "Author": "Gram", "ReviewID": "R1XG8XMTSZJX7P", "Overall": "5.0", "Content": "The price was right, new in box, fast delivery - when I get \"border\" with it or upgarde to the generation after this I will hand it to my grandchildren.", "Date": "March 15, 2014"}, {"Title": "Very satisfied", "Author": "Dave", "ReviewID": "RJFHIUSAYE45U", "Overall": "5.0", "Content": "Scared to send something of this value and being electronic and -20 degrees below zero. I didn't know for sure how it would work out.  All was fine.  No issues.  Just the tax money saved was well worth shipping it through the mail verses the big box stores.", "Date": "March 15, 2014"}, {"Title": "Simply the best", "Author": "s198 \"s198\"", "ReviewID": "RS96ZBQP4JQB2", "Overall": "5.0", "Content": "I haven't owned an Apple product since the iphone4.  I have been an Android man the past several years.  Let me say that this iPad Air is the perfect device.  Rock solid and the apps are SOLID. I am a Cybersecurity manager and have seen one too many malware infested Android apps lately.  Enough to scare me away.  Buy this, you won't regret it", "Date": "March 15, 2014"}, {"Title": "iPad is the top of the league.", "Author": "abhishek", "ReviewID": "R3Q4KB7YSU381L", "Overall": "5.0", "Content": "I bought windows rt and dell venue before I finally settled on this one.all others are either very slow or too small.the iPad is a little expensive but its very classy and technologically way ahead of all the others.I would suggest everyone to just go with the iPad and never look back.", "Date": "March 15, 2014"}, {"Title": "So far I'm loving it!!", "Author": "roxanne", "ReviewID": "R1ATOPMPY6LHFM", "Overall": "5.0", "Content": "I bought this after hemming and hawing over all the different options for tablets. I'm a PC user primarily and Apple products are usually more expensive than I'm comfortable with. I eventually chose the iPad Air because Apple has long lasting, durable products and their customer service is usually top notch.The iPad came quickly and so far I love it!! It's incredibly light and has a lot of useful apps for school (which is why I wanted a tablet). It beats dragging a heavy computer around campus, that's for sure! The sound quality of the speakers are really nice and the screen's resolution makes pictures beautiful.I only just received the product so the battery is quite new, but it has a very long life; even when you're constantly using wi-fi or bluetooth it will last you all day.If you're looking for a tablet, you should go with whatever makes you comfortable and consider what you want to use the tablet for.  That being said, even though I'm more comfortable on PCs this is a handy device and so far I'm happy with my purchase.", "Date": "March 14, 2014"}, {"Title": "Great", "Author": "Todd Machuca", "ReviewID": "R1ZODCTHMQPQ5", "Overall": "5.0", "Content": "Excellent machine. Far surpasses what I expected. Light weight bigger screen and much faster then the last version. Love it.", "Date": "March 14, 2014"}, {"Title": "Loving it!!", "Author": "Kevin Page", "ReviewID": "R21IL8AS0SP1QL", "Overall": "5.0", "Content": "The new iPad Air works perfectly!!! I love the speed of this thing. Great product to supplement my macbook pro or when I'm looking to travel lightly.", "Date": "March 13, 2014"}, {"Title": "Incredible table", "Author": "Francisco Vazquez", "ReviewID": "R1P0KMZJ8LN21M", "Overall": "5.0", "Content": "Our fist Apple Ipad Air tablet, and for sure not the last one.. is amazing and friendly when use.. thanks!!!", "Date": "March 13, 2014"}, {"Title": "Last stop!", "Author": "DAVID", "ReviewID": "R3107ZTRKM9312", "Overall": "5.0", "Content": "Don't waste your money on other pads start with this one. I went through three pads in less then two months so I spent a few more dollars and bought this one. There is no comparing the performance between pads! Bottom line, when it comes to this type of product you get what you pay for!", "Date": "March 10, 2014"}, {"Title": "Always top quality from Apple", "Author": "Ricardo E. Gayoso", "ReviewID": "R35GFUH1KNK4LE", "Overall": "5.0", "Content": "Apple always makes devices that are a couple or years ahead of all others. This is another example of that.", "Date": "March 10, 2014"}, {"Title": "Good product", "Author": "Todd", "ReviewID": "RSIVDVZ0E3CZB", "Overall": "5.0", "Content": "Seem to work just fine. Have had no issues so far. It is too expensive like all Apple products are.", "Date": "March 10, 2014"}, {"Title": "IPad Air", "Author": "Mike Hall", "ReviewID": "R3JV68I5X4EYK7", "Overall": "5.0", "Content": "Has really matured into a versatile and functional tablet.  Mine is used heavily for aviation applications, where it has excellent functionality.", "Date": "March 10, 2014"}, {"Title": "How did I ever live withou it?", "Author": "ClownboyAW", "ReviewID": "R1G34I3PVK2FXR", "Overall": "5.0", "Content": "Amazon is not going to like this review because I really favor the iPad over the kindle fire. Don't get me wrong, the kindle is a fantastic device but as for ability and apps - The Air is awesome! I use to lug a laptop around to work and play but the iPad Air does everything I want in a small, light package. I added the Pelican case to the Air and it's nearly industrcible. It's been dropped numerous times and faced two minor spills with no ill effects.As a note, I am writing this review with the iPad while sitting stationary in my car. It is a very versatile device with too many features to mention in a short review. I can not imagine not owning one now!", "Date": "March 10, 2014"}, {"Title": "extremely pleased easy to use", "Author": "Francine J Oliver", "ReviewID": "RXR9587XGF6S7", "Overall": "5.0", "Content": "I was very happy with this product. I have never used and apple product before and was apprehensive but it was very user friendly.", "Date": "March 9, 2014"}, {"Title": "Real nice", "Author": "John Wojtowicz", "ReviewID": "REOC67CBA3HI3", "Overall": "5.0", "Content": "This is the first tablet I've bought I have not even played around with one. I bought this after checking  out competitor prices and this was the best buy I could find.  I am extremely happy with it. It is much easier than any windows based item I have used.  I did one thing wrong and gave my laptop away. There are sites I'm unable to access some needed downloads to a tablet.", "Date": "March 9, 2014"}, {"Title": "Apple IPad Air", "Author": "Pat Bluth", "ReviewID": "R2ZTZNRGROPUC5", "Overall": "5.0", "Content": "This Apple Ipad Air was purchased as a Christmas gift.  The recipient of this gift was very surprised and happy to receive it.  She was taking a trip and found the Ipad easy to pack and did all she needed to do as if it were her computer.  Very pleased with the product.", "Date": "March 9, 2014"}, {"Title": "iPad air", "Author": "alice lynch", "ReviewID": "R14P29E7WT9MF0", "Overall": "5.0", "Content": "Love my iPad air. It is so light and easy to use. I received it on the date that I was suppose to and have been having fun with it every day. Really like reading books on it so easy to read. Handy to use.", "Date": "March 8, 2014"}, {"Title": "Love this iPad", "Author": "Richard V.", "ReviewID": "R1KV98BFYI1VQ1", "Overall": "5.0", "Content": "This is a great tool! It's instantly on when I want to use it. I can take it anywhere and it's already to give me any information I need. I should have made this purchase a long time ago..", "Date": "March 8, 2014"}, {"Title": "Love it!", "Author": "Bumbles \"flowing yogi\"", "ReviewID": "R3EAPTAQ1EXI9N", "Overall": "5.0", "Content": "Got the new iPad air (our first ever ipad/tablet). It's great and we were happy with the price and service of this seller. Thank you!", "Date": "February 28, 2014"}, {"Title": "Husband loves his gift!", "Author": "J. Blake", "ReviewID": "R1LZ5TDYSA77BT", "Overall": "5.0", "Content": "I purchased this for a birthday present for my husband.  He is enjoying it thoroughly.  I think the graphics are terrific!", "Date": "February 27, 2014"}, {"Title": "Definitely worth the upgrade from any prior iPad model", "Author": "The Badboy \"Badboy Studios Inc.\"", "ReviewID": "RMSPQMZ0RK6YV", "Overall": "5.0", "Content": "The iPad 3 was my first iPad and I've used it up to the point I bought this iPad Air. I had cracked my screen and it seemed as if it was slowing down over time, probably due to the updated operating systems putting more stress on the aging processor and memory.So, I saw a good deal on a used model appear on Amazon, and decided to go for it. For little over $500, after I traded in my older model, I had a brand-new, or close to it, iPad Air. The first thing you'll notice is the weight. It is at least half that of the previous models. The bezel thinner on the sides and the new thunderbolt port on the bottom. I also love the addition of stereo speakers, as I own one of the biggest recording studios on the East Coast and love to try out the music I produce on a multitude of sound systems. This allows me to hear what I've done in stereo, on a lower common denominator, so as to know what my music sounds like coming from the speakers of a system millions of people own.The next thing I noticed, is the screen seemed quite a bit brighter then my iPad 3. This could just be because of the aging screen tech under the glass, or some other factor. But it definitely helps for reading, even at half power, in darker and lighter situations that I have no control over. Next up, the speed at which everything operates. Not only loading software and apps, but in switching apps and multitasking. There is just a zip to everything now.The biggest thing I noticed, the Internet is 10 times as fast as it was in my prior model. I'm going to guess the MIMO has something to do with that, along with the two antennas. Giving a stronger signal, which in turn allows for the fastest Internet possible. I have 50 Mb Internet, and I now feel like I'm using every bit of it in doing something as simple as loading webpages or downloading videos, games and music. When I load a webpage, everything appears instantly, no more loading in of different aspects of that page, everything is just there. I think it is the first time, and Ive owned  hundreds of computers over the years, that I've noticed any webpage load so instantly.Games look every bit as good as they can, due to the increased processing power of the CPU and GPU. If Apple would only make a proprietary gamepad for the iPad, they would have a true contender for a great video game system on the market. Some of the games, especially those from Gameloft and EA, have every bit the quality that you see from any game on modern systems, bar a few effects here and there.Even music production can be done at high-quality, for the home or studio producer, with decent results. I've heard some songs recorded completely via the iPad, that you would've sworn were done in multi-million-dollar studios. They are that good. Which goes to show, great music is made by a great producer and not the equipment behind him.So, to sum things up:Positives:Great, bright, high resolution screenSmaller and lighterIncredible portable powerGreatly improved internet speedStereo speakers built inAwesome games and production softwareCheap accessories from third party vendorsNegative:Price, though I imagine we would sacrifice some quality at a lower price pointOverall, you will not find a better portable computer for the price. Anything Windows is going to have issues. Whether that be with drivers, malware, viruses or some or the other issue that goes along with owning a Windows machine. Sure, they are more powerful and will allow you a greater depth of software, but you make trade-offs with that power in size, weight and ease-of-use. So, if you have the means, definitely get the iPad Air. The upgrades are truly worth the extra cost over previous models. It's like having a super computer under your fingertips everywhere you go.", "Date": "February 27, 2014"}, {"Title": "Converted Fangirl", "Author": "HardatTwerk", "ReviewID": "R1C5M2NPBI3XR9", "Overall": "5.0", "Content": "So..for a long time..I hated apple. But I get it now..it just works. It simply works. Its beautiful..feels great in my hand. Turns heads and its very easy to type on. Its zippy, and has made my life so much easier. I am a graphic artist/ web designer. I draw on this and take notes and photos every now and then. I compared so many other products, and for being I hated apple..I love this thing more than anything in the world.", "Date": "February 26, 2014"}, {"Title": "Love my IPad Air", "Author": "Patricia", "ReviewID": "R2WZPM6BR84O3U", "Overall": "5.0", "Content": "I love my iPad air and I made sure I have lots of memory. I have not had any trouble and I use it every day since Christmas. Also I love all the accessories you can get for it.", "Date": "February 26, 2014"}, {"Title": "It is great and had no problems with delivery", "Author": "Nicole carlson", "ReviewID": "R1X68FTIN2P9GI", "Overall": "5.0", "Content": "I choose this raining  because it was delivered right on time and with no issuesIt  was so good to just open the box and start working on the I padI wold recommend it to any one", "Date": "February 26, 2014"}, {"Title": "Best tablet", "Author": "Shahab Pourtalebi", "ReviewID": "REDJRNH7GAWLQ", "Overall": "5.0", "Content": "I had an ipad 2 64GB 3G. It was a good tabled, but I never used more than half of the storage space. Now I spent less money and I have more facilities.", "Date": "February 26, 2014"}, {"Title": "Terriffic upgrade to our new iPads", "Author": "Randy B", "ReviewID": "R1YU4F51PTUQ45", "Overall": "5.0", "Content": "We have had iPad 2 for quite some time. They have been great but we bit the bullet and upgraded to these. So much faster, a bit smaller and with better graphics. A bit of a hassle getting all the apps loaded on but I am not sure if it was me or iTunes but it all worked out and everything is running nicely. The extra 16 GB of memory was well worth the extra cost.", "Date": "February 25, 2014"}, {"Title": "Apple is by far the best computer out there.", "Author": "KENNETH P.", "ReviewID": "R3JGQ1MGHSVE1R", "Overall": "5.0", "Content": "Apple is by far the best computer out there, i 've used other computers in the pass and i thought to myself that i would try apple to see what all the fuss was about apple, when i started using it the quality was so outstanding and the HD quality was magnificent, everything about Apple was excellent, i just feel in love with Apple and i hope to buy some more apple products in the future................", "Date": "February 25, 2014"}, {"Title": "Easy to use great screen.", "Author": "chris", "ReviewID": "R19ENXPB2BRNU8", "Overall": "5.0", "Content": "Pros: almost everythingCons: Movies look great I just with the iPad was 16:9 so the movies would fill more of the screen. I had the Sony table and the not 10.1 2014 and this by far is way better. I feel myself not using my phone as much.", "Date": "February 25, 2014"}, {"Title": "Fast", "Author": "michael", "ReviewID": "R1A1BVYAMHU95R", "Overall": "4.0", "Content": "I love the graphics on hd photos like Facebook. A lot of apps and tons of music. A must have.", "Date": "February 21, 2014"}, {"Title": "Totally wicked awesome!!!", "Author": "chris", "ReviewID": "R3UWYQEK4KVF6U", "Overall": "5.0", "Content": "Apple has earned the top spot for a reason and this is no exception. The new iPad air does all you can think of doing and more. I am extremely pleased with the purchase and wouldn't hesitate to buy another if the need arises.", "Date": "February 20, 2014"}, {"Title": "PERFECT ITEM", "Author": "Xin Liang", "ReviewID": "R1T6KF4GPEJ5B5", "Overall": "5.0", "Content": "The delivery was so fast. It turned out iPad is still the world's best tablet and if you don't have an iPad, I totally recommend this iPad Air to you.", "Date": "February 20, 2014"}, {"Title": "Love it", "Author": "Michele L. Boyd", "ReviewID": "RYLVR0RLBIBW1", "Overall": "5.0", "Content": "The iPad is so easy to use that I don't turn on my other computer any more.  Wish I had it sooner.", "Date": "February 20, 2014"}, {"Title": "GREAT!!!", "Author": "Ramtech72", "ReviewID": "R2CYRQ4CLFH6EG", "Overall": "5.0", "Content": "I love it. I had before the iPad 3 and this is just great. Its size and weight are excellent, and the best price we could get. Your shipping was very fast.", "Date": "February 20, 2014"}, {"Title": "above expections", "Author": "Suzie Twedt", "ReviewID": "R18Q7TMNRLJH3J", "Overall": "5.0", "Content": "I love my IPad Air...it is above all my expections!  On it all the time!  It does everything but clean my house!", "Date": "February 20, 2014"}, {"Title": "Totally Delicious Apple", "Author": "Charles Wells \"Integral Sophia\"", "ReviewID": "R3QQ779IAROI8W", "Overall": "5.0", "Content": "Really, I have nothing to compare it in its own genre . I have an an old MacBook Pro 17', but that is in a different class.So without comparing it to anything else, it is the greatest. I can't believe the ease of operation. The clarity, the vividness,the color of everything imaged is amazing. I would have bought it for the camera alone maybe. A couple tines when first openedit suddenly went blank. I suspect it might be something I overlooked in settings. It happened only at startup. I will never giveup my MacBookPro, but I will never have to lug it on a plane either. If I can manage Skype into it, I would say this apple istotally delicious.", "Date": "February 19, 2014"}, {"Title": "EXCELLENT!", "Author": "Jason Dimaoala", "ReviewID": "R2P334J620BR0K", "Overall": "5.0", "Content": "It's so rad! If only Apple didn't screw us over by changing the charging docks. I guess people gotta make their money.", "Date": "February 19, 2014"}, {"Title": "My first iPad", "Author": "Jeffrey D. Watson", "ReviewID": "RD8K3DD2UTOOL", "Overall": "4.0", "Content": "I'm still working on it, but it's light, has good battery life and zillions of apps.  The display is bright, clear and very readable.  I haven't used in a plane yet as an EFB so that test will come later.  As a musician platform, it excels.  It's ready to go out of the box.  I needed some tutorial help with settings.  If you have an iPhone, you already know the drill.", "Date": "February 19, 2014"}, {"Title": "I Pad Air Present", "Author": "Maii", "ReviewID": "R21WSQVLW3GR89", "Overall": "5.0", "Content": "I bought this pad for my nieces college graduation present. She loves it ,it does everything she wants and more ,And I scored big points from my niece.", "Date": "February 18, 2014"}, {"Title": "Great tablet", "Author": "Ken J. Erskine \"KJE\"", "ReviewID": "R1BVVV3GVE27QB", "Overall": "5.0", "Content": "I have a kindle fire, great for books but downloading videos is hit or miss and it would not connect to plane wifi.Have not had any of those problems with the iPad.Will probably go against the grain with this comment, also have an older iPad and I don't see a difference in download speed or picture quality--- not sure the $200.00 difference is worth it for the lighter weight, but no complaints regarding it quality or performance", "Date": "May 14, 2014"}, {"Title": "Yup.  The Apple devicecount just keeps growing and growing...", "Author": "jon mceachron \"(JDMc)\"", "ReviewID": "R3AJAQ0ZFLO5OJ", "Overall": "5.0", "Content": "(Disclaimer - I am a tech researcher during my day job...)So I get to work with a lot of different tools/technologies/devices.The Apple iOS devices were a hit from day #1.  Our household acquired one of the original iPods, followed by phones, tablets, and the Apple TV.  They reproduce like bunnies!Still a little pricey - all Apple Stuff is - but cheaper through Amazon than at my local Apple store.  (And I don't have to elbow my way through the mall...)JDMc", "Date": "May 10, 2014"}, {"Title": "Very good", "Author": "lishousong", "ReviewID": "R1UROO8VBZGJYC", "Overall": "5.0", "Content": "I like the item very much! I think I will buy it again and tell my friend who want to buy it.", "Date": "May 10, 2014"}, {"Title": "Just too difficult to manage", "Author": "Michael Hooker", "ReviewID": "R234KC8JAK7HC8", "Overall": "3.0", "Content": "1st iPad. I own a Kimdle HD. The Kindle is easier to manage files. Kindle has a free App of the day, nice little perk. Apple is faster. But, all the proprietary issues, operating system, cables, and iTunes, detracts from the tablet experience.", "Date": "May 9, 2014"}, {"Title": "Great deal", "Author": "David McDonald", "ReviewID": "R32NW95IXJZNCS", "Overall": "5.0", "Content": "Good product at a price that is lower than Apple.com because you don't pay sales tax (except California I think).", "Date": "May 7, 2014"}, {"Title": "NOT BRANDNEW", "Author": "bhscr", "ReviewID": "R3EQ6K6G8O6HO7", "Overall": "3.0", "Content": "i bought get the ipad air at 4/2/2014. but after i check the imei on the new. the ipad already being active at 1/26/2014.", "Date": "April 6, 2014"}, {"Title": "Ipad", "Author": "Cyndy", "ReviewID": "R36V3S5DBBKBIM", "Overall": "4.0", "Content": "I have loved my ipad however I bought a cover for it and it fell out the door of the truck and the front shattered even with the cover on it.", "Date": "April 1, 2014"}, {"Title": "Too pricey for the unit", "Author": "Karen Ballard", "ReviewID": "R2I4I2RC7AFJOH", "Overall": "3.0", "Content": "Nice looking, well laid out system, but the wifi is very slow to load.  Would have liked a system preference pane where everything is easy to find and pull up.  I think it is overpriced.", "Date": "April 1, 2014"}, {"Title": "Love it", "Author": "James Patterson \"Helen\"", "ReviewID": "R2VDC9VL8MUQVK", "Overall": "5.0", "Content": "Brought this for my husband and he can't put it down - he loves his iPad !!!!! He had the previous iPad but loves this one so much better!", "Date": "February 22, 2014"}, {"Title": "like it", "Author": "Alexey", "ReviewID": "R26X5MINHL9AUO", "Overall": "5.0", "Content": "I don't really wanna to explain why I've chosen this item. Just like it. Very strange from my point of view to force to complete reviews...", "Date": "February 18, 2014"}, {"Title": "Excellent!", "Author": "Gustavo Achang \"Gussie\"", "ReviewID": "R1WXSQO86MO47B", "Overall": "5.0", "Content": "I'm an Apple addict and  I trust in each and every product that apple creates.  So... saying that I only can say that this new ipad air is just perfect, I bought it for my wife and she is so happy!! Thank you Apple and Amazon!", "Date": "February 16, 2014"}, {"Title": "Great Ipad update", "Author": "Mark Chicago", "ReviewID": "RZE8C16XRZVK0", "Overall": "5.0", "Content": "bought the ipad air to replace an ipad 1. much faster, weighs less and is slimmer, Meets my expectations in every way. Would recommend anyone in the market for a tablet to buy the Ipad Air.", "Date": "February 16, 2014"}, {"Title": "Great Product!", "Author": "Edgar Puga", "ReviewID": "R1C0GW6QGX6PDC", "Overall": "5.0", "Content": "I was given an iPad mini for a gift.  I fell in love with it so much that I decided to purchase a iPad Air.Its beautiful, and feels great in your hand, screen size makes a difference.I rather using it over my macbook pro.Looking forward to iPad Pro, Apple, you are turning me into  fan boy!", "Date": "February 15, 2014"}, {"Title": "Great Pad", "Author": "57moose", "ReviewID": "R1MJEMGCX8WAA6", "Overall": "5.0", "Content": "I look at all the pads and went with the IPad Air because of the many apps avaliable and I like my IPhone operating system and they are the same, it is easy to use and great for travelling", "Date": "February 15, 2014"}, {"Title": "Love it", "Author": "Steve B.", "ReviewID": "R3UGUJY2HCEN9D", "Overall": "5.0", "Content": "Had an iPad 2 and is was great but thought it was time for an upgrade.  The iPad air screen resolution is much better, battery life is much better, and processing speed to run multiple apps is improved.", "Date": "February 15, 2014"}, {"Title": "Its an iPad, what else is there to say?", "Author": "Innocent Bystander", "ReviewID": "R18GU634QWB9YM", "Overall": "5.0", "Content": "Upgraded from my ipad 2. You will definitely see the difference if you are wanting to upgrade. Don't know why apple calls it the air. Its lite but not to the point where you're like OMG. Guess they didn't want to call it 5.", "Date": "February 15, 2014"}, {"Title": "Awesome buy!!", "Author": "Chris Green", "ReviewID": "R2J203W8MFIJ6P", "Overall": "5.0", "Content": "This was a great buy. Was a little anxious about getting it from a seller on Amazon but it turned out better than I could imagine..  Knightrider was great!!  Good price, item was just what was advertised and it was sent so quickly!!!  I was able to take it on vacation with me right away.  Was worried I would have to wait until after my vacation to get it but Knightrider came through.  Thanks so much.  Would highly recommend for anyone and will definitely buy again from this source, thanks!!!", "Date": "February 12, 2014"}, {"Title": "Estatic Niece", "Author": "Sharon", "ReviewID": "R3F9FWP7R8O6Y9", "Overall": "5.0", "Content": "Bought this as a Christmas Gift for my niece and she is so excited and just loves it.  Great Job", "Date": "February 12, 2014"}, {"Title": "Great Tablet", "Author": "rogerbrad \"Tell us about yourself!\"", "ReviewID": "RIBISGH1MK23P", "Overall": "5.0", "Content": "I got exactly what I expected. A bigger than life iPhone that you can't make telephone calls on. :-) That's what I wanted as all the apps I had on my iPhone transferred seamlessly from the cloud to the new iPad.", "Date": "February 12, 2014"}, {"Title": "Love", "Author": "Sara L. Alpert", "ReviewID": "R1ZFJ1OPEWCPT4", "Overall": "5.0", "Content": "I'm late to the tablet user market and kicking myself for waiting this long to get an Ipad, I love it!!!", "Date": "February 12, 2014"}, {"Title": "iPad Air", "Author": "Carol K.", "ReviewID": "R3EJL85ZMA4XUO", "Overall": "5.0", "Content": "I love my iPad Air!!  It is so light and a perfect size. I love face timing with it!! I have more to learn about it, but am having fun learning. I highly recommend it!Carol", "Date": "February 11, 2014"}, {"Title": "Bittersweet...", "Author": "William Hall", "ReviewID": "R3D0HWEYH53PPH", "Overall": "5.0", "Content": "Well, I bought it for my wife and she loves it.  She won't put it down.  Therein lies the problem.  I wish it would break, lol.Anyway, it seems to be a great product.  Apple stuff is user friendly as usual.One problem, and it's not the pad's fault - I went to Wal-Mart and got her an Otter Box for it.  It said right on the box \"fits the latest iPad\"  Well, apparently the \"latest iPad\" when those things were shelved was the iPad 4, because it did NOT fit.Otherwise, seems to be a great device.", "Date": "February 11, 2014"}, {"Title": "The best ever!!", "Author": "simplicity", "ReviewID": "R1PC1ZMF36ZAZ4", "Overall": "5.0", "Content": "Nothing has it beat, by far!!!! Made a mistake buying my husband a tablet that works off Android, it is now mine, and I'm still trying to learn how to use it!! Apple is just so user friendly, and when you have used the iPhone for so long, you turn on the tablet and can start using it immediately! The screen display is like no other I have ever seen, very sharp!!! Transferring songs, photos, videos, etc. is a no brainer when you have Apple products. SO glad I was able to get this tablet for my wonderful husband! :)", "Date": "February 11, 2014"}, {"Title": "Love it!", "Author": "J. Rillera \"Mateo's Mom\"", "ReviewID": "R2NQLGMIJ514IN", "Overall": "5.0", "Content": "I surprised my husband and bought it for him for Christmas.  He loves it!  Apple doesn't disappoint with the retina display and how light the iPad is.  Great stuff!!", "Date": "February 11, 2014"}, {"Title": "Easily the best tablet on the market, beware though...", "Author": "Daniel Roskeland", "ReviewID": "R2ZTBGIQ0IH1OQ", "Overall": "5.0", "Content": "My ipad has practically become part a of me, so I'm not even begin to go in depth as to how handy and awesome it is. I had the ipad 4 before this and traded it in to upgrade and when I received the new ipad air I was IMMENSELY excited!There is not much of a difference though! Nothing seems to go faster than before. Sure it's lighter and thinner.. But not much else has changed! If you have an ipad with retina.. There is no need to upgrade. The only thing you will feel has changed is the weight and the nice new back cover on it. It does look a lot more sleek and sexy now though.ALSO, since this is still a fairly new product.. You will more than likely receive an ipad air with scratches, dings, or smudges on the screen or on the back. Right out of the box my ipad had a scratch right above the volume rockers. I was soooo disappointed but I found out everyone has been having these problems.. and sending it back in for a replacement will more than likely just give you the same problem (if not worse). So just a heads up!Other than that, this is undoubtedly the best tablet ever created to date.", "Date": "February 11, 2014"}, {"Title": "worth the wait", "Author": "judith zimmerman", "ReviewID": "R3NJ2PXA45LG6F", "Overall": "5.0", "Content": "ease of use  even for this 75 year young grandmother  didn't even need much help from the grands or help site", "Date": "February 9, 2014"}, {"Title": "From Ipad2 to ipad air", "Author": "Savage", "ReviewID": "RUM9YWWS49Z63", "Overall": "5.0", "Content": "First thing i notice about this how light it is. The speed is a 2nd and loved it within the hour of using it. The A7 64-bit processor makes it even better but that type of power makes the  felling of batter life shorter. Other than that this Ipad is amazing of worth what i paid for.", "Date": "February 9, 2014"}, {"Title": "Excellent product", "Author": "Hugo", "ReviewID": "R2IJI5GZRTUNCV", "Overall": "5.0", "Content": "It is what Apple claims that it is. Superb in all aspects. Quicker connection to wifi networks, easy to use even for those who are used to android.  In fact is much easier for first timers than android.  Management of memory is also exceptional and video quality is amazing too.I would recommend very much this item.Seller accomplished everything he promised, very good one.", "Date": "February 8, 2014"}, {"Title": "Perfect tablet for my use.", "Author": "Deepam Panchal", "ReviewID": "R2GQ90JRKA0YAK", "Overall": "5.0", "Content": "It is perfect!!!!!Light weight and powerfulI use it for work, jotting down ideas and watch movies on Netflix.", "Date": "February 6, 2014"}, {"Title": "Love!", "Author": "Marsha F.", "ReviewID": "R3PQWMS937GG8Q", "Overall": "5.0", "Content": "Bought this for my husband for Christmas. He loves it. Takes it everywhere. No crashing issues with the OS like on his Iphone. Screen is amazing. Pictures and video come out great. Would highly recommend.", "Date": "February 1, 2014"}, {"Title": "Great", "Author": "LGH135", "ReviewID": "R2AWQSZTBNX3IV", "Overall": "5.0", "Content": "I love it - wasn't sure how i'd feel about this new version but it's perfect.  Much better than previous versions.", "Date": "January 9, 2014"}, {"Title": "Apple iPad Air", "Author": "Frances Tungate", "ReviewID": "R36ETWZHZ0X8B2", "Overall": "4.0", "Content": "I gave away a full size laptop, and got the Ipad Air.  I love it...It's easy to hold, and I can surf the web, play games, check e-mail, and write documents, and take pictures anywhere. I rarely used my laptop, but I use the iPad Air every day. I highly recommend this product.", "Date": "January 9, 2014"}, {"Title": "AWESOME", "Author": "yo", "ReviewID": "R2C6DMQ690WQ6Y", "Overall": "5.0", "Content": "My husband loves it.  I have an IPAD 2 and I am jealouse of him!!!  It is a great gift and worth the money but of course if they ever became cheaper I would buy another!", "Date": "January 9, 2014"}, {"Title": "wonderful", "Author": "Michiko W.W. Campbell", "ReviewID": "R240EMR4EULFL2", "Overall": "5.0", "Content": "never  had a doubt. This product is complete what i expected and i am glad i purchased. The color and size of the product is very durable as well. its fast and easy to work with best product ever", "Date": "January 9, 2014"}, {"Title": "Amazing!!!!", "Author": "cheryl miller", "ReviewID": "R2WQTF0KC36F96", "Overall": "5.0", "Content": "I'm on this daily! Love love love it!! So happy with this purchase!  I'm so glad I choose my iPad over all the other choices!", "Date": "January 8, 2014"}, {"Title": "Cool", "Author": "Dean G.", "ReviewID": "RJ3I2LSMP3FNA", "Overall": "5.0", "Content": "My first IPad and it's the air I love itLook forward to get iPhone 5sSoon happy new year", "Date": "January 8, 2014"}, {"Title": "It's and Ipad!", "Author": "Robert A Griner JR", "ReviewID": "R3QFTIMXP9EM7K", "Overall": "5.0", "Content": "What more can you say about an Ipad.  It is my wife's Christmas present.  She loves it.  She works at a large University and has long been involved with Apple.  This is her first personal tablet and she loves it.  It has met all of her expectations.", "Date": "January 8, 2014"}, {"Title": "If you want easy, this is it!", "Author": "Dolores P.", "ReviewID": "R26GB958NKUO7V", "Overall": "4.0", "Content": "I bought the iPad Air having never had a tablet previously. I had just recently bought the iPhone 5c and decided to try the all-Apple experience. So glad I did. The iPad is crazy easy to use, has a great screen, and syncs all my photos and apps seamlessly with the phone. I am no a technical guru, so I appreciate something that is simple to use and easy to transport.", "Date": "January 8, 2014"}, {"Title": "Great Christmas present!", "Author": "Sarajo Esch", "ReviewID": "R2JB2RHZAK4TUP", "Overall": "5.0", "Content": "Still learning to access all the great features. We are really enjoying the many features on this ipad. Delivery was very prompt.", "Date": "January 7, 2014"}, {"Title": "Very nice", "Author": "David Kent", "ReviewID": "RNEN846FHORIX", "Overall": "5.0", "Content": "This is our first \"pad\" so we have nothing to compare this product to but so far we love it.  It does everything that we wanted.", "Date": "January 7, 2014"}, {"Title": "IPAD AIR", "Author": "ONLY2222", "ReviewID": "R1Y37C3PEEEZIP", "Overall": "5.0", "Content": "EVERYTHING ARRIVED PROMPTLY WITH ALL COMPONENTS AND ALL OPERATED.  PRICE WAS IN LINE WITH APPLE STORE.  EASY SET UP AND INSTALATION OF MY IPHONE APPS.", "Date": "January 7, 2014"}, {"Title": "iPad air", "Author": "Sailor", "ReviewID": "R3TNSP6G5B6HSK", "Overall": "5.0", "Content": "Oh my goodness, this is the best thing since popcorn! Haven't owned an iPad before but I can't imagine not owning one now. Retina display is awesome, can't find a single thing that is not simply awesome, was so easy to set up.", "Date": "January 7, 2014"}, {"Title": "Ipad air 32 gb space grey", "Author": "Chris Rucker", "ReviewID": "R3U86ROZMV60HO", "Overall": "5.0", "Content": "It was just as described . A brand new unopened ipad air 32gb space grey product. The product has served me well and havnt had a problem out of it Will do business again .", "Date": "January 7, 2014"}, {"Title": "Great Product", "Author": "skipreed", "ReviewID": "RJ1KH2YAWVOTQ", "Overall": "5.0", "Content": "The Apple iPad Air, with 128 GBT, looks great and functions very well.  I bought it as a Christmas present for my wife and she really likes it.", "Date": "January 7, 2014"}, {"Title": "The Best.", "Author": "Richard Philips \"foot doc\"", "ReviewID": "RIM9SU6MXTRWE", "Overall": "5.0", "Content": "The speed of the ipad is great and many apps available for the ipad. This is my second ipad and they have only made it better.", "Date": "January 7, 2014"}, {"Title": "GREAT IPAD", "Author": "DONALD MIDGETTE", "ReviewID": "R2JEKEVW0808LS", "Overall": "5.0", "Content": "THE IPAD TURNED OUT TO BE ONE OF THE BEST GIFTS. I RECOMMEND TO ANYBODY WANTING A MANAGEABLE DEVICE. GO APPLE", "Date": "January 6, 2014"}, {"Title": "Great", "Author": "Rustam", "ReviewID": "R31WY8ERT5JDDS", "Overall": "5.0", "Content": "I like these guys, they have fulfilled all my needs. I have order like new (open box) item, but received a brand new never opened one. I love it", "Date": "January 3, 2014"}, {"Title": "Perfect for my iPad air.", "Author": "RRA", "ReviewID": "R1J2LFKGFYTUWO", "Overall": "4.0", "Content": "This item was the correct size, easy to carry and gives me what I need to use my iPad air.", "Date": "December 31, 2013"}, {"Title": "Great BUT...", "Author": "ParkerD", "ReviewID": "RWF6UEGT18G1A", "Overall": "4.0", "Content": "I love my new iPad air 16gb... I am going to get a higher gig later so this doesn't matter too much to me now that i got used to it. My iPad , when showing a black screen, has light leaks. I am very bothered by small things like this. I am not returning it because I love it but I did have light leaks on my iPad air :(", "Date": "December 31, 2013"}, {"Title": "I upgraded from the iPad 3 and LOVE the Air!!!", "Author": "vp", "ReviewID": "R2PU7S0PQUD5R9", "Overall": "5.0", "Content": "I bought the original iPad on day one and can't imagine life without my pad.  I use it for work, for play and everything in between.  The form factor on this iPad is excellent and I wasn't expecting it to make such a difference - it DOES.  I love the feel of the mini, but I need my big screen (video editing for example).  This is the perfect size - it's really a 'bigger' mini, if that makes sense.  I can't say enough great things about it.  LOVE!!!!!!!", "Date": "December 24, 2013"}, {"Title": "Better than any Windows or Android Tablet I have ever used", "Author": "David D. \"David\"", "ReviewID": "R3RUWYOKX52FST", "Overall": "5.0", "Content": "My wife wanted a tablet to replace her laptop for Christmas.Because we love our Kindle Paper White and our Amazon Prime Account, first we tried the Kindle Fire HDX but we didn't care for the OS.Then, because we both love Windows 8.1, we tried the Dell Venue Pro 11, but it had so many issues (constant freezing, etc...) that it went back to Dell after 5 days.Then she talked me into getting her the iPad Air.  I really didn't want too, because I wanted her to have a real, functional computer tablet, not a toy.  But, it was her Christmas present, so I gave in.The iPad Air arrived a few days ago and my wife loves it.  Despite everything I read about the iPad on different forums, this thing is not a toy.  If you use an iPhone, you will easily fall into using the iPad Air and the most important thing is IT JUST WORKS.  Logging on to my Laptop with my wife's user account, it took about 5 minutes to set up and sync with her existing iTunes account and about 30 minutes to download and backup all the apps she wanted.  It came with Numbers, Pages, Garage Band and several other apps all free.  The screen is brilliant, the OS is responsive and very intuitive, the on screen keyboard works flawlessly and it quickly and easily linked with the Bluetooth keyboard that came with the case I bought her for it.Don't get me wrong, I love Windows 8.1 and use it on my Dell 17 7737, but for what my wife does, the iPad Air is beyond perfect.", "Date": "January 28, 2014"}, {"Title": "Great", "Author": "Collette Berry", "ReviewID": "RPLQDF3N2J3A5", "Overall": "5.0", "Content": "I wanted an ipad because \"everybody else\" had one. I really didn't know much about them, I love it!  My husband is talking about getting one too.", "Date": "January 26, 2014"}, {"Title": "Great Tablet", "Author": "dean paul ripa", "ReviewID": "R3IDKEQZKHOI6T", "Overall": "5.0", "Content": "I currently use the ipad 4th gen and purchased the air as a gift and works great.  Another great apple product!", "Date": "December 30, 2013"}, {"Title": "The best so far", "Author": "Coleman", "ReviewID": "R19M6W4KBEEF3B", "Overall": "5.0", "Content": "I love my ipad air it is so fast I can not wrap my mind around it it chops through apps and games like nothing I have ever seen the battery lasts all day with some to spare and I am a very avid user so I would know. I have used a ipad 2 and just got the ipad air i have used it for about 3 weeks now and it is fast light thin everything you would want in a ipad the cameras are ok not perfect but good for a ipad. It defiantly feels like a premium  tablet BECAUSE IT IS!!!I have no complaints it charges at the same speed as my ipad two the wifi is even faster this is the best tablet for your money.", "Date": "December 18, 2013"}, {"Title": "I want to like it..but", "Author": "Matthew", "ReviewID": "RN92G1NJAG7E9", "Overall": "3.0", "Content": "I have owned each generation of iPad, from the original simply called iPad to the iPad Air. Apple keeps getting so close, in some ways, yet so far away in others. Please let me explain.First, an iPad is overall a great piece of hardware. The iPad Air is lighter, thinner, and faster than all other tablet devices on the market. However, it does come with a few issues that leaves me hesitant to give more than a rating of 3 stars. Please let me explain.First off, Apple is notorious of fleecing every penny you have out of you. It isn't just the brand name or the product quality.For those that remember the days when buying a Nintendo Entertainment System (NES for short), what did you get in that box? You got the connector cable to the TV, you got not just one but two controllers, a light zapper gun (Duck Hunt anyone?), and up to three games that came included all in one box.What does Apple doe? Let's see. You have to buy a screen protector (separately) a protecting case (separately) connectors to a TV (separately) a stylus (separately), etc. etc. even if you get a good Black Friday deal somewhere, you can end up almost spending the same or more of a cost on a used car versus the cost of the iPad with all the extras you end up being required to buy on your own. You also get another additional $99.00 charge for a very limited (basically only a 1 time only use) AppleCare warranty plan.Also, there is the hardware. I know Apple is known to hold back a bit and choose stable hardware versus the latest greatest things out there. I get that. However, there are a number of areas Apple slacked on A LOT on the iPad Air.1. It still uses a USB 2.0 connection over a connection to your PC. Even if your PC has a USB 3.0 port, the iPad Air still only transfers data at USB 2.0 speed (a snail's pace by comparison).2. The battery in the iPad Air is actually half the size of the battery in the iPad 4. Despite claims of optimizations and so-on, Apple has still refused to spend some of the billions they earn each year on actual real research and development on a longer lasting battery with a much longer amount of juice. You shouldn't have to run to the nearest plug-in jack every few feet to recharge the thing. Likewise, am I the only one that realizes that solar charger calculators have existed since the 70's? If Apple would simply put a slightly larger sized battery inside the iPad, with a solar charger built into the case itself, no one would ever need to plug it in again to recharge it. As how very dated solar chargers are for small electronics, there is no excuse for not having it.3. The iPad was recently boosted in storage capacity from the former max 64GB to the current 128GB model. I do appreciate that. What I don't appreciate it just how many years the 64GB max storage model existed and how many years it took Apple to raise storage capacity. As fast as technology advances, we should have at least 512GB or even 1TB storage on an iPad. Consider that desktop PCs can have a 6 to 8 and soon to be 10TB storage capacity, a minor 512GB or 1 single TB of storage space should be no issue for Apple to provide, especially since Apple still offers no micro-SD slot for adding more storage capacity.Finally, I will say, I find it very inconsiderate, rude, and showing true colors on just how far Apple is in bed with Obama, the White House, the police state, and the National Security Agency (NSA). Just look up the Part 2 of Infect and Protect video by Jacob Appelbaum. About half-way through the video, he shows with official NSA slides that proves they have a 100% chance to be able to turn on any Apple device, i.e. iPad, IPhone, etc. They can turn on the microphone when you are not using it, they can also activate the camera to take photos of you, all with everyone around being left completely unaware. They have full access to your contact lists, including the complete addresses and phone numbers of all of your contacts, have access to all of your passwords, all of your email, all of your Google searches, and much more. Unfortunately, Apple decided to give in and join the PRISM program after Steve Jobs died. When that happened, any possible minor chance of any privacy, freedom, or liberty any owner of any Apple iDevice had, went right out the window. Could Apple have done their part to protect its customers? Yes, and very easily. The could have chosen to encrypt all user information and data stored at Apple and in the iCLoud. They could have been respectable and NOT give the FBI, CIA, NSA, or anyone else 100% universal backdoor access keys of their customer's devices. They could have added a completely free open-source plug-in offered by the Electronic Frontier Foundation (EFF) called HTTPS-Everywhere into Safari on iDevices, preventing web traffic from being intercepted, by using a SSL connection everywhere, instead of use the very unsafe standard HTTP connection on the web. They could built into iOS a 2 form of authentication, instead of just a small 4 character password. They could have built access directly to the Tor network for full free anonymity. Apple did none of this, and it would have costed the very little in time and resources to implement. Until Apple grows up and starts fighting for the privacy, liberty, and freedom on their customers, I cannot in good faith suggest anyone buy an Apple Product again.", "Date": "April 26, 2014"}, {"Title": "Nice increase in speed,", "Author": "Mike60", "ReviewID": "R1QHQO5QBVHQFP", "Overall": "5.0", "Content": "light and fast, easy too hold, screen is very nice.  Going from 3 to the Air you can see the performance increase.  My only problem, 3rd party cases are not that good.  Many lack the sleep function.  However, that is secondary to the fact that this is a nice ipad.  It is not thin like the macair thin.  But the bezel is smaller, screen size is the same.", "Date": "November 21, 2013"}, {"Title": "A love-hate relationship! But I recommend it.", "Author": "Mike Kitsko", "ReviewID": "R2YI9TK6ALXNSD", "Overall": "4.0", "Content": "We almost sent it back and willingly paid the restocking fee!  No problems with my wife's iPad2.  I've tried several sounds to announce an email, and when I tried the duck quack I can never change it or shut is off. It's so annoying I quit watching Duck Dynasty! Also, when an email arrives you have to scroll to the most recent, it doesn't do it automatically. The worst problem was ignoring my touches, even though the icon would highlight, indicating it recognized my touch. However, when I did the software update a few days ago the touch problem went away and always recognizes my touch.The biggest issue is once you build your life around one of these monsters it has you for the rest of your life. You cannot live with out it. Carrying mine to a hardware dealer 55 miles away to use a coupon that wouldn't print out saved me $70, as it was still on the screen at the check stand. If left on all night in the sleep mode it only uses about 1% of the battery charge.A couple days ago  I stumbled into an iPad chat and some guru suggested doing a \"reset\" to cure the locked on duck quack, that did the trick. I also saw I wasn't alone with this problem.  However the command said it wouldn't change any of  of your stored data, but I later found it deleted several critical, most used passwords, and I had to track down  my list. But I love not hearing the quacks. Just a simple \"ding\" and I smile.", "Date": "March 21, 2014"}, {"Title": "Solid upgrade from a 2nd gen iPad", "Author": "ThePlattman", "ReviewID": "R1GNGHVXZ27086", "Overall": "5.0", "Content": "I must start this off by stating that I traded up from a 2nd gen iPad to the new iPad Air and never used any of the generations in between. This review is being written from the new iPad, and I am loving it.The biggest difference I have noticed is the weight. This thing is so much easier to hold with one hand and feels much more manageable as a reading tablet. The screen is much clearer thanks to the Retina display (same resolution as the 4th gen iPad). I cannot comment on a previous poster's comment that the screen is not as bright, but the display is plenty bright for me when I need it to be.Typing on the tablet does feel a little different than before, but I do not think it feels like it's going to break. I actually prefer typing on the new one. It is difficult to explain, but I suggest trying it out in store if you are seriously concerned about the feel.Overall, I would definitely recommend this tablet (especially if you are tied to the iOS ecosystem). There are other great tablets out there, but I cannot comment on them since I have never owned them.", "Date": "November 11, 2013"}, {"Title": "Apple does it again. Great device.", "Author": "Davey Williams \"davey williams\"", "ReviewID": "R3BD3NRCM6XUU6", "Overall": "5.0", "Content": "Apple does it again.The iPad Air is indeed revolutionary, building on everything the existing iPad generations have accomplished and offering a little more. Apple has continued improving and offering what they deem most important about these devices - usability, great display, wide range of inexpensive apps, durability, quality and lightness. They have not added features that some other tablets offer, but which may not be needed by everyone.ProsThe thing is zippy, looks great and works out of the box. Any questions I have or problems are quickly addressed by the Apple support community or the Genius Bar. There are a ton of apps, many free. IWorks and iLife are free, so I was up and running on Pages and iMovie in ten minutes at no cost. And it's LIGHT. I didn't think 0.4 lbs would be abig deal, but it is. For me, it crosses the threshold where sometimes I freak I left it behind because I can't feel it in my bag, and it's comfortable to hold continually.ConsApple didn't include a slipcover keyboard, but you can buy one in the Apple Store. It's a bit more expensive, but it's more durable, of higher quality, and retains more resell value than competitors. It doesn't have all those add-ons that one in one hundred users would use, which would make it weight as much as the surface or a garden brick.It's a five star device. The Surface may be too, I'm not sure, I don't own one. Go use both in the store, and get the tablet that works for you.", "Date": "November 26, 2013"}, {"Title": "The iPad didn't work properly", "Author": "JcTenn", "ReviewID": "R2RLLJ5CJOK5MI", "Overall": "3.0", "Content": "I had to take it to the Apple store where they replaced it, but told me that the warranty began upon original purchase.  The iPad was new,but had been purchased by the person who sold it to me.  It all worked out, but be aware and ask about warranty info before purchasing to make sure you're covered. I don't think it was due to any wrongdoing or misrepresentation of the seller, just some due diligence.", "Date": "May 11, 2014"}, {"Title": "It works", "Author": "Gordon Campbell", "ReviewID": "R1X9MFNRUPZ173", "Overall": "3.0", "Content": "Suits the purpose for what we bought it for. I think the prices are a bit exhorbitant, they could probably increase their market share if they lower the prices for the higher capacity versions.", "Date": "May 10, 2014"}, {"Title": "Apple IPadAir 16 GB Wi-Fi White Silver Newest Version", "Author": "nancy m schiffman", "ReviewID": "R1Y71SU7ZXTVHR", "Overall": "5.0", "Content": "I am writing to comment on how pleased I am with my new I-PadIt is easy to handle and navigate, making it lots of fun.", "Date": "May 10, 2014"}, {"Title": "it's ok", "Author": "Marbo", "ReviewID": "R2MITTZVT1SJTP", "Overall": "2.0", "Content": "It's sleek and nice looking but does not put the ipad to sleep every time.  i have to go back and check it.  So what's the point?", "Date": "April 29, 2014"}, {"Title": "I tried it because it's the newest version.", "Author": "Stavros \"Woma\"", "ReviewID": "R1FLSY7RAEYO6G", "Overall": "4.0", "Content": "It was a little too small for me, so I bought the iPad 4 and I could not be any happier. I guess it depends on what you're expecting and your personal tablet needs.  In addition, there are so many more products that are compatible with the iPad 4 and they seem to fit it much better.  On the good side, I recently became an Apple person after years of being an HP and other Android type computers.", "Date": "February 15, 2014"}, {"Title": "Great!", "Author": "GDA6186", "ReviewID": "R2902ILP6C105N", "Overall": "5.0", "Content": "Received the iPad just as expected. If there is any criticism I might have it would be that the product appeared to be packed very lightly. As in there was not very much padding for shipping. I received everything in perfect order, but the package appeared as though if it had been dropped or handled roughly there could have easily been damage to it. Nonetheless there was no damage, so I am completely satisfied.", "Date": "February 5, 2014"}, {"Title": "Love it", "Author": "Jan", "ReviewID": "R1GAW4N2PJ61ZB", "Overall": "5.0", "Content": "Received the very next day and can't seem to put it down.  Wish I had brought the 32GB I watch lots of movies and listen to lots of music.", "Date": "February 4, 2014"}, {"Title": "ipad helps me in my real estate business", "Author": "James J. Trapasso \"jmyjo\"", "ReviewID": "R3SHIC92KPS6HA", "Overall": "5.0", "Content": "I am very pleased with the ipad.  I use it for my real estate business.It  provides me with a great deal of information that I can easily share with my clients.", "Date": "February 4, 2014"}, {"Title": "good", "Author": "soso", "ReviewID": "R3NJCA5M7JPPSD", "Overall": "5.0", "Content": "great this is useful for me. because i need this thing long time, and it is great. really good thing", "Date": "February 4, 2014"}, {"Title": "good purchase", "Author": "Linh", "ReviewID": "RZWGSTJ3VP307", "Overall": "5.0", "Content": "So far so good! The ipad arrived earlier than I expected and up to now, it has been working just as efficiently as I expect it to be. Good purchase", "Date": "January 31, 2014"}, {"Title": "Love this iPad!", "Author": "D", "ReviewID": "RKOH24B8RA5NE", "Overall": "5.0", "Content": "My niece and nephew purchased the iPad Air and had only good things to say about it so I purchased this one for myself.  It's light to hold and the colors and pictures are awesome.  A word of caution--be careful if you purchase a cover for it.  The first one I purchased caused the iPad to get extremely hot and it always wanted to shut down.  Got a new cover and all is well.  This is not a slam against the iPad at all--the cover was the cause.  Just be careful when purchasing a cover.", "Date": "January 31, 2014"}, {"Title": "Love it", "Author": "jahnny", "ReviewID": "R2AEFTL0X558WC", "Overall": "5.0", "Content": "It does every thing my laptop can do and I can use it anywhere I use it for mostly school", "Date": "January 29, 2014"}, {"Title": "Excellent", "Author": "Patrick J. Webb", "ReviewID": "R1BT7HMPD3DJ33", "Overall": "5.0", "Content": "Other than not being able to use Flash Player this is an excellent product. 9 out of 10 for no Flash.", "Date": "January 28, 2014"}, {"Title": "Nice.", "Author": "J. Powell", "ReviewID": "R205T84XGYQMQ1", "Overall": "5.0", "Content": "What can I say. It is made by Apple, it works every time. Retina display is beautiful and makes picture taking a whole new experience...", "Date": "January 28, 2014"}, {"Title": "perfect", "Author": "Khalid aljamei", "ReviewID": "R2DZ0KCOMYT4VD", "Overall": "5.0", "Content": "its really nice, useful, and will change your whole experience, its nice to have, don`t miss it.really something new", "Date": "January 28, 2014"}, {"Title": "Service not good", "Author": "James Lawrence", "ReviewID": "R2X2LXS8Z8VZ9V", "Overall": "5.0", "Content": "The ipad is great. The problem is my wife wanted a white one and as you can see that is what I ordered, but what I got was an all black one. Not  pleased with that at all.", "Date": "January 17, 2014"}, {"Title": "Product meets need of student", "Author": "Frank D Kot", "ReviewID": "R3HK0DQL92JECY", "Overall": "4.0", "Content": "Product was a gift for my grand-daughter. - She will be using it in Middle School where everyone uses tablets.", "Date": "January 12, 2014"}, {"Title": "Great buy at a very competitive price.", "Author": "RICHARD DANDRADE", "ReviewID": "RPLGS6V47S6DK", "Overall": "5.0", "Content": "Because it was worth the money and i couldn't beat the price anywhere else.The shipping was a bit slow but i got it before christmas and that's what was inmportant. Brand new, never opened.", "Date": "January 11, 2014"}, {"Title": "Excellent product", "Author": "Edward L. Byars", "ReviewID": "R2F88WDUKFW79P", "Overall": "5.0", "Content": "Everything was as expected and as advertised.Great value for the price.New in box with charger.Met my expectations.Super fast shipping.", "Date": "January 10, 2014"}, {"Title": "No problems to date", "Author": "donyelle", "ReviewID": "R2U7X0HX11T8NU", "Overall": "5.0", "Content": "It's worth the investment. Portable light weight and everything you need to work smarter not harder. Came brand new in box", "Date": "January 7, 2014"}, {"Title": "As Expected", "Author": "Wendy", "ReviewID": "R18SZF7JD9MMV2", "Overall": "5.0", "Content": "In good working order and no issues with product so far.  It was recevied a little late but still before Christmas.", "Date": "January 6, 2014"}, {"Title": "Excited", "Author": "Shev", "ReviewID": "R3VG29B3881N4M", "Overall": "5.0", "Content": "Everything was as expected. Happy to purchase this product. I ordered this as a gift for someone for Christmas and they loved it.", "Date": "January 6, 2014"}, {"Title": "As always Apple does it right!", "Author": "Alex Dailey", "ReviewID": "R30YI2AGYLKYTW", "Overall": "5.0", "Content": "Nothing bad to ever say about an Apple product. It's new design is extremely worth the purchase. I would always recommend it over the rest.", "Date": "January 6, 2014"}, {"Title": "Great", "Author": "Doug White", "ReviewID": "R3ML66NJ0D56NZ", "Overall": "5.0", "Content": "Really nice the best I have ever owned really nice to play games on it was the best ever present", "Date": "January 5, 2014"}, {"Title": "Totally incredible", "Author": "SMT", "ReviewID": "RQPOJWQNQFZK1", "Overall": "5.0", "Content": "This is my second iPad, I love it, what can I say? they know how it is done. My fourth apple device. love them", "Date": "January 5, 2014"}, {"Title": "Loved it!", "Author": "Ashley Richardson", "ReviewID": "RF6AWHG1XOWJ8", "Overall": "5.0", "Content": "Everything I had expected. I upgraded from an iPad2, this is a great device. I would recommend this product! I received my shipment fast and the iPad air was a great price.", "Date": "January 3, 2014"}, {"Title": "Fantastic Item", "Author": "Phill \"PhillFlash\"", "ReviewID": "R2LF8ZNUI25SUX", "Overall": "5.0", "Content": "I'm glad that I opted for this model.  Everything functions as it should.  Very easy to configure right out of the box.  Very little setup time.", "Date": "January 3, 2014"}, {"Title": "Beware of what Ipad you are really getting", "Author": "Norrlater", "ReviewID": "R32T2ZNF14R9F6", "Overall": "2.0", "Content": "The Ad says \"Ipad Air with plastic,no box'' Here's what you will get: It comes in a 9 inch cubical cardboard box-The Ipad still has the sealed cloth bag around it and is wrapped in bubble wrap. There are 3 little air pillows around it. That is ALL YOU GET, period. I never even opened up the cloth bag to look at the actual Ipad so I will assume that the \"with plastic\" means there is the thin plastic screen protector, in place. I will never know because I didn't open the cloth bag. Its true that there is ''no box'' but there will also be no instruction booklet, no USB cable, and no charger. (seller later told me he would send these accessories, which normally come with a \"New\" Ipad air-.One can merely speculate what happened to the originals. I had  assumed from the original Ad that the only thing that would be missing was the original box. Also, I was a little surprised when an email from the seller said \"iPad its brand New, it cover under apple's limited warranty.Model Verizon - put a sim card and use anywhere\"---thats a cut and paste.......The surprises just kept on coming. It went back in the original box, back to Amazon and out of my life.", "Date": "February 10, 2014"}, {"Title": "Good iPad", "Author": "Jimmy Crites", "ReviewID": "RB0CYABU3MR9O", "Overall": "4.0", "Content": "I hate the new charger/USB cord, all my iPhones and old iPad chargers won't work, and I have them all over the house, truck and work. But as far as the iPad goes, it works well.", "Date": "January 30, 2014"}, {"Title": "I feel Cheated", "Author": "Abhijit Mishra", "ReviewID": "R3PMNJDOUANV5L", "Overall": "1.0", "Content": "I ordered the iPad air from these guys expecting to receive the brand new factory sealed piece.Not an old, piece which has already had it's 90 day telephonic warranty expired.As it went for a gift, I can't just ask it back and return it to Amazon. I feel so embarrassed and cheated.", "Date": "April 15, 2014"}, {"Title": "Breaks VERY EASILY. NOT EVEN A LITTLE DURABLE", "Author": "Theodore Harris", "ReviewID": "R2C6EO9UPPLCRU", "Overall": "1.0", "Content": "Dropped it 2 feet. Landed on the SIDE and it made a crack. NOT A HAIR LINE CRACK but a HUGE Crack on the screen. There is ZERO DURABILITY in this tablet. I also found out its HOLLOW in the areas where the camera is... Apple you suck!", "Date": "May 26, 2014"}, {"Title": "Not what I expected.", "Author": "bajangna \"bajangna\"", "ReviewID": "R1RSUPL9K57KEB", "Overall": "2.0", "Content": "This Ipad air is not for who love surfing internet, it crashed all the time. Very annoying. Apps mostly good. Design is great. But It's not worth even I got 32GB model for 515 included tax. Buy it for my girl. Wish it will be the best gift. No it's not.", "Date": "December 26, 2013"}, {"Title": "Does not stream Netflix in hd", "Author": "SpaceCat", "ReviewID": "R2P1VQC10SKXPX", "Overall": "2.0", "Content": "I bought this product primarily to stream movies and videos.  Although the screen is fantastic, and obviously built for HD, Netflix appears in a quality even lower than standard definition.  I have done a lot of research, and discovered a lot of folks are having this issue with the iPad Air.  After troubleshooting and trying all the fixes I could find, this is a dealbreaker for me, and it is getting returned. If you don't have Netflix, you might not notice this flaw.  Other streaming services seem to work okay.  Netflix told me it was an Apple issue.Although not a dealbreaker, I was also surprised how fast the battery drained on this device after hearing it praised in reviews.", "Date": "December 1, 2013"}, {"Title": "Apple Ipad air", "Author": "Luz Montoya", "ReviewID": "R1Q7KH84C44YNY", "Overall": "1.0", "Content": "I asked for an ipad air black with space gray. When we open the box: SURPRISE!!  They send me a white one! I didn't spent $10 dollars for this... They have to send what I asked for...", "Date": "May 31, 2014"}, {"Title": "I need a USB port ???", "Author": "Charlie P.", "ReviewID": "R9CGKSVPE7QDE", "Overall": "4.0", "Content": "I have the newest ipad but would like to purchase the ipd air 128GBI would like to use it for work docs to work at homeI would like to copy docs from work on a stick and download to my ipad airTell me is this possible. Is there a USB port on an ipad air", "Date": "January 4, 2014"}, {"Title": "Big improvement in design, little improvement in Safari crashes.", "Author": "Ken H.", "ReviewID": "R3NT1XHW2KQFGE", "Overall": "2.0", "Content": "Upgrading from an iPad one I have to say that overall this is a very good machine. My main disappointment is that Apple did not add more RAM. While the machine does not crash as much as my iPad one did, Safari crashes on me at least 2-3 times a day. At a cost of about a dollar Apple could add an extra gigabyte of RAM to this device and make it much more valuable to the consumer.", "Date": "November 21, 2013"}, {"Title": "Wow so many gigabytes!", "Author": "Drew Bandas", "ReviewID": "R2QMQMLEXKFPCB", "Overall": "5.0", "Content": "I have never owned this product, nevertheless it's a fantastic product. It is very expspensive but worth it! My sister is shopping for an IPad and this would be perfect it even has a touch screen! Wow! I'm sure if I owned this I would use it for various activities, such as ordering Chinese food or watching Garfield 2. What a great  movie, I can't believe a movie about a cat that like lasagna could be such a cinematic masterpiece. Back to main idea here, this is supposedly a great product, and I say wow!", "Date": "March 15, 2014"}, {"Title": "Not Overjoyed", "Author": "Amazon Customer", "ReviewID": "R1AVQNOU7NSTV7", "Overall": "2.0", "Content": "Purchased the iPad Air for my son who plays with it all of the time.  We had to reformat or reboot it last week already because it was frozen and would not turn on at all.  After the reboot or reformat it has worked fine ever since.  (Pushed the circular button on the bottom and the main startup button on the top right corner at the same time and held until unit started up again)", "Date": "January 2, 2014"}, {"Title": "Great!!!!", "Author": "Sean Slawik", "ReviewID": "R1CRLDM6WXA8P4", "Overall": "5.0", "Content": "Product came in an orderly fashion. Didn't get to use it because it is a Christmas present, so I will update this review once it is opened and being used", "Date": "December 10, 2013"}, {"Title": "iPad Air", "Author": "Petra E. Pershall", "ReviewID": "RH0NQSVS250M4", "Overall": "2.0", "Content": "I just purchased the iPad Air as a Christmas present for my grandson and so far I have had several problems with it.  I cannot get it to connect to my home Wi-Fi and had to have my business tech person work on it.  It was plugged to charge since before noon yesterday and as of 6 a.m. today, it had only charged 99%.  I have a iPad 2 and an iPad 4.  I wish that I had purchased one of those instead of the Air.  Hopefully, it won't crash on Christmas Day b/c my grandson is only 5 and won't understand why it doesn't work.  He uses my other iPads with no problems.", "Date": "December 23, 2013"}, {"Title": "I tried but wasn't for me", "Author": "Carter \"O.C.\"", "ReviewID": "R3L8JINUOZZDB5", "Overall": "3.0", "Content": "It's not a bad tablet by any means... one of the best BUT i'm slightly annoyed that it doesn't have the features i'm so use to using. My friend got me this as a gift to try to win me over to apple products... I gave it a go but It's just not for me. I decided to stick with my Samsung Galaxy Note 10.1 2014... I love using two screens at once.Pros: Really just the new design although I tend to have issues with the new bezel when holding it, you have no choice but to have one finger on the screen which sometimes causes issues with apps. and its smooth which is greatCons: Not enough features,  and boring. This was cool years ago but with tablets out there that allow multi screen and other amazing stuff...I gave it a go guys, and I really wanted to not be bias in my review. Hopefully you were able to see that. I think if you like the other Ipad's you will be happy with this for sure. If you want a much more amazing experience then i'd say go with the Samsung Galaxy Note 10.1 2014 or even a surface tablet.", "Date": "November 3, 2013"}, {"Title": "Don't worth the money I pay for it", "Author": "Adriana Martinez Rodriguez", "ReviewID": "R36IG33P31B3UA", "Overall": "1.0", "Content": "Really disapointed with only wifi model... I gonna sell it to buy a 3G model. The size is not a big difference between old models", "Date": "May 2, 2014"}, {"Title": "I DID NOT RECEIVE THE IPAD  FROM THIS ORDER", "Author": "Cooks Saw Manufacturing LLC", "ReviewID": "R3NTH85DEDDSB9", "Overall": "1.0", "Content": "I WAITED FOR 4 WEEKS AND THEN , I HAD TO PURCHASE FROM ANOTHER SOURCE.  I was not happy with the way this order was handled.", "Date": "January 20, 2014"}, {"Title": "Product was stolen/fraudulent per tmobile", "Author": "skcrowe", "ReviewID": "R3CFI2FL2ZO85U", "Overall": "1.0", "Content": "I was unable to connect to cellular data after adding the iPad air to my plan.  When I called tmobile to find out why, they checked the iPad's IMEI number and told me that it was blocked due to fraud and I should send it back and get a refund as soon as possible!  I contacted amazon.com's fraud department when I hung up the phone!  I am not happy at all!", "Date": "January 2, 2014"}, {"Title": "So revolutionary they can't even throw in a camera flash.", "Author": "Bubba", "ReviewID": "R258CLLTLZRDAG", "Overall": "1.0", "Content": "Don't believe all the reviews out there saying the ipad Air is the better tablet. Those reviews are biased and only bring up the minor upgrades from the old ipad and base the comparisons off of those few things. And the only two really bad things they had to say about the ipad Air was that it didn't have a fingerprint scanner and it didn't come in gold. The 80's called and they want their gaudy flashy gold bling back.Most of these reviews will only focus on those points and will not mention all the other advantages the Surface 2 has. And for the few reviews that do mention the other features the Surface 2 has, they still favor the ipad because the camera was nicer or more apps. Really?I will use the Surface 2 as comparison because it will show how ridiculous the bias is regardless of capabilities.What the reviews usually leave out or down play.Surface 21. Full office software. Word, Excel, PowerPoint, OneNote.2. Wide screen optimized for wide screen movies. When held in portrait when you are surfing the web for example, you get a a longer list so you don't scroll as much.3. Sd slot. Easy to download or upload data on the fly.4. 3.0 USB so you can easily backup files to a hard drive and not have all your eggs in one basket. Or transfer files with anything that has a USB plug and also charge your phone. Ipad? No, unless you have the adapter and you can't charge your phone.5. Can print to almost every printer.6. Hdmi port7. Flash support so you are not limited browsing the web.8. Built in two position kickstand.9. Thin keyboards that double as covers. Can get them background lit, flat, with real keys, and a new one coming out with built in battery to recharge your Surface at the same time on a charge. Battery in tablet is good already though. Some say that you need to buy a keyboard to make full use of the Surface and adds to the cost. Ridiculous. You do not. It will make life more easier though if you are working on a spreadsheet or word document. With an ipad you don't need one because what use would it be for? Sure there are apps. but they are limited to what you can create or edit. You have to do major creating and editing on a computer first and then hook up the ipad and transfer it.10. Hook up to your t.v. or another monitor and drag an open window to the second screen.11. Do a split screen on the tablet.12. Run multiple tasks at the same time in the background like listening to music, watching a video and doing something else like typing an email or working on an a office document in split screen mode.13. Wirelessly sync with your xbox and play games on your t.v, stream videos, pictures, etc.14. Drag and drop files.15. Can set up individual separate accounts on the tablet and have parental monitoring updates and deciding what child can do on the tablet.Now these are not all the Surface 2 offers. I am finding new things still.The ipad Air is basically the same ipad as before with minor tweaks. It's faster and lighter. Still does the same thing as before, nothing new.ipad Air1. Powerful processor. For doing nothing new. Future fingerprint scanner? Tablet will still only run apps. as before.2. Lighter and thinner is negated by the cases to protect the ipad and without a keyboard.3. Upgraded camera. Put it down, your annoying the people behind your trying to see the wedding or play. Use a real camera.4. No USB or sd slot. Need adapters for just about everything. And with the Surface 2 you can plug the unit in when it is dead and keep on using it and still do things via the sd card or usb cables. On an ipad you can't do both. You either charge it or plug in an adapter to the only port the ipad has do to something. And if it is dead, you have to wait until you charge it first. Also you need to bring all the adapters and keyboard with you vs the Surface 2 of which all you need is the power cable. And the cover/keyboard is so thin it is negligible in bulk and weight. And justifying that the ipad has third party keyboards is not valid. It is a separate bulky keyboard and the ipad does not support mouse functions. You are stuck with third party hardware that is Apple specific whereas with the Surface you can use anything that supports micro SD or USB. And having to buy all these accessories tofor the ipad.will not be cheap. People gripe about the Suface cover/keyboard costs too much. Well to buy a seperate cover for an ipad will cost $40.00 and it will flop around and a non intergrated keypad will cost $100.00 that you have to carry seperatley.5. Having to convert simple files with Apple software a hassle.5. Tons of apps. Android not far behind. And Microsoft growing. How much apps. does one need?6. What good is the Reina display if it isn't widescreen? Picture is actually smaller than 9.7 with the black bars.7. Only compatible with Apple products i.e. cant print unless it is an AirPrint printer or stream to t.v. unless Apple t.v.8. Slightly upgraded camera. Put it away! Your blocking my view! And people with a 4.8 inch phone look ridiculous? At least they are not carrying around the perfect sized iphone for one handed operation along with a 9.6 tablet that takes two hands. Kind of contradicting.The ipad Air has more negatives than positives, so how can it be better? Android tablets have more features even than the ipads. I guess if you want one just for games and apps, then an ipad or a higher end Android tablet might suit your needs. People are not weighing in that the Surface 2 can do more than just play games.Now back to the Surface 2. There was a slight learning curve to understand what all the gestures do. It didn't take long though. Look it up on youtube and you will pick it up real quick along with a lot of tips and tricks of what it is capable of. There different ways to open, close, move, split screen, multitask, etc.The tablet feels a little heavy in the hand if you had to hold it I admit. But the two position kickstand works pretty good on the lap as I didn't think it would. I don't have to have a cover to add to the bulk to double as a kickstand also. And even if I put on one of the super thin keyboards they would add very little weight or bulk and they snap on and off without any hassle.The boot up time takes a little while when completely off, but remember it is opening real office programs. When in sleep mode it opens up quickly.I went several days at a time of casual use and in sleep mode without charging and it still had a charge.The tiles are nice because it is real time data so I can glance at them without opening up an app. for email, weather, etc. On Apple you have a bunch of icons and you have open it up, Android you can use widgets.With a real browser and Flash I can use full websites rather than a mobile version. And also it is a lot easier to open multiple tabs when surfing the internet unlike some tablets where it is a pain to pop back and forth between tabs.As I mentioned above it is nice to have the split screen because my kids can research on the web on one side and write their paper on the other side while listening to music of which they shouldn't be.The only two cons I find on the Surface 2 so far is that the power cord is only about 58 inches long. You have to be really close to an outlet of some sort.And the main con was that the software and backup takes up about 16 gigs so you don't have the full gigs of memory stated. So might have to get an sd card. Yes other tablets you only lose about 2 gigs, but remember they are pretty much entertainment tablets only and can't do what the Surface 2 can do.If you are waiting for a ipad Air Pro to come out. Don't be surprised if it doesn't come with a Retina display, finger print scanner, nice camera, etc. You will have to wait for the Pro S, Pro S1, etc. to get one feature at a time and not several at once. I mean come on, cant even throw in a simple camera flash. The ipads shouldn't even be placed in the categories of tablets that can run Office software. There should be a category for Dumb Tablets that only run apps, a category for Smart Tablets for those that can run fully functioning office software and not just limited mobile versions, and Extreme Tablets for ones that can run full blown Office suites.If your a die hard Apple fan, please back up your arguments with something valid other than ipad rocks or a childish angry comment. Because if you do, it will prove my point.", "Date": "November 5, 2013"}, {"Title": "Don't Waste Your Money!!!", "Author": "G. Johnson \"big hands\"", "ReviewID": "R2U0XPBM19XDPO", "Overall": "1.0", "Content": "I bought this for the cellular to use with Square credit card sales. First of all, it took over six hours just to set up the iPad Air, because it wouldn't receive the information that was being inputed. Very frustrating. After three calls to Apple tech support, we finally got the set up finished and were able to use the unit. Next, we were told that the SIM card from our cellular data provider would work with the iPad Air. It did not. So, my only option was to pay AT&T; or any of the other three providers $50 per month for cellular. That's a rip off. It's no coincidence that all four of the cellular providers available for the iPad Air charge virtually the same high price for coverage. So, the IPad Air is very pricey for a tablet, it's very time consuming to set up, the cellular coverage is very expensive. So, we returned it and got our money back. That was the best decision I made in regards to the Apple iPad Air.", "Date": "December 28, 2013"}, {"Title": "Ordered the wrong one", "Author": "Don from VA", "ReviewID": "R3UR5Z6N0MZDOZ", "Overall": "3.0", "Content": "I got this as a Christmas gift for my wife.  When she opened it and looked at the description she noticed it was a 16G model.  We need at least a 32G model.  I sent it back and will be looking for the 32G model to purchase.  I will review it later.  I rated this model 3-stars simply based on their past history with other iPads (we have an earlier version and we are extremely pleased with it).  If the iPad Air is anything like their other iPads it will be a hit with us and it get a higher rating than 3-stars.", "Date": "December 31, 2013"}, {"Title": "Don't assume you'll like an ipad", "Author": "Philip Walter Bonsell", "ReviewID": "RXBWTZZSD232R", "Overall": "1.0", "Content": "Hello.I just got one of these tablets from Apple. I assumed I'd like their products as I had a high opinion of them as a company. Most of these reviews are full of how great they are and tech data. I'm 52, I'm not dumb, I can work a PC, I've got a BMW, a Bang and Olufsen system, a couple of homes and the rest.Well it's an education; we're all used to be expected to work stuff right out of the box, but if you're an apple novice, if you don't have a smart 'phone (I know that's putting me in a minority but why would I need one when I've been out the workplace for ten years?), if you still use CD's for music and DVD's / blu ray for films, well take my advice and don't bother. A nightmare to set up, impossible to put right if you get it wrong; mines back in the box three hours after delivery and there it will stay. I'll put up with windows instead.For all you guys who want to do loads of stuff, well good luck to you. I just wanted Amazon, Google search and my mail live on a screen next to my seat in the living room and was prepared to spend $500 to have that in a nice package. It didn't deliver, and no I don't want to have to go around to my local Apple store and ask some guy pursuing an alterative lifestyle how to do it. Much easier to make do with the $150 Acer notebook, even if it does need to be on a mains lead most of the time.Farewell Apple; if it had worked I'd have bought a pricey Mac, but that ship's sailed and I'm $2000 ahead.Phil", "Date": "January 6, 2014"}, {"Title": "A joy to use!", "Author": "Sandra E. Pike", "ReviewID": "RYA52UOXQ2C0F", "Overall": "1.0", "Content": "I upgraded from the iPad 2 which was also a wonderful tablet.  The screen is outstanding.  I can hold it for long periods to use for reading as it truly is featherweight!", "Date": "January 18, 2014"}, {"Title": "I hate it.", "Author": "Reader6000", "ReviewID": "RVY0PMKQTVZC9", "Overall": "1.0", "Content": "This is the most over rated product on the market today. Nothing can be done without Itunes. They charge you at every turn. The picture is great but that is all it has going for it.", "Date": "December 20, 2013"}, {"Title": "made for old people", "Author": "the truth", "ReviewID": "R2S9WWPOATJ4SN", "Overall": "2.0", "Content": "I just bought it to try it out.  No � customization.  No sd card slot, sub par camera.... Just overall...... Lacking!!!!", "Date": "November 25, 2013"}, {"Title": "spend the money on a year's books & classes at your local J.C. instead", "Author": "Mike Schmidt", "ReviewID": "R1SQTW5PLP5I3H", "Overall": "2.0", "Content": "These people with the \"perfect,\" 5 star, ratings are hysterical.  This little thing depreciates faster than a falling brick.  It's a tech fad and you're paying about 300% over value  to fit in.  It's like 1975 and lava lamps craze - with a lot more conformist culture and people into it. Except, Lava lamps aren't anti-social and waste your time. Get an iPad - it has that apple logo that makes everybody realize that you're cool now.", "Date": "November 23, 2013"}, {"Title": "Bad taste", "Author": "Jeffrey Funk", "ReviewID": "RXKVUH328JER7", "Overall": "1.0", "Content": "I was stupid and sent this as a gift to a woman that didn't work out ,but am sure she is enjoying it on my dime.", "Date": "March 17, 2014"}, {"Title": "Crap!", "Author": "iPad Air Expert", "ReviewID": "R299FHI9ANQC7R", "Overall": "1.0", "Content": "It won't even turn on. Why is that!  :( ahhhhhhhhh what is going on. And it also didn't come with a charger!", "Date": "November 6, 2013"}, {"Title": ".4 lbs lighter WOW what a pointless device!", "Author": "Deimos \".\"", "ReviewID": "R2JBOFZJ3AG6LC", "Overall": "1.0", "Content": "So you get the same OS, the same capabilities as every other Ipad or slightly \"faster\" and .4 of a pound lighter?  Who the hell in their right mind would buy this pointless device.  If you have any other more capable tablet or any other version of the apple store shackled limited Ipad you do not need this peiece of junk.  If I held this up facing toward you with a first gen Ipad, and an Ipad 2, you would not be able to tell the difference, you know why that is....becasue there is none. Ohhh the new version of IOS has slightly different looking icons....it's still the same locked, limited, crippled Iphone OS on a larger screen.  It's a giant, thinner iphone. A total waste of money, espessially when there are vastly better options available from Microsoft and Android that can outperform this toy any day of the week in features and power.", "Date": "December 9, 2013"}, {"Title": "Lol.", "Author": "Max \"Boston\"", "ReviewID": "R28WHNGRGRKWRU", "Overall": "1.0", "Content": "People are going crazy for an ipad coming out a tiny bit thinner, and a little bit more powerful (because we know that app really requires the mega power). Meanwhile a revolutionary, world changing product like Google Glass is getting very little buzz. Appletards really have their priorities straight, huh?", "Date": "November 4, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00G2ZI8RO"}}