{"Reviews": [{"Author": "Harry D.", "ReviewID": "R3CBWBJJX5174U", "Overall": "1.0", "Content": "Wouldn't work when I got it. Only came on when charger was connected.  The little instruction book was hard to read and the pictures were blurred.", "Title": "Inferior product, I had problem reading the instructions, words are missing ?", "Date": "November 18, 2013"}, {"Author": "Helper", "ReviewID": "R2KI17104PC6QP", "Overall": "5.0", "Content": "best pc tablet I have Found, No problems, all works fast, came fast too this is my on line store it has work good for me the day I bought it thanks I got the tablet at a good price", "Title": "Works Great", "Date": "December 17, 2013"}, {"Author": "casey", "ReviewID": "R1K0NDYF4KZB0N", "Overall": "1.0", "Content": "Everything about this is crap slow glitchy all around junk omg it freezes so much my phone in a dead zone runs faster than this pile", "Title": "Absolute junk I literally sold ours for 30 bux", "Date": "March 25, 2014"}, {"Author": "Knice30", "ReviewID": "R18O4OU2KPEBMO", "Overall": "4.0", "Content": "Well let's see.....First off before I purchase this product, I ask the seller if I could use my 4g clear wireless pin inside the usb hub. The seller said yes. But it was not true.  I had to switch Internet service to a wireless hot spot. So in product discription it said support 3g doogle not true. you would need a hotspot wireless internet. So on good note you can copy files from other devices to put on this tablet. The picture and sound is nice and clear and bright. On bad note The built in camera is s***ty you would need a lamp or bright light near to take a bright clear picture. The internal battery is week don't last long. I always use the ac adapter plug.  If you big on tablets. And know what you need and portability this is not for you. But if your like me new to the whole tablet use this would be a okay choice to start out with.  Overall it's worth the great price!!!!!!!", "Title": "It's ok nothing to shout about lol......", "Date": "December 21, 2013"}, {"Author": "Jonathon Gear", "ReviewID": "R50RA3SQ93TQU", "Overall": "1.0", "Content": "This product was not good at all. First off I paid extra for two day shipping as it was a Christmas gift to my wife and it did not arrive for 4 business days. Amazon was very quick in refunding my shipping costs so I have no Problems there then after my wife opened her gift and started using it. This tablet would shut itself off after a few minutes of use and would not restart. When it did work for a little bit it would drain the battery very fast. It had to be plugged in to use it and it would still shut itself off after a few minutes. Ended Up returning the Product for a refund two days after Christmas!", "Title": "Disapointing", "Date": "December 31, 2013"}, {"Author": "Sharon Jones", "ReviewID": "R15ZTL3VZ3NLI5", "Overall": "5.0", "Content": "Now this notebook is just the right size.You can read the words when you're reading online or just rrading in general i can watch movies listen  to music I had a smaller notebook book i like the size and the quality of this one happy with this.", "Title": "Happy with my notebook", "Date": "April 17, 2014"}, {"Author": "Decerica Smith", "ReviewID": "R23HMCGG6AEUK1", "Overall": "5.0", "Content": "Need to put a warrent on this product in case something happen to it. If there a warrent on this product.", "Title": "Great", "Date": "April 14, 2014"}, {"Author": "Susan Henson", "ReviewID": "R1EY317X0H2AX6", "Overall": "4.0", "Content": "I am really pleased with my Android-price was great-I am still learing to use it-it is so different than a lap top-but I LOVE it--Got a case to on sale---Fits perfect -Andord is light purple-case medium purple leather--got both for $100.00---THANK YOU !!!!!!!!!!!!!", "Title": "9 inch Android-Great price -Great Item", "Date": "April 12, 2014"}, {"Author": "susan powers", "ReviewID": "RD26XAKVD0MNS", "Overall": "1.0", "Content": "It was slow, it barely worked, i was unhappy with it. i returned it. I wouldn't recommend it to anyone.", "Title": "don't recommend", "Date": "March 31, 2014"}, {"Author": "Martha Cobb", "ReviewID": "R224JVJDP3HSRS", "Overall": "1.0", "Content": "This tablet worked great for what I used it for, but sad to say I received it on 12/21/2013 and now it will not charge.  Were you plug in the charger there is nothing there for the charger to plug into, looks like it is pushed in to far.  Hope I can get it fixed....if not will need to get it replace.  But don't buy this one again!!!", "Title": "short lived", "Date": "March 29, 2014"}, {"Author": "Roberto", "ReviewID": "R1KWOSCE7KJ6U7", "Overall": "1.0", "Content": "I would expected because its a cheap tablet the resolution its terrible. Its to slow and wont play the apps right . don't buy it", "Title": "cheap", "Date": "March 23, 2014"}, {"Author": "robert sanborn", "ReviewID": "R3QYEH3PI8JX95", "Overall": "3.0", "Content": "the tablet is ok but thought camera would be better and its a little slow to load but all in all its prity good", "Title": "it was ok", "Date": "March 22, 2014"}, {"Author": "Helene R. Merrion", "ReviewID": "R120LBSJMR46A9", "Overall": "1.0", "Content": "I bought this item and then returned it.  The Wi-Fi is very weak.  Also the instruction booklet had very poor interpretation to English.", "Title": "do not recommend", "Date": "February 25, 2014"}, {"Author": "Julisa R.", "ReviewID": "R1R6AQRQKI43NY", "Overall": "1.0", "Content": "When I got the product, the box seemed to have been wet. When I opened the box, the tablet was scratched. I didn't bother turning it on, so I really don't know how it works. But I am disappointed the the product was sold to me in that condition. I was able to return it to Amazon and got a refund for the tablet and the shipping cost.", "Title": "Not good product.", "Date": "January 26, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00GCSKYNM", "Features": null, "ImgURL": null, "Name": null}}