{"Reviews": [{"Title": "Stay away!!!", "Author": "Amazon Customer", "ReviewID": "R8NLLA597O0CA", "Overall": "1.0", "Content": "Bought this for our daughter for Christmas and it is a pile of garbage. Recently getting a Nexus 7 may be influencing this review, but the Visual Land tablet is very, very, very, very slow. Another issue is the speaker makes noises even when the volume is off. Going to return it for sure and buy a better quality tablet. Oh yeah, did I mention that it was very slow?", "Date": "December 13, 2013"}, {"Title": "Very dissatisfied", "Author": "H. R. Scanlan \"H-Bomb\"", "ReviewID": "R2SLZSEXER8SI7", "Overall": "2.0", "Content": "Very, very slow. I only had it for 24 hours, you get what you pay for and I returned it. Constantly froze up and aps closed. Spend more and get the Kindle Fire.", "Date": "December 5, 2013"}, {"Title": "FOR CHILDREN ONLY!", "Author": "Alexia Maniagult", "ReviewID": "RD8T1D8ZMRA70", "Overall": "5.0", "Content": "I bought 2 of these tablets for my 5 year old and 3 year old and they are perfect for them.. I would never thnk that a $60 tablet would satisfy the needs of an adult. note this tablet is perfect for a child that dosent need a $300 or even a $100...", "Date": "February 19, 2014"}, {"Title": "It's great! But........", "Author": "Crystal Ravyl", "ReviewID": "R3895AKT4T1J0G", "Overall": "4.0", "Content": "This is a great starter tablet! I'm able to do the things I need to do, and access the internet at a great speed........The only problem I have is that there is only a front facing camera (bummer)", "Date": "December 4, 2013"}, {"Title": "EXCELLENT FOR CHILDREN", "Author": "yormary lujano", "ReviewID": "R12SIHBJFR1FX6", "Overall": "5.0", "Content": "I reccomend the tablet For the child, is excellent. He have 9 year and he is  very happy. very good.", "Date": "December 31, 2013"}, {"Title": "my visual land tablet", "Author": "Paula Alexander", "ReviewID": "R3JX1UWD40MGN7", "Overall": "4.0", "Content": "I like my tablet! The size is so convenient for me. Works great. I  purchased 1 for my husband too. He is enjoying his also.", "Date": "December 30, 2013"}, {"Title": "not the best", "Author": "thebeast2611", "ReviewID": "R18IX8JGJCN6PB", "Overall": "3.0", "Content": "This is not the best tablet I've tried for one its slow but other than that it works  for me", "Date": "December 7, 2013"}, {"Title": "Camera not so good.", "Author": "Allison Carey", "ReviewID": "RVXSKDFZBER6F", "Overall": "3.0", "Content": "The overall product is okay, the photo sucks though. It does not line up with your face very well and the image is poor. I love the google play on it and I like how you can change your background wallpaper on it to fit any personal style.", "Date": "May 27, 2014"}, {"Title": "returned.", "Author": "Edward Eck", "ReviewID": "R27NLORV57NU2U", "Overall": "1.0", "Content": "Misleading claims. No HDMI port despite mfg's claims in manual and advertisements, makes unit useless. Returned for replacement. Don't bother.", "Date": "April 11, 2014"}, {"Title": "Should not be on the market!!", "Author": "Jean-Marie Deschamps", "ReviewID": "R2LVUD4Q690EVL", "Overall": "1.0", "Content": "I was looking for a low cost tablet to use with my home sound system. So my need was just to install and use Google Play, Pandora and a Radio streaming apps. Nothing else!! So based on product characteristics and reviews I decided to by this Visual Land Prestige 7G tablet ... my needs being so low I thought I will make it. I was wrong. This tablet is so slow it is not viable and usable. It should not been sold on the market. You click on an icon and you have to wait almost 5 second before the application open and wait another 5 second before it's ready to use. It can not stream music continuously without interruption. Nothing else was running on the tablet. I though it was my WiFi network. So I put the tablet close to the access point and it was the same. I tried with the other Android Smartphone and Tablet in the house and the streaming was working fine. I had to return the product and by the way it was not so easy. TigerDirect is not fully integrated with Amazon and you don't get the same level of service than want buying direct with Amazon, something I will watch in the future. As a replacement I bought a Toshiba Excite 7c. It is $30 more but works perfectly. This one can be use as an entry tablet.", "Date": "March 16, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00GKKI1U0"}}