{"Reviews": [{"Author": "Hapsmom", "ReviewID": "RYUB960Y1TXU7", "Overall": "4.0", "Content": "Really nice Tablet, after installation of Windows 8 memory ???????.  Have issues everytime I attempt to log into the apps you have to put in too much info, but still nice tablet, will update as necessary.", "Title": "ENCORE TOSHIBA 8.1", "Date": "May 30, 2014"}, {"Author": "David Sandbeck \"hallgrd\"", "ReviewID": "R26SSEARGGAKZ3", "Overall": "5.0", "Content": "Eight inches is the right size for a screen because it more portable and the larger screens get to be cumbersome to use on the go. Something special about the tablet is the micro HDMI port. I  have an adapter to connect it to regular HDMI so I can connect it to a larger screen when I choose. Windows 8 is a robust platform designed for touch screens like this tablet. I prefur it because sites don't recognize it as a smart phone like it will for an Apple or Android. So my tablet can play my Sirius satellite radio online without paying extra monthly for a phone app to listen. I can also use sling player for my sling box without paying for the app like you do for a android, Fire or apple devise. I can give more examples but you can spot the trend as to why windows 8 tablet is a compelling value. My first tablet of this type was used, and I was unable to unlock it from the previous user. The security is very good on this and had to replace it for a new device. Amazon warehouse deals went above and beyond to  make it right. The power of Windows on the portability of a tablet for only two hundred bucks. Awesome!", "Title": "Compelling value for your computing dollar.", "Date": "May 28, 2014"}, {"Author": "Heather", "ReviewID": "R2W5FIYQLBRXBT", "Overall": "4.0", "Content": "this s my 2nd tablet my other one is ipad2 for 2011. The Encore looks more like a netbook replacement. It feels well balanced and is easy to hold. There are not many games on win8 store compared to ipad apps. Lake of hard disk space makes it hard to load a larg game. It was really smart of them to give this Office. It was worth getting a mouse for me because my fingers are big what is huge advantage compared to ipads. Battery has been working well, but takes a long time to charge if fully depleted.If you wants a mobile game platform look at an Ipad device. if you want a fully functional browser and office then this is better.", "Title": "2nd tablet", "Date": "May 18, 2014"}, {"Author": "Gary P. Goersch", "ReviewID": "R1Z3I37YWCNI16", "Overall": "4.0", "Content": "Learning Windows 8.1 when you have no prior experience is a pain but the tablet works like a champ.  Great Buy.", "Title": "Takes some getting used to", "Date": "May 17, 2014"}, {"Author": "Thomas E. Mattice", "ReviewID": "R2UR8YKSHJWI5C", "Overall": "5.0", "Content": "The Toshibas Encore WT8-A32 8\" 32 GB Tablet is a great little computer with the Windows 8.1 OS and is compatible with my other computers when making up documents, as you can save them to the cloud and then retrieve them on another computer. Very easy to use and I like it a lot better than the Androids. For me it is also fast enough for games and other apps that are compatible with Windows 8.1. It is a great little system and I carry it with me everywhere.", "Title": "Treffic little machine and easy to use.", "Date": "May 7, 2014"}, {"Author": "richard adams", "ReviewID": "R38YFDS57W95C", "Overall": "5.0", "Content": "I love the ease that this tablet synced with all the rest of my equipment. The storage capacity is very impressive.", "Title": "great deal", "Date": "May 3, 2014"}, {"Author": "Freddry Wallace", "ReviewID": "R2166LRGWO0BOO", "Overall": "4.0", "Content": "Tablet is great. Even for Casual Games, like starcraft 2, WOW, DOTA 2, Skyrim!!!!!!, I did run them in mid to low settings and played very well.Sound is average (normal) and if you have a headset-headphones it is much better.Apps  run fine and the behavior-performance is very good after a long termOnly lacks the battery life which is about 7 hours.", "Title": "Very good tablet. Only lacks the battery life", "Date": "April 29, 2014"}, {"Author": "James", "ReviewID": "R2M9MHD3NW5RY1", "Overall": "5.0", "Content": "I researched tablets for a short while and ended up with this model and am very pleased that I did.I added a 32 gb Micro SD card, A USB to Mini adapter, and a 15' HDMI to Mini-HDMI cable and a cover and called it a day. I can surf the web, do email, photos - everything on my TV. The product does what it says, and plays a ton of games, too!I am very pleased with this device. I will say that for the first few days it needed several updates and restarts but once it caught up with Microsoft & Toshiba's updates ...it just works, and works great!", "Title": "Encore ROCKS!", "Date": "April 28, 2014"}, {"Author": "K. FRYE", "ReviewID": "R29NDD44YNFAPD", "Overall": "4.0", "Content": "How exciting to own a tablet.  Now, no more popping up from the den to desktop to check on something on the Internet.  Only drawback is keyboard covers up some input lines, but that is remedied by purchasing a bluetooth keyboard or using smaller onscreen keyboard app.", "Title": "Toshiba Encore", "Date": "April 26, 2014"}, {"Author": "Brandon Trost", "ReviewID": "R2GR1R82UK6HKB", "Overall": "4.0", "Content": "Nicely built, actually build quality is as good as on an Ipad. Unlike some reviews, it is actually not that heavy, and as for one handed use, no you can't really use it with one hand, but who wants to? All tablets for windows 8 will be best in portrait mode, because the OS is designed around portrait mode. It is really a nice tablet, that can do basically anything. If you buy a keyboard case (just search Bluetooth 8 inch tablet keyboard and you will find some good ones), it works very nicely in the regular desktop mode. Actually, I am typing this review on the tablet right now. The only reason I will not give 5 stars in a few minor crashes, and a lack of apps for touchscreens.", "Title": "Solid tablet", "Date": "April 23, 2014"}], "ProductInfo": {"Price": "$329.99", "ProductID": "B00G1YKHHA", "Features": "Windows 8.1, 8.0-inch 1280x800 IPS Display, 5-Point Multitouch\nIntel Atom Z3740 Quad-Core 1.86 GHz Processor, 32 GB\nAmbient Light Sensor, Gyroscope, 3-axis Accelerometer, Haptics, Digital Compass, GPS", "ImgURL": "http://ecx.images-amazon.com/images/I/41qiIy2KQpL._SX300_.jpg", "Name": "Toshiba Encore WT8-A32 8-Inch 32 GB Tablet"}}