{"Reviews": [{"Title": "Great buy!!", "Author": "Alejandra", "ReviewID": "RVKL16NHU1EO2", "Overall": "5.0", "Content": "I like everything about this tablet. I am a really big Android fan. This tablet is a great price you can't really beat and worth every penny. This is very fast and you can I connect it to my TV all the time to watch movies from the mini HDMI port.", "Date": "January 27, 2014"}, {"Title": "Just As Advertised", "Author": "Deborah A. Seaward", "ReviewID": "R1ALZUUENTSS9V", "Overall": "5.0", "Content": "Works for me. Has everything it said it had and works just fine for what I wanted it for. I would recommend this item.", "Date": "March 11, 2014"}, {"Title": "Luv it", "Author": "James Sommer", "ReviewID": "R2522VTSPYIUME", "Overall": "5.0", "Content": "Am enjoying it.  Look forward to getting everything set up on it.  Hope to take on trips for easy accessibility.", "Date": "February 3, 2014"}, {"Title": "OK FOR THE MONEY", "Author": "seeB", "ReviewID": "R2RTDRV4PY14QM", "Overall": "3.0", "Content": "First of all, I only paid $78 with free shipping for this somewhat disappointing tablet.  But at that price, I feel its a keeper.  Display quality, touch accuracy, software compatibility, and physical construction are only average.  At times a lock-up will occur, and there is a learning curve.  But I feel that with a little patience, the user can learn how to get the best use out of the device.  The SVP is fine for watching vids and listening to music in bed.  And I feel that there is a niche for this budget priced device...  Its bigger and nicer to use than the average smart phone and if something bed happens to it while traveling, camping, etc. its no big loss.  My advice is to take a chance on this item, especially if the price remains so attractive.Helpful Hint:  When lock-ups and other glitches occur, just do a restart while remembering that this isnt a $400-$600 device.Good luck and I hope this helps!", "Date": "May 25, 2014"}, {"Title": "Crashed on the 3rd day", "Author": "patrick in Michigan", "ReviewID": "R118KOBGDYOFTM", "Overall": "1.0", "Content": "I got this as a gift from my wife and on the third day, it crashed. At first, only the Android logo would show and then after a while, only the SVP logo.  I tried the \"reset\" myself and it didn't work.  I tried calling SVP and got a VM.  someone did answer my email but only told me to try to reset it.  It's going back to Amazon tomorrow.", "Date": "February 27, 2014"}, {"Title": "good tablet, works as advertised", "Author": "Dmesh", "ReviewID": "R3Q5JKO9G8MVNQ", "Overall": "5.0", "Content": "i gave it 5 stars because i dont expect it to do what a $600 tablet can do.  it does everything you could expect from a bargain tablet and more.-plays video from and sd card-you can browse the web, check email, and watch youtube-google play works fine, need to get an old version of netflix though because android jelly bean and netflix arent getting along, not this tablets fault though, lol.-screen picture quality is good-touchscreen is sensitive-has hdmi so you can hook it up to the tva square trade insurance, 1 year for $20, and now i dont have to worry about anything happening to it.  square trade fixes, replaces, or sends you a nice sized check", "Date": "June 7, 2014"}, {"Title": "bought as a present", "Author": "anne brabant", "ReviewID": "RRSC16TD03NZT", "Overall": "5.0", "Content": "love it she is happy just bought case to go with it .......so yes happy with price size purchase etc ......", "Date": "March 4, 2014"}, {"Title": "perfect", "Author": "terry elkington", "ReviewID": "RN94MNEZ3IY74", "Overall": "5.0", "Content": "easy to use, the shipper was great highly recommended for anyone, nice screen fast response just like the description no complaints", "Date": "June 7, 2014"}, {"Title": "has been a lemon", "Author": "ann allen", "ReviewID": "R1BKKUG0ROE4MK", "Overall": "1.0", "Content": "It has been a lemon.  Cuts off when in use have to reset it.  Now it cuts off wifi when in use .  Did a factory reset and still loses internet connection.  Very unhappy with it.", "Date": "March 12, 2014"}, {"Title": "ok", "Author": "Evelio", "ReviewID": "R25XNGKNG0M8IV", "Overall": "5.0", "Content": "Here are some tips for writing great reviews: • Do explain why you liked or disliked it.• Do compare to similar products or services and share how long you've used this product.• Do identify specific attributes (e.g. comfort & fit of a shirt or the battery life of a camera) and whether they met your expectations", "Date": "June 2, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00GP5IMY0"}}