{"Reviews": [{"Author": "Paul Cooper", "ReviewID": "R2FDJMJB4GWQM2", "Overall": "3.0", "Content": "[YIKES! Five minutes after I left the review below; the screen went black and I am researching ways to try to reboot or wake it up. The provided instructions are very generic. I cannot see any way to remove the battery.* UPDATE: I finally managed to get it to reboot only to discover the battery had apparently discharged to zero while hooked up to USB. I am trying to determine whether a cause can be discovered or whether I need to return this item. Hooked up to USB again it is slowly charging back up.* UPDATE2: The battery does not appear replaceable. According to the built in graph the battery had been discharging 10 hr on battery power before it went dead which means it never started charging again when I plugged it back in. The only notification I got was the USB disconnect noise from the computer when the unit died. It was a hassle getting it to charge again but it is now fully charged and staying there. I have installed an app to hopefully take action before the charge ever drops that low again. If the unit tried to give me an alert it is possible that Perk might have squelched it as Perk pretty much takes over when it is running. The extra trouble is disappointing but I still like this unit and will continue to put it through its paces through the rest of the return period and keep it if possible.* UPDATE3: It ran perfectly under heavy use for more than another week but then crashed again to zero battery. This time the on-board graph missed the discharge as did the apps that I installed to alert me of low battery. The apps performed perfectly during intentional battery drainage tests but when it crashed this time nothing showed even in their history tracking. I am afraid there is something defective in the circuits or hardware of the unit I received so I had to return it.]*** original review ***Being an unrecognized brand makes it difficult to search for product specific information or advice so I am tossing my two cents into the review section. I have only had this a few days but so far I am pleased with the purchase. The pictures showed the phone in both black and white. FWIW mine arrived White (and shipped fast).Data transfer speed does not bother me because I usually use WIFI and only enable data on the road to bring up address coordinates. After finally remembering to add an APN for Airvoice [an MVNO on the AT&T; network] my data speed tested out at 110kbps [up to .05 MBps on a subsequent test] which is obviously too slow to stream anything. The 3G speed mentioned in the description is for CDMA but Airvoice uses the AT&T; GSM network which this phone (and most other phablets I looked at) may support only 2g/basic speed. I did not encounter the screen shivering mentioned in a prior review.One feature I was not aware of is that as a cost saving measure some phones do not register a stable MAC address but rather generate a random one with every reboot or WIFI connection. I had to turn off my router MAC address filtering which removes one layer of protection on my home network. It is possible to spoof a stable MAC address but my limited research indicates you need root which I have not done yet.Most of the features on this phone I found to range from good enough to better than I expected for the price. It only took a few applications before I was robbing the TF/SD card from my old phone to make room for more but I tend to be a space hog with the applications I use. It has no charging indicator which is an irritation I need to tweak the display to accommodate. Bluetooth connected to my ear piece with no issue so I did not bother trying the provided head phones.I selected this phone because the other phones my search brought up in this price range had less resolution or did not mention the resolution. I am happy with the resolution of the screen but the field of vision is more narrow than my other phones. It is best when facing directly but it is wide enough to run the phone pointing forward from the middle of the dashboard to use as a dash cam while still being able to view and follow the GPS from the driver seat angle. It also seems less bright than my prior phones which could be affected by the greater size.The phone shipped with a screen protector but it was not yet installed on the phone which dooms a klutz like me to a phone life of bubbles on the screen when that happens. I have not tested the battery life fully because I usually remember to plug the charger in but so far it seems to range from unimpressive to adequate. At night I leave it running Perk TV which it seems to do as well or better than the Hydro I purchased specifically for this purpose.Most of my issues were more on the order of adapting to the OS which was new to me. The description mentions a couple different versions but mine shipped with Jelly Bean 4.2.2. Page transitions have have a ghostly flicker of the prior page which makes them seem jerky to me so I am not sure if that is a function of the OS or the phone.I was surprised to find Google has downgraded Maps in Jelly Bean including removing the layers which put me in a panic because I have many hours invested in \"My Maps\" and depend on that functionality. I was able to side-load the old version of Maps and Navigation thanks to the good folks at XDA which was scary to me but seemed to go rather well and work flawlessly. Just to be safe I also extracted and converted My Maps to a format I could load into Maxfactor Navigation so I am not lost when/if Google continues on its path to fully remove support for My Maps.Coming from Gingerbread & ICS I keep taking unintended screen-shots while looking for the menu but that is another one I cannot blame on the phone.", "Title": "So far so good? (spoke too soon)", "Date": "May 12, 2014"}, {"Author": "MJ \"MJ\"", "ReviewID": "R1SK3D6A0PEPL3", "Overall": "5.0", "Content": "Seller is really great and quick! Also responds quick to issues! tablet is fast,makes phone calls, long battery life (like nexus 7 kind of) google market is on it, but not play services so things like integration w google maps doesnt work completely. it still get 5 stars tho because its just fly to call with an 7 inch phone. bigger is better i can finally see everything!Seller is really great and quick! Also responds quick to issues! tablet is fast,makes phone calls, long battery life (like nexus 7 kind of) google market is on it, but not play services so things like integration w google maps doesnt work completely. it still get 5 stars tho because its just fly to call with an 7 inch phone. bigger is better i can finally see everything!", "Title": "nice and stable looks very good", "Date": "March 2, 2014"}, {"Author": "julisa", "ReviewID": "R3S77P2CO7X9PN", "Overall": "5.0", "Content": "This product was shipped fast an on time went for two day shipping this tablet is a cell phone slash computer you can type it comes with a special pen to type on keyboard yes you can get internet though prepaid chip or contract don't matter . This tablet will surprise you won't be upset its like a iPhone king it has android 3 slots for sim card an micro USB to save pic I thought this was good to be true for the price but it proved me wrong . It also comes with headphones which has to have a speaker on the headphones if you dail a number kinda low to hear because headphones are recommended . The headphones that came with this doesn't work for some reason buying your own will solve the problem. Overall experience 5star this knocks out the small I phones out their same thing but a 7 inch bigger is betterbetter you can take this tablet anywhere you go.  This is a must have awesome for adults that's need things stored like pics notes wow this tablet sweep me off my feet I'm beaver going back to a tiny phone again . Recommend to anyone fun attractive an yes people will be hat in this tablet came out march 6 of 2014 so yes brand new Lamar package was very well. Go get this tablet nothing to hesitate about only a few left I'm one of the lucky one may yourself be one to.", "Title": "omg", "Date": "April 9, 2014"}, {"Author": "Jason S.", "ReviewID": "R1LD697SJ8M925", "Overall": "3.0", "Content": "Shipment was great , love the accessories that come with it, my only problem is when using the sim card for dat Connection or simply mAking a call the screen shivers..", "Title": "average", "Date": "April 14, 2014"}], "ProductInfo": {"Price": "$99.90", "ProductID": "B00GPPX2MW", "Features": "dual core mtk6572 solution 512m memory\nOperating System: Android 4.1 ; Supports Flash, Wifi, and videos\nual Core -With twice the processor, this tablet is much faster than our previous version\nSupports Google Play Store, Skype, Netflix, YouTube, and more!", "ImgURL": "http://ecx.images-amazon.com/images/I/41kD8zedMKL._SY300_.jpg", "Name": "Amar® 7 inch dual core 3G Tablet pc Support 2G 3G Sim card slot Phone call GPS WiFi FM tablet pc 7 Inch 3G Phone Call Tablet MTK6572 Dual Core 1.2GHz Android 4.2 Sim slot Dual Camera GPS Bluetooth 512MB/4G"}}