{"Reviews": [{"Title": "nice tablet", "Author": "james w.", "ReviewID": "R2P3G2WNNJ2HFO", "Overall": "5.0", "Content": "Don't let the price fool you. This same tablet is being sold elsewhere for a lot more money. I have tried other more expensive tablets and this blows them away. The quad-core is lightening fast. The tablet is so responsive, and I am able to do everything I want with it.The HD quality is excellent, the 5MP HD camera is super clear, the battery life is about 7-8 hours depending on what you are doing with it. The size is perfect, and is not heavy. It fits in your hands nicely. It looks elegant and professional.If you want an excellent operating, great looking tablet at an unbelievable price, I couldn't recommend the ZTO 9.7\" enough.It so deserves the 5 stars and more.", "Date": "December 9, 2013"}, {"Title": "great bargin", "Author": "LiJian", "ReviewID": "RSUTPPLTZZMKM", "Overall": "5.0", "Content": "For $229.00 this was an amazing buy. I LOVE the size. The 7\" is just a bit too small for my eyesight. This 9.7\" ZTO  just feels right. I have the ipad and I like it, but I don't care for the size. Too big for my purse. My 14 year old sort of took it over anyway! So, I wanted something just for me and I didn't want to spend a fortune. And I wanted it to be lightweight. I like the sides, because if there isn't a big enough side it's too easy to hit stuff on the touch screen you don't want to. I originally thought I wouldn't like it because it didn't have flash. Then I learned that adobe quit supporting flash on all mobile devices, and any android after I believe 4.0 won't have a flash made for it. I learned that basically most websites are using things other than flash due to their decision not to support it. If you have an older device you probably already have it Flash - after Anddroid 2.2 I believe - but it will no longer be updated or supported. I go to a Weight wtchrs site and wanted to do the recipe builder but it said my device didn't support flash. All I did was download Firefox from Android market and then I went to the adobe website and downloaded the last archived flash for android app (you won't find it on Google play). I was then able to use that function when on Firefox. Other than that I have not gotten the annoying 'flash' message on the android browser or on chrome. The camera on the back is pretty good, not great in low light but not bad. Keep in mind it cost $229.00 and you get a 5 mp camera with it, that's pretty amazing. I don't do Skype, and don't really have a use for the front camera, so I can't comment on how good that is. This also has face recognition for unlocking, if you want to use it. It is fast and fun to use. The 'negatives' are the sound - not so loud, but I'm ok with that for the price. The screen is quite as crisp or bright as the Ipad. I haven't tried the HDMI out yet, gotta get a mini hdmi cable. So I can't comment on that yet. The battery life has been pretty decent too, not as awe-inspiring as the ipad...but again, the price. I have a wifi that I use for this when we go to our camper. It's an at&t; wifi, and something odd did happen when trying to access the internet. When my son was on the ipad surfing the web, and I was as well, the touch screen acted goofy. Some links just couldn't be clicked on. But once he got off his ipad, it worked fine. So, I think it must have something to do with the wifi strength or something...just really odd. They both work great together on our home cable wifi. I'm happy with it and so far so good. Cannot yet speak to it's longevity, but hopefully it will last a few years. Good luck on your tablet shopping!", "Date": "December 9, 2013"}, {"Title": "iPad killer!", "Author": "adams", "ReviewID": "R3IOFB9Y0L82R9", "Overall": "5.0", "Content": "The ZTO 9.7\" is a fantastic tablet. Just what I need. Thinner and lighter than my sadly broken iPad 3, but now that I have had a chance to really use it, I think I probably would have upgraded even if I didn't break my last iPad. The deal makers are the new and lighter design and the the Dual-core 1.8Ghz chip that will pave the way for better applications and performance. No touch ID which is ok because I don't like having a pass code on my iPad anyways where on the 5S it is greatly appreciated. Same fantastic resolution as its past 2 models but now has better power to push them all. Gaming and productivity apps look and feel great and I can use them to do everything I need. For the half price of an iPad, I highly recommand this product to everyone.", "Date": "December 5, 2013"}, {"Title": "really bad customer service from (Triple AAA)", "Author": "gerald meyer", "ReviewID": "RGO62YACHUFGG", "Overall": "3.0", "Content": "Unit received defective ! Returned the next day and was charged a restocking fee of 20%. Thank heavens for Amazon's satisfaction guarantee. Amazon backed up the sale completely.The unit looked fine,if it had worked I would still have it.Be very careful if you purchase from (Triple AAA)", "Date": "April 4, 2014"}, {"Title": "Son loves it", "Author": "joe knab", "ReviewID": "R3QQ7DDNLYVUDO", "Overall": "4.0", "Content": "Got this as a present for my son, he hasn't put it down since Christmas. Very light, compact, takes real good pix's", "Date": "January 13, 2014"}, {"Title": "Truth", "Author": "Greg", "ReviewID": "RG70BDGHPO040", "Overall": "3.0", "Content": "AnTuTu benchmark 18413 (Below Nexus 10, about equivalent to Galaxy S3). Feels like Nexus 7 rev 1 - perhaps a bit snappier.Rootable (it has root for \"adb shell\" - but you must manually copy a new binary from SuperUser app from Play Store after adb remount - \"cp /data/data/*superuser*/files/su /system/xbin/su\" to actually do anything GUI-useful with that root access.Worst issue for me - does not charge via USB connection and requires YASCUC (Yet Another Stupid Custom USB Charger).Roughly iPad 1 equivalent in performance & weight (certainly not iPad 3 like - nor 2 like). It jitters a bit and is slow to boot.You'll never get a ROM upgrade... ever. I can't even find ZTO on the web.Otherwise... it's fine. You get what you pay for. Battery life is decent.", "Date": "January 10, 2014"}, {"Title": "This is a piece of junk", "Author": "Greenman", "ReviewID": "R1E7PJILFXDNH", "Overall": "1.0", "Content": "I brought this tablet based on untrue reviews at $220 solely as an book reader. It constantly crashed but most frustrated was it's battery that drained 1 percent per minute even no app was running. They offered 20 percent off when I requested return but I refused as it was useless. It ended up paying $44 restock fee plus shipping expense of $15, a total of almost $60 penalty for just using it for 2 days. So do read carefully the return policy and prepare to take a big loss if you need to return the junk - totally not on your fault at all.", "Date": "February 16, 2014"}, {"Title": "False advertisement.", "Author": "Opualapuye Inko-Tariah", "ReviewID": "R2NEWSKV6T2JPX", "Overall": "1.0", "Content": "The device is okay for the price. Mine came with flash so I can watch videos and view media content on files. However, it does not charge on USB contrary to the literature that came with the tablet, and ZTO customer service never responds to any communication. All they want is to sell their product and let you deal with whatever disappointment or misrepresentation you discover. Very dismal and unfortunate marketing strategy.This is my update. This device is a piece of trash. It crashes more than it works. All the adverts are false and the reviews are streets away from the truth. Maybe the reviews were by the sellers or their associates. It will be a total waste of money to spend a dime on this junk called tablet. The WiFi cuts off on you, the device crashes frequently, customer service would not respond to you, everything is just wrong. Before you buy this or other ZTO products, try calling their customer service to have first hand experience. If the device worked as advertised, people would not even need customer service. Buyer beware.", "Date": "February 8, 2014"}, {"Title": "not worth a dime", "Author": "redhotsewer...", "ReviewID": "R1UMRHUF9I1TET", "Overall": "1.0", "Content": "It didn't work...would not stay connected to the internet unless I was right next to my wifi......looked great but useless!", "Date": "January 22, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Android 4.2.2 OS Jelly Bean, Rockchip RK3188 1.8 GHz Quad-Core Processor; 2GB DDR, 16GB HDD\nZTO 9.7-inch Super HD Retina Display 2048*1536, 4:3 high pixel density 320 dpi, and perfect color accuracy for vivid, lifelike images that go beyond HD, 10-point high sensitive G+G touch panel\nWi-Fi (802.11a/b/g/n); 0.3 MP front facing camera, 5.0MP rear camera\nBluetooth, HDMI output, OTG support\nAverage 10 hours battery life", "Name": "ZTO Tablet PC - Multi-Touch Screen, Android 4.2 Jelly Bean Bluetooth, 1.8GHz quad-core Rockchip RK3188, 2GB RAM, 2048*1536, 4:3 high pixel density 320 dpi, HDMI, Wifi", "ImgURL": "http://ecx.images-amazon.com/images/I/51SRhKP%2BlfL._SY300_.jpg", "ProductID": "B00GRWRUKI"}}