{"Reviews": [], "ProductInfo": {"Price": "$1,999.99", "Features": "The Most Powerful Tablet In The World The Razer Edge Pro is the world's first tablet designed for PC gamers. Powered by Intel Core processors and NVIDIA GeForce graphics powering a 10.1\" high definition multi-touch display, and a rugged high-speed solid state drive that screams incredible performance in a portable form-factor.\nRuns All PC Games and Applications: The Razer Edge Pro is more than just a tablet, it's a full-fledged mobile gaming PC, ready to play all of your favorite games and applications. With Windows 8, gamers will have access to the largest library of games in the world, so you're not waiting on the most popular games and software.\nTablet Mode: The Razer Edge Pro is a full functioning Windows 8 tablet with the performance to run hardcore touch screen games and applications. PC Mode: The Docking Station (sold separately) for the Razer Edge connects you to a desktop display with peripherals for a full PC experience.\nMobile Console Mode: The Gamepad Controller (sold separately) for the Razer Edge makes it the only tablet in the world that allows for console style gaming on the go with full PC game support, immersive vibration-feedback and direct reflective acoustics. Home Console Mode: The Docking Station (sold separately) mode for the Razer? Edge connects to the big screen with multiple gamepad controllers for a home console experience.\nThe new Razer Edge Pro features Intel's 3rd generation Intel Core i7 processor, ensuring your games and media playback run with the most powerful processing performance you'll ever experience on a tablet. NVIDIA GeForce GTX Series Graphics The Razer Edge Pro also features NVIDIA GeForce Series graphics with Optimus technology, so you can play games the way they were meant to be played.", "Name": "Razer Edge Pro High Performance Gaming Tablet Dedicated Graphic Card Windows 8 Core i7 8GB 128GB 10.1 Inch IPS FREE 1 Year Kaspersky Internet Security (1-User) download", "ImgURL": "http://ecx.images-amazon.com/images/I/51nDugu2T8L._SX300_.jpg", "ProductID": "B00GZ88ZA8"}}