{"Reviews": [{"Author": "Courtney", "ReviewID": "RKV5RTR74QE0B", "Overall": "5.0", "Content": "I upgraded to the iPad Air from the iPad 1 and am very happy.  Very fast, great resolution, and easy to use.", "Title": "Great step up", "Date": "February 24, 2014"}, {"Author": "Christina", "ReviewID": "R102X9SL24TEDW", "Overall": "4.0", "Content": "Apple doesn't have a Swype app that works with all applications. If you have any android apps with Swype, then hen pecking will drive you nuts. Unless of course you want to add more money and buy a key board. too bad apple doesn't get with the program  here. people need to be efficient.", "Title": "would be five", "Date": "February 20, 2014"}, {"Author": "Christopher Ralph", "ReviewID": "R2U030Z2K3HBBC", "Overall": "3.0", "Content": "I give this 3 stars because of my packaging. I did not get the Lightning to USB Cable, instead i received the 30-pin. My Ipadair", "Title": "The Ipad Air is Good My packaging was BAD", "Date": "February 13, 2014"}, {"Author": "Ann de Vries", "ReviewID": "R3T5D991D644IF", "Overall": "5.0", "Content": "I bought my 128GB iPad Air with 3G  and had trouble using it because my husband couldn't keep his hands off it. He loved it so much that we got one for him. We bought the Apple cases for both of them and my husband bought the stylus, as well.We  are both very pleased with these tablets. My husband has a neurological condition and the accessibility features and stylus have been wonderful for him. He stopped using his laptop for portability, because the iPad Air does everything he wants. We were afraid it would be too heavy for him to hold, but he has found it to be lightweight and comfortable, and it does weigh less than earlier iPads. Anyone with vision and fine motor skills problems is almost certain to love the iPad Air, especially when combined with the stylus.I dropped my iPad twice when in parking lots, both times from low heights, but on hard surfaces. The case protected it and I have had no problems resulting from the drops.We use our iPad Airs primarily for reading Kindle books. Our joint account has a huge archive and our other devices were not handling it. The K4iPad app and this unit work beautifully together and we have had no problems accessing our books. This iPad is powerful.We were worried about how comfortable it would be to read for long periods because we kept hearing that tablet screens bothered one's eyes. We found it easy to use the settings to adjust the screen lighting, and found an adjustment that has caused no eye problems, even when reading for several hours. It has been very comfortable. We have also read in fairly bright sun with no problems. However, when the sun was actually hitting the screen, it was impossible to read on it.We do use the iPad Air for many other functions. Games, surfing the web, eMail, videos, music, photos, YouTube, social networking sites, and so on, work as well as on a computer. The battery lasts a long time and the 3G is a real bonus when wi-fi is not available.I have seen some negative reviews of the iPad Air, and I don't doubt that some people have had bad experiences. All I can say is that we have had good experiences with Apple. Our iMac was out of warranty and still working when Apple notified us they were replacing the hard drive on all iMacs like ours, because the hard drives had an unacceptable failure rate. When we took it in to the Apple store, I asked them to also check my iPod Touch, which was two years out of warranty and had become very temperamental and glitchy. They found a corrupted file on the iPod Touch and got it set up and working for me, and didn't charge anything.  We have had good experiences with the iPad Air and are extremely happy with both of ours.", "Title": "Absolutely Love the iPad Air", "Date": "June 2, 2014"}, {"Author": "Brad Potts", "ReviewID": "R1IOW55MJ0WJHD", "Overall": "5.0", "Content": "This is a ergonomic, user friendly, electronic media formate for the casual user.  Apple will be my choice for my next computer!", "Title": "Wonderful", "Date": "June 2, 2014"}, {"Author": "Sandra J. Howard \"Sandy's How\"", "ReviewID": "R1CQEN04X1KSHG", "Overall": "5.0", "Content": "I had ordered a used iPad Air white/silver with AT&T; cellular, but received black/silver with Verizon! Actually I like the black but was disappointed that I did not get AT&T; cellular which has the best data plans. Product was used but in perfect condition including 20 months of Applecare. I really enjoy my iPad.", "Title": "Used in perfect condition!", "Date": "June 2, 2014"}, {"Author": "Hector Gallego", "ReviewID": "R11C7FJLW2SNR3", "Overall": "5.0", "Content": "I bought the Ipad for my cousin and we need it asap. The timing was so great that the whole family is happy about the arrival of the new apple air.", "Title": "Great device", "Date": "June 2, 2014"}, {"Author": "Brandon", "ReviewID": "R2A2SLALS4MY24", "Overall": "5.0", "Content": "I had the Ipad 2 before I got the air. way better in every aspect, worth every penny. Really fast and reliable", "Title": "Awesome device", "Date": "June 2, 2014"}, {"Author": "W. Qian", "ReviewID": "R1QUQ9GW19Y4SO", "Overall": "5.0", "Content": "I've owned a IPAD2 for several years. This one is much faster and the screen is of much better quality. Definitely worth the upgrade.", "Title": "Very fast!", "Date": "June 2, 2014"}, {"Author": "Jose", "ReviewID": "RZU7Y6FYOWTOO", "Overall": "4.0", "Content": "The iPad itself is great. Beautiful display and very sleek light and overall very pleased.The delivery was fast. I rushed mine and was here less than 24 hours, which was great.One thing however, the package seemed scratched as if it were rubbing up against something. Since it was the outer plastic cover i didn't mind much. What I found weird however, was that the inside too seemed the same. After careful inspection, there seemed to be no damage or any sings of the device being previously (since it was listed as new) and the packaging made it seem a bit suspicious. Overall however, good experience.", "Title": "Suspicious packaging but overall good", "Date": "June 1, 2014"}, {"Author": "Mary", "ReviewID": "RKYUEW5R860G6", "Overall": "5.0", "Content": "I went to T-Mobile to get data so I could use it away from home and apparently whoever had it previously, didn't pay for it.  Therefore, T-Mobile couldn't hook me up.  The machine is blocked, locked or something.  I will need to send it back.  I am in the process of finding out how to return it.", "Title": "I love the IPad - but it cannot be used", "Date": "June 1, 2014"}, {"Author": "Francisco Vazquez", "ReviewID": "R1P0KMZJ8LN21M", "Overall": "5.0", "Content": "Our fist Apple Ipad Air tablet, and for sure not the last one.. is amazing and friendly when use.. thanks!!!", "Title": "Incredible table", "Date": "March 13, 2014"}, {"Author": "Patricia Coykendall", "ReviewID": "R2Q8KB9C8ZHKQW", "Overall": "5.0", "Content": "All said it would be and more, had the I pad 2 and this is so much faster and lighter", "Title": "Always love Apple", "Date": "January 18, 2014"}, {"Author": "Maryanne", "ReviewID": "RX8WHXEP7PHLS", "Overall": "5.0", "Content": "I honestly love this tablet like crazy! It has great battery life, just like they claim. I had my younger cousins go on it and even though they were playing games and watching movies the whole time, the battery still lasted all day! The screen is also great, maybe it's not the best on the market but I can barely even tell the difference and it's still exquisite. The processing power is also outstanding and I couldn't need anything faster. Internet is very fast as well. All in all, I've always wanted an IPad and finally when I got it, I was not upset at all and it was actully a million times better than I expected.So, in my opinion, if you want it enough, and your willing to make a big splurge, get it. :D You won't regret it, it's da bomb. But if you really haven't wanted this much and your short on money, maybe you can give the other cheaper tablets a try. Such as the Nexus, Kindle, or even Nook!", "Title": "I love it, love it, LOVE IT!!!", "Date": "January 9, 2014"}, {"Author": "Bookenz", "ReviewID": "R1Q22IXQKRHAIJ", "Overall": "4.0", "Content": "This is my favorite iPad so far, despite an initial wifi connection problem. I bought the original iPad, iPad 2, and iPad 3 (which I returned because of heating issues and thickness/weight and went back to the iPad 2).I was ready to buy a new iPad because my iPad 2 16gb was filled up.  So I decided on the iPad Air. The first thing I noticed when I took it out of the box was that it really is much lighter than even the iPad 2.  The screen is the same size, but the frame is narrower, so it's smaller overall.  I have the white 128gb wifi version.  Set up was problematic though, which is why I've taken away a star.  When asked to put in my home wifi password, I received a message that it was entered wrong. Repeatedly.  Well, it wasn't wrong because it's the same password as my other wireless devices.  Nothing I did would make it take the password, so I called Apple tech support. After being on the phone with the technician for at least 45 minutes, nothing worked. Turning my modem and router off and on did nothing. Changing some of the iPad's settings, again, nothing. I felt disappointed, frustrated, and let down by Apple. Finally, the tech set an appointment for me to take it into the Apple store and see if they could get it to connect to their wifi. Before we hung up, the tech suggested I connect the iPad to the iTunes on my computer and do a complete software restore and see if that would resolve the connection issue.  I did this, which took about an hour, and FINALLY was able to connect to my wifi. The connection has been stable so far.Other than the above initial connection problem, I am really loving the iPad Air. Sharp retina display, thinner and lighter, and faster connection (I use the Mercury Browser, not clunky Safari). The white frame with silver edges is really nice looking. I read a lot of ebooks, so the lighter weight is very much appreciated since it can be held comfortably with one hand. I also listen to audiobooks and this iPad has two speakers instead of one. They're located on the edge of the device, not the back, so you don't have to have the iPad back side up to get unmuffled sound. The sound quality of the iPad Air is superior to the iPad 2, and the volume can be turned up slightly louder. I've only played one game so far, Plants vs. Zombies 2, but it plays great. I don't use the camera and really wish Apple would make a version sans that option. It feels cool when holding--the iPad 3 I had got too warm on one side, which this one doesn't do. I haven't had any other problems and I think this is the best iPad yet. As far as the initial wifi connection issue I had, I'm going to assume this was a fluke with my device, and not something a lot of people are experiencing (although I have seen a few mentions of this on some of the Apple forums).", "Title": "Love it, but had connection problem during set up", "Date": "January 8, 2014"}, {"Author": "Benedito Eloi Maya \"Maya\"", "ReviewID": "R3PBL8USTW8GYJ", "Overall": "5.0", "Content": "This product is amazing. It's not perfect, but considering that I'll have it for at least 2 years and I've used it every day so far, It's very sturdy and I know it will hold up well, as my other Apple products have.", "Title": "Its perfect", "Date": "December 30, 2013"}, {"Author": "mgf", "ReviewID": "R3T4HQE7937J2J", "Overall": "5.0", "Content": "I love this iPad, is so light weight but with a big screen.  The picture quality is great too.  High quality like everything from apple.", "Title": "Great Purchase!", "Date": "December 23, 2013"}, {"Author": "Nancy Bell", "ReviewID": "R1TAU6FYPB8B8N", "Overall": "5.0", "Content": "I have a laptop & a small size mini computer, both were obsolete, SLOW, etc. I was pretty much using my ipodTouch5 as my sole computer for everything, so this iPad was a natural progression from the Touch to a bigger screen.  The Air is all you need!!  I find even typing with no keyboard is not an issue.  I am not sure it is any better than an older iPad since it is my first, but if you want a tablet , this IS the one, just because of the lightness of the iPad!  It is easy to use & does it all with ease.  Flawless for me so far.  I am like a walking advertisement for iPad Air!!", "Title": "So very portable", "Date": "December 23, 2013"}, {"Author": "michael", "ReviewID": "R1YRRYGUE5W27N", "Overall": "5.0", "Content": "i myself love it.  got her this one cause her old 2nd gen is cracked and pretty much dead.  im sure she will love this one", "Title": "christmas present for my mom", "Date": "December 19, 2013"}, {"Author": "Ashton P. Johnson \"Zepaw\"", "ReviewID": "RD013T1R9OA4A", "Overall": "5.0", "Content": "My title makes it pretty clear how I feel, but I'll try not to go over the top about how much I like it. The big thing is I've always liked the iPad as a concept but I've never fully fallen in love. I bought an original iPad, 2, and 3 but ended up selling them not long after because of a couple reasons. Mainly they just felt a bit like a luxury item I didn't have much use for and they weighed just enough to be uncomfortable to hold for a long period.The weight is now a complete non-issue. I fall back in love with it every time I pick it up because it just feels so perfectly designed for being held and interacted with. It also feels like much more than a luxury because of how much usability it now has. There are so dang many things I can do on my iPad, things I used to need my pc to complete. This is partly because of improvements by Apple but its also the simple benefit of web and app developers designing their services with mobile in mind.I can only imagine this comes off as a completely biased review but know I didn't get this device expecting to be so happy with it. I've been underwhelmed by Apple products before, but not this time. I highly recommend it.", "Title": "I'm in love with this thing", "Date": "December 19, 2013"}, {"Author": "Albert C. Marth \"Albert c. Marth\"", "ReviewID": "R1F0R6VV0RKR7G", "Overall": "5.0", "Content": "This I-Pad is definitely a step up from last years model!  It's is lighter!  It is faster!  The picture is the best  I have seen.  The picture shows the pictures in a brilliant fashion!  The thinner all over design is really appealing!The seller and their service was exceptional!  You wont be disappointed", "Title": "Apple Air Fun", "Date": "December 5, 2013"}, {"Author": "Dr. Sarah M. Young", "ReviewID": "R11CXF8RPTZQJW", "Overall": "1.0", "Content": "I purchased the IPAD air last week. When I tried to activate my accounts it would not allow it because apparently since I changed carriers I could not use my old Apple ID because it is tied to the old carrier. I can't establish a new Apple ID because I have an old one and if they delete the old one I lose all the apps I've paid for. I contacted Apple Technical where I was required to purchase tech support before they would do anything.  After doing this I went through multiple calls with multiple levels of support over three days so far with more to come. Seems that if the tech makes a mistake it stops the process and you have to wait 24 hours for them to be able to continue. They promise to call back and so far they have not so I called them to start the frustrating cycle all over again. I can't get the apps I want until this if fixed. I also can't connect to Facebook. For a machine this expensive plus having to pay for tech support for something that is Apple's fault I now believe Apple products aren't worth the gas to go buy one. I've been using Apples since the Apple Plus and I feel abused as a customer for the IPAD AIR. On top of all this they just had the gall to send me an email thanking me for contacting Apple Support. They have charged me for something a user should be able to do online with a new machine that is supposed to be the latest and greatest and it is just a paper weight right now. Can't return it because there is nothing wrong with it. Seems to me Apple is unethical and does not care about customers after a purchase. Dr. Sarah young", "Title": "IPAD AIR unusable, tech support is worthless.", "Date": "January 26, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00G2YDKK0", "Features": null, "ImgURL": null, "Name": null}}