{"Reviews": [], "ProductInfo": {"Price": "Unavailable", "Features": "Children's 7 Inch Android 4.2 Tablet that has a fun touch screen, which also lets the parents be in full control over how long their kids can play   See no evil, hear no evil and speak no evil is a very old motto that is used, especially when raising children and to establish good ethics. However, we no longer live in the old days as technology has evolved so much that you cannot avoid it even if you tried. Children are being exposed to technology from a young age, either at school or at home, therefore you may have concerns how they are using this technology. This tablet is to ensure your children are not spending too much time or being exposed to adult aimed entertainment by letting you have full control, this is the \"Play-Tab\". The pretty pink cover will brighten up the date of your little princesses who may want to play various games and also talk to their friends via the front-facing camera.   A nice 5 point touch capacitive screen allows the kids to navigate easily and view all the content on the 7 inch display screen. Watch movies, listen to music, play games and surf the internet just like over tablets are the market but ensure the safety of what your children can and cannot see via the password managed paternal control. You will get control over apps installed, web browsing, and even how long children can play on the \"Play-Tab\". Maybe your children are spending too long glued to the tablet because they want to play games or watch movies, the \"Play-Tab\" guarantees that once you selected the allowed duration of use, that the \"Play-Kid\" will do its part and turn off.   It uses an Android operating system, therefore you can use the Google Play store to download suitable content such as games and educational material, plus Android allows a high level of customization that most other systems have never had the chance to experience. Very practical with an easy to hold frame as well as having a built-in micro SD slot that can add an 32GB memory", "Name": "Children's 7 Inch Android 4.2 Tablet - Child Friendly UI, Parental Control (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Xf6XvniQL._SX300_.jpg", "ProductID": "B00GGMD76A"}}