{"Reviews": [{"Title": "Meets expectations; used daily.", "Author": "Britton", "ReviewID": "R1VJ8XGNNQYFPD", "Overall": "5.0", "Content": "Received as a birthday gift around the holidays and I have used it every day ever since.I am a bit of a techno-phile.  I've been using computers since the days of parachute pants and the mullet.  I have both Windows and Linux computers and have fully embraced the Android OS.  I still cannot bring myself to spend the money required to own Apple products, so I cannot and will not compare this to an iPad.What a handy device it really is!  It's wifi ready, has a headphone jack, a mini-HDMI output, and it can be charged with either a supplied A/C charger or a micro-USB charger.  Its 7” screen size keeps the whole thing manageable but much bigger than a phone screen.  I think it’s an excellent balance of size and convenience.  My wife can keep it in her pocketbook without feeling weighted down or feeling like it has taken over her bag.  If I had to, I could keep it in the front pocket of a pair of slacks (not jeans, though).Even a newbie Android user should be able to figure out how to use this tablet.  Follow the instructions to fully charge the batteries before using without the plug.  But I started working on it right away with the device plugged in.  The Settings screen is accessible through the bottom of the screen and the apps list button on the home screen.  Through Settings you can get to the wifi settings where you log in to your local network.  I was on the internet in less than a couple of minutes.  After a quick download through the Play store, all my favorite apps including IMDB, Accuweather, Firefox and more were immediately available.  It also loaded my favorite games including 7 Little Words, Angry Birds and Texas Hold’em.  To add a recent picture I took as my wallpaper, I loaded QuickPic to organize my pictures and Tonido to access all my favorite files from my home computer.I asked for this tablet as a gift to provide two tasks, both of which it handles very well.The first is to give me internet access - mostly IMDB - while I'm watching TV with the Queen.  The wife and I love to watch TV and movies and we are always wondering where we've seen that actor/actress before.  It works very well for just about any online access you will need.  I’ve even used it in the kitchen to try a new recipe for banana bread.The other task was to have an easily portable tablet available for when the Queen and I are running errands or on a road trip.  I've installed the 'hot-spot' option on my cell phone so when we're out and about, we can easily log into the internet via wifi while driving or shopping.  Our previous tools for that were either our cell phones (not as easy to see) or our laptops (too big and clunky for the car).  This tablet provides the perfect balance.Some downsides to the Y88 are the battery life and the availability of apps.  My favorite weather app is WeatherBug which is not available for this tablet.  Not sure if it’s the tablet or WeatherBug that’s at fault here, but I found a reasonable solution with Accuweather.  There were a few other apps that I looked into loading and they were not available, but I’ve also found viable workarounds.  The battery issue is not unusual for tablets, so no major complaint here.  I’ve dug up some eBay sourced micro-USB chargers from around the house and have plugged them in where I sit with my tablet around the house and just operate ‘wired’ as necessary.  Not that big a deal.  We do the same in the car until we need to go wireless.  Simple.Overall, this tablet met all my expectations.  Hope it does the same for you!", "Date": "January 27, 2014"}, {"Title": "Absolute Junk", "Author": "Crunk Panda \"Crunk Panda™\"", "ReviewID": "R3GUYUPHVQD7K0", "Overall": "1.0", "Content": "My kids each received one for Christmas from their grandparents. Complete and total ripoff. The screens are awful. Once you get past looking at something that looks like a bad 3D view, you are welcomed to your own personal hell by network issues. It connected to my network no problem, but, only in appearance. It took 20 minutes to load cnn.com, and poorly at that. It constantly dropped connectivity and showed network \"out of range\" even when feet from the router. As a very tech savvy person I tried everything. Reset routers and modems, forgot connections and reset, even full factory reset. Same story each time on both tablets. Their customer service basically does not exist and I am returning. DO NOT BUY THIS TABLET UNLESS IT IS FOR YOUR WORST ENEMY...even then it's a pretty cruel thing to do. I can't get back the 10 hours I dedicated to this piece of junk, let this be a cautionary tale.", "Date": "December 26, 2013"}, {"Title": "Horrible Customer Service", "Author": "ROBERT", "ReviewID": "R1Z6B075S4TKTB", "Overall": "1.0", "Content": "Product had a very small blemish on the screen which turned into a completely cracked display.  Have been fighting with TabletExpress on getting the product warrantied and I cannot even get through the process of where to send the tablet!  The customer service reps do not speak clear english.  You have to repeat everything to them several times and they just read a script to you which goes in circles and never can get them to tell you where to mail the product back to warranty it.This product is 2 months old... Will never buy from TabletExpress again.  At this point it is still unresolved as of the date of this rating.  I am currently sending emails and have yet to get a response from their customer service department.", "Date": "February 3, 2014"}, {"Title": "Total Christmas killer", "Author": "Ron Coleman", "ReviewID": "R3G7ODW1UFZ4X5", "Overall": "1.0", "Content": "Oh my...can't believe items of this low quality are allowed on Amazon. Purchased for grand sons and watched as my son spent hour upon hour trying to get it to work properly. Not just one tablet, but 2 tablets for 2 grand children. Both just total junk. Sad, just sad... DO NOT BUY", "Date": "December 27, 2013"}, {"Title": "Good tablet with bad speakers", "Author": "Cheryl Lovell", "ReviewID": "RMOBWPQHPD46O", "Overall": "4.0", "Content": "I really like this tablet.  I didn't give it 5 stars because the speaker is not loud enough.  You have to use earphones with it if you want to use it. I don't listen to music on it, so its not a big deal for me.  Its a good tablet for a good price.", "Date": "December 15, 2013"}, {"Title": "Defected Tablet", "Author": "Lammone Bouahom", "ReviewID": "R25YOH161670I7", "Overall": "1.0", "Content": "The second day i had it the screen just went blank on me. Like clear white i could hear stuff but it just went blank. so now i'm trying to figure out how to fix it our get it replaced i'm so MAD.", "Date": "December 12, 2013"}, {"Title": "No braggin' about the Dragon", "Author": "G. Blake", "ReviewID": "RYE8AMP0J49OJ", "Overall": "5.0", "Content": "Love the tablet so much I got one for my wife. It's better than the first one I got for her. It was a Visual Land. That one punked out within a month and after sending it back to manufacturer for repair or replacement it went out again. Dragon Touch is a good buy and a good tablet. Very happy with my purchase.", "Date": "April 29, 2014"}, {"Title": "Works Well", "Author": "Deb Dickinson", "ReviewID": "RE8UAURAGGAIN", "Overall": "4.0", "Content": "Xmas present for Son. 1st one just wouldn't work with our router. So I sent it back, and they said the Wi-Fi was working but when I insisted it wasn't they kindly sent another. Same problem with the 2nd, except I then realized it worked fine with my neighbors Wi-Fi & then the coffee shop's too! So I changed the frequency channel on my router & low & behold, the tablet picked it up just fine! So I think the problem was my router the whole time.Anyway, it works great (as you can expect for a $100 tablet). And Kudos to TabletExpress for their prompt customer service, & no argument return, even though the 1st tablet was fine!", "Date": "February 21, 2014"}, {"Title": "Works Great For RVing", "Author": "steve warford", "ReviewID": "R18Y6FVYEVLSMV", "Overall": "5.0", "Content": "I'am retired and do a lot of camping mainly in the national forest campgrounds so i don't have wifi ,I have to go to restaurants where there is free wifi and it's so much easier to carry this tablet then a big cumbersome laptop  It's also the first android system I've had  and I really like it .", "Date": "January 8, 2014"}, {"Title": "Awesome!!", "Author": "Kendall Adams \"kendall adams\"", "ReviewID": "R2DT0ZSQZ7UKKE", "Overall": "5.0", "Content": "I'm using it right now :)  I would recommend this for a gift or for yourself, I bought the purple one for myself and I haven't put it down for hours. Its great you can download so much stuff on it. You'll never get bored with this. I only with the camera was better but other than that its awesome and came before expected! I love this tablet and good for the price.", "Date": "November 1, 2013"}, {"Title": "Very Disappointed.", "Author": "Kim J Bucher-Tyo", "ReviewID": "R3RX68OEZSDUJ7", "Overall": "1.0", "Content": "Bought three of them for our Grandchildren for Christmas.  I charged all of them for the full 10 hours that was recommended before I gave them to them.  One would not turn on at all.  The second would not turn on after the first week of use.  The third is still working, but who knows for how long.  Not overly optimistic.  I loved the color choices", "Date": "January 10, 2014"}, {"Title": "Dragon touch 7 in tablet", "Author": "phoenixblu69", "ReviewID": "R3MM0P2PTCSOU5", "Overall": "3.0", "Content": "I like it but it freezes up often. It sometimes has to be restarted. I haven't found any other issues.", "Date": "December 6, 2013"}, {"Title": "Dragon Touch® 7'' Blue Dual Core Y88 Google Android 4.1 Tablet PC, Dual Camera, HD 1024x600, Google Play Pre-load, HDMI, 4GB 3D", "Author": "Francesco", "ReviewID": "R1DMQSSH770U8M", "Overall": "5.0", "Content": "When I first received my package there was a lot of movement inside the box so when I received it it was damaged and my sound of the tablet it went bad.  But that's not only thing that I'm not upset with the tablet works just fine like I said before the sound just started to go bad there was no damage on the screen or anywhere on the tablet but I still give five stars for this item.  But I will show you how the sound on this time and I will do it later on for right now I am trying to figure out how to make a video to show you what I am referring to and also the tablet works very fast which I am very happy with.  I was talking to Amazon.com they were very nice to help me to figure out what the problem is I explained to them what the problem is and they already tell me what to do to send it back to give me a replacement and they were very understandable people her name was \"Jessica \"and I'm very happy with the she saw the problem right away.  Like I said before I will give it five stars but if there was more stars I would give it at least 10 stars for this item and also I have three of them and that's why I would like to know how to fix this problem and they did it right there in the spot was talking to her and she solved it right away to make me happy.", "Date": "May 31, 2014"}, {"Title": "Dragon Touch 7\" Tablet", "Author": "Jb1055", "ReviewID": "R3Q8IP6CMCULKO", "Overall": "5.0", "Content": "It works great. I compared this product with other brands and I feel I got the best deal for the money. I wouldseriously recommend this to my friends.", "Date": "April 29, 2014"}, {"Title": "Don't buy", "Author": "Thomas", "ReviewID": "R3NVZ16P6TQ25T", "Overall": "2.0", "Content": "Not a good product read the reviews an it was positive reviews so I thought I would by one. The thing crashes. Can't play clash of clans. All its really good for is youtube but even then the speaker is low quality.", "Date": "April 11, 2014"}, {"Title": "unbelievably poor product, appalling customer support", "Author": "stephanie", "ReviewID": "R1NRHS4VXC1QBA", "Overall": "1.0", "Content": "I ordered this tablet in December as a Christmas gift for my daughter. Upon arrival, the tablet charged and powered on. However, after the initial charge wore down, we were unable to charge it again. After several attempts at contacting the seller, I escalated to the amazon a to z guarantee. The seller then informed me that they would send me a return shipping label to return the defective tablet and receive a replacement. I never received the label, or even an address. I again contacted amazon, who then informed me that the seller wouldn't replace the item because the defective product hadn't been returned (this is despite the fact that I had no address to return it to, even at my own expense). I have since replaced the item with an XO tablet (which I would recommend to anyone looking for a tablet for their child). DO NOT PURCHASE THIS ITEM.", "Date": "March 25, 2014"}, {"Title": "It quit working after 1 day of use", "Author": "Enligh10dwon", "ReviewID": "RSIW482XHP74K", "Overall": "1.0", "Content": "The screen became unresponsive after 1 day of use. I cannot unlock it at all...Returning for a refund and will purchase from a more reliable brand.", "Date": "March 13, 2014"}, {"Title": "Don't buy!!!!", "Author": "Tephenie Harp", "ReviewID": "R2OLOJQ8H1M64V", "Overall": "1.0", "Content": "I will never buy from them again! I only had it a week and the screen cracked and the touch won't work. Nothing at all happened to it either. I tried to message the company and they will not respond back!", "Date": "March 11, 2014"}, {"Title": "If I could give this a ZERO, I would", "Author": "Me \"babybella\"", "ReviewID": "R2JBD8V0Q93DH2", "Overall": "1.0", "Content": "I bought three of these tablets (pink, purple and blue) for my kids for Christmas. My son's screen broke within 3 days. Granted, he probably threw it or something, but he's played with my Kindle Fire for over a year without damaging it in any way. Within another couple of weeks, the power button on the pink one got stuck and the tablet cannot be turned on at all. We thought maybe she had done something wrong because she is young. But like my son, she has played with my Kindle for some time without ever causing any damage. Within a month after that, the purple one did the same thing. This happening made it clear to me that the product is the problem. My oldest child is 8 and knows how to handle and take care of tablets. She has been playing with my Kindle since I bought it 2 or 3 years ago. So now I have three useless tablets that I paid almost $80 a piece for. I am also giving 1 star for customer service. We contacted Amazon about returning the tablets (pink and purple only because we aren't 100% sure that our son didn't do the damage). They authorized a return for one, but not the other claiming it was out of the 30 day return period. Well, duh. Of course it is. We bought these for Christmas presents and did not wait until the last minute to buy so 30 days pretty much passed before my kids laid hands on the things. Frankly, if you're going to sell crap, you should be prepared to refund money for crap. I don't want to replace crap with more crap. I want my money back so I can buy something worth my money. I will never buy from this seller again. I do not recommend purchasing this tablet or anything else from Tablet Express.", "Date": "March 11, 2014"}, {"Title": "disappointed", "Author": "Jennifer Bliss", "ReviewID": "R33RXBTF9PE9QG", "Overall": "2.0", "Content": "i got the dragon touch green for a gift i liked it but the sound is way to low the camera takes fuzzy pictures and after a couple of weeks the screen cracked it got hot fast alot now i cant use it i had it in a case to protect it . i dont have the money to get another one .", "Date": "March 9, 2014"}, {"Title": "Great Value Buy", "Author": "Sunny Salguero", "ReviewID": "R38FIWO7F9KRKQ", "Overall": "5.0", "Content": "Item is great for young kids who don't mind playing it on a wall charger, sadly it does not hold a long charge, but again overall for the price, it is a great item.", "Date": "February 26, 2014"}, {"Title": "No good", "Author": "Porchea Davis", "ReviewID": "R39LIIU6GGPI93", "Overall": "1.0", "Content": "I would not recommend this item. It stopped working a week after having it. It Won't charge properly can't turn it on at all. I totally want a refund on this item. Completely disappointed.", "Date": "February 14, 2014"}, {"Title": "Great gift", "Author": "Kwame Fauntleroy", "ReviewID": "RZ84H3N75NAN6", "Overall": "5.0", "Content": "Brought this for as a Birthday gift for my 4 year old and he loves it. Has Google Play store and a good camera", "Date": "February 8, 2014"}, {"Title": "Not good enough.", "Author": "erika sanchez", "ReviewID": "R1R0WGGLIIKGR7", "Overall": "1.0", "Content": "I don't even use it,  when I opened & turn on the screen definition wasn't good at all. I just got a galaxy, the best.", "Date": "February 3, 2014"}, {"Title": "didn't work and not worth the hassle", "Author": "Rachael Ward", "ReviewID": "REXFK9M9N8VLQ", "Overall": "1.0", "Content": "When I received the tablet it did not work. I called tech support and all they did was send me an email of steps to try. Simple things like restarting it. I had 3 different error codes coming back so this did not help. I had a very heartbroken 8 year old on Christmas. Very disappointed on how the compamy handled this issue. Would not buy from them again.", "Date": "January 14, 2014"}, {"Title": "very good product", "Author": "bevann", "ReviewID": "R2QXU4WFIHBL1J", "Overall": "5.0", "Content": "I purchased these for my older grandkids and they were very pleased. I have not heard any complaints from the and the age range is 8-18.", "Date": "January 6, 2014"}, {"Title": "She loves it", "Author": "Ricklyn Beach", "ReviewID": "R1DLFAQJSWF1TK", "Overall": "5.0", "Content": "Purchased for my daughter and it is meeting all of her expectations. She is using it primarily for games at this point", "Date": "January 6, 2014"}, {"Title": "Okay for the price", "Author": "LaTiffany Bizzell", "ReviewID": "RTHGWJKQBV1IL", "Overall": "3.0", "Content": "My son really likes it. He is nine years old. But not what I excepted. But it's good. Thanks again", "Date": "January 6, 2014"}, {"Title": "Lp1229", "Author": "Lisa Prichard", "ReviewID": "R3862X1W6UPCPY", "Overall": "1.0", "Content": "So far so good.  Purchased for my grandkids. They seem to enjoy them. Would recommend them to any one. Good picture, easy to learn.", "Date": "January 4, 2014"}, {"Title": "Tablet", "Author": "Reading Teacher \"Reading Teacher\"", "ReviewID": "RDUYHIK9WCPM0", "Overall": "3.0", "Content": "This tablet is just ok. It doesn't have a lot of memory and the camera is not very good. I purchased for a child in lieu of a more expensive tablet, and so just for games it seems to be ok. Not sure that I shouldn't have just spent a few extra dollars and gotten a kindle fire...time will tell.", "Date": "January 3, 2014"}, {"Title": "Defective product.", "Author": "Nana619", "ReviewID": "R49QEKFAGCXFR", "Overall": "1.0", "Content": "The tablet continually overheats and shuts down. Also would not accept a sd card to allow for more memory to try to solve problem.", "Date": "January 1, 2014"}, {"Title": "Disapppointing", "Author": "Darlene Knowles", "ReviewID": "R3U51VM16EY71L", "Overall": "1.0", "Content": "I bought this for a Christmas present. The tablet barely made it through setting it up before it quit working. Very disappointing.I would not recomend this product", "Date": "January 1, 2014"}, {"Title": "good tablet", "Author": "Carlotta Mitchell", "ReviewID": "R1ADS9ZDIJVT6B", "Overall": "4.0", "Content": "i like this tablet and so far it works good...still learning everything....i am having a little trouble trying to uninstall a game but that is no biggie", "Date": "December 28, 2013"}, {"Title": "given as gift", "Author": "Melanie", "ReviewID": "R33B0HOFJQHNHA", "Overall": "5.0", "Content": "Exceeded my expectations. My grandson is loving it . I would recommend this device to anyone looking for a functional tablet.", "Date": "December 28, 2013"}, {"Title": "Good so far/", "Author": "Ronald Coleman", "ReviewID": "R2WS1YTK2TSI94", "Overall": "3.0", "Content": "No problems to report yet.Only had it since Christmas Day but will let you know again in about two months", "Date": "December 28, 2013"}, {"Title": "Horrible experience.", "Author": "Tara Greenough", "ReviewID": "R1YQ4X6H3JPMC", "Overall": "1.0", "Content": "I had bought this tablet for Christmas for my daughter, when I received the tablet the screen was scratched all over and the camera was cracked.  Had to send it back and make a dash to the store to buy her a new one, very disappointed that they do not check there products before shipping.  I am sending it back for a full refund.", "Date": "December 27, 2013"}, {"Title": "something wrong with the power button or charger connector.", "Author": "Stone", "ReviewID": "R2H8H9UI2MWW7I", "Overall": "2.0", "Content": "Doesn't turn on easily. to turn on, i have to spend about 5 minutes mashing the button, or plugging in the charger and headphones, then hold power for 20 seconds, then wait, then hold power for 5 seconds. or .....", "Date": "December 27, 2013"}, {"Title": "Great for kids", "Author": "Toni-Ann Clarke", "ReviewID": "R3PM9T5YTRS3E6", "Overall": "4.0", "Content": "For the price its nice. The volume button got stuck which is irritating ofcourse but the tablet on its own is perfect for my 13 year old little brother.", "Date": "December 26, 2013"}, {"Title": "Cheap", "Author": "Lawrence Evans", "ReviewID": "R28GY2HPWF7937", "Overall": "1.0", "Content": "Bought two of them for my granddaughter for Christmas….Returned them on the 26th.  Both item had serious screen problems (bubbles, lines) and slow.", "Date": "December 26, 2013"}, {"Title": "Pros and Cons", "Author": "jeremy", "ReviewID": "R3BT7MV1R86786", "Overall": "3.0", "Content": "ProThe internet surfing speed and response is good.  Doesn't seem to have any problems loading apps or playing applications.  HD display during movies, so far, that i can see.  Charges quickly and seems to hold good so far but may be because the screen is so poorly lit.  Good tablet for children as it is inexpensive if it gets broken.  Front and Rear cameras are an expensive addition in name brand tablets and included in this tabletConsI will compare this tablet to the kindle fire hd.  When I purchased it i looked for similar characteristics.  The 1280x600 hd display is what sold me and was expecting similar quality screen to kindle.  This tablets screen, i would be surprised if it was truly 1280x600 hd from a quality control stand point.  In the same note, the front/back cameras seem to take equal quality pictures, yet the back camera is rated at 4 times the picture quality.  The picture is maybe half the quality as a kindle fire hd.  This tablets picture seems to be recessed into the tablet so the pictures cannot be seen clearly except for straight on and is very low lit.  Frustrating for anyone who has used a kindle as there screen seems to display right at the surface and withvery viberant.  You will need to buy speakers of some kind for this tablet.  This tablet 85 compared to kindle fire hd with camera at 140 used or 200-225 new.  Save for the kindle unless youre like me and buying several for kids as that can get expensive. Dolby surround and precise picture at all angles is worth the extra 75 bucks and you will have to buy 20 bucks worth of speakers anyway.  Don't buy this if you are an adult.  You will not be satisfied.", "Date": "December 25, 2013"}, {"Title": "Meet the dragon that burned up my money.", "Author": "Brenda McCorcle", "ReviewID": "R3OIXDU3AMVOF9", "Overall": "1.0", "Content": "At first I was excited but continued use with failure to hold a charge for 2hours or reloading a video every 5 minutes was frustrating while studying online. I feel that I should have bought a laptop instead.", "Date": "December 11, 2013"}, {"Title": "Not worth the money", "Author": "DENISE CYR", "ReviewID": "R36XGF9DL46NZJ", "Overall": "1.0", "Content": "This is not what I was expected because I have read the reviews, It won't let me download any games,  it shuts off for no reasons, and it is very very slow.  Save your money not worth it.", "Date": "December 14, 2013"}, {"Title": "Died after 1 hour of use.", "Author": "Barnabas S", "ReviewID": "R3ED9D4QHV1EWK", "Overall": "1.0", "Content": "The screen's touch sensitivity is very low and the colors are quite dull. It also does not perform like I would expect a dual core processor tablet to. It's very laggy and that is how it acted right out of the box. Biggest issue is that the tablet will not turn on anymore. It doesn't react to the power cord being plugged in. Unfortunately for me, I delayed sending it back for too long and now it's past the return by date. So now I'm stuck with a $90 paperweight.", "Date": "February 5, 2014"}, {"Title": "not worth the money", "Author": "Tiffany Emery", "ReviewID": "R1ZN59ID79L0D1", "Overall": "1.0", "Content": "Because this product is junk. Screen goes haywire and the screen does not allow the pressure from finger all the time to select or thinks it is on the the next place down. Does not always turn on the first two times. Does not always let you shut it down. WiFi strength pick up is horrible.", "Date": "January 3, 2014"}, {"Title": "Refund", "Author": "Olivia", "ReviewID": "R12PSIK6KJKWCH", "Overall": "1.0", "Content": "I bought this product for a gift and it doesn't even turn on. The charger does not even fit in the port to even charge the tablet. Highly disappointed and would not recommend to trust this company!", "Date": "December 25, 2013"}, {"Title": "Very surprised", "Author": "Charisse Vega and Allende", "ReviewID": "R2OIG1EL3SU118", "Overall": "5.0", "Content": "Since the holidays are here my husband and I thought a tablet for our 14 year old son would be great. After shopping around at bestbuy and pc Richard we came across the dragon and right away we could not believe the price comparing it too other stores and their prices, we were sold. The tablet came yesterday I was happy when we open it and loved what we saw, yes we tested it it's light it has everything the camera is great wo sided. We liked it so much I bought two ore for myself and my husband and he told his coworkers back at work who have children grandchildren nieces nephew ect we are going too order 11 more yes you can't beat the price. I am very excited and pleased.", "Date": "November 30, 2013"}, {"Title": "Not great at all!!!!", "Author": "melysee", "ReviewID": "R19HUUOYN1T4LK", "Overall": "1.0", "Content": "I purchased this tablet for my dad back in December 2013. He doesn't use computer a lot so I thought this would be great for him as a way to introduce him to the internet and do his research and all. First few days it worked fine. And then back in February it stop working. It went completely dead would not even turn on. The charger is working fine. I'm always satisfied with the stuff I buy on amazon but this purchase was a big disappointment :( I do not recommend it", "Date": "June 9, 2014"}, {"Title": "Dragon tablet", "Author": "Charlanda Woodson", "ReviewID": "RG5I89SODUNN7", "Overall": "5.0", "Content": "I loved the color and so did my daughter and she also loved the two cameras. It is a great tablet at a great buy.", "Date": "June 8, 2014"}, {"Title": "Cases", "Author": "Michele Self", "ReviewID": "R130EVX4FSRVLJ", "Overall": "4.0", "Content": "We did actually get this one. We got in pink. Good product. But the leather cases are fragile. Thank you.", "Date": "June 7, 2014"}, {"Title": "Buyer beware", "Author": "Dianne", "ReviewID": "RCNNG34QG81VE", "Overall": "1.0", "Content": "Cheaply constructed. Charger has already broken and it has not been six months since the purchase. First charger I ever seen break after trying to remove it from the device.", "Date": "June 6, 2014"}, {"Title": "One cracked a tiny bit and stopped working.", "Author": "Jessica", "ReviewID": "R2WTDM8BAZBQWM", "Overall": "3.0", "Content": "I bought three of these for my children. In all, they were great, but I had set one tablet on the couch, and in fell on my hardwood floors, it had one tiny crack on the bottom right and it stopped working. In all it's a great buy but make sure you have a tablet cover for it because one drop and it's gone. They came on time and the packaging was great... I will be buying again from this company.", "Date": "June 6, 2014"}, {"Title": "Don't bother even buying", "Author": "AccdntL1.Einstein", "ReviewID": "R3VZ7DTB55T54R", "Overall": "1.0", "Content": "this thing isn't even worth the cheap plastic that it's made out of and runs just as horrible to. Definitely not worth the money I wasted on it", "Date": "June 6, 2014"}, {"Title": "Sad", "Author": "Djbob", "ReviewID": "RMD65LVGXFY8", "Overall": "1.0", "Content": "Right after the deadline they both went kerplunck I'm am out of almost 250.00 my daughters are upset as I brought these for gifts, usually you have at least 90 days to return.", "Date": "June 5, 2014"}, {"Title": "Wish I hadn't bought it!", "Author": "Patty", "ReviewID": "RUNHR0249AO0J", "Overall": "1.0", "Content": "I'm sorry I ever bought this tablet. I can't get the camera to connect and it won't charge properly. I will never buy another one of these tablets.", "Date": "June 4, 2014"}, {"Title": "Worth it!", "Author": "Dizzy", "ReviewID": "R3OQEDGF85B2SP", "Overall": "4.0", "Content": "I purchased this in pink at christmas time for my daughter.  It's too slow for my regular internet use but it's perfect for a kid who's just going to play games and watch videos.It's lightweight, runs fine, and is perfect for long car rides.My only real complaint (and it's not much of a complaint because of the price) is the battery life.  I wish it would hold a charge longer when in use but it does last for a good 4 hours in that situation.The reason I ended up purchasing this one is because my friend bought her son a Nabi for $200 and it was all kinds of problems and they returned it.  So she had me order this.-Definitely get a micro SD as this doesn't have a large memory.-a case, is a really good idea because the back of this is thin plastic.-keep a charger aroundbut for the price it cant be beat.", "Date": "June 3, 2014"}, {"Title": "Good product", "Author": "Janeen Herren", "ReviewID": "R3VB4YZQBP8PGB", "Overall": "4.0", "Content": "I love my tablet. My chord is sparking and not sure why that is doing it for some reason, however, it is still a great tablet.", "Date": "June 1, 2014"}, {"Title": "awesome!", "Author": "Rene Maxfield", "ReviewID": "R3SUD3PU63W4AM", "Overall": "5.0", "Content": "Very good value. like the dual cameras and the hookup to my 32in. hidef tv.and the direct download of my music files.", "Date": "June 1, 2014"}, {"Title": "Don't buy this product.", "Author": "Johnny", "ReviewID": "R2P41KMAEQLYHO", "Overall": "1.0", "Content": "I ordered this item and got it a few days later. It was supposed to be brand new but it was everything other than that. The screen was slightly blurry and it was really slow. I went to use it 13 hours later after charging it and it wouldn't start up. You get less than you pay for. I went to walmart and bought a netbook for 30 dollars and haven't had a problem yet. Clear screen and faster.", "Date": "May 31, 2014"}, {"Title": "a good andrion the dragon touch !", "Author": "Rosalina C Jones", "ReviewID": "R23A40N758VFY0", "Overall": "5.0", "Content": "i in joy playing my game on it but same time i have trouble loading a game,but other then that it work great .i would tell any person that would asks me about dragon i would tell them where i got from and for the price it works petty good.", "Date": "May 30, 2014"}, {"Title": "HORRIBLE!!!", "Author": "Nora Hicks", "ReviewID": "R2GNDI0HQVNJDG", "Overall": "1.0", "Content": "I do not recommend this tablet AT ALL!!! There is NO customer support for them. I bought two (one for each of my daughters), one broke (which was an accident) and the other locked itself. I have been all over the net looking for a way to reset it with no luck... Perhaps if there were support for them I would have given it a higher rating, sadly that is not the case.", "Date": "May 29, 2014"}, {"Title": "THE WORST!!!", "Author": "Nora Hicks", "ReviewID": "R3GB3GJOOHDV2L", "Overall": "1.0", "Content": "I do not recommend this tablet AT ALL!!! There is NO customer support for them. I bought two (one for each of my daughters), one broke (which was an accident) and the other locked itself. I have been all over the net looking for a way to reset it with no luck... Perhaps if there were support for them I would have given it a higher rating, sadly that is not the case.", "Date": "May 29, 2014"}, {"Title": "Not good", "Author": "TaBetha Smith", "ReviewID": "R3HDKVFYZUMJ8I", "Overall": "1.0", "Content": "We bought this for our daughter to have so she can do her home work on. Not a good product. Camera will not work, won't hold a charge, and gets to hot when charging. We are going to find her a different tablet and let her smash this one in the road.", "Date": "May 28, 2014"}, {"Title": "For the kids", "Author": "George Liermann", "ReviewID": "R3JWBFI0ZTZ8D6", "Overall": "4.0", "Content": "for the Price they work great.  13 year old son loves it.  I would suggest an SD card to increase the memory and screen protectors as the screen gets scratched up.  But it keeps the son busy and he was even doing some homework on it.", "Date": "May 28, 2014"}, {"Title": "good for kids", "Author": "ashley grove", "ReviewID": "RFEE6Y27MDKKC", "Overall": "4.0", "Content": "Excellant kids tablet my son loves it. Dont really like that there isnt much storage and cant figure out how to move things to the sd card", "Date": "May 27, 2014"}, {"Title": "Dragon Touch", "Author": "Zettie", "ReviewID": "R1BRACNOY1UZL8", "Overall": "5.0", "Content": "I purchased this Android tablet for my grandson he seems to like it very much I have heard no regrets and it has GOOGLE PLAY.", "Date": "May 22, 2014"}, {"Title": "Excellent tablet for the price!", "Author": "Matthew Shea", "ReviewID": "R34CU9OAEG3MR2", "Overall": "4.0", "Content": "I purchased this for my 13 month old son. I can't keep him away from me when I'm trying to work on my laptop or tablet so this a nice alternative rather then constantly telling him \"no\". I has decent battery life around 4 hours if he watches back to back movies. Its durable enough so far that he hasn't broken it and he rough on it because he is only 13 months old. We've had the tablet for about 2 months and it serves well for him. He still likes my iPad and laptop because the screens are so much brighter but this has made car rides and many other situations so much easier. It's a great low cost piece of technology and I do recommend the case even though I only gave it two stars. This would have been broke with the case. It is made of thin plastic and low end glass on the display.", "Date": "May 19, 2014"}, {"Title": "dont do it", "Author": "Mommy of Two \"Mommy of two\"", "ReviewID": "R260N0E8I8YRPL", "Overall": "1.0", "Content": "horrible. touch screen freezes . inherant problem with device and company refuses to fix it replace. never again  only offered for me to prochase new screen... really you sell me crap and then demand i pay to fix it????", "Date": "May 19, 2014"}, {"Title": "Tablet", "Author": "Miguel Fajardo", "ReviewID": "RT2OTAS1IVVX8", "Overall": "5.0", "Content": "Very good seller good product and I recommend it 100% to the community, an excellent tablet for easy handling and gameplay. regards", "Date": "May 19, 2014"}, {"Title": "Dragon Touch 7\"", "Author": "tamu", "ReviewID": "RVHIN7D9DNRVF", "Overall": "3.0", "Content": "Was given one a year ago.  Worked for a while then  went blank. Haven't use this one yet.  Its for one of my grandchildren who will use it this summer.", "Date": "May 18, 2014"}, {"Title": "Dragon Touch 7\" Tablet", "Author": "John C. Chirila", "ReviewID": "RWDMK62T3WCI2", "Overall": "5.0", "Content": "The Dragon Touch 7\" Google Android Tablet works great. Color display is good and the tablet is easy to use. Plenty of 3D color games preloade.", "Date": "May 17, 2014"}, {"Title": "Great tablet", "Author": "S. benns", "ReviewID": "R19B3D8NUZZ0EY", "Overall": "5.0", "Content": "Great tablet. Easy to set up and use. I bought it for my kid and she loves loves it and hasn't put it down since she received it.", "Date": "May 6, 2014"}, {"Title": "great tablet for an even greater price.", "Author": "Desire", "ReviewID": "R2YGM0XKNAU649", "Overall": "4.0", "Content": "Actually enjoy my tablet. .. would give it five  I'm still learning new things on it.  Like where is the flash! !!!!", "Date": "May 6, 2014"}, {"Title": "jush cheap, no bueno", "Author": "fabian", "ReviewID": "R2X3ABNWE0DRF0", "Overall": "2.0", "Content": "this thing was use had pictures from other user, they dint cleaned.. not cool, work find for the kids, but for adult don't use.", "Date": "May 3, 2014"}, {"Title": "I'm disappointed", "Author": "Miguel", "ReviewID": "R2TXP8PTYEIEEX", "Overall": "2.0", "Content": "I live in Venezuela, and now is when I received the product, that's why I've been slow to post my opinion.I'm disappointed, the product I received is NOT a tablet Touch Y88 Dragon ... is a tablet is a different model and brand!", "Date": "May 2, 2014"}, {"Title": "Good for pre-teens!", "Author": "K Brent", "ReviewID": "R2WP8LLJ4GQH5V", "Overall": "3.0", "Content": "I think this tablet is good for moderate use.  Its just not durable, nor does the battery last long max 3 hours.  The paint started to come off within the first month.  I also had to get it replaced because the display screen stopped working.  The best thing I can say is the price is good and the company did not give me a hard time with the replacement.  The replacement came very quick but they do not pay for return shipping cost.  These tables are equal to what you pay for them nothing more nothing less!  I purchased 3 of these and 2 of them have given me problems.  I would also suggest that you buy the protection plan as a backup.KBrent", "Date": "May 1, 2014"}, {"Title": "crappy and cheap", "Author": "devoted1", "ReviewID": "R1IUJC9HRONDM7", "Overall": "2.0", "Content": "i bought this for my son this past christmas.. it was working ok at first then i noticed that it started to overheat while charging then sometimes it wouldn't come on at all.. now when my son tries to play it the device just stopped working altogether...", "Date": "April 29, 2014"}, {"Title": "great when i purchased...but....", "Author": "lumia myst", "ReviewID": "R3DD8BSDG3ZTXS", "Overall": "4.0", "Content": "it worked fine for a while....now it wont charge and doesnt start up...didnt use it for more than games and checking email", "Date": "April 28, 2014"}, {"Title": "just not enough", "Author": "sara ingersoll", "ReviewID": "R2TFEH1PBOF3EX", "Overall": "3.0", "Content": "it has a very short battery life and shuts off on its own for no reason  and very short memory not enough storage space needs more", "Date": "April 28, 2014"}, {"Title": "Dragon Touch 7\" Green", "Author": "shelly", "ReviewID": "R365LOQORZLUCX", "Overall": "3.0", "Content": "it's okay, It gets very hot while you are using it, the good thing is that you can put it in the case and not get burned.  I like the color it is easy to find.", "Date": "April 28, 2014"}, {"Title": "wish i cud return it", "Author": "carri smith", "ReviewID": "RU1M576YU8OQJ", "Overall": "2.0", "Content": "the tablet over heats and freezes. pic mode works great. but if i had a choice i wud return it and invest in another kindle fire.", "Date": "April 27, 2014"}, {"Title": "works great", "Author": "Cathy lemen", "ReviewID": "RGJ3RYQXISURK", "Overall": "5.0", "Content": "I bought this for my daughter when she got her tax return & so far she loves it. Works well & is portable.", "Date": "April 24, 2014"}, {"Title": "I like it", "Author": "ramon gonzalez", "ReviewID": "RS7EAVR9YRDIK", "Overall": "4.0", "Content": "very good product", "Date": "April 23, 2014"}, {"Title": "PIECE OF CRAP", "Author": "Kim Elaine Gorak", "ReviewID": "RDI1XWSMDU73K", "Overall": "1.0", "Content": "It really is a piece of crap. I got this for a 9 year old. This is her third... The first two were problem zeepads so i thought I would try this one. BOY IS THIS A PIECE OF CRAP. It constantly restarts its self. It goes to black screen. WE have restored it at least 50 times thinking it would help whatever problem was wrong with it. NO LUCK. The whole thing is terrible. I would not waste a dime on it.", "Date": "April 23, 2014"}, {"Title": "JUNK", "Author": "Brian Kindzierski", "ReviewID": "R3CAT3L3MHEKKV", "Overall": "1.0", "Content": "This tablet took forever to do any simple iOS operation. ANY click took well into 3-5 seconds, which in computer land is an eternity. Kids games took ALL of the memory and had to be cleared to re-load app games. the machine was lethargic and unresponsive no matter what action you wanted to. DO NOT BUY.", "Date": "April 23, 2014"}, {"Title": "I love it. It's my first tablet", "Author": "A. Parson \"Blipsgirl\"", "ReviewID": "R1SDG4VF9ECIM2", "Overall": "4.0", "Content": "It fits in my pocket. The picture resolution has room for improvement. But overall, I love it. It's my first tablet.", "Date": "April 18, 2014"}, {"Title": "Good if you don't have sensitive eyes", "Author": "Sarah Timmons", "ReviewID": "R2ADKB40785GVD", "Overall": "2.0", "Content": "the resolution on the screen is poor which causes headaches for me, I could only look at the screen for maybe 5 minutes before getting a headache.", "Date": "April 17, 2014"}, {"Title": "Dragon touch", "Author": "Rebecca Acuna", "ReviewID": "R1HVU6HCMVOZGW", "Overall": "1.0", "Content": "I really don't like this tablet at all. I bought it for my son. He has had it for 4 months and has not been able to use it. It turns off every time he tries to use it. It's been nothing but trouble since we got it. I guess it's true you get what you pay for.", "Date": "April 12, 2014"}, {"Title": "Okay for kids...", "Author": "Anastasia", "ReviewID": "RCHJT4VQY4KYL", "Overall": "3.0", "Content": "I bought this and a pink one for my daughter for Christmas. The chargers dont fit well, the battery life is inaccurately represented and the graphics are not as nice as shown in the pictures. I am just glad they were for my children to play around on and not myself. Not worth the price.", "Date": "April 11, 2014"}, {"Title": "you really get what you pay for :(", "Author": "Heather Stout", "ReviewID": "R3EVQSB9WG21ZE", "Overall": "1.0", "Content": "I purchased a few of these for my kids. They shut off during play, it wont recognize passwords, the on/off button dont work", "Date": "April 11, 2014"}, {"Title": "Is a product requerid very fine its a good very very fine i like to much", "Author": "Henry Landino", "ReviewID": "R116SG81L83V0H", "Overall": "3.0", "Content": "Is a product requerid very fine its a good very very fine i like to muchIs a product requerid very fine its a good very very fine i like to much", "Date": "April 8, 2014"}, {"Title": "kinda lousy", "Author": "Amazon Customer", "ReviewID": "RAEO3AIBVA53F", "Overall": "3.0", "Content": "bought it for my niece. She doesn't like it. She gave it to her 2 year old daughter. Not a great buy", "Date": "March 24, 2014"}, {"Title": "still working", "Author": "paula", "ReviewID": "R3BXPVGCXZQVFC", "Overall": "4.0", "Content": "still working Great! Had since Christmas and its still going strong it was the 3rd one we bought, one from nomorerack that was a piece of poop, and another from Radio shack and that one was awful too and we paid too much money there. This one works great and for the price and year protection can't beat it.", "Date": "March 24, 2014"}, {"Title": "hard to get tablet to turn on", "Author": "William J Pfannenstiel", "ReviewID": "R3B0LWOY8LCDAZ", "Overall": "1.0", "Content": "I couldn't get the tablet to start the first time I tried to turn it on, so I plugged in overnight and then tried again.  Still wouldn't turn on so I put it aside plugged into power.  Went back to it later and it was on.  It was working normally except it was always tricky to turn on.  Every time I wanted to use it I seemed  to have trouble getting it started. I contacted Tablet Express by email and they had developed a fix for the operating system.  I had to buy a micro SD card to download the file too, and then insert into the tablet and restart tablet.Well guess what. I couldn't get the tablet to start up.  So I got back in touch with the Tablet Express person and was given a different file. I could now start the tablet but it wouldn't update itself.  So I was told to ship the tablet back and they would fix it.  I wrapped it in bubble wrap and shipped it in. I received an email back saying the tablet screen was broken and that it wouldn't be warranty.  They asked me how it had gotten broke. Well during the time I was emailing back and forth I was sending them pictures of the screen that I was seeing. There was no breaks in the screen.  So I feel like I got nothing for my first foray into the tablet world.Thanks Tablet Express for nothing! You got my money and I got your junk.", "Date": "March 23, 2014"}, {"Title": "not impressed....", "Author": "aubrinam", "ReviewID": "R1R0CI46V7T1E1", "Overall": "1.0", "Content": "I ordered this for my autistic daughter as advised by her doctor (to get a hand held device such as a tablet or iPad for the apps) And I pull the tablet out of the box to discover it will not even turn on! I figured it may need charging but after 16 hours of being on the charger it still would not turn on! All that happened was the charger got very hot and so did the tablet! I'm not happy to say the least!", "Date": "March 23, 2014"}, {"Title": "My son says it is just swell.", "Author": "Robert Scott \"Robert Scott\"", "ReviewID": "RHXJT1QIZAX4A", "Overall": "4.0", "Content": "I bought him this as a present after I was extremely unhappy with the \"Fast Touch\" I bought previously on Amazon for myself,  he reports that it does everything he wants with no problems.", "Date": "March 22, 2014"}, {"Title": "dont buy", "Author": "Arma", "ReviewID": "R35NS0XT2WEOZG", "Overall": "1.0", "Content": "I bought this tablet. the same day it drop & cracked the screen. now it wont charge. I would like a number so can call", "Date": "March 21, 2014"}, {"Title": "She likes it.", "Author": "Donnie Darko", "ReviewID": "R3DY9M6AH4X7DQ", "Overall": "5.0", "Content": "Was a gift for mom for Christmas. Can't afford an iPad for myself let alone to give to someone but Android is a great OS too. She uses it for facebook games and browsing simple sites so she didn't need a powerful tablet.", "Date": "March 21, 2014"}, {"Title": "I bought this for my daughter", "Author": "kristy norwood", "ReviewID": "R3DLI5M270K5P8", "Overall": "3.0", "Content": "it works pretty good my daughter loves it but the down side the battery dosnt last long and the picture quality sucks but it is great for a 12 yr old", "Date": "March 21, 2014"}, {"Title": "7\" Dragon Touch Tablet, also bought case cover with keyboard. It works Great, look forward to getting another.!!~~~~~", "Author": "Gary F Leon", "ReviewID": "R2TU0UYLQQL3BY", "Overall": "5.0", "Content": "Ordered this when my laptop crapped out... Everything they stated it would be, surprisingly works welll enough to order another for my Wife....  :)", "Date": "March 20, 2014"}, {"Title": "3 tablets, all had problems", "Author": "Amazon Customer", "ReviewID": "R2FULD8SNVRKTE", "Overall": "1.0", "Content": "One wouldn't accept an SD card...at all. All had areas of the screen that didn't respond well to touch. The volume was practically non-existent on all of them. Two of them we had used for 2 months and couldn't be returned. Luckily they ended up being dropped by kids and got cracked screens so they were covered under our square trade warranty. The third had the power button stop working just days before the end of the 30 days so we got a refund on that too.", "Date": "March 20, 2014"}, {"Title": "very nice.", "Author": "Taylor Fehr", "ReviewID": "R3AX1XTMMCHZMR", "Overall": "4.0", "Content": "This is a very good tablet for the price. People failed to mention in past reviews that they understood the screen was made of glass so be extremely carefuk , this would do great with a case and charges fine. Shipping was fast too. Get it, its more of a tablet to fool around on though. Not a school tablet.", "Date": "March 19, 2014"}, {"Title": "hey", "Author": "dennis", "ReviewID": "R236MJM4WXI5DD", "Overall": "5.0", "Content": "thank you so much i llike so much now thank u again have a good day i give u 5 i wish can give more star", "Date": "March 18, 2014"}, {"Title": "hey", "Author": "dennis", "ReviewID": "R2595RO7JI5NF8", "Overall": "5.0", "Content": "thank you so much i llike so much now thank u again have a good day i give u 5 i wish can give more star", "Date": "March 18, 2014"}, {"Title": "Works good", "Author": "Wayne Kiefer", "ReviewID": "R2O5GYOV53SZG2", "Overall": "4.0", "Content": "Everything works just as I expected except the battery life is very short.  They could add a stronger battery and it would make it much better.", "Date": "March 18, 2014"}, {"Title": "very nice  to have for kids", "Author": "karmatheone29", "ReviewID": "R26QKETT9907TE", "Overall": "4.0", "Content": "we bought this item for my boy friends kids my boyfriend plays it way more the then kids although we had some minor issues with it at the beginning it tends to be a bit slow and sometimes the screen freezes up I am happy with the product overall", "Date": "March 17, 2014"}, {"Title": "very similar to Kindle fire Hd", "Author": "Linda Kornilieff", "ReviewID": "R1O5LL6L47M0CE", "Overall": "3.0", "Content": "I ordered this thinking it was better or as good as my kindle fire and it is.. no descrepency there. however 3 days later if found this same item on EBAY for half the price. it has good quality videos and takes good pictures but I'm now unhappy that I found it just 3 days later. this to me is not right. and the price on ebay is not a bidding price it is the actual buy it now price. same exact item all the same colors etc. this is priced to high for sure. sorry but it is. thinking about returning it and purchasing the same thing for $44 off ebay and also free shipping. the truth is the truth", "Date": "March 16, 2014"}, {"Title": "dragontouch tablet", "Author": "Cody", "ReviewID": "R30ZWD6BZVLBJI", "Overall": "2.0", "Content": "I need to return this item. It wont charge. It worked fine for a few months.  Now it's completely dead.", "Date": "March 16, 2014"}, {"Title": "amie", "Author": "amie", "ReviewID": "R33Y7LS9P1A41O", "Overall": "5.0", "Content": "It works great for what I need and want. hold a charge for all day. I love it thank you", "Date": "March 13, 2014"}, {"Title": "i wouldn't bye this product again", "Author": "Channell Carmon", "ReviewID": "RU4WEZNL17GT5", "Overall": "2.0", "Content": "It works slow I would pefur this to any one at allBut it is a nice price really. Thank you", "Date": "March 13, 2014"}, {"Title": "well worth it.", "Author": "kim", "ReviewID": "R13H5CJY68BR43", "Overall": "4.0", "Content": "Works great. Just took a min to figure out. Would definitely purchase again also recommended this two others. You can't go wrong with the price. Went online and purchased Micro 2 female so I could  use my USB. I love it to just toss in bag. Not worried about it. Does every thing I need. Also hook it up to myexternal hard drive", "Date": "March 13, 2014"}, {"Title": "Get what you pay for", "Author": "Angie Gilmore", "ReviewID": "R3GYMNWYMJXBVQ", "Overall": "3.0", "Content": "Meh.I wanted a \"starter\" tablet for the kiddos. First one I received, the speakers didn't work straight out of the box. We did get a replacement that seems to be working so far. We have now had it for 3 months. Picture quality is poor. Battery drains fast. My daughters are lucky to get an hour of play at a time. The sound is also muffled and poor. I am still giving it three stars though as I knew when I bought it that I was buying a lower quality tablet. If your kids are begging for a tablet and you aren't sure if they are responsible enough to have one, this one is the perfect one to be able to find out. I do not recommend it for anybody high school aged or up though as the poor quality can be frustrating.", "Date": "March 13, 2014"}, {"Title": "nondurable", "Author": "Krystal Graham", "ReviewID": "R3H4RX7RVA4JHK", "Overall": "1.0", "Content": "Nondurable! I got these for my kids and as soon as they bump them the screens broke on them ! They aren't built to last at all!", "Date": "March 13, 2014"}, {"Title": "Disappointing purchases", "Author": "Noreen Glenn", "ReviewID": "RWSK11TO8DPJV", "Overall": "1.0", "Content": "Niether tablet isnt working properly and one isnt working at all poor choice on my behalf. Didnt recieve the earrings", "Date": "March 13, 2014"}, {"Title": "disappointed", "Author": "Brian Reames", "ReviewID": "R3G0LVNQK768Z9", "Overall": "1.0", "Content": "I am disappointed in this product it is clumsy and now it will not turn on at all. I would like to return it. B", "Date": "March 12, 2014"}, {"Title": "do not buy", "Author": "Dalia Rodriguez", "ReviewID": "R3P1GNU93PTR0U", "Overall": "1.0", "Content": "horrible. power button broke returned it and got another one and stopped working 3 days later. Had bought 2 for Christmas and both of them stopped working. Returned both! manufacture service reps are horrible no knowledge of anything and hard to understand their English.", "Date": "March 12, 2014"}, {"Title": "Tablet won't turn on at all", "Author": "Shakita M Vaughan", "ReviewID": "R6PXB1VVM0JHK", "Overall": "1.0", "Content": "Because now the tablet won't work. I can't even get it to turn on. I've only used it a handful of times prior to it not working.", "Date": "March 12, 2014"}, {"Title": "this company is disgusting", "Author": "JOYCELYN", "ReviewID": "R3B0KYVMG8WST9", "Overall": "2.0", "Content": "I bought this item for my Grandaughter and I sent to Toronto, Canada and up to date we cannot get it hook up, communication with these people,you all sucks.", "Date": "March 11, 2014"}, {"Title": "Not satisfied.", "Author": "Jason93535", "ReviewID": "RBSBYPWIUAFK9", "Overall": "1.0", "Content": "I bought this tablet for my brother this past christmas. No more than 30 days after i purchase it, it randomly shut off and never turned on again. NOT SATISFIED.", "Date": "March 10, 2014"}, {"Title": "good for kids", "Author": "Jason", "ReviewID": "R24DBUCMCE2U2M", "Overall": "3.0", "Content": "very nice and simple and works well for kids but i recommend that you get a protection plan. good luck", "Date": "March 9, 2014"}, {"Title": "Nice tablet for the price.", "Author": "Chris Craig", "ReviewID": "RAVMXWDQN3IG1", "Overall": "5.0", "Content": "I bought this tablet as a Christmas gift for my girlfriend niece she loved it. She's had it for three months now and hasn't had any issues with it.", "Date": "March 8, 2014"}, {"Title": "Don't waist your time.", "Author": "Jose", "ReviewID": "R21WJCT28YK04Y", "Overall": "1.0", "Content": "It worked till the return date expired and now I am stuck with a tablet that doesn't work. At first I would have to hold the power button for several minutes for it to turn on but now nothing and will not power on. Also the camera stopped working before that.", "Date": "March 1, 2014"}, {"Title": "tablet", "Author": "taunya", "ReviewID": "R24P9RWNP8PJE5", "Overall": "5.0", "Content": "This handy little tool is great for kids to learn and for travel. My niece is have a great time with this product.", "Date": "March 1, 2014"}, {"Title": "Died after two weeks :( ...then came alive again!!  whooo hoo!", "Author": "Stephen Carroll", "ReviewID": "RW1K7MBL5380C", "Overall": "4.0", "Content": "I liked it fine until it decharged and refused to budge.  No idea if it's the charger or the tablet even.  Plugged it in later, and Voila!  it started charging.  Will keep you posted here about the miraculous resurrection ;)  ratings going from 1 to 4 depending on current status", "Date": "February 28, 2014"}, {"Title": "DRAGON TOUCH", "Author": "Classic City Cockatiels \"Classic City Tiels\"", "ReviewID": "RQ0Z9QYD7JOYR", "Overall": "5.0", "Content": "I am so impressed with this little tablet.  great acces to google apps, nice looking case that stands out from most others being red and then having a dragon on the back as well!!  Size, Price,& shipment was super as well!!  delivered during our first snow storm!!  Would buy another from here if I had the need \"\"LOVE IT\"\"", "Date": "February 27, 2014"}, {"Title": "Very disappointed,", "Author": "Anita L Day", "ReviewID": "R6GO1C1I68JOW", "Overall": "1.0", "Content": "This has lasted only 4 weeks and will no longer turn on. When you do get it to turn on it takes 20 minutes. I ordered this on 1/16/14, shipped on 1/18/14 and received 3 to 4 days later, not sure of exact date. The return police expired on 2/22/14.  $80 bucks down the tubes and one very unhappy grandson. If there was less then a 1 star I would give a zero!!!Due to an on going problem with Dragon Touch Tablets that they are very well aware of. We received a replacement for the 1st one around the 1st week in March. 2 1/2 weeks later the 2nd is doing the same thing. Now CS Tablet Express wants us to do a fix that THEY knew about at our expense of $30 for a mini SD card to POSSIBLY fix it. I asked for a refund as we had less then 3 weeks. They now inform me the 30 day warranty has expired and I would be generous enough to give me 70% back. No wonder people are leaving bad reviews. Bad tablets and very poor service!!!!!", "Date": "February 26, 2014"}, {"Title": "4 stars tablet", "Author": "trashika", "ReviewID": "R1OEWFENXV0E16", "Overall": "4.0", "Content": "I give it 4 stars it's great. My 10 yr old niece loves it. She is on it constantly before and after school", "Date": "February 26, 2014"}, {"Title": "Not worth the trouble", "Author": "Tina", "ReviewID": "R2ZUT3RUWWTT5Q", "Overall": "1.0", "Content": "Have purchased 2, which both had to be returned for defects. This product is not worth the money, or the disappointment it put my daughter through. If you are considering a tablet, skip this one. It is junk.", "Date": "February 25, 2014"}, {"Title": "i dont liike it", "Author": "yanira", "ReviewID": "R16PV4UPWNFLE3", "Overall": "1.0", "Content": "its slow it came broken and damaged it doesnt want to turn on and came with a cracked screen . i want my money back or a ima send it back", "Date": "February 25, 2014"}, {"Title": "Not bad", "Author": "Nicole L Walker", "ReviewID": "R1ZYUJMDIY0BBV", "Overall": "4.0", "Content": "I was worried, based on the reviews, but my boyfriends daughter absolutely loves it.  She got it for Christmas and uses it almost every day.  She watches movies that I have downloaded or Netflix and plays games with no problem.  I haven't heard her complain once about it.  She is only 8, but at her moms house she has an Ipad and she says it isn't as fun, because of the lack of movies and the games aren't as fun.  So, based on her own experience I'm giving it 4 stars.  It is a little slow for me, but great for kids.", "Date": "February 24, 2014"}, {"Title": "bad", "Author": "Rick Clark Jr.", "ReviewID": "RE5T9PXW5KFZG", "Overall": "1.0", "Content": "Did not work! Appears to have been dropped or not inspected, any any rate my kid is very upset and so am I!", "Date": "February 24, 2014"}, {"Title": "Broke immediately", "Author": "CrazyDaizy99", "ReviewID": "RLGP3LNBFDWAW", "Overall": "1.0", "Content": "A fun little android tablet when I bought it for my daughter. But it failed within two weeks after she got it for Christmas and is now useless... very disappointed after the positive reviews I read.", "Date": "February 24, 2014"}, {"Title": "Not impressed.", "Author": "Sara Wheeler", "ReviewID": "R2PTLV5B5FBA5U", "Overall": "2.0", "Content": "I think my Android phone has more \"oomph\" than this product.  It is slow, not user-friendly and has terrible battery life.  I wish I would have kept the box and returned it.", "Date": "February 24, 2014"}, {"Title": "Meh...", "Author": "Amazon Customer", "ReviewID": "R10KM4G8MQO0D", "Overall": "3.0", "Content": "It's an okay tablet, especially for the price you are paying.  Don't expect too much in the way of graphics, and you can only really see the screen straight on (gets really blurry at an angle).  The battery sucks, drains very quickly and takes forever to charge.  Save a little more money and buy a Nook or a Kindle.  That's what we had to do for my son, after spending the money on this one...", "Date": "February 23, 2014"}, {"Title": "Good tablet", "Author": "My 2 monkeez", "ReviewID": "R3HKZSTD1AZSFE", "Overall": "4.0", "Content": "Great item for kids, the only thing is charging cable is not very sturdy ( at least for kids) .", "Date": "February 23, 2014"}, {"Title": "Dragon Touch", "Author": "Patti Barnes", "ReviewID": "R2K7FV7N92E16H", "Overall": "1.0", "Content": "Ordered same tablet twice.  Both had to be returned due to very short playing time (less than two hours after charging), both completely died after a few days and the second one got very hot.", "Date": "February 21, 2014"}, {"Title": "Very disappointed.", "Author": "Linda Baragona", "ReviewID": "R1SR512SPJU3GA", "Overall": "1.0", "Content": "Broke in the first day. Bought 4 of them. Others screen cracked and when they would run took hours to download one game. Very disappointed.", "Date": "February 21, 2014"}, {"Title": "Decent (wanting instagram?)", "Author": "JENNIFER", "ReviewID": "R3474BIZQTERPF", "Overall": "4.0", "Content": "I got this for my preteen daughter so she would stay off the IPAD.  So far it is pretty decent, she is using it for KIK messenger, Netflix, and Instagram.  We downloaded kik and Netflix by going to google play but had to use back doors for instagram because the device did not support instagram.  I think it just wont support the newest version but we went to the next version down and it was fine.  I am pretty sure this is not the best thing to do because I got a \"enter at your own risk\" warning from the tablet by going to android drawer to download but it worked fine for us.  We then tried to add a game but it said we were short memory, to be fair it was a large game.  I instantly went back on amazon to find an SD card for it but I didn't really find anything that said \"YO this is for the Dragon Touch\" so I am leery to buy one.  It is probably a generic SD card but I would like more direction to accessories for this tablet, they only have a million for the covers, screen covers, cases, and foilos, but no SD card, geesh.  Overall it is not bad for the price and I am getting another one for my other daughter.FYI ****Want Instagram[...]", "Date": "February 20, 2014"}, {"Title": "dont buy this tablet", "Author": "manny", "ReviewID": "RXIPC6NWCKJ4U", "Overall": "3.0", "Content": "The tablet keeps disconnecting from the WiFi the camera is horrible both front and back u cant download certain games it has a delay when unlocking it", "Date": "February 20, 2014"}, {"Title": "NO GOOD", "Author": "Zelyntor", "ReviewID": "RCPQ90WVXTBY6", "Overall": "1.0", "Content": "I thought this might be a nice tablet to get my wife to use one, but because it barely works she gave up on it.  I would not recommend it to anyone - pay a bit more and get a Kindle.", "Date": "February 20, 2014"}, {"Title": "Didn't work for us", "Author": "Kelly Reagor", "ReviewID": "R2NTMREABXULG8", "Overall": "1.0", "Content": "This item just didn't meet the needs of my 12 yr old ,  it was cute that's about it ,", "Date": "February 20, 2014"}, {"Title": "excellent and reliable product", "Author": "moreno_716", "ReviewID": "R3RAS698ISG2LU", "Overall": "4.0", "Content": "despite being an economic team that meets the system requirements that are needed and reliability of these devices and that's why we chose", "Date": "February 20, 2014"}, {"Title": "I loved it while i was able to use it", "Author": "J.J.", "ReviewID": "R6NWW7H1G8GBT", "Overall": "5.0", "Content": "I loved this tablet even though I only was able to use it for a week due to the screen shattering.  That was the only downside.  I set it on the charger over night and when I woke up the screen had spider web cracks all over.  My wife has the pink one and she loves it.  Not a bad purchase for $79.99", "Date": "February 19, 2014"}, {"Title": "Overall happy with the purchase", "Author": "Virginia manriquez", "ReviewID": "R5T5QQE4CAVJJ", "Overall": "4.0", "Content": "The tablet works great I bougth it for my daughter she is 5 ... There is two things that I dont like the screen is too bright it almost looks like it has 2D or 3D you have to tilt it to the side a little to be able to see, I dont seem to find a setting to control that brightens. The audio is kind of low my daugther is hard of hearing and it doens't seem to boder her but with background noise I even have a hard time hearing.", "Date": "February 19, 2014"}, {"Title": "great for  kids and teens", "Author": "Jean", "ReviewID": "RBL36D4EELVK4", "Overall": "4.0", "Content": "Great item for the price, I got this for my 12 yr old son, he absolutely loves it. it never leaves his hands. the videos and games are crystal clear.", "Date": "February 18, 2014"}, {"Title": "good product for the price", "Author": "Jean", "ReviewID": "R12SQB3U3R1Y47", "Overall": "5.0", "Content": "Turned out to be a nice present for the price. My 14yr old loves it and has not reported any problems with it what so ever.", "Date": "February 18, 2014"}, {"Title": "Died after 6 days.", "Author": "Lisa Coleman", "ReviewID": "R1X9Z90LF63M9I", "Overall": "1.0", "Content": "I bought this tablet after my nephew said it was awesome and when you plug it in to charge, nothing and it won't turn on?  Then it happened to my son's that I bought him too?  They ought to stop selling them", "Date": "February 18, 2014"}, {"Title": "Not a happy customer- Power button not working after 2 days", "Author": "Blake Martin", "ReviewID": "R1HTYKWL4BHQWE", "Overall": "1.0", "Content": "I ordered 2 of these right before Christmas as gifts for my children. I also got the Square trade Warranty for an additional $10 on each tablets. The Square Trade Warranty is awesome. However the tablet is not. Soon after Christmas, the tablet was accidentally dropped and I called SquareTrade and within 2 days I had the purchase amount back in my paypal so I could buy another tablet to replace this one. Here is where the problem started. I purchased the tablet and  not even 2 days after receiving it, the power button sunk down in the casing of the tablet and it will not power on or off. I returned it(Amazon Prime  return was painless) and purchesd another one. within 24hrs of receiving it, the power button done the same thing. Not sure what is causing it to sink down in the casing of the tablet and not work. The two new tablets have not been dropped or mistreated. The other tablet I purchased at Christmas has just now stopped charging as well. I have ruled out the charger because I have a working charger for the other one that is identical. I guess you get what you pay for with these tablets.", "Date": "February 18, 2014"}, {"Title": "It worked awesome . . . for about 2 months", "Author": "Amazon Customer", "ReviewID": "R2365DZBCVVED3", "Overall": "3.0", "Content": "It worked awesome for about 2 months and then bam it never came on again.  No warning, no error message nothng.  Doesn't seem to be anyway to even get to the battery to see if that's the problem.  It looks like I'd have to break the case to get to the battery.", "Date": "February 18, 2014"}, {"Title": "not good for me", "Author": "Tiffannie R.", "ReviewID": "R1GU4VNRQCPLTF", "Overall": "1.0", "Content": "Product overheats & shuts off with use. Then it turned off & never allowed me to use it again. This product wasn't for me", "Date": "February 18, 2014"}, {"Title": "Nice", "Author": "M. Crosson", "ReviewID": "R2R822T47VJZ0Q", "Overall": "5.0", "Content": "I got this for my 10 year old. He loves it. It's inexpensive and works very well. I suggest a good case though.", "Date": "February 17, 2014"}, {"Title": "Meh. Double meh.", "Author": "Kate F. \"rocketgrrl\"", "ReviewID": "RL0C0Z3KMG2QC", "Overall": "2.0", "Content": "- Heats up something fierce while using- Very slow when using apps- Would not connect to my computer to transfer files via USB; computer could not recognize itI cannot recommend this.", "Date": "February 14, 2014"}, {"Title": "Tricky", "Author": "Sassy & Seventy", "ReviewID": "R2FIJFHY3I7AL3", "Overall": "2.0", "Content": "Most of the time, the table will not open up---that is, come \"on\".  I am chalking this up as a \"learning experience\"; you get what you pay for.  This was a \"cheap\" item, should have known better----don't waste your money or time with this product---buy the more dependable expensive tablet!", "Date": "February 14, 2014"}, {"Title": "good for a child who is learn to use a tablet", "Author": "Africana", "ReviewID": "R23Y0L1VJHP3LT", "Overall": "1.0", "Content": "It takes ten hours to charge. It can't charge with the charger I receive n it can't charge n use at the same time. Its just a waste of time the battery only last 30 minutes or less. Nonetheless my son still love it", "Date": "February 12, 2014"}, {"Title": "Product isn't worth the monehy", "Author": "Lorraine Washington", "ReviewID": "R28KBJPIYMJWWU", "Overall": "1.0", "Content": "First tablet would not turn on after being fully charged. Second tabled worked for 3 months and again would not turn on after being fully charged. Product is defective. Would not recommend this product. If you decide to purchase this product, please get warranty to be safe.", "Date": "February 12, 2014"}, {"Title": "Only works when it wants to.", "Author": "Rachel217", "ReviewID": "R16KXMKX58E1MG", "Overall": "2.0", "Content": "Everyone told me not to go cheap on electronics-and I should have listened!  The screen blanks out frequently and I have to turn if off and back on again to resolve the problem.  The resolution is extremely poor making.  The battery life is quite low.  It's just not as I thought it would be.  Needless to say, I am now stuck with having paid for this hunk of junk, and now having to purchase one of higher quality.", "Date": "February 12, 2014"}, {"Title": "Tech support is poor", "Author": "Mark L.", "ReviewID": "R24ZS2FCJS92OF", "Overall": "4.0", "Content": "Needs a better manual, Okay for the price.  Shop around and see where a toll free tech support option is available.", "Date": "February 12, 2014"}, {"Title": "dragon touch lightly", "Author": "julie spears", "ReviewID": "R2NSGEUBWFSGUL", "Overall": "2.0", "Content": "Screen broke rather easy. Bought two at same time both broke within a cpl weeks so touch lightly or it may just shatter", "Date": "February 12, 2014"}, {"Title": "Worth the money", "Author": "Tonya Steinkruger", "ReviewID": "R1TC8115AL4PT", "Overall": "5.0", "Content": "I purchased this for my 11 year old Grandson for Christmas. I also bought a leather cover for protection which he never used. He dropped it and the power button is very sensitive. Please purchase extra protection and memory card.Michael loves this Dragon and it helps him scholastically and allows him fun with games. He has learned how to e-mail and send photo's. I hope in time he will learn how to go to his Schools website, click on the links to join in on extra English work.The Dragon is pretty clear to watch video's, play games and access the super information highway faster than my phone.", "Date": "February 12, 2014"}, {"Title": "Low quality", "Author": "Dana", "ReviewID": "R2GRDB8VX6GIAU", "Overall": "1.0", "Content": "This tablet is slow. I bought it ahdmhadnproblems with it from day 1 till it broke. Waste of money and time.", "Date": "February 12, 2014"}, {"Title": "works ok. gets hot.", "Author": "stephanie copley", "ReviewID": "R252KNJ7FKVCTW", "Overall": "2.0", "Content": "i bought it for a certain game. wont download the game. battery life is extremely short. always be close to a plug in. gets hot easily. and if u turn it off. it struggles to come back on. i would not buy this. if i had it to do over. i would have saved for a kindle.", "Date": "February 11, 2014"}, {"Title": "Broke after 1.5 months", "Author": "Michaela", "ReviewID": "R1MILI2J6BRYGD", "Overall": "1.0", "Content": "This tablet worked fine and the internal system is still in good shape but the charging port will no longer accept charge.", "Date": "February 11, 2014"}, {"Title": "dragon touch", "Author": "katie", "ReviewID": "R1OT3LO2JGDTL6", "Overall": "1.0", "Content": "The screen is difficult to see. The camera sucks and i barely can read what is on the screen. ugh", "Date": "February 10, 2014"}, {"Title": "like it alot but wish the camera took better pictures", "Author": "Dovie Sartino", "ReviewID": "R10P9QXPRRV60Z", "Overall": "4.0", "Content": "I would recomend this tablet to anyone. it is just the right size to put inmy purse . I'm very happy!!!", "Date": "February 10, 2014"}, {"Title": "Stops working and is out dated", "Author": "Michael", "ReviewID": "R3OM9G9C7HFL9G", "Overall": "1.0", "Content": "I got it and after a week the batery started to drain fast and it froze up a lot. After 3 weeks the battery won't hold a charge. Even if u give it a full charge as soon as the screen turnes off it won't turn back on. You can't download anything for it because it operating system does not support much of anything. Don't buy it's crap.", "Date": "February 9, 2014"}, {"Title": "good tab for child", "Author": "Sandra Greene", "ReviewID": "R49DA1E171B8E", "Overall": "3.0", "Content": "Cameras not real good. Battery life isn't long. Screen picture isn't so good. Return arrow in bad spot. Great for a small child.", "Date": "February 8, 2014"}, {"Title": "wish there written directions on this tablet.", "Author": "Deborah J. Fenwick", "ReviewID": "R2T4CU5LAQDZV7", "Overall": "4.0", "Content": "needs written directions or a pamphet with it. Do like it but harder then I thought to navigate through this tablet.", "Date": "February 8, 2014"}, {"Title": "Dragon Touch® 7'' Purple Dual Core Y88 512MB/4GB Google Android 4.1 Tablet", "Author": "Nim Merchant", "ReviewID": "R1SXIDUAQHZY74", "Overall": "2.0", "Content": "The Dragon Touch tablet is slow and the sound is very poor,  you even can't hear from couple of feet.Nim Merchant", "Date": "February 7, 2014"}, {"Title": "3 bought, 3 returned not worth the time or trouble.", "Author": "Rebecca Morgan", "ReviewID": "R3IZ3ENA2SMJ48", "Overall": "1.0", "Content": "I originally purchased two of these as Christmas gifts. They arrived quickly and we charged them for a full 18 hours before first use.  One of them worked fine, but the other only had sound for about 5 minutes. Later that day, the one without sound began to crash to a white screen. The other one operated ok, but would lock up running only 1 app (Bad Piggies). I sent the soundless one in for return and bought another hoping it was an anomaly. The replacement worked for 1 week. It then began having a nervous breakdown, deciding randomly to shut down or refusing to power on. The remaining original tablet began having problems at this time, failing to charge or refusing to power on. I returned both tablets for a refund and will not be buying replacements.I don't expect a lot at this price point, but I do expect minimal functionality. The build quality on these units is very poor. The charging port is loose, the plastic molding has ridges and rough spots. The screen has inconsistent quality and very poor color rendering. The components should more than handle basic apps like Bad Piggies but because they basically threw them together nothing works well for long.", "Date": "February 7, 2014"}, {"Title": "Bad Investement", "Author": "Thomas Beeson", "ReviewID": "R3SBSP9IZCXUJV", "Overall": "1.0", "Content": "Purchased three tablets for grandchildren, out of the box one would not even turn on, the next two were out of service in about three weeks. The second stopped receiving wifii and the third, the screen went blank. AMAZON tried by getting one replaced but , the other two were broken by that time I got that one back, just gave up on getting anymore help with them. DON'T WASTE YOUR MONEY ON THESE TABLETS.", "Date": "February 7, 2014"}, {"Title": "Good buy", "Author": "Rebecca Thomas", "ReviewID": "RI9QQI9ZWG444", "Overall": "3.0", "Content": "The screen freezes up sometimes. Other wise. This is a good product for my grandson. He loves it. This product was great for the .price", "Date": "February 7, 2014"}, {"Title": "pretty good", "Author": "Kari Branham", "ReviewID": "R1EQMZM9I2KA3Q", "Overall": "4.0", "Content": "This tablet is very easy to use the only reason I gave it 4 not 5 stars is because it is very easily broken the plastic case is very cheaply made but what do you expect for the price but other than that the functionality is awesome it doesnt freeze up and is easy for my 6 yr old to use and understand.", "Date": "February 5, 2014"}, {"Title": "Not Happy!!!!", "Author": "Tyra West", "ReviewID": "R1K59JY8JBGCTZ", "Overall": "1.0", "Content": "This product did not charge. I only had it for a few days.3 days to be exact. Will not purchase another.", "Date": "February 5, 2014"}, {"Title": "You get what you pay for", "Author": "sissy", "ReviewID": "R3WFJLW2GLV6T", "Overall": "3.0", "Content": "Camera stinks and volume control on one is stuck. They are very light weight which is nice. Don't expect Kindle or iPad quality with this tablet.", "Date": "February 3, 2014"}, {"Title": "DragonTouch", "Author": "Shelia D. Perry", "ReviewID": "ROQUSR5T0792H", "Overall": "4.0", "Content": "Everything about the Dragon Touch is clear, there were noproblems with downloads- you can barely touch the screenand no problems at all.  I would recommend this to all ofmy friends.  I am 60 years old", "Date": "February 3, 2014"}, {"Title": "my tablet is ok....", "Author": "Charkia Hunt", "ReviewID": "R159AF3SLI8YVZ", "Overall": "3.0", "Content": "It was fun when I fist got it because the price was perfect but I just wish I can download some app I use a lot like Instagram and vine and IHeartRadio...and sometimes it moves slow or freezes and I have to reset it...its a good tablet for people who don't do much...but me I didn't realize till after a week I got it I have to get a sim car....not cool...", "Date": "February 3, 2014"}, {"Title": "review", "Author": "Donna Nimmo", "ReviewID": "R3GZ3JWNMWI7D2", "Overall": "5.0", "Content": "I am very happy with my drgon touch. I just wanted to play games on I could carry around with me and I'm 62 years old and love it. A good price and perfomance without the price of an ipad.", "Date": "February 2, 2014"}, {"Title": "Great for the price.", "Author": "Jaemiah", "ReviewID": "R3RAIHC3JSB6GP", "Overall": "3.0", "Content": "definitely would recommend it. Im happy overrall.Would have given itt 4 stars but they sent me the wrong color and I didn't feel like going thru the exchange process.Would deserve a 5 star if the battery life was longer.Visual is great sound was surprisingly good.I don't regret the purchase at all, just wish I got the color I wanted.", "Date": "January 27, 2014"}, {"Title": "Keep looking", "Author": "Christal Burston", "ReviewID": "R3B5EM06DQ7MQE", "Overall": "1.0", "Content": "Don't buy it ! I bought 2 for my children for Christmas. One works just fine although within a few weeks of playing it the tablet literally fell apart. Buttons came out etc.  The other tablet even though I have called the company several times has a hard time coming on and when it does all memory is lost. It won't hold the correct time and date or even a wifi signal.", "Date": "January 27, 2014"}, {"Title": "Dragon Touch", "Author": "baker", "ReviewID": "R1RCAB2F1WG3QS", "Overall": "2.0", "Content": "I was excited to order this for my 11 yr old son for christmas. When It arrived I had to charge it for a full 8 hours before its first use and again once more another 8. I was disappointed the case seemed very cheap quality as well as the screen. This tablet lasted 2 weeks and it dropped once and the screen was gone and would't even power up all the way. I have a Kindle and have dropped it 100 times and it still works with no problem! Glad I bought the square trade agreement!", "Date": "January 26, 2014"}, {"Title": "perfect color - perfect fit", "Author": "Douglas W. Daniels", "ReviewID": "R3RYWU7WVYFFWZ", "Overall": "4.0", "Content": "I am very pleased with this product. My wife loves it constantly braggs on how her co workers like it. They think she is spoiled", "Date": "January 25, 2014"}, {"Title": "Dragon tablet", "Author": "Gigi", "ReviewID": "RF19GEIVPUJLV", "Overall": "5.0", "Content": "Got this for my 4, 5 & 6 year old kids it works great for them also got it for my 18 year old brother they can go 3 hours straight before having to charge it is great for the price....also the color of the tablet is bright love that", "Date": "January 17, 2014"}, {"Title": "Awesome tablet for the Price!!!", "Author": "Ernest James", "ReviewID": "R13VKCG5MCLMWL", "Overall": "5.0", "Content": "Good buy for Kids and Adults.  I would get the silicon slip cover, if buying for kids, product is fragile to say the least", "Date": "January 17, 2014"}, {"Title": "Good buy", "Author": "Alfonso", "ReviewID": "R1R7QFSQSL8A5P", "Overall": "3.0", "Content": "I bought it for my little girls it has been a great system. The have enjoyed it immensely. We are happy with it", "Date": "January 17, 2014"}, {"Title": "disappointed", "Author": "james", "ReviewID": "RC1S19OBSPK41", "Overall": "1.0", "Content": "Most apps i use wont work with this tablet. spend a few more and get a better tablet not what i expected", "Date": "January 17, 2014"}, {"Title": "gerat tablet", "Author": "Donald Suggs", "ReviewID": "R3FGPXYV1613VY", "Overall": "5.0", "Content": "Daughter ecstatic !!!! great picture quality and ease of use. she is pre-occupied with it for hours. she loves the purple color.", "Date": "January 16, 2014"}, {"Title": "Good", "Author": "Jason", "ReviewID": "R3MJVH74TAUT3U", "Overall": "4.0", "Content": "Overall these are some decent tablets. I bought 3 for my kids around Christmas time. The only problem I was concerned with was turning it on the first time. I saw where some had issues with it not turning on, after talking to a local tech in my area he said they sometimes can take a little longer than a few seconds to switch on the first time.SoI held the power down roughly 10 seconds or so and it fired right up. No issues and kids enjoy it for music and games.", "Date": "January 16, 2014"}, {"Title": "Good Start up Tablet", "Author": "Jorge O. Espejo", "ReviewID": "R160ZTADQXWEUG", "Overall": "4.0", "Content": "The tablet comes preset with a certain storage allocation to operational memory and internal memory which limits what you can download depending on the demand of the specific App. The battery life is not very long, 2hrs - 2.5hrs maybe, and the unit seems to get hotter than normal when charging. Overall the tablet is not bad for the price, you just have to get a bit technical in reformatting it to your desired storage space allocation. It is a good startup choice in tablets when you have more than one child, ages ranging from 7 to 12 and you are trying to satisfy everyone with a tablet.", "Date": "January 16, 2014"}, {"Title": "Great can't go wrong for your little one", "Author": "Jittuana Pfeifer", "ReviewID": "R13YJ8S9FH3P8Q", "Overall": "5.0", "Content": "Awesome,  just a little slow but great kids got them for Christmas and have played with them ever since then. Great price and look, I purchased 2.", "Date": "January 16, 2014"}, {"Title": "dragon touch", "Author": "William l jones", "ReviewID": "R2UU2YG2O696AI", "Overall": "1.0", "Content": "didn't work most of the time. there were a few times that I couldn't get it to turn on for a few days. very unhappy with it.", "Date": "January 15, 2014"}, {"Title": "tablet safety", "Author": "Joseph Parsons", "ReviewID": "RVBAJCIDDSTH3", "Overall": "1.0", "Content": "the battery area get super hot after only 20 minutes of use. the tablet also keeps resetting it self back to the year 1970", "Date": "January 15, 2014"}, {"Title": "doesn't work properly.", "Author": "pat lee", "ReviewID": "R2JXTQZ5SIB6H2", "Overall": "1.0", "Content": "It gets hot and goes off. It won't hold a charge but for 2 hours. The other 2 work work just fine. I need to send it back. Could you tell me where to send it?in", "Date": "January 15, 2014"}, {"Title": "They would not even charge well", "Author": "pat 69", "ReviewID": "R3JOFKYPN0DAP5", "Overall": "2.0", "Content": "When I saw this tablet of amazon I thought it would be the perfect Christmas gift for my girls. then after talking to my friends about it , they asked to buy some for their kids as well so I bought 7 of them. It was hard to get them to charge the first time after that they seemed to be ok but they kept turning off over and over again while they were playing.  One of my friends could never get it to charge at all even after I lent her my charger hoping that it was the only problem. we only had them for 10 days and it was more of a battle every day so all of us decided to returned them and we did not get all of the money back even though it was not our fault that we had to return them. We are very disappointed!!", "Date": "January 15, 2014"}, {"Title": "Worst Tablet Ever!!", "Author": "AlexusJoullanar", "ReviewID": "RIU0DG0U4CJC1", "Overall": "1.0", "Content": "It didn't charge well at all & it froze a lot & was very slow. It also felt very cheap like a piece of plastic.", "Date": "January 15, 2014"}, {"Title": "You get what you pay for", "Author": "Busy mom", "ReviewID": "R2TZPG5SSBZGTE", "Overall": "3.0", "Content": "I ordered two, one for each of my kids. One of them worked (and still works) as advertised. The others charging port didn't work from the start, and usb charging is certainly not sufficient. I returned the defective one and got a refund.The operation of the tablet is as expected. It's fast enough. The battery life isn't that long, but long enough to keep the kids occupied for a road trip.", "Date": "January 15, 2014"}, {"Title": "dragon touch", "Author": "jacob Doan", "ReviewID": "RRXAR1COPGX3M", "Overall": "5.0", "Content": "Tablets are awesome battery life isn't great but they stream Netflix and hulu perfect no lagging games run smooth its an awesome device for an awesome price.", "Date": "January 15, 2014"}, {"Title": "Waste of money", "Author": "momof3s", "ReviewID": "R2B8MZDP1KL658", "Overall": "1.0", "Content": "Bought tablet for my sons Christmas and display died in less than 4 weeks. Refused to buy another one. Cheap is not always good.", "Date": "January 14, 2014"}, {"Title": "waste of money", "Author": "anne shirley", "ReviewID": "R18O0GBLYP64D4", "Overall": "1.0", "Content": "From day one the dragon tablet would not let me do anything, and by day three would t keep a charge.", "Date": "January 14, 2014"}, {"Title": "Good stuff", "Author": "William McDonald", "ReviewID": "RUUNZ4J2PD90L", "Overall": "4.0", "Content": "Bought it for a 3yo and he loves it easy to navigate and hold for him good stuff here thanx", "Date": "January 14, 2014"}, {"Title": "Awsome For Its Price", "Author": "Jennifer", "ReviewID": "R2S8I0INJ5CLR", "Overall": "4.0", "Content": "Awsome tablet for a reasonable price. Fast and does everything I want it to do and more. Highly recommended for kids and adults.", "Date": "January 14, 2014"}, {"Title": "Ok", "Author": "leslie", "ReviewID": "R1SID5OVUZ4XDG", "Overall": "1.0", "Content": "The sound button isn't working properly had to return it ... And got my daughter one and when I got it the wifi wouldn't connect", "Date": "January 13, 2014"}, {"Title": "Just plane junk!!!", "Author": "chad", "ReviewID": "R3637ALKG3KAI5", "Overall": "1.0", "Content": "Wow I seen some bad screens in my life with all the tech I buy and own but thing is so bad that it is hard to do anything on it at all.When I bought this thing I call it that because its not up to par to be a tablet I knew it wouldn't be the best for 100$ but I did expect it to work half right this thing is a joke its so slow I have an old HTC wildfire sitting around and it is faster then this tablet. Don't waste your money it is built so cheep a day after I had it the screen went black I pulled the back off and all the ribbon cables came out of the sockets junk do your self a favor and don't even give this thing a second thought.", "Date": "January 13, 2014"}, {"Title": "Nice for the price", "Author": "Carol Miller", "ReviewID": "RPE9Q6W3COKCQ", "Overall": "4.0", "Content": "Nice little tablet.  It's great for the kids.  A little slow to start up but we can live with that.", "Date": "January 13, 2014"}, {"Title": "broke", "Author": "Monica Jansen", "ReviewID": "R2IEKOV9H64AFP", "Overall": "1.0", "Content": "It broke the first day by setting it up the screen cracked and No good won't work. It seams very cheaply made.", "Date": "January 13, 2014"}, {"Title": "great gift", "Author": "Helen", "ReviewID": "R1ZN50D4H3TQ4J", "Overall": "5.0", "Content": "This was purchased for a 13-year old and he absolutely loved it.  The speed of operation was good and the ability to add extra memory was awesome. Unfortunately it met with an accident but is being replaced with the same tablet.", "Date": "January 13, 2014"}, {"Title": "Was somewhat dissapointed", "Author": "Marissa Wilmot", "ReviewID": "R2BYEU69OGKMWS", "Overall": "3.0", "Content": "Loved how user friendly it is, however it was dropped a very short distance and the screen broke, so not very resiliant.", "Date": "January 13, 2014"}, {"Title": "Very good Purchase", "Author": "John George", "ReviewID": "R1X8N4UA6GTL4F", "Overall": "5.0", "Content": "This item was at a great price and made good for a Christmas present. Was very satisfied with this purchase.", "Date": "January 13, 2014"}, {"Title": "short battery", "Author": "Amazon Customer", "ReviewID": "R2YMQ8IJ9EGULW", "Overall": "2.0", "Content": "I got this for my son because it was a low cost and it wouldn't b a huge deal if something happened to It however after 10 minutes of him playing a game it goes dead.", "Date": "January 12, 2014"}, {"Title": "Waste of money!!", "Author": "Danielle Montes", "ReviewID": "R1ETOYG06WOPHK", "Overall": "1.0", "Content": "I would rather rate a zero!! We ordered 2 of these for my daughters. One seemed like it was going to work ok and one would not turn on after a full 10 hour charge as directed! The one that did turn on would not connect to our wifi, it would just keep trying while the battery ran down and would finally time out. We have several other wireless devices in our house that connect to our wifi instantly. My daughter did enjoy playing with the very poor quality camera, but that did not make it worth keeping!! We are sending both back!!", "Date": "January 11, 2014"}, {"Title": "Gragon Touch 7\" tablet", "Author": "Jo Jackson", "ReviewID": "RCU4FO1EIU1V2", "Overall": "4.0", "Content": "Item was purchased for Christmas present and returned to Amazon.  Reason:  bought for my granddaughter, she received two tablets so I returned the one I purchased.", "Date": "January 11, 2014"}, {"Title": "My son", "Author": "francisco molina", "ReviewID": "RSQSZKKPRZORZ", "Overall": "4.0", "Content": "He is so happy with that tablet.  No more problem anywhere because he pay more attention to the tablet.  Thanks", "Date": "January 11, 2014"}, {"Title": "not worth the money!!!", "Author": "louy pravong", "ReviewID": "R3BC8G7VCORZGP", "Overall": "1.0", "Content": "bought 3 for my kids. paid about 100 bucks each. within 2 weeks the power button broke on 2 of them. had to squeeze the surronding area for it to turn on. after the 3rd week, it wont even turn on. p.o.s product!", "Date": "January 8, 2014"}, {"Title": "Not 100% impressed", "Author": "Shanyka Jackson", "ReviewID": "R1WZTEH0P9LAS7", "Overall": "3.0", "Content": "Tablet quality/resolution is not the greatest. The power cord adapter does not fit all the way into the female portion of the tablet, leading one to believe that it is not charging when plugged up.", "Date": "January 8, 2014"}, {"Title": "pretty price perfect!", "Author": "Mommy", "ReviewID": "ROITYEYLZS13Y", "Overall": "4.0", "Content": "I bought this tablet for my 14 year old daughter and she looves it we love the color it is so pretty.  I was afraid it would look cheap but it is sleek. I took off one star bc the camera could be better. The android system is great!  So far so good!", "Date": "January 8, 2014"}, {"Title": "Good for the price", "Author": "David DiCantio", "ReviewID": "RBE6ML7DRFPU6", "Overall": "4.0", "Content": "I gave this four stars because for the price it seems to be a very good unit. I bought two of them, one for each child, and they have been playing them A LOT since the holidays with no issues.", "Date": "January 8, 2014"}, {"Title": "as long as it turns on", "Author": "4x4chevy", "ReviewID": "R9OSYF0FX9AHP", "Overall": "3.0", "Content": "Its very nice as long as it turns on. Sometimes if it gets turned of or if it dies it won't start back up.", "Date": "January 7, 2014"}, {"Title": "Nice starter tablet", "Author": "JennHay", "ReviewID": "R2DEOMXD5VFJ87", "Overall": "4.0", "Content": "This was a gift for my kids, they like them very much and the ability to choose a specific color for my Boy and Girl was the best. They are not very powerful pretty slow once you start downloading apps which is all my kids want to do so they have to wait for a bit to get the functions going but all in all a great purchase for the price.", "Date": "January 7, 2014"}, {"Title": "tablet", "Author": "Missy K", "ReviewID": "RCW0GCCGYW9CT", "Overall": "5.0", "Content": "gave this as a christmas present to my daughter and she loves it! it runs fast, and it was her favorite color", "Date": "January 7, 2014"}, {"Title": "A Gift", "Author": "kilaun thomas", "ReviewID": "RE6TFNSK1XC80", "Overall": "3.0", "Content": "It does what was expected. durable and love that i was able to choose his favorite color. he uses it to watch movies on the go but the volume on it is very low", "Date": "January 7, 2014"}, {"Title": "Not satisfied", "Author": "jamie johnson", "ReviewID": "R36WOB0R171LK3", "Overall": "1.0", "Content": "The tablet freezes all the time has to be reset and the plastic surrounding it always snaps off.  Honestly it's junk", "Date": "January 7, 2014"}, {"Title": "Not bad", "Author": "Ralph Conti", "ReviewID": "R2D1RSSRU04H7I", "Overall": "4.0", "Content": "Bought for my 8 year old and it works well enough for simple use.  Over all, a good buy for the price.", "Date": "January 7, 2014"}, {"Title": "A great deal in a colorful package", "Author": "teresa codispoti", "ReviewID": "R3RW7KFLEXY5F", "Overall": "5.0", "Content": "Easy to use quick and my granddaughter loves the color an awesome tablet for the price I would recommend it", "Date": "January 5, 2014"}, {"Title": "my 12 year granddaughter is very happy with it", "Author": "Roland Brisson", "ReviewID": "R2H9IAFF8UB69B", "Overall": "5.0", "Content": "my granddaughter loves it. With so many choices it was hard to know which tablet to choose. I guess I chose well.", "Date": "January 4, 2014"}, {"Title": "thanks mom!", "Author": "Ashley Greer", "ReviewID": "R17MMJCXINNMMQ", "Overall": "5.0", "Content": "My mom bought this for me as a gift.. its cute! I got the blue one. Its perfect size ( small ). I haven't got it connected yet so I will have to update!", "Date": "January 4, 2014"}, {"Title": "never worked", "Author": "Jason", "ReviewID": "RZL452JXI03EK", "Overall": "1.0", "Content": "got this for my son for Christmas. it worked for half an hour tops then shut down to never start up again. while it did work it took 5-6 min to connect to the internet and 90% of the time the page would time out once you got the internet browser up and tried to search something.", "Date": "January 3, 2014"}, {"Title": "Customer Service is HORRIBLE", "Author": "workathome", "ReviewID": "RC9J1T58C8YEF", "Overall": "1.0", "Content": "I purchased this item as a Christmas present 3 weeks before Christmas.  A week after Christmas the charger was no longer working.  I called the number and was told they only have a 30 day warranty on this product.  They would not recognize that it was only out of the box for a week.  Amazon did issue me a credit, but buyer beware on this product.  I would recommend the extra insurance on this item because I don't expect them to last.  Better yet spend the extra on a reputable company tablet.", "Date": "January 3, 2014"}, {"Title": "give it a miss", "Author": "Gary Whalen", "ReviewID": "R3SCJDTYSTZ6XI", "Overall": "2.0", "Content": "1 week after using it, refuses to charge or switch off. Back of case gets really hot and, charge didn't last that long. Wouldn't buy another one.", "Date": "January 3, 2014"}, {"Title": "As it should be", "Author": "Amazon Customer", "ReviewID": "RQPRR1RLT1XU2", "Overall": "4.0", "Content": "I bought this product as a gift to someone else. Before giving it to them, I did take it out and charge it a little just to make sure everything worked. I didn't get too specific. But everything I checked was great.The product arrived on time and was in excellent condition. I was pleased. The final review will have to come from the person who receives it.", "Date": "January 3, 2014"}, {"Title": "Not a bad product for kids if it works", "Author": "Heather Stewart", "ReviewID": "R3L8P4ONTWBLSI", "Overall": "3.0", "Content": "I purchased 3 tablets for my kids for Christmas. i have had problems with the one tablet but the other two are working well. The one thing that is a bit annoying is the fact that the tablet does not seem to save the WIFI password so it needs to be retyped each time the unit is turned on. Otherwise it was easy to download from Google Play and I was even able to load some movies with digital downloads. No instructions -so it's learn as you go.Tablet express has been responding to my customer service emails re: the one tablet so i hope to be able to exchange it with no problems.", "Date": "January 3, 2014"}, {"Title": "Great Tablet For Kids", "Author": "Morris Tate", "ReviewID": "R348PN5Z7BLGJ0", "Overall": "5.0", "Content": "Great tablet for kids. I got 3 different colors for my 3 kids, and they love it. Had to send 1 back the day after Christmas because it didn't work. But they exchanged it with free 2 day delivery.", "Date": "January 3, 2014"}, {"Title": "Didn't work", "Author": "Becky White", "ReviewID": "R39NJ2I99AY6V3", "Overall": "1.0", "Content": "My 7\" Dragon Touch wouldn't turn on. Called the company and they tried to help but it wouldn't turn on. Had to return it to that company and then I just upgraded to a Dragon Touch 9\".", "Date": "January 3, 2014"}, {"Title": "wonderful for the price", "Author": "Skye Walker", "ReviewID": "R2835A10UNQYPB", "Overall": "5.0", "Content": "For the price and reason of getting it, works well. Runs decently smooth, if no sd card inserted, it does start to run slower when you download a bunch, but thats expected. I bought it for my 4 year old and he loves it!", "Date": "December 31, 2013"}, {"Title": "great tablet", "Author": "derick forde", "ReviewID": "R1CMS7MZNIEYII", "Overall": "4.0", "Content": "nice tablet got it for my kid she is loving it and im loving it more  sad she is telling me its mine not yours", "Date": "December 31, 2013"}, {"Title": "extremely poor quality", "Author": "roger", "ReviewID": "R3D5D7MGM3EQ2W", "Overall": "1.0", "Content": "purchased four of these. 3 of them messed up or started comin apart in some way after just 2 days. Im no expert on pixels or screen quality but ive seen tablets and phones with much less pixel resolution advertised that looks exactly the same as these. (640x480). i wasnt expecting no super HD screen but expected much better than what i got. turn the screen just a little and everything gets dark if not disapears. buttons on side and top are very flimsy and will stop working before anything else. seller shipped very quick.....thats about the only good thing i can say", "Date": "December 31, 2013"}, {"Title": "Dragon Touch® 7'' Blue  and Green models received...", "Author": "Tomas Medina Martinez \"Xitmedina\"", "ReviewID": "R1S1HPS123CS7V", "Overall": "1.0", "Content": "I recently received both tablets, and the same no power on... Not like it... and the other (Green color) come screen scratched", "Date": "December 31, 2013"}, {"Title": "Tablet", "Author": "Debra Swindall", "ReviewID": "R21VZCDY9E0ZNV", "Overall": "5.0", "Content": "My grand-daughter received 2 tablets, both from Nana's, the other one was smaller and is keeping both of them. She loves the purple one I bought. It comes with 2 games and absolutely love it.", "Date": "December 31, 2013"}, {"Title": "It's worth it to pay more for a better item", "Author": "TM_25", "ReviewID": "R3ELAPS1C6YB5R", "Overall": "2.0", "Content": "I had high hopes for the tablet as a family device.  When I first received it, the sound didn't work and I had to call tablet express for help.  I was hung up on twice by a person with poor phone reception.  The 2nd person and 3rd call was helpful and aided me in resetting the tablet.  It worked fairly well at first, the games looked great, internet functions were great.  Camera and video capabilities were horrible, about the quality of an old flip phone.  I may have over looked that, but the system kept getting stuck and often times when it goes off it takes several tries to go back on.  It went off on a Saturday night and I have been unable to get it to power up.  I have charged it over night and still not working.  It is now a Tuesday.  I will be returning it.", "Date": "December 31, 2013"}, {"Title": "Don't waste your money", "Author": "Nathan Vetter", "ReviewID": "RBTFF0KCHYWHN", "Overall": "1.0", "Content": "Only charges or turns on half the time.  Screen bubbles and cracks. Very very little use and this has happened.", "Date": "December 31, 2013"}, {"Title": "good kids tablet", "Author": "HarryMtrains04", "ReviewID": "RXPRGOFZT2J25", "Overall": "5.0", "Content": "I got these for my kids for Christmas and they are a great tablet for the price. Pretty fast and have a good battery life.", "Date": "December 31, 2013"}, {"Title": "Would not turn on", "Author": "CINDY TAMBERT", "ReviewID": "R35M3AAUUNEGHB", "Overall": "2.0", "Content": "I bought 3 of these tablets for my grandchildren and none of them work. trying to send them back is a project.", "Date": "December 31, 2013"}, {"Title": "it was ok. just that.", "Author": "doni vlade", "ReviewID": "R2UZHUS7KNSJJ2", "Overall": "2.0", "Content": "it was ok, not really what i want. to slow and some app won't install...update the market please and thank you...", "Date": "December 31, 2013"}, {"Title": "HAPPY GRANDSON", "Author": "Cheri Andres", "ReviewID": "R1G2SF4I14Z68", "Overall": "5.0", "Content": "MY NINE YEAR OLD GRANDSON WAS THRILLED WITH THE TABLET. HE HAS PLAYED ON IT SINCE UNWRAPPING THIS GIFT.  HE HAS EXPERIENCE WITH VARIOUS ELECTRONIC ITEMS AND HAD ONLY GOOD THINGS TO SAY ABOUT THIS ITEM.", "Date": "December 30, 2013"}, {"Title": "Wasn't a Complete waste but ill never get one again", "Author": "Shawn Grant", "ReviewID": "R2NXL9QCGPIWPS", "Overall": "2.0", "Content": "ITs a nice solid tablet for  the price its one of the strongest, however there's a few broken features and the HDD design is a complete train wreck it's labeled as a 2Gb tablet its actually 512Mb moving anything over to the \"tablet\" drive (the other 1.5Gbs) just creates same app on BOTH so now every app you try to move to the larger partition leaves a footprint that takes up roughly the same amount of HDD space as it did before. other than that and the god awful video mode  it switches to anytime there's a video on a page your viewing and most apps are not really supported on this (Netflix, most games, and any app not designed specifically for a tablet", "Date": "December 30, 2013"}, {"Title": "not worth it", "Author": "Beth Dunn", "ReviewID": "R2D042NI9HG38W", "Overall": "1.0", "Content": "great price. and when it would turn on, it was exactly what I wanted for you 5 year old. she loved it what little bit she could play with it. it would not stay on. we could only get it to come on every now and then. finally it wouldn't come on at all. we had it 48 hours.", "Date": "December 30, 2013"}, {"Title": "Your money's worth...", "Author": "K. Shane", "ReviewID": "R1RRC4NYAHT2K0", "Overall": "4.0", "Content": "I was quite impressed with the Dragon Touch tablet!  It performs welllbeyond what  I expected forthe price...  A great deal!  I bought  four andgave themout  for Christmas!", "Date": "December 30, 2013"}, {"Title": "not worth it", "Author": "Pen Name", "ReviewID": "R1T6KJC60PMT15", "Overall": "2.0", "Content": "The camera on it is horrible. The picture quality is junk. The battery doesn't last long and doesn't log on when usin wifi. Has been a nightmare. U get what u pay for I guess", "Date": "December 30, 2013"}, {"Title": "died out after 24 hrs!!!", "Author": "ADRIAN RENTERIA", "ReviewID": "R3CK715OTFO9CQ", "Overall": "1.0", "Content": "died out after 24 hrs!!! will not charge or come on. lasted more in gift wrap than it did once it was put to use.", "Date": "December 30, 2013"}, {"Title": "good purchase", "Author": "Kelly DeFrancesco", "ReviewID": "R1XV6PL0NWN6IV", "Overall": "4.0", "Content": "I purchased it for my children. It was easy for them to use. The quality of the picture and sound are both great", "Date": "December 30, 2013"}, {"Title": "Disappointed", "Author": "Veronica kay", "ReviewID": "RZXH5BVX0QWKA", "Overall": "2.0", "Content": "Both my kids got this tablet for Christmas and after two days my sons tablet won't even turn on or charge at all on the other had I have not had any problems with my little girls yet I have not really had the chance to mess with the camera yet or any apps but I hope I did not wast my money", "Date": "December 29, 2013"}, {"Title": "Terrible tablet", "Author": "Normii Late \"normii477\"", "ReviewID": "RS2TSEFOV0LO3", "Overall": "1.0", "Content": "Purchased this tablet as a Christmas gift for my 10yr old nephew. I needed a simple tablet for a young child. This tablet would load apps and crash over and over during game time.  I even added a sd card for more game play.  I tried to call company's help desk and no one answered my calls.Hope if you purchase this item, you have better luck than I did.", "Date": "December 29, 2013"}, {"Title": "Awesome", "Author": "Kdee", "ReviewID": "R1KF0VY4HAZM66", "Overall": "5.0", "Content": "I brought this tablet as a Christmas gift for my 10 year old daughter who loves it.  It's perfect for her.  I read the other reviews before I purchased this tablet and everyone was right.  The tablet is easy to use and the price was right!", "Date": "December 29, 2013"}, {"Title": "Sent it Back.", "Author": "Todd Butler", "ReviewID": "R3K5C3RLU8JLK9", "Overall": "1.0", "Content": "Bought this for my grandson for Christmas.  I checked it out when package arrived.  It worked i guess.  Find out after went dead that the charger doesnt fit nor does an conventional android style charger.  So it remained dead.  Returned immediately.  Waist of time.", "Date": "December 29, 2013"}, {"Title": "it will do for now", "Author": "deedee", "ReviewID": "RGFTAL04ZPX18", "Overall": "3.0", "Content": "its not what i wanted but it will do it was for my kid an it dont get somethings that she need it to get", "Date": "December 29, 2013"}, {"Title": "Starter tablet", "Author": "Dana Bolden", "ReviewID": "R1REDO5WKOZCQV", "Overall": "3.0", "Content": "This was a Christmas gift for my 8 1/2 yr. Old son who's never owned his own tablet. Overall it's a good starter tablet not the fastest but for the price fair. It's not running the latest software version so some apps aren't able to be installed ie; Instagram. However I believe once I add an sd card I can update it. Also the sound is extremely low unless you have headphones on. Going to go out an purchase some wireless bluetooth speakers .", "Date": "December 29, 2013"}, {"Title": "Good tablet..", "Author": "elizabeth schuhs", "ReviewID": "R7ULCZHZ3IZ22", "Overall": "4.0", "Content": "I got this tablet for Christmas.  So far i've had no issues.  You do have to keep the screen at a certain angle to see it.  Also, the speakers are so so but for the cost of the tablet, its what is expected.  I have mine hooked up to wifi and it works great.  I bought the 1 year replacement plan sice it was only $10.  I really like it.  I still  use my smart phone and laptop a lot so I couldnt see spending a ton of $$ on a tablet.", "Date": "December 27, 2013"}, {"Title": "My honest opinion? Not that good of a tablet...", "Author": "TigerBite", "ReviewID": "R25PX65U2XC7TL", "Overall": "2.0", "Content": "I bought this for my brother as a Christmas present because it was an inexpensive tablet that wouldn't break my bank. It came in and after about three hours using it, my brother gave it back and said he didn't like it (what an a-hole, he could've been done it a nicer way). Yeah so I'm stuck with this tablet because I ordered it awhile back and it's passed the 30 day return period. From first glance it looks nice but when you get into playing around with it that you'll find that it is limited and cannot do as much as you'd hope. First off the display is is pretty clear and is HD but not as good as an iPad or the Surface (I have neither but my friends have them and they are really nice.) Video quality from Youtube on this thing is garbage, the sound isn't that loud even on max, the charger it comes with doesn't work. Even though it's a standard Android charger, my phone charger can't get it to charge. The screen has a negative type effect to it if tilt it so you'll get distorted colors. I can say more but I won't. If you're thinking of getting this, don't. Save your money and spend a little more to get a Nexus or Galaxy Tab.*Update* (1/11/14)I found out last week that quality from the Youtube app is better. I was using the browser for Youtbe so that's why the quality wasn't that good. Soooo... today I accidentally dropped the tablet (yes, my fault) and the back piece came off and the wire got disconnected. Since I'm not a techie I didn't know if you could've just re-wired it or something but now my tablet is broken. The inside looked cheaply assemble because the wires and some parts were held down by some electrical tape. Oh well...", "Date": "December 27, 2013"}, {"Title": "Great Little Tablet", "Author": "Sharon A", "ReviewID": "R2D5SAI78P7CUD", "Overall": "5.0", "Content": "I got this little tablet for those awful waiting times, you know, like waiting in line, the doctors office, and other boring waiting places.Its just great. Fits my in my jacket pocket, goes anywhere. I can read free books, play free games. And I like to read in bed. This is great because when I get sleepy there is no light to turn out, just shut off the tablet and roll over, lol.  Wow, and on top of that Tablet Express shipped it in just a few days. Just can't get any faster than that. Oh, and here's something else I've noticed. You might not think it's much,but, the charger conection to the tablet is much more secure than other tablets I've owned. Much easier and more secure when recharging. Little things that mean a lot. Thanks a lot and keep up the good work.", "Date": "December 27, 2013"}, {"Title": "Don't buy this tablet!!!", "Author": "Amanda Martin", "ReviewID": "R2D8U0R32F0G1P", "Overall": "2.0", "Content": "I bought this tablet as a christmas present for my 7 year old daughter. We downloaded four games on it and when she tries to play one, it won't let her. It forces the apps to close. Don't waste your money on this tablet, spend a little more for better operational system and performance.", "Date": "December 27, 2013"}, {"Title": "Price is right fpr 1st tablet.", "Author": "Cristy L Dockery", "ReviewID": "R1GC55429WA5LB", "Overall": "3.0", "Content": "Great for a kid not recommended for an adult, poor picture quality. As parents we liked the price fit into our Christmas budget.", "Date": "December 27, 2013"}, {"Title": "hard to get signal for wifi", "Author": "Tammy J Williams", "ReviewID": "R1073JKAS25AFB", "Overall": "2.0", "Content": "keeps losing wifi signal. I have other tablets that work fine. I bought 2 both the same! and with wifi useless, camera stinks to not clear pic,", "Date": "December 26, 2013"}, {"Title": "Good", "Author": "Florentino C.", "ReviewID": "R2A2YFX3TP3NPX", "Overall": "4.0", "Content": "Good for the price, might give it away to a friend as a gift.  The wireless does not have a long range so limited to a confined area.", "Date": "December 26, 2013"}, {"Title": "Dragon Touch Tablet", "Author": "Teresa Stucky", "ReviewID": "R9M9JJMWZ7RK2", "Overall": "3.0", "Content": "Bought this for my grandson. He was really excited but he was a little disappointed that he couldn't play games for a long period of time.  Wish we could buy a good quality product at a reasonable price,", "Date": "December 8, 2013"}, {"Title": "Dragon Touch 4.1 Tablet PC, Dual", "Author": "Regina Horne", "ReviewID": "R3LWUGLOK3SNG5", "Overall": "1.0", "Content": "Dragon Touch 4.1 Tablet PCI purchase this tablet and once we received it, it did not and has not worked yet. First it would never power on after charging it for longer than 10 hours. I think I dislike it most because it was a Birthday present that I was not able to give.", "Date": "November 11, 2013"}, {"Title": "Good Product", "Author": "Johanna N.", "ReviewID": "R3KNN6SYBHCW6W", "Overall": "4.0", "Content": "Good Product for a very low price. I am very satisfied. Anyone on a tight budget can by this. Screen is crisp and clear. Dual cameras work really well.", "Date": "May 8, 2014"}, {"Title": "very good for the money", "Author": "CA OZ", "ReviewID": "R3ECPDR8RIGZ1S", "Overall": "5.0", "Content": "my son loves it, he doesnt stop playing with it, and he likes all the games that he is able to download..", "Date": "April 21, 2014"}, {"Title": "Nice tablet", "Author": "riveredgepaints", "ReviewID": "RSH23K0IMB7U1", "Overall": "5.0", "Content": "My grandson just loves it and it's easy for him to use and he knows how to download all the fun apps!", "Date": "April 3, 2014"}, {"Title": "Not happy", "Author": "maira", "ReviewID": "R2ICVYT66SJHY9", "Overall": "1.0", "Content": "TranslationI did not like very much because this signal is not very slow and takes a lot for cargase thank you very much but do not buy one with the mark", "Date": "April 3, 2014"}, {"Title": "buy a protective cover as soon as you get it...", "Author": "Jantzen McNsac", "ReviewID": "R38YF3FBL2RPFL", "Overall": "1.0", "Content": "everything was great until it dropped 3 feet onto some carpet... and now its done for...ill look for something a little more sturdy next purchase.", "Date": "March 30, 2014"}, {"Title": "I wished it function better for the sake of my kids", "Author": "Andria Bryant", "ReviewID": "R367WXAO2P3ZD6", "Overall": "1.0", "Content": "I was so disappointed with the items. It was delivered to me with cracked screens. I made several attempts to contact y'all but was very unsuccessful. I would really like to return these items", "Date": "March 29, 2014"}, {"Title": "it broke the first day I opened it", "Author": "logan collins", "ReviewID": "R1HKCZWJR4F27I", "Overall": "1.0", "Content": "It's broke on the second day and I don't know how to return it. I need a number to call", "Date": "March 15, 2014"}, {"Title": "Great tablet", "Author": "Majel Dianne Darrah \"diaray\"", "ReviewID": "RYYAMMCGTMSAS", "Overall": "4.0", "Content": "This is a great little tablet, but it does not have the capability to do 4G wifi from my phone.Even though the description said that it is 4G , don't know why they say it when I called the ladysaid that it will not do 4G from a cell phone.  I guess that my search will still be on.", "Date": "March 6, 2014"}, {"Title": "POS", "Author": "Ryan Watson", "ReviewID": "R159KW8SVRZKBE", "Overall": "1.0", "Content": "Cheap material looked better in the picture. After I bought it the button that turned it on came off. What a piece of work, I would returned it if i did not lose my box.", "Date": "March 6, 2014"}, {"Title": "great paper weight", "Author": "Jessica", "ReviewID": "R19A29PSG7KI7O", "Overall": "1.0", "Content": "Had it for two weeks, it started shutting off with full charge. Then it became unusable when the power button broke internally.", "Date": "February 13, 2014"}, {"Title": "Dragon touch 7\"", "Author": "Generic unlocked Quadband 2", "ReviewID": "R2NNW4DMCYXDBH", "Overall": "3.0", "Content": "I got it a little late but I received it,maybe is because of the weather I don't know but at least I got it.", "Date": "January 29, 2014"}, {"Title": "Hard to handle", "Author": "Heather Warneke", "ReviewID": "R9P8QOTH243TT", "Overall": "2.0", "Content": "It is a lot more confusing to use than other tablets and the wifi is not all that great. Not a good buy.", "Date": "January 23, 2014"}, {"Title": "It sucks!", "Author": "Christine", "ReviewID": "R1CSKUJ3AKFZEY", "Overall": "1.0", "Content": "Does not power on! Not enough space to store games! Battery life sucks! I hate it!!!! Regret buying this tablet!! Wasted my money!!!", "Date": "January 22, 2014"}, {"Title": "No Space", "Author": "Samantha Escobar", "ReviewID": "R2E75DT6NPT2TJ", "Overall": "1.0", "Content": "If your looking for a tablet to add apps to, this is NOT the tablet for that! You can't download more than 2 apps/games/anything, at a time. It runs out of space, the memory card is a great option but nothing saves to it, including the pictures, you have to manually move each picture to the SD card. This definitely isn't made for a preteen to use, there's no space.", "Date": "January 13, 2014"}, {"Title": "Dragon Touch", "Author": "robert plath", "ReviewID": "R2UR0ULLZXJJ4Z", "Overall": "5.0", "Content": "Far exceeded my expectations. Very fast and easy to use. My personal opinion is that for the price, it is comparable to the Google tablet without the higher price. Boot-up time is comparable to the Chromebook! Very pleased with purchase.", "Date": "January 9, 2014"}, {"Title": "Awful expirience", "Author": "chasity", "ReviewID": "R1AQS2FJ9PSPFF", "Overall": "1.0", "Content": "Bought this for my daughter for Christmas , and it worked for three days , then the screen went black. Now it wont turn on at all. Very frustrating and my daughter is really let down. Awful expirience.", "Date": "January 5, 2014"}, {"Title": "Got this after Christmas. Great!", "Author": "Amazon Customer \"newsong\"", "ReviewID": "R34FPQ7K7UH73E", "Overall": "5.0", "Content": "This tablet was great. It has an outstanding battery life if you turn it on ounce it's out of the package and tells you to charge it. I have no problem with the keyboard cause I got a keyboard/case for it. But other than that great tablet and would recommend it to anybody who is thinking of getting one!", "Date": "January 5, 2014"}, {"Title": "Nice tablet", "Author": "Amazon Customer", "ReviewID": "R286B5RD2X29BM", "Overall": "4.0", "Content": "Great tablet for adults. No parental controls for kids. Contacted manufacturer and they recommended an app. The app they recommended did not work well. Downloaded a different app, works great, however, netflix won't play with the parental control app. Have only had for two days, will try another app. Other than that the tablet itself is nice. Nice camera.", "Date": "December 28, 2013"}], "ProductInfo": {"Price": "$99.99", "Features": "The DT Y88 featuring the newest powerful and robust Dual Core CPU with DDR3 ram, makes everything run faster than ever. Plus, high-performance Quad Core Mali-400 GPU ensures smooth and dynamic 3D graphics.\nGoogle Android 4.1 (Jelly Bean) OS reveals tons of new adventures to your Dragon Touch tablet. Get access to thousands of useful apps and fun games to download and install on you tablet with Google Play Store pre-installed. Micro SD card slot allows you to add up to 32GB extra space to store songs, videos, photos and other files.\nComparing with A13 Q88 model, Y88 has higher resolution Multi-Touch HD Screen with 1024x600 which makes ebook, photo, video look great.\nWi-Fi (802.11a/b/g/n) keeps you connected on the go. Front-facing camera makes it easy to chat with friends and family, while rear-facing camera allows you to capture the special moments and upload them to facebook and twitter.\nLive customer service and tech support from TabletExpress. Robust warranty, on-time customer service/tech support, frequently updated firmware guarantees customer satisfactory. Feel free to contact us whenever a question pops up in your head, we are always here to help.", "Name": "Dragon Touch® 7'' Green Dual Core Y88 Google Android 4.1 Tablet PC, Dual Camera, HD 1024x600, Google Play Pre-load, HDMI [By TabletExpress]", "ImgURL": "http://ecx.images-amazon.com/images/I/51h3un6jSdL._SY300_.jpg", "ProductID": "B00GV0KAK8"}}