{"Reviews": [{"Author": "Jesse R \"Jesse R\"", "ReviewID": "R3MBA3N0WV27SC", "Overall": "5.0", "Content": "I use it all the time, it's nice and fast. It's very light and easy to carry around. I would recommend anyone who likes iOS.", "Title": "Love it!", "Date": "April 16, 2014"}, {"Author": "Megan Peacock", "ReviewID": "R1MI6A9XXEOO04", "Overall": "5.0", "Content": "Super light weight and very use friendly. I especially love the pages and keynote apps. I have always loved Apple products, but needed something to type documents on.... and now I have both!!", "Title": "Awesome!", "Date": "April 13, 2014"}, {"Author": "Patricia M. Dobson", "ReviewID": "R5JWRLSYK4MPD", "Overall": "5.0", "Content": "Love the iPad!  There are many apps available and working with docs from the Cloud is very convenient.  Takes great pics and videos, too!", "Title": "iPad Air!", "Date": "April 13, 2014"}, {"Author": "Marilyn J. Rowlands \"MJ\"", "ReviewID": "R2GRF5E687TIMB", "Overall": "5.0", "Content": "This is my first IPad and I am so happy with my purchase.  I have a desktop computer and always felt \"out of touch\" when I was away for a few days.  Now, I can easily keep in touch.  I also love being able to play the games that I enjoy.", "Title": "I am so happy with this IPad Air!", "Date": "April 12, 2014"}, {"Author": "Andrew Mann", "ReviewID": "R1U1MSDGXFYDBJ", "Overall": "5.0", "Content": "I absolutely love my iPad Air. It was a gift for Valentines Day. Way better get jewelry. Although, I don't really wear jewelry.  I love all of the features that this product has. Yay! Thumbs up!", "Title": "Excellent", "Date": "April 11, 2014"}, {"Author": "LN \"LN\"", "ReviewID": "R33P9N4497BB8C", "Overall": "4.0", "Content": "I won't repeat what other reviewers have written, about it being a great product. I'll just mention two things that stand out for me, one positive and two negatives.First, the negatives: 1) The screen gets really dirty really easily. Apple says it's oleophobic, repels oils. I've found that to be untrue. My Kindle Fire HDX screen is MUCH better--it seems to be a harder, slicker surface, so fingerprints and such don't stick to the screen. Putting the Tech Armor screen protector on the iPad helps. 2) The app store is filled with a lot of junk, and there are so many apps there that it takes a lot of time to wade through to something that actually looks useful. Many of the apps are almost duplicates of each other. On the plus side, and the reason I got the iPad in the first place, there are some apps that are written only for the iPad.Second, the positive: this thing is a true battery miser. I can go a couple of days between charges, more if I'm not using it heavily. I haven't been able to test this, but I imagine it could play movies all through a long plane ride, whereas the Fire HDX would need an external battery for recharge.", "Title": "Great machine", "Date": "April 11, 2014"}, {"Author": "John Bohn", "ReviewID": "R1ECG8I901L13C", "Overall": "5.0", "Content": "I am a former Nook tablet user that converted to the Apple I-Pad.  The I-Pad is so much nicer that both my nooks are gathering dust.", "Title": "I-pad Air", "Date": "April 11, 2014"}, {"Author": "Sid F.", "ReviewID": "R1YPKS2XMJRGX7", "Overall": "5.0", "Content": "I am in love with you guys, because your product description was exactly when I receive it. Everything rock, I will definitely come back", "Title": "Is the best and smooth. I am loving it", "Date": "April 11, 2014"}, {"Author": "Kevin Page", "ReviewID": "R21IL8AS0SP1QL", "Overall": "5.0", "Content": "The new iPad Air works perfectly!!! I love the speed of this thing. Great product to supplement my macbook pro or when I'm looking to travel lightly.", "Title": "Loving it!!", "Date": "March 13, 2014"}, {"Author": "Bumbles \"flowing yogi\"", "ReviewID": "R3EAPTAQ1EXI9N", "Overall": "5.0", "Content": "Got the new iPad air (our first ever ipad/tablet). It's great and we were happy with the price and service of this seller. Thank you!", "Title": "Love it!", "Date": "February 28, 2014"}, {"Author": "J. Blake", "ReviewID": "R1LZ5TDYSA77BT", "Overall": "5.0", "Content": "I purchased this for a birthday present for my husband.  He is enjoying it thoroughly.  I think the graphics are terrific!", "Title": "Husband loves his gift!", "Date": "February 27, 2014"}, {"Author": "The Badboy \"Badboy Studios Inc.\"", "ReviewID": "RMSPQMZ0RK6YV", "Overall": "5.0", "Content": "The iPad 3 was my first iPad and I've used it up to the point I bought this iPad Air. I had cracked my screen and it seemed as if it was slowing down over time, probably due to the updated operating systems putting more stress on the aging processor and memory.So, I saw a good deal on a used model appear on Amazon, and decided to go for it. For little over $500, after I traded in my older model, I had a brand-new, or close to it, iPad Air. The first thing you'll notice is the weight. It is at least half that of the previous models. The bezel thinner on the sides and the new thunderbolt port on the bottom. I also love the addition of stereo speakers, as I own one of the biggest recording studios on the East Coast and love to try out the music I produce on a multitude of sound systems. This allows me to hear what I've done in stereo, on a lower common denominator, so as to know what my music sounds like coming from the speakers of a system millions of people own.The next thing I noticed, is the screen seemed quite a bit brighter then my iPad 3. This could just be because of the aging screen tech under the glass, or some other factor. But it definitely helps for reading, even at half power, in darker and lighter situations that I have no control over. Next up, the speed at which everything operates. Not only loading software and apps, but in switching apps and multitasking. There is just a zip to everything now.The biggest thing I noticed, the Internet is 10 times as fast as it was in my prior model. I'm going to guess the MIMO has something to do with that, along with the two antennas. Giving a stronger signal, which in turn allows for the fastest Internet possible. I have 50 Mb Internet, and I now feel like I'm using every bit of it in doing something as simple as loading webpages or downloading videos, games and music. When I load a webpage, everything appears instantly, no more loading in of different aspects of that page, everything is just there. I think it is the first time, and Ive owned  hundreds of computers over the years, that I've noticed any webpage load so instantly.Games look every bit as good as they can, due to the increased processing power of the CPU and GPU. If Apple would only make a proprietary gamepad for the iPad, they would have a true contender for a great video game system on the market. Some of the games, especially those from Gameloft and EA, have every bit the quality that you see from any game on modern systems, bar a few effects here and there.Even music production can be done at high-quality, for the home or studio producer, with decent results. I've heard some songs recorded completely via the iPad, that you would've sworn were done in multi-million-dollar studios. They are that good. Which goes to show, great music is made by a great producer and not the equipment behind him.So, to sum things up:Positives:Great, bright, high resolution screenSmaller and lighterIncredible portable powerGreatly improved internet speedStereo speakers built inAwesome games and production softwareCheap accessories from third party vendorsNegative:Price, though I imagine we would sacrifice some quality at a lower price pointOverall, you will not find a better portable computer for the price. Anything Windows is going to have issues. Whether that be with drivers, malware, viruses or some or the other issue that goes along with owning a Windows machine. Sure, they are more powerful and will allow you a greater depth of software, but you make trade-offs with that power in size, weight and ease-of-use. So, if you have the means, definitely get the iPad Air. The upgrades are truly worth the extra cost over previous models. It's like having a super computer under your fingertips everywhere you go.", "Title": "Definitely worth the upgrade from any prior iPad model", "Date": "February 27, 2014"}, {"Author": "HardatTwerk", "ReviewID": "R1C5M2NPBI3XR9", "Overall": "5.0", "Content": "So..for a long time..I hated apple. But I get it now..it just works. It simply works. Its beautiful..feels great in my hand. Turns heads and its very easy to type on. Its zippy, and has made my life so much easier. I am a graphic artist/ web designer. I draw on this and take notes and photos every now and then. I compared so many other products, and for being I hated apple..I love this thing more than anything in the world.", "Title": "Converted Fangirl", "Date": "February 26, 2014"}, {"Author": "Patricia", "ReviewID": "R2WZPM6BR84O3U", "Overall": "5.0", "Content": "I love my iPad air and I made sure I have lots of memory. I have not had any trouble and I use it every day since Christmas. Also I love all the accessories you can get for it.", "Title": "Love my IPad Air", "Date": "February 26, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00G2ZI8RO", "Features": null, "ImgURL": null, "Name": null}}