{"Reviews": [{"Title": "would not recommend", "Author": "H.Tell", "ReviewID": "R2PLDROKLF3V22", "Overall": "1.0", "Content": "Not very responsive to stylus pressure (have to press hard to get it to register), bloatware you can't delete (think Windows Vista), locked into contract or else $70 restocking fee, Google-dominated, not much space on it apparently - you cannot seemingly turn off some advertisement-y type things in order to save GB.  I decided to return it before I even managed to fill up that limited space that people are complaining about. Screen size was way small for what I wanted to do with it. I think a netbook or smartphone is more useful. The tablet does a lot of things, but nothing well. I went ahead and paid the 70 (which I could ill afford) just to get out of the monthly contract because no one in the family would use this thing enough to justify it. I think some people might like this tablet - but it depends on what specifically you want to do with it. I wanted Kindle, GPS, Skype, artistic apps, e-mail and some other things. It would have done a few of those things well enough, but my computer + cellphone pretty much has those covered.", "Date": "June 6, 2014"}, {"Title": "Good Tablet", "Author": "Jonathan Clark", "ReviewID": "R3ZMDWQEIMPZ3", "Overall": "4.0", "Content": "I find this to be a good tablet for the money. Battery life is acceptable to me. It has performed well all functions.", "Date": "May 25, 2014"}, {"Title": "Not seeing the issue with other reviews", "Author": "Amazon Customer", "ReviewID": "R1KJG6JO9KLZTO", "Overall": "5.0", "Content": "I got this table 2x weeks ago on a special: $35 activation fee, no fee to buy the tablet, free 1GB data added for lifetime, and just $10 per month fee for device.I have downloaded several apps and i still have 4 GB of internal memory left before its full. I didnt see a lot of bloatware, and I also know based on someone else who has it that I can put in my SD card in AND move apps to it.The battery life isn't GREAT, but would you expect Verizon to offer a \"FREE\" tablet that was perfect ? For this, the price is right.  didn't buy this expecting a Samsung or an Apple tablet. I got something that has been nice so far, has done what I want it to do, and I have had no issues.I also was able to lower my data plan that I pay for to offset the device fee so this tablet is really only costing me $35 (I dont need the data)But don't take my word for it. Do your own research. Call and speak with Verizon directly. Get documentation on their answers if you are concerned. I wasn't dissapointed. I doubt you would be either", "Date": "May 12, 2014"}, {"Title": "Love it!", "Author": "ShelbyRose", "ReviewID": "R8CR1UF3ITELR", "Overall": "5.0", "Content": "I like the android system better than apple, this is easy to navigate and I love it! Battery lasts, universal charging port, and the speakers are pretty wonderful. I'd recommend this!", "Date": "April 28, 2014"}, {"Title": "piece of garbage", "Author": "Amazon Customer", "ReviewID": "R1XOLBJ2VVD90T", "Overall": "1.0", "Content": "I also am stuck with this lemon and a two year contract for a device that is useless.  They have sent a replacement but I don't even want it.", "Date": "March 31, 2014"}, {"Title": "Angry Verizon customer", "Author": "RL Atlanta", "ReviewID": "R18ED8543Q4XUN", "Overall": "1.0", "Content": "DO NOT BUY ELLIPSIS 7!!!!  Verizon blocks the texting,  and wants to charge extra for it.BUYER BEWARE!!!Also,  only 8GB,  and it is not that fast.  Without texting,  unit is a waste of time and money!! !!!", "Date": "March 10, 2014"}, {"Title": "Free with activation and two year contract.", "Author": "Leeloo Marley \"Leeloo\"", "ReviewID": "R36FGSZ7AD1TRQ", "Overall": "3.0", "Content": "So, listen. Several years ago, I was all amped up on getting our toddler a LeapPad because it was all the rage. We got it, downloaded some apps, bought some cartridges, and don't get me wrong, she loved/s it, and still uses it (so long as the batteries are charged!!!). But she is at an age now where she sees us using phones/tablets, etc, and has started asking for her own phone/tablets. Okay, sure to the tablet (NO TO THE PHONE, SORRY!). I wasn't expecting this to be a top of the line tablet, but I at least wanted one that would hold up to a young child. Have surfed Amazon for a case and screen protectors, but have not, as of yet, purchased. Tot has dropped the tablet, already, but only on the carpet. Since young children can be quick to go on a button-pushing spree, I am fully anticipating crashing tablet... That's why no Apple (way back when Apple came out with those cutesy, bubbly, standalone iMac computers- no tower, a beaming salesperson told me, \"Good luck crashing this thing!\" -- yeah, pal, you should've seen me crashing it left and right) will enter our house. So far, the tablet has a decent battery life, good processing speed, only minute quirkiness with some apps (tot reported My Little Pony game jitters, and I played words with friends- screen jitters black until I hit the back button, and layout is funky), sound is fine (I have a premium Spotify account and so, I suppose, I have a penchant for good quality sound-- music is, I have to admit, a touch on the tinny side. But for movies, the sound seems adequate, and loud enough for this chaotic household. I didn't look up reviews on this tablet-- just went in to a Verizon store for new phones and came out with this. I haven't tested its storing capabilities yet, but I have downloaded all the apps from My Apps in the Google Play Store and then uninstalled the few I knew I wouldn't use on the tablet. It held all the apps just fine, and they continually update, so I have no idea why reviewers are having issues there... Possibly internal ram? I don't know! All in all, it's a good tablet so far. I can't complain!", "Date": "March 8, 2014"}, {"Title": "It could be better BUT...", "Author": "Q Productions", "ReviewID": "R1O4BL9UXW3I6L", "Overall": "3.0", "Content": "A yo, I got one of these joints as a christmas present and it's i-ite.  It could be better but for the price, it says a lot for tablet pc's.  It's worth 80 bones.  If you need something simple joint to read because you're going blind like me then this cool.  You can also send text messages too.  The video resolution is bad enough to aid in my going blind.  You can add a 64 gb memory card for extra storage, that's about it though.", "Date": "May 21, 2014"}, {"Title": "There's only 1gb of space for apps and an sd card won't help", "Author": "Heather <3", "ReviewID": "R33LZLSLOE1C95", "Overall": "1.0", "Content": "This tablet is worthless; I got it free and still lost out on the deal. There's only 1gb available for your apps and you can't add with a micro sd card (that will only hold your pics etc.). This means you can only run a few basic apps and then it will freeze up every single time you try to do anything because, surprise, you are out of space. Don't waste your time and money with this p.o.s. Once more I've willing bent over for Verizon to.... take advantage of me (to put it as nicely as I can and no where near as strongly as if like to say)", "Date": "April 7, 2014"}, {"Title": "Car sick and headache", "Author": "CM", "ReviewID": "R1F9G6ROQJVWYA", "Overall": "3.0", "Content": "Is anyone getting car sick feeling or headache from using this product?I get the same feeling when using the IOS 7 smartphones and there are a lot of articles with users getting sick but those are supposedly only from Apple products. Couldn't use a Droid mini for the same reason. Customer service is BAD.", "Date": "February 13, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Verizon Ellipsis 7 4G LTE Tablet, Black 7-Inch 8GB (Verizon Wireless)", "ImgURL": "NULL", "ProductID": "B00GJ3MF9Q"}}