{"Reviews": [{"Author": "Jodi Davis", "ReviewID": "R28L25U6JYRU8N", "Overall": "1.0", "Content": "My son received this for Christmas. The touch screen didn't work. I called the company the day after Christmas and was given instructions on how to reset the tablet. This didn't fix the problem. I was told that email would be sent on how to return the table for a replacement. No email ever came. When I called 3 days later I was cycled through to the voice mail system. No one ever called. I then contacted the company by email. Another 5 days passed before anyone contacted me. I was once again given the reset code. It didn't fix the problem. When I wrote back to the company I was given a name and number to call... That person was no longer an employee there. I asked for the manager and he assured me that he would email me the instructions on how to return the tablet for a replacement. He promised me that the email would arrive before the end of the working day. He even sent me an email to make sure that they had the correct email address. That was 15 days ago and still no email. This product might work well, but we will never know. DO NOT BUY THIS PRODUCT! Click-n-Kids does not stand behind their product and will not help you if you have problems with it.", "Title": "Worse Customer Service Ever", "Date": "January 18, 2014"}, {"Author": "shiela fowler", "ReviewID": "R2WK0M32BOBRUL", "Overall": "5.0", "Content": "I have to say I absolutely love this tablet. My four year old had been using mine, because I wanted to see if he would really use something like this. After fighting with him to put the tablet down and him managing to charge an app to my account, I decided that it was time to purchase a tablet for him that I could restrict items. I love the fact that parents are able to restrict times of play and even better you can pick certain apps for certain times. For instance; If I want him to play more educational game I will block the other apps for certain time periods, leaving him only educational apps to play. Click n Kids gives you full control on what you child can and cannot see.I also love the parent side it is better than my own tablet. The only downside I see so far is that you cannot uninstall some of the apps that my where pre-installed.", "Title": "Better than my own tablet", "Date": "February 15, 2014"}, {"Author": "wanda alston", "ReviewID": "RIXVPZIHDDJBY", "Overall": "4.0", "Content": "This is my second click n kids tablet. I ordered one for my godson and he loves it. It works great. Then I ordered another for husband and I (it's the kid n us). However, I ordered these from two different companies and the first one was new. The second one was a refurbished one. We've only had the second one two weeks and now it won't turn on without having it plugged into the charger but once i turn it on I can disconnect the charger. I don't understand that but I DID BUY IT REFURBISHED. We just bought the second one to play around with anyway. This tablet will help my husband become familiar with computers and the internet since he is a beginner. I have other computers for business purposes.Other than that everything works fine. It downloads apps quickly and plays great. I'm still satisfied with both purchases. You can't beat the price and it does everything any other can do. You've got the kids side with tons of learning games and then the grown up side, which you can download your apps you need and then you've got an all in one for a low price!!", "Title": "Great product!", "Date": "March 18, 2014"}, {"Author": "Bri", "ReviewID": "R24YTUBU6LHRF9", "Overall": "5.0", "Content": "After purchasing the kurio tablet for my 4 year old for Christmas, and it completely broke, we bought this tablet to replace it. He loved that it was green as its his favorite color. He's now owned it over 2 months, plays it everyday, and loves it. So much for him to do on it and learn. Has preloaded games and apps. And a parents zone so it acts like a regular tablet. And a baby app so my 10 month old can take it from him and play on the baby app and not mess anything up. He's had no issues with it", "Title": "surprised at low ratings", "Date": "February 1, 2014"}, {"Author": "phoule", "ReviewID": "R2U98VENQJAZWP", "Overall": "1.0", "Content": "first of all i had to pay 12 dollars for shipping to receive this item, charged it for 6 hrs as instructed and the volume would not work, never worked after my son played it for awhile the game awesome its like a superman game would freeze up and we would have to turn it off and on to get it unstuck, then it started making static noise from the back speakers and sounding all static, the only time we heard anything from this device very sad to say when we requested a refund or replacement the company is going to have us pay for shipping another 12 dollars.  i was going to purchase 2 of these but never from this company!  maybe thats what you get for buying refurbished devices? not sure, my first time?", "Title": "very disappointed in this company customer service", "Date": "January 21, 2014"}, {"Author": "Darktragedy", "ReviewID": "R385LLA09ZMR0W", "Overall": "3.0", "Content": "So, first off I did not buy this from Amazon, but a major retailer; it is the exact same model. My son got this from Santa, who read good reviews on this. He downloaded like 10 apps and not the huge games either, and it started saying there was no more room left... So I wrote to the company and I received this reply:\"We apologize about the storage error. We are currently working on releasing an update to expand the storage to download more apps. As of now we recommend you to \"Disable\" system apps you do not currently use. Apps like \"Currents\" and \"Chrome\" take up a lot of storage after updating so you may uninstall the updates and disable them to free space.Also you may move most downloaded apps onto the Nand flash portion of the memory to free up space.You can do this by going to Settings > AppsSelect an app you've downloaded and select \"Move to SD\"Just thought I would pass this along before anyone else has this problem. I did do as they suggested but it only gave me like 100 mb more....As far as the tablet itself goes, it's OK. I have a nexus 7, which I love, so that is what I am comparing this to. For a kid it is fine, I still am not use to the sensitivity, or lack of I should say, of the screen. It runs apps fine, no problems there. It comes with a screen protector & the nice rubber bumper. It has lots of parental controls you can set up; I didn't use them all, so I can't really comment on those.My overall opinion: if you are buying this for a small child, and maybe 8 or younger, it's fine, but I think there are better tablets out there for older children that are probably around the same price. My son is 7 and he enjoys having his own tablet, so it's OK for him. I hope they fix the memory error soon though....or I am going to get very angry, they advertised it as 8...", "Title": "Misleading storage info...", "Date": "January 2, 2014"}, {"Author": "John Spencer", "ReviewID": "R17TRPN2WWLC3Q", "Overall": "1.0", "Content": "I only chose this rating, because It didn't last long. It was a gift for my 5yr old for easter, however, he discovered it just before and I had to go ahead and open it. He loved it. He loved the phonics program....Until...He was tapping on the screen to get a response and it didn't respond....it went dark. I thought the battery needed to be charged, and charged it. When I turned it on, the screen lit up and then went dark again. I repeated this step, in which, it did light up, but kept going dark...And I only put it in action for two weeks. My guess is that refurbished products aren't the way to go. Basically, I wasted money on this.", "Title": "Re: Two sides of the rating", "Date": "April 29, 2014"}, {"Author": "Maricela Galeno", "ReviewID": "R7VGH3PT24I0F", "Overall": "1.0", "Content": "To start with recieved the wrong color, i had to send it back and recieve a new one so technically it took three weeks to finally recieve it. Then my child accidently dropped and it cracked ! Unbelievable, my toddler is only 2ft tall. The floor was carpet it does not add up. I am currently trying to return it for my 30 day gurantee but no one seems to be answering. I regret the day I bought it, i should have just gone with the kids galaxy tab.", "Title": "A complete disappointment. Get any another tablet, this one is not worth it.", "Date": "March 18, 2014"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B00HJXWJ8C", "Features": "Screen Size: 7\"\nOperating System: Android 4.1.x Jelly Bean\nProcessor Speed 1.5GHz Dual-Core processor\nSystem Memory:1GB\nResolution:800 x 480 resolution", "ImgURL": "http://ecx.images-amazon.com/images/I/51-u7LzYJCL._SY300_.jpg", "Name": "ClickN Kids Tablet with 8GB Memory 7\" Featuring Looney Tunes Phonics | P774A"}}