{"Reviews": [], "ProductInfo": {"Price": "$179.95", "Features": "Powerful, Smart and Easy to Use A dual core processor, Android 4.1 OS, TF card slot (Up to 32GB), Capacitive multi-touch screen and more, from Kocaso's best tablet yet. Fast dual core processor opens up programs and webpages seamlessly. RF card slot gives you the freedom to add even more storage or transfer music and pictures. Android's 4.1 allows for easy multitasking and customizable home-screens.\nAndroid 4.1, Jelly Bean  Android 4.1, Jelly Bean, is the fastest and smoothest version of Android yet. Jelly Bean improves on the simplicity and beauty of Android 4.0, and introduces a new Google search experience on Android. Jelly Bean features improved performance throughout the system, including faster orientation changes, faster responses when switching between recent apps, and smoother and more consistent rendering across the system through vsync and triple buffering.\nNeed More Memory? We Have a Slot for That  M1070 features 8GB memory. But if you need more that is no problem we don't want anything to limit or interrupt your enjoyment of the M1070 10.1. That's why we included a built-in TF card slot (up to 32GB) which means you can keep your HD movies, photos, music, documents and almost anything else nearby and ready to go.\nDual Core Processor  Fast dual core processor opens programs and web pages quickly and seamlessly.   This KOCASO M1070 Android 4.1 Tablet PC has a Capacitive multi-touch screen with Dual-core processor and screen rotation. The screen rotation features lets you view the screen in landscape or portrait mode, dictated by which way up the unit is held in your hand, this is great for viewing larger menu lists. Internet connectivity is achieved via external 3G modules. It has a 10.1\" High resolution IPS screen with a resolution of 1280 x 800 pixels to provide a fantastic multimedia and internet experience.\nKey Features:  CPU: Rockchip RK3066, Dual-core Cortex-A9@1.4GHz, OpenGL ES 2.0; RAM: 1GB DDR3 Memory: Built-in 8GB Nand Flash. Plus TF card slot (Up to 32GB) Display: 10.1\" High resolution IPS screen, 1280 x 800 pixels, 16:10 Touch Panel: Capacitive multi-touch screen Networking: WiFi IEEE 802.11 b/g/n, Bluetooth 3.0 OS: Android 4.1 Camera: Front Facing 0.3MP and Rear Facing 2.0MP Network: Support external 3G module dongle Battery: Li-ion Battery 6,600mAh@3.7V, Runtime 5-6 hours I/O Interface: TF card slot, USB OTG, DC Jack, Earphone Jack, Mini HDMI", "Name": "Kocaso M1070 Silver Color Dual Core 1.4Ghz 8GB 10.1\" IPS Capacitive Bluetooth Tablet PC", "ImgURL": "http://ecx.images-amazon.com/images/I/51R8vJPUT2L._SX300_.jpg", "ProductID": "B00HZNU2C6"}}