{"Reviews": [], "ProductInfo": {"Price": "$149.99", "Features": "oLexibook Tablet One: AndroidTM 4.1 tablet. oAdvanced parental control to secure the Internet browsing and the applications. oInteractive Learning content included.\noMultimedia: a universe specially dedicated to listen to your music, to watch your videos and to look at your pictures.  oDirect link to Lexibook VideoStore with hundreds of Cartoons oDirect link to Spotify: you will have access to all your favourite music anywhere you want. o+ 2 cartoons embedded\nPhoto editing software oMy Translator app, with 15 languages! (English, French, German, Spanish, Italian, Portuguese, Finnish, Norwegian, Danish, Swedish, Polish, Dutch, Chines, Hungarian, Russian) oMy Weather app so you know what activities to plan with your friends!\nFeatures: AndroidTM 4.1 tablet Advanced parental control to secure the Internet browsing and the applications Power Academy application with 500 memos My library: 100 books. Discover classic books and books considered to be essential reading. Reading guide to learn more about each author Twin Sisters: 10 Ebooks + 10 Songs included Amazing video of Ribert and Robert 20 songs & 3 video clips to sing along of Susie Tallman My Games: 50 games pre-installed 3 exclusive games (My Puzzles with Garfield, Alice in Wonderland, Aladdin and the Enchanted Lamp) My Hobbies, 52 creative activities to do with friends or alone - DIY, recipes, games and more 3 Little Stories (Goldilocks, My little red riding hood, The 3 little pigs)\nACCESS TO: oA platform with 12.000 Apps: discover the Lexibook Market for fast and secure download of the best content and apps. You will find the classic Apps such as Skype; but also many games: colouring activities, puzzles? Lexibook Market offers you the possibility to secure and filter all apps non suitable to children with a password. oLexibook Market Premium: A useful interface for a Premium Content! Access to the current best games and apps as Spotify, Temple Run, Angry Birds? (Category search and secure download with the Lexibook Protect) oLexibook Cloud 25GB: Share easily your files with family & friends and store them !", "Name": "Lexibook Kids Tablet One", "ImgURL": "http://ecx.images-amazon.com/images/I/51WbrtZaIIL._SY300_.jpg", "ProductID": "B00H6XWESA"}}