{"Reviews": [{"Author": "Tiffany", "ReviewID": "R1TIJR65A47JHI", "Overall": "5.0", "Content": "I love my new tablet.  I held onto my 1st generation Galaxy Tab 10.1 from 2011 until I found the perfect replacement.  this was it.  it is the perfect mate for my GS4 phone.  I like the interface, and I also like that it is a multi-tasker just as my GS4 phone. it is fast, but there is some lag time from when I push the center button to when my screen pulls up. It is so lightweight compared to my old tablet.  I use it primarily for games, web surfing, and video viewing.  I think it is a vast improvement from my previous tablet, and I am hoping this one will last for 3 years just like it's predecessor.", "Title": "Fast", "Date": "April 22, 2014"}, {"Author": "D. Guyant", "ReviewID": "R3QGOC2SR0MC77", "Overall": "5.0", "Content": "This Galaxy Tab Pro supports Wi-Fi 802.11ac  which really increases Internet browsing speed when combined with a 802.11ac capable router.  Surprised Samsung doesn't mention the benefits of this newer standard.", "Title": "Faster Web Surfing!", "Date": "April 16, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R5MVETQ42HL2Z", "Overall": "5.0", "Content": "I am liking this tablet!  It has everything that I was seeking in a tablet, including a very good 8 megapi elsewhere camera!", "Title": "Great Tablet", "Date": "April 10, 2014"}, {"Author": "BoogieWoogie_74", "ReviewID": "R133XPZR62OBFB", "Overall": "5.0", "Content": "Great Tablet Love the screen resolution, use it all thie time for play store games. beats bogging down my phone with games and apps.", "Title": "Great Tablet", "Date": "April 10, 2014"}, {"Author": "Gary E Hughes", "ReviewID": "R2NIJ3K9ICRCPN", "Overall": "5.0", "Content": "My first tablet, and I couldn't be happier.  Great screen resolution, sound is decent, all the functions and settings are very intuitive.  Love the way Flipboard works.  My only problem was with the Hancom Office - the spell check function wouldn't operate.  Downloaded Kingsoft Office, and all is well.", "Title": "Outstanding Tablet!", "Date": "April 4, 2014"}, {"Author": "Gerald Harris, Jr.", "ReviewID": "R1MLWFBT5VN7ZC", "Overall": "4.0", "Content": "It shipped quickly as usual, was packaged well, and was as I expected. I would order again with no concerns. Great upgrade from the galaxy tab 2 10.1", "Title": "Excellent tablet", "Date": "March 26, 2014"}, {"Author": "Carmen", "ReviewID": "R3IXB6XHC8MK0S", "Overall": "2.0", "Content": "I received this tab pro on 22 Feb 2014.  Today is 10 Apr.  I started noticing problems almost immediately.  The magazines on home page wouldn't update. In fact, I found this feature to be a waste of space. Browsing became slow on certain sites. Logging in on these sites became impossible.  Using apps and viewing photos was very slow scrolling would lag. And immediately after receiving my NEW Samsung Galaxy Tab Pro,  it seemed as though screen shots were being made while reading Flip board News. The last straw was when I attempted to login on Samsung.com for help (I've already downloaded and read the manual) and COULD NOT. I called Samsung customer care. The 1st day I was finally told the only option was a factory reset. This didn't resolve anything. Next day I called and was told to mail in my new tablet to Samsung.  The turnaround should ONLY take 7-14 days! I'm a veteran Samsung customer and I really would like to continue.", "Title": "Major issues with browsing the Web, using apps and etcetera", "Date": "April 10, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R6L96I4FEZ17P", "Overall": "5.0", "Content": "bought this as soon as i found out apple will stop supporting ipad2.  sold ipad2, bought tabpro.  love it.  i was able to get 3 good years out of ipad2, so i'm hopping to do the same with tab.  its fast.  the new os is great.  i have it on my Nexus 5, thus i can make my tab look and feel the same or totally diffrent.  its up to me.  all my google apps just come right over with out any issues.  i had to re-install amazon app. no biggy.  i still with i can get amazon prime steaming on it, but no such luck. (its amazon fault, not Samsung)  the screen is crystal clear.  i can read books on it for hours on end w/o my eyes getting tired.  transferring movies is breeze.  the only downside i found is the buttons location. when having the tab vertical and trying to read, sometime i press the back button a lot.  no biggy.  Love the fact i can use it as a remote control for all the tv in house.  over all, i love it. by-by apple, hello Samsung!!", "Title": "super great tab", "Date": "March 27, 2014"}, {"Author": "Robert Trower", "ReviewID": "R2BGWP63WAMLO", "Overall": "5.0", "Content": "IPAD MOVE OVER...... I THINK YOU LOST FIRST PLACE IN THE TABLET FIELD.  THIS WAS COMPARED SIDE BY SIDE AND I WOULD TAKE THIS OVER THE IPAD ANYDAY.", "Title": "HOLY SMOKES", "Date": "February 17, 2014"}, {"Author": "AK529", "ReviewID": "R23475OQ7DXKR0", "Overall": "3.0", "Content": "This tablet is very similiar in many ways to the other tablet made by samsung called the note 10.1 2014 edition. The only main difference is that the note has 3gb of ram versus this one which has only 2gb ram. The note has stylus and is heavier than the tab pro. Also the tab pro has the newer touch wiz interface. Other than that I found everything else to be pretty much the same. My main disappointment with this tablet is that it is only offered in 16gb of storage. Only about 12gb is available storage for apps. This can be very limiting, even if someone wants to pay more for 32gb storage which is not available. An micro sd car can be used but only for files like music, videos, pictures, etc. Expandable storage cannot be used for apps with android 4.4 kit kat unless you root the device. This tablet is just as light as the iPad Air. Which makes it feel very nice in the hands. Like other samsung tablets that I have tried it still has a very cheap plastic feel and I get a clicky sound from the back. The button placements like the home, app switcher and back buttons still come in the way when using the tablet in portrait mode and can be pressed accidentally. Google still is  really lacking when it comes to tablet optimized apps. Apple just has way more and are better quality. This tablet is also the same price as Apple iPad Air. If samsung wants to compete they should sell this for less than the iPad. This tablet seemed to be very laggy due to the touch wiz interface and only 2gb of ram. I did find the performance to improve after I disabled some samsung apps and used nova launcher instead. I still think this tablet should have 3gb of ram.", "Title": "Only competitor to the iPad Air", "Date": "March 11, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00HWMPSFQ", "Features": null, "ImgURL": null, "Name": null}}