{"Reviews": [{"Title": "Awsome Tablet", "Author": "Jacob Medernach", "ReviewID": "RBV4NE16U5RUW", "Overall": "5.0", "Content": "Great Value for your money, runs on android, no problems meanwhile, Overall a great tablet for all your needs, Thanks", "Date": "May 21, 2014"}, {"Title": "good tablet for kids.", "Author": "cece", "ReviewID": "R34X76TVYXHUZN", "Overall": "4.0", "Content": "It handles games like Minecraft nicely, comes with an adaptor that makes expanding storage quite versatile.  Store your data on usb drives and your apps on sd cards easily which makes up quite nicely for the lack of native memory.  The only drawback is for example...the lack of options for cases.  But otherwise this is a great low cost option for a kids tablet.", "Date": "May 20, 2014"}, {"Title": "Good tablet", "Author": "carlos salazar", "ReviewID": "R3IJLMDW0NR0ST", "Overall": "4.0", "Content": "For the price you can't go wrong. Bought this tablet for my seven year old and he loves it. The tablet has a good feel to it, doesn't feel cheap like the I rulu.  My son uses it to play games and watch videos on you tube.  I would highly recommend this tablet to anyone who's looking for a good affordable tablet.", "Date": "April 9, 2014"}, {"Title": "my personal views on this product.", "Author": "michelle johnson", "ReviewID": "R3RK5HG2AYCM31", "Overall": "3.0", "Content": "I like that it is light and really does not look cheap , it is an easy product to understand ,the pictures are clear ,I like everything about it so far and I would recommend this product to friends and family in the Caribbean.", "Date": "May 20, 2014"}], "ProductInfo": {"Price": "$55.00", "Features": "The 2014 Prizm xZ features the new Allwinner A23 Dual Core CPU which performs approximately 20% more powerful, uses 15% less power and is more reliable than the iMAP x15 processors in similar competing tablets!\nThe multi-touch capacitive display is easy to use and very responsive. Your favorite Android games come to life on the Nero CX2.\nIncludes Google Play Store which gives you access to thousands of free apps isntantly! The G-Tab CX2 supports Skype video chatting, Facebook, YouTube, Twitter and more!\nWi-Fi (802.11a/b/g/n) keeps you connected on the go. The front-facing camera makes it easy to chat with friends and family, while the rear-facing camera allows you to capture your most special moments and easily post them to facebook and twitter.\nSupported and fully warrantied by Matricom, one the top names in Android technology. Matricom provides a helpful phone customer service department as well as online live chat support!", "Name": "G-Tab Prizm xZ - Dual Core Android Tablet PC (7-inch, Wi-Fi, 2014 Model) [Pink]", "ImgURL": "http://ecx.images-amazon.com/images/I/31uRvGxa-AL._SY300_.jpg", "ProductID": "B00HQ6A7FY"}}