{"Reviews": [{"Title": "I am really impresed!", "Author": "Rudy Inoa", "ReviewID": "RQK6XVJBN4C2G", "Overall": "5.0", "Content": "First of all, this is not a fake review... I live in dominican republica and this is my first review. I must say i was scared when i ordered it... but when it arrived it was exactly what it says here. This is absolutely the best tablet i have seen for the price... The camera works great, also i was really impressed with the touch responsivnes and how thin it is. It works flawlessly and has Google Play Store on it. Im already ordering two more :)Any questions please ask! I absolutely recommend this!", "Date": "February 8, 2013"}, {"Title": "I Like It!", "Author": "sdallen", "ReviewID": "R3GVZGRZGNAMRG", "Overall": "5.0", "Content": "I just received this tablet yesterday and really did not expect too much for the price. I already use an Acer Iconia tablet but wanted something smaller to use as a bedside dream journal. I installed Docs 2 Go and OI File manager plus a few other apps from the Play Store (already installed)  and I was set.The first thing I noticed is the tablet was advertised as running Android 4.0 but in fact it came with 4.1 (Jellybean) installed, a very nice surprise. There was also a screen protector installed too.I almost went with the Nexus7 but for what I wanted to do I settled on this sub $100 device and I am so glad I did! I just could not stop playing with it! Thumb typing is so easy on a tablet this size and reading all my kindle books on it as well??? Bonus!I even streamed the HD TV series \"Vikings\" from [...] and it ran flawlessly and looked great.Closing: If you need a 7in tablet and don't need too much internal memory then just grab one of these and slap a 16 or 32gb SD card in it and have fun. I still love my larger (10in) Acer for soom things but this little sleeper device is a load of fun and runs great.Stephen.", "Date": "April 7, 2013"}, {"Title": "Value tablet.", "Author": "D J SLEAZY EEEEE", "ReviewID": "R2H2Z54H22Q19Z", "Overall": "5.0", "Content": "I have to admit, when I seen the price I was skeptical about this product. But here are some of my experiences I've had with this tablet.Can stream live youtube streams, which is a plus for me.Easy to learn menu(UI).If you are looking for a tablet that can do most basic tasks and some more advanced, this is the tablet for you.Casing quality is better than expected.Specs. of this tablet are great for the price.System is very responsive and so is the screen. Even with 800*480 resolution, the screen looks fine. Doesn't have a stretched blurry look like I dreaded.Speaker on back is surprisingly louder and clearer than expected.Plenty of connection ports.Battery lasts 3-4hrs normal use, 1-2hrs with heavy streaming. Recommend going through system settings to tailor tablet performance to met your needs. Turn down screen back light to about 60% to get the most out of your battery.This tablet has met every expectation. Worth the price. Get it now!!Also, in the product description it says out of 4gb on board mem, after Android 4.2 OS is installed only 2.5gb are available. Well when I check mine I still have 1gig for apps plus 4.83gb on board available. Bonus I guess.", "Date": "July 3, 2013"}, {"Title": "i love this tablet", "Author": "Angel C. Gordon", "ReviewID": "R61F5H05CY5RS", "Overall": "5.0", "Content": "Tablet came in perfect condition. I've had no problems with it. Works much much better than you would expect for its low price. Its great. It does everything I want to use it for. Using now to right this review. Been great for Netflix and watching crunchy roll  (anime/drama service). The only I can't watch so far is amazon instant video on it. Web surfings great and twitter runs great on it. Better than having to carry my laptop every where. My boyfriend wants me to order him one now even though he's got a tablet. He likes this one better and his was more expensive.", "Date": "May 8, 2013"}, {"Title": "Superb function + great price = must have.", "Author": "Chance", "ReviewID": "R3II0B9LP6YT0R", "Overall": "5.0", "Content": "First off a little warning, something to watch out for is the system can be a little buggy until you run the battery dead and recharge it. At first I had issues with the product shutting off instead of locking any time I hit the power button, but after it ran out of battery initially and I got it recharged it has yet to have this issue. Now on to the breakdown reviews.1. Something I had seen as a big issue was WiFi reception but I personally have had no such issue. On break at work I can get WiFi just about as far as my phone and still be able to stream using all sorts of apps. Which leads me to my next topic.2. It can download and use pretty much any app on the Google Play Store(installed pre-shipment) and seems to run them flawlessly thus far.3. Battery life for something of this size is bound to be on the lower end, that's just common sense, but if your smart with charging and use it can last an amazing time for the size and price. (You could buy 4 of them and have it last all day and it will still be cheaper then an iPad hahah)4. Price is PHENOMENAL, enough said.5. Extra perks, just like another reviewer said, it DID come shipped with 4.1 jellybean which is very nice :D and also it came with a screen protector on it already.6. All in all great tab for the price and while maybe not the best for an extremely long work period running top of the line video games, it is great as a casual relaxation/time wasting device.P.S. While the supplier was great and shipped it out promptly and to the right address, FedEx for some reason decided they were going to change the address it was going to be sent to so I had to go and hunt down my package to get it before the weekend (it was delivered on a Friday). I don't believe this has anything to do with the products origins and everything to do with the FE people being derpheads so I am not going to let it effect the product score, I just felt like ranting..All in all even with the above mentioned hassle I had, I would definitely both recommend this product to others AND buy it all over again!", "Date": "April 23, 2013"}, {"Title": "Awesome purchase", "Author": "Stacey", "ReviewID": "R2Z2CG4K344IWJ", "Overall": "5.0", "Content": "I bought three of these recently...one for my mother, my son and myself.  I couldn't be more please with them if i tried!!  My son loves his, my mother uses her's all of the time and i can't get enough of mine.  This is truly a wonderful product at an amazing price.It does everything all three of us could ever need it to .", "Date": "May 2, 2013"}, {"Title": "Excellent - so far", "Author": "J. C.", "ReviewID": "R1JWNZATQRTET1", "Overall": "5.0", "Content": "My purchase was mainly for the purpose of having a lightweight device to connect to the internet, check email, and do moderate web browing while I go on a trip. This product is exactly as it is, without the bulk of a laptop. The screen is very responsive and I like its portablility. While the 7 inch screen is not large, it is large enough to not having to squint to see the letters/graphics. Time however will tell whether its durable - if not, I will remind myself to come back here and put up a followup review.update - I have had this for 1 year and took this with me on 3 major overseas trip. Overall, it is very good for what it is, a lightweight device to connect to internet and do light to moderate web browsing. However, other than that, it doesn't do much else - I have yet to figure out how to install new apps on this device for example.", "Date": "March 2, 2013"}, {"Title": "not Adequate", "Author": "Flybob", "ReviewID": "R1A8BRSSKZANM1", "Overall": "1.0", "Content": "UPDATE 27 Dec 13: As I mentioned earlier, the power button wasnt consistent. Well, over time the unit got harder and harder to start; it would take 3, 4, 5 tries. Some other reviewer had a similar occurrence. Now it is completely unable to start at all; there is no combination of pushing the power button, holding the power button, pressing the recessed reset button and holding the reset button that will get it to do anything except display the \"Jelly Bean\" graphic. No longer reminds me of anything like Snapple.--------------------------------------------------I didnt have any experience with tablets - thats why I bought this one - wanted to see what the fuss is about.The packaging is sturdy, and the most generic thing I have seen in years.The \"instruction manual\" takes me back to my childhood - those little \"books\" you got in Cracker Jack, except those werent in Engrish. Same font, though. I found it better just to guess how it works.This unit seems pretty solidly built physically - almost like a product from that company that rhymes with Snapple.The touch-screen doesnt seem super sensitive; no matter how carefully I tap the screen, a lot of times it does not seem to actuate where I think it should, especially with checkboxes.The display seems pretty good. I have mostly used the unit for watching Youtube and browsing. The audio could afford to be a little louder, but it seems to have good quality even cranked all the way up to 7 (this one DEFINITELY doesnt go to 11).Another issue is that a lot of times you will click/tap on a thumbnail to try to start a video, you can see the lights flash on the router as it starts to download and then it will just hang. Most of the time \"restart\" works, but occasionally I have to give up on the video if it doesnt start after 5 tries. But I am not counting this against th unit - this might not be the tablet - the router/WAP is a Belkin and these bastards hijack webpages all the time so it could be them interfering with the tablet communications as well.The on/off button cant make up its mind whether it is a soft start or a reboot, I cant predict which is going to happen. The battery life indication is not a good indication of battery life either, within 30 seconds after starting it has dropped to < 80%, and when it gets to 10% left it just shuts off and you have to do a cold start.The power cord could afford to be longer, its only about 3.5 feet. The USB cable is on the short side as well. The AC adapter wall wart gets pretty warm,  recharges it fully in about 3 hours.The biggest complaint I have is the battery life. 1 hour of Youtube and you're finished.", "Date": "May 23, 2013"}, {"Title": "great lil device", "Author": "Phon Kangdee", "ReviewID": "R4X6ZEIWJH6WR", "Overall": "4.0", "Content": "I just got the item today. The delivery time was fast and on time. The device is very responsive and clear. I would have given it a 5 star if the volume was more louder. But all in all very great device.", "Date": "February 18, 2013"}, {"Title": "functional", "Author": "brian m", "ReviewID": "R2G6PLFLN4PRA7", "Overall": "4.0", "Content": "got this a few hrs ago, I've been playing with it and so far so good. For the price it works great.. i didn't give it 5 stars because the wifi reception is poor. but then agin i have a fire hd and its not that much better so i might be a little too harsh, for less than half the price. Everything works so far ,highly responsive and desent speed.I will be updating as i go along.", "Date": "February 15, 2013"}, {"Title": "TABLET SHOCKED ME (GOOD BUY)", "Author": "Jose Almonte", "ReviewID": "R3S47UUME6050A", "Overall": "4.0", "Content": "I WAS LOOKING FOR A CHEAP TABLET UNDER $100 (SINCE MY 2YR OLD SON TOOK POSSESSION OF MY IPOD LIKE HE WAS INCHARGE OR LIKE IF HE BOUGHT IT LOL)SO I WANTED MY OWN PERSONAL TABLET, I WANTED AN ANDRIOD AND SOMETHING CHEAP, SO I CAME ACROSS THE ALLDAYMALL A70X I WAS REALLY SKEPTIAL ON BUYING IT BECAUSE I DIDN'T WANT IT TO TURN OUT TO BE A PIECE OF JUNK, I DEBATED AND READ A REVIEW OF ANOTHER OF THE SAME BRAND AND DECIDED TO BUY IT.PROS:-TABLET WORKS GREAT WITH WI-FI-GOOD FOR NETFLIX, YOUTUBE, OR JUST SURFING THE NET (WHICH WAS MY ORIGINAL REASON FOR BUYING)-HAS PLENTY OF OPTIONS TO UPGRADE STORAGE (SD CARD/ USB FLASH DRIVE)-FRONT & BACK CAMERA-WORKS GREAT IN GENERALCONS:ONLY CON IS THAT:IT TAKES A LITTLE BIT TO GET THE TABLET RUNNING WITH FAST SPEED (BUT TO THE DEFENSE AFTER IT LOADS PROPERLY IT FUNCTIONS EXTREMLY WELL) (GIVE IT A FEW MINS)", "Date": "June 26, 2013"}, {"Title": "Very good tablet for the price", "Author": "miriam", "ReviewID": "R6LPGHTB72SZ9", "Overall": "5.0", "Content": "excellent it works like a computer. it is fast , you can download many apps. easy to handle. my child loves it.", "Date": "July 15, 2013"}, {"Title": "Good tablet", "Author": "ThaBoss", "ReviewID": "R15EJB1RXJLPK4", "Overall": "5.0", "Content": "this is a good tablet and i cant believe its only 80 dollars, When i got it and turned it on it found wifi asap! and you can download mostly any app you want and it WILL work", "Date": "March 22, 2013"}, {"Title": "My first tablet", "Author": "Katrina", "ReviewID": "R1FXRTIF02IVN7", "Overall": "4.0", "Content": "Only had it a week but I like it very much. The size is just right to fit in my pocket like my Kindle does. It's not particularly fast but it does get the job done. The onscreen keyboard works very well for me though I also bought a cover with a USB keyboard in it to use when writing documents. Screen is very bright even after turning it down to save the battery. Sound is fine with the speaker in the back facing me. I'd use headphones for times I also need to see the screen and listen. Being older with lousy eyesight I thought the small screen size would bother me but it doesn't. Google Play works great on it to get more apps. Getting the screen to flip around when I turn the device is very slow but I'm not sure that's so bad. I use an Ipad at work and it rotates too fast. I installed the Kindle app on it which is nice to see the photos in books in color. Text is quite readable though I still prefer reading on my Kindle. Tip: for a cheap but good daily cover I found a nice spongy tablet cover for $1 at one of the dollar stores in their electronic section. It's too large for this so I cut it in half and resewed it to make covers for both this and my Kindle.", "Date": "June 24, 2013"}, {"Title": "Not worth the trouble!", "Author": "Dorothy Stephens", "ReviewID": "R2G4X0FCOASQ0H", "Overall": "1.0", "Content": "This is another of the four tablets I ordered for grandchildren that are faulty and won't last. Now I have to save up to replace them with a real tablet.", "Date": "February 5, 2014"}, {"Title": "Worst Tablet Ever", "Author": "Karla", "ReviewID": "R19ZPB1AK6RXDX", "Overall": "1.0", "Content": "To be honest is the worst tablet I'd ever had! The image is blurred, the pictures are dark. I really don't like it!!!", "Date": "January 2, 2014"}, {"Title": "Unit died a few months after purchase", "Author": "Bryan K. Steagall", "ReviewID": "R3MHVA50XA5K9E", "Overall": "1.0", "Content": "I bought two of these items as prizes for kids at my church.. One of them works just fine, the other is dead in the water after sitting on a shelf for a few months.This company makes it very difficult to get items repaired.. I would not recommend buying this product", "Date": "December 19, 2013"}, {"Title": "did not last", "Author": "233cbclka", "ReviewID": "RHEYJFU43EXUQ", "Overall": "1.0", "Content": "Bought 2 they Did not last more than a couple of months.  Would not charge.  Tried other chargers also nothing worked.", "Date": "November 28, 2013"}, {"Title": "Good buy but might have quality control issue", "Author": "Mike", "ReviewID": "R37ZVO13CARN40", "Overall": "4.0", "Content": "I bought this for my middle grandson. Booted up and worked great with no lag time noted even when he was playing some fast moving games. Cost/benefit is much better with this unless you need a higher performance tablet. I was actually so impressed bought a second one for my youngest grandson. Unfortunately it is currently being returned. Almost immediately it started shutting itself down or closing apps on it's own. Hopefully just a dud. On the plus side Amazon makes it easy to return a defective item. Because of that I say give this tablet a try and as long as not defective you'll be pleased with performance and price. Just don't expect Nexus or Ipad performance although unless your using pretty graphic intensive programs you probably won't notice much difference except for the price.", "Date": "May 13, 2013"}, {"Title": "Not an iPad but wow!", "Author": "garyznola", "ReviewID": "R14NU8L8YKMBBC", "Overall": "5.0", "Content": "Bought this tablet as a gift to give to my nephew.  So when it arrived I had to set it up with some games and stuff for him and OMG, I almost kept this one myself.  I have an iPad and this tablet is pretty comparable to it and even better in many ways even though it is one tenth the price.  Yes, it may not be as responsive or have the crisp and clear screen, but for the price, this little thing is awesome.  If you want to grab a cheap tablet that works well, I would definitely recommend this one.", "Date": "April 16, 2013"}, {"Title": "Outstanding!", "Author": "Ken Heath \"DJKen\"", "ReviewID": "R346KAWV9FB1JN", "Overall": "5.0", "Content": "This is the third tablet I've purchased in hopes of finding one that will do what I want... The WM8850 is it! It does all the 'computer' stuff quite well, but I wanted a unit that would play stored videos through an HDMI out and show the images on the built-in screen at the same time. (I'm using it to feed a video projector). I will be buying more of these for other systems.", "Date": "May 27, 2013"}, {"Title": "Great price for a great tablet.", "Author": "Marbles84", "ReviewID": "R1TMJS1WEGNXHU", "Overall": "5.0", "Content": "I originally bought this thinking I was mainly gonna use this as a travel tablet. Something I didn't mind breaking or losing. Now I use it more than anything else. It's very responsive and extremely fast. I am able to watch videos on HBOGO and YouTube with no issues.Highly recommend!", "Date": "May 26, 2013"}, {"Title": "My Gift`", "Author": "LEVI", "ReviewID": "R6S3KOAGFEVBO", "Overall": "5.0", "Content": "This was a educational gift for my kid. She likes it and used all of its capability for her school work and soical networking.", "Date": "May 26, 2014"}, {"Title": "bad product", "Author": "Candace Davis", "ReviewID": "R19H9LM2G4K4KB", "Overall": "1.0", "Content": "BIG MISTAKE BUYING THIS ITEM..STOP WORKING AFTER A MONTH. POWER BOTTON GETTING STUCK..IN THE END JUST A WHITE SCREEN..USELESS NOW", "Date": "May 21, 2014"}, {"Title": "Bad experience", "Author": "mike", "ReviewID": "RYXDLTMXDD3WR", "Overall": "1.0", "Content": "This item is waste of money, it sticks , try to get it to work but the item is no good. It came damage as well. Would not encourage anyone to buy this item.", "Date": "May 21, 2014"}, {"Title": "I do not recommend", "Author": "Rossie Placid", "ReviewID": "R1J0NP0CU1SK7V", "Overall": "1.0", "Content": "I do not recommend this tablet, only probe once you charge at night and then would not turn over, not even turn on the bombillito of loading. not recommend this article", "Date": "April 25, 2014"}, {"Title": "Screen broke the first week", "Author": "Dara Gibson", "ReviewID": "R1FNHYXKP35LLQ", "Overall": "1.0", "Content": "I got it quickly, charged it, and played with it. It was working ok, I had it in a case and had a screen protector on it. It fell off my couch, maybe 2 feet, I don't think its even that far, onto carpet and the screen was destroyed.", "Date": "April 10, 2014"}, {"Title": "A70M Dual Cord Tablet", "Author": "Yolanda Sapp-Wester", "ReviewID": "R2OK9OPZKHN26", "Overall": "5.0", "Content": "I purchased this tablet for my daughter & she absolutely loves it! It's very easy to maneuver & the apps downloaded without a problem!", "Date": "April 5, 2014"}, {"Title": "Not to great but it works", "Author": "Raymond", "ReviewID": "R28BKAOIC6X7IH", "Overall": "2.0", "Content": "Picture not really clear when taking pictures, can't use many apps on it and it has a very low battery life.....", "Date": "March 30, 2014"}, {"Title": "tablet don't work", "Author": "derrick lyles", "ReviewID": "R2Q9TVBAYDHEBJ", "Overall": "1.0", "Content": "Cause it does not play movies just the sound how do I go about getting another one cause this one is broke", "Date": "March 20, 2014"}, {"Title": "Glitches galore", "Author": "krysha hurt", "ReviewID": "R2KJQAISIWUYMX", "Overall": "3.0", "Content": "The microphone jack hasn't worked since I got it out of the package. Also its very slow to respond to my finger when I touch the screen. Just has a few glitches. Other than that I would say its good. If you decide to go with this tablet I would recommend getting a replacement plan if possible.", "Date": "February 20, 2014"}, {"Title": "Great tablet!", "Author": "deangelo royal", "ReviewID": "R2A21R39Y15DI6", "Overall": "5.0", "Content": "The speed on this tablet is very good. It is perfect for the price. I bought it to download games for my children. My children loved it!", "Date": "January 31, 2014"}, {"Title": "Good experience but with a problem to solve...", "Author": "Jesus O.", "ReviewID": "R3UPKFMOP4WK16", "Overall": "3.0", "Content": "I received my tablet with the included components. So far I've had a relatively good experience except for one problem, I have trouble to run the Netflix app. It opens perfectly but I only have audio and no subtitles so visualize the video image, just a black screen appreciation. Look for an older version and the same problem happens. Any help or suggestions to fix this issue because Netflix does not guide me about it?Thanks in advance.", "Date": "January 28, 2014"}, {"Title": "even better than advertised", "Author": "Amazon Customer", "ReviewID": "RO03W6BIIY0ES", "Overall": "5.0", "Content": "This little tablet is even better than I expected.  It has lots of connection potential and the battery has lasted very well.", "Date": "January 14, 2014"}, {"Title": "Fast, but Poor Camera", "Author": "EmZ", "ReviewID": "R2QMZSJ2IR0TEH", "Overall": "4.0", "Content": "Dual processing makes for clear, quick, easy downloading, playing games and watching movies.Downside: camera is the worst. I contacted them because the camera is so bad (grainy and blurred, even ouside in direct sun). Customer service confirmed that was the quality of the camera. Wow! It's bad! I even sent them samples of what it took! Customer service is super helpful and respond immediately. I decided to keep it with the crappy camera since it was so cheap and it's for my son to play on; but then it froze several times within the first few days. Sent it back for a replacement. I'll see what I get in exchange...", "Date": "January 4, 2014"}, {"Title": "decent device", "Author": "Jodi L. Ducheny", "ReviewID": "R1F5SK362GB60F", "Overall": "4.0", "Content": "so far so good, my daughter is 7 and she has been playing non-stop on it. I think it was worth it for the price.", "Date": "December 30, 2013"}, {"Title": "Cool Tablet For The Price", "Author": "kaye", "ReviewID": "R3B07GGY6XBX3X", "Overall": "3.0", "Content": "This tablet is ok for the price. It comes preloaded with 3 games. Angry Birds, Turbo Run , and Fruit Ninja. I was surprised youtube wasn't on my tablet but I downloaded it from the app store. It has a front and back camera. The camera is very bad. My pictures come out very dark. The only way I can really see myself is if I take a pic in front of a bright light. It has a hdmi and usb port. It downloads well and browses the internet quickly . Also there is a sd slot to expand storage. This is a good tablet and budget frienndly. The only bad thing I can say about it is the camera is not the best.", "Date": "November 19, 2013"}, {"Title": "Broke less than a week after gifting it to my son", "Author": "Theodore", "ReviewID": "RM6BSU14KXOFJ", "Overall": "1.0", "Content": "Everything worked great on it for about a week, then it doesn't turn boot up. It turns on, but then the Jellybean icon on the front showing that it is starting up but never goes anywhere different. Hit the reset, same issue. Let the battery die off of it completely, and still the same issue. Great product if you only want it to work for a week.", "Date": "September 29, 2013"}, {"Title": "Excellent", "Author": "Hendrik Sulbaran", "ReviewID": "R1IJ5MRN5I4ZYC", "Overall": "5.0", "Content": "excellent :)I was surprised that it came with android 4.1 version, not what I expected, very quick, clear screen resolution, fast shipping great product ... I recommend it meets my expectations ..", "Date": "September 20, 2013"}, {"Title": "I have had this for about a week....", "Author": "Jannett Neville", "ReviewID": "R24LWEHQDXHWU1", "Overall": "4.0", "Content": "First of all what we use this for is Netflix family movie night and a few games my 5yo gets to play on it. Very basic use.Pro: Its cheap! It comes with a protective screen.  HDMI ports - USB  Low battery life - limits the time my 5yo can be on it, works out well in our household.Con: The camera is only front facing, same side as the screen. (5yo likes to take pictures.)  Battery life is only about 2 hours, so its not to good for long trips - be prepared to charge it.Overall I'm very happy with it, and it works great as a stay at home device.", "Date": "September 9, 2013"}, {"Title": "Tablet", "Author": "Terri", "ReviewID": "R31WP918EXV6S7", "Overall": "4.0", "Content": "I always wanted a nice size tablet  and this is very handy, works well, At  very affordable price.If your on the fence with this one its a good buy. came very fast too.", "Date": "July 14, 2013"}, {"Title": "It works pretty well", "Author": "Mine", "ReviewID": "R3B6RMSQRU6VEY", "Overall": "4.0", "Content": "I really like this tablet. It is like having another computer. I bought a USB hub and it worked. I connected a mouse and keyboard to this Tablet PC. I am going to college soon and it will make a great note taker (once I find a good word processor). I also connected it to my Epson printer via WiFi, so it does a lot. I would have given it 5 stars, however, it has the tendency to freeze every one in a while, but the reset button takes care of that. Another problem is that the charger is kinda cheap and mine broke, so I can't use the tablet at this time. Overall, this is a good bargain Tablet PC and I recommend it to anyone who is looking for a good tablet that doesn't cost too much.", "Date": "July 12, 2013"}, {"Title": "Stopped Working 2 Days After the 30 Return Period", "Author": "Amazon Customer", "ReviewID": "R1MBKPRCDCIZ8Y", "Overall": "1.0", "Content": "Shut down while my nephew was playing a game.  We thought maybe the battery had died, but it still will not power up after charging.", "Date": "July 6, 2013"}, {"Title": "Failed Quickly", "Author": "JP", "ReviewID": "R36S6ZU0TM2F6Y", "Overall": "2.0", "Content": "I am easy-going or I would have given it one star. I noticed almost immediately after charging it the first time (overnight) that the battery capacity was very low. Not a huge deal, except that it's only been weeks and it won't hold a charge now and won't even start up.In addition: no instructions; generic box; the whole thing seemed shady to me and I'm actually a little surprised because I've always had very good luck with Amazon purchases. I will be returning it posthaste.Still, like the cliche goes: you get what you pay for. I think there's a certain amount of \"luck of the draw\" when it comes to inexpensive electronics.", "Date": "June 28, 2013"}, {"Title": "Alldaymall tablet", "Author": "JUDY EDWARDS", "ReviewID": "R11BE9M9CX0502", "Overall": "2.0", "Content": "The staff at Alldaymall was wonderful trying to assist me with the tablet but finally determined it must be defective and suggested I return it.", "Date": "June 28, 2013"}, {"Title": "Worked for less than a week!", "Author": "Mandy Simpson", "ReviewID": "R2GYQSTI9WW0HB", "Overall": "2.0", "Content": "I was pleasantly surprised when this tablet arrived in the mail.  It was sturdier than expected and was very responses.  My 7 year old son saved up his money to buy this and he was thrilled.  Unfortunately, within a couple of days it began to freeze up and then not hold a charge.  When you did plug it up, it would make a static noise.  Ultimately it gave up the ghost and eventually wouldn't even turn on.  I exchanged MANY emails with customer service...and although kind, were not able to help me after several days of back and forth.  I finally contacted Amazon and shipped it back for a full refund.  I am very disappointed for my son, but I guess you get what you pay for...", "Date": "June 26, 2013"}, {"Title": "Would be great if it worked for longer than 3 wks.", "Author": "E. Angulo", "ReviewID": "R2O50SOB9HIC10", "Overall": "2.0", "Content": "I bought two of these after my daughter found them online. The price was absolutely awsome! Well both are kind of glitchy. Mine would stop responding to the horizontal or vertical movements, would get stuck on vertical view no matter which way I moved the tablet. Restarting it would make it work again properly. Used it mainly for viewing You Tube videos or online surfing, which I have to say was great. The picture and video quality was impressive. Camera is awful though. Apps worked fine too. But after very light use within three weeks, the tablet stoppped functioning. Wouldn't turn on unless I plugged it but soon after it froze. Now it doesn't work whatsoever. Too bad. My daughter's is still working I believe, but it's always confiscated for being in trouble so she doesn't get to use it much.", "Date": "June 20, 2013"}, {"Title": "its Oks.", "Author": "Francisco Holguin", "ReviewID": "R1BMCF33LWFZKC", "Overall": "3.0", "Content": "The Products is Ok, but the table have a problem with a battery, charge is over in 20 or 30 minutein the application is fine but some times freezing and wait. the quality fo video is great, the Wifi is Greate, in some game is greate too. for a Kid is excelent but, a adult not recomend.", "Date": "June 19, 2013"}, {"Title": "would not hold charge or charge at times", "Author": "J. Bentley", "ReviewID": "R2EJT33VC4QQQR", "Overall": "2.0", "Content": "big problem with battery and charging, if you could keep it charging or running on charger would be great device had mini hdmi and some other things you won't see on small devices, steer clear unless you like to gamble I am sure someone gets one that works. I finally give up and returned then went on to the Asus Memo 7 inch that is working out fine had to give up the mini hdmi though.", "Date": "June 19, 2013"}, {"Title": "Does not hold charge", "Author": "M.J.", "ReviewID": "R2ON8BN2WPEUBP", "Overall": "2.0", "Content": "The battery does not hold charge for long. Needs frequent recharging. My son does not even play with no more.", "Date": "June 16, 2013"}, {"Title": "its good for a second device", "Author": "Kirk Johnson \"book wander\"", "ReviewID": "R2M61GU8HCQIR2", "Overall": "3.0", "Content": "it not very fast  connecting to wifi but once it loads it works wellfor the price it good for the kids to have", "Date": "July 30, 2013"}, {"Title": "Caused headache for Amazon and us", "Author": "Dave", "ReviewID": "R183J2KGQGK24N", "Overall": "2.0", "Content": "Package arrived on time and in good shape, however, this tablet would not recognize our wi-fi even though it is unsecured. Tried for 1/2 hour to get it to work and tried the wi-fi on other devices to make sure it was not a wi-fi problem. Wi-fi worked fine. I scheduled a return pickup with Amazon and about 1 hour later, this device woke up and decided to read the wi-fi. Now I have spent an hour on the phone trying to cancel the pickup but that is not allowed. So, Amazon is out the pickup cost and I have spent a good amount of time and effort. This tablet is for a child who is so excited now that it works that he doesn't want to part with it. Otherwise, I'd send it back anyway.  I have no idea if this tablet will continue to work or if it was a one time thing.Update: It has been almost 6 months now since this tablet was purchased and to my surprise, it is still working and seems to be working well. I'm not sure how to increase the rating I originally gave it but it is better than the original rating.", "Date": "March 9, 2013"}, {"Title": "SLOW...very slow", "Author": "Florafis C. Lazo", "ReviewID": "R7TOEYZQJSYXX", "Overall": "1.0", "Content": "Pros:Product came new and arrived quickly.Android 4.2.2 -- latest Jelly bean android OSCons:slow...very slow...i have no idea if this is broken.as i write this, I am considering returning it because i believe i have tried everything i can as a beginner user of tablet products.  my cellphone is android and interaction with this product is nearly flawless.  this tablet has many problems in terms of speed and wireless access and apps crash consistently.  i don't know what's going on but i am starting to think that this is standard operating procedure for this device.  definitely not a satisfying experience.", "Date": "August 15, 2013"}, {"Title": "If you don't really plan on using it it is great...", "Author": "McKay Stewart", "ReviewID": "R1B7J4ZDQ9J84R", "Overall": "2.0", "Content": "It was fine at first but it has slowed down a lot and it lags like nothing else it does work sometimes and it was working great for the first few weeks but it is not the greatest buy I have made.", "Date": "July 26, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00H7VU5CI"}}