{"Reviews": [{"Author": "Tenny Sin", "ReviewID": "R25AUXAN18P2PT", "Overall": "5.0", "Content": "I enjoy the super clear HD screen with a resolution of 1600x2560 pixels. I like the image quality of the 8MP central camera with autofocus, flash.  We watched some online video YouTube, MLB.com on the Tab Pro 8.4-Inch , we enjoy the clarity of the screen and the speed of the 2.3 GHz Quad Core Processor. I read the specification, it is Corporate E-mail/Calendar/Contacts Microsoft Office compatible. I am ready to try Outlook E-mail on my Galaxy Tab Pro.", "Title": "Impressive HD screen - Perfect for entertainment", "Date": "May 8, 2014"}, {"Author": "root", "ReviewID": "R24V5RGR688ON2", "Overall": "5.0", "Content": "I've had most of the tablets and I switch frequently.  I have managed to keep this one the longest and I am still in love with it.", "Title": "love!!", "Date": "May 5, 2014"}, {"Author": "FSJUNKIE", "ReviewID": "R5LVE2L0GMY3L", "Overall": "4.0", "Content": "I've had all versions of the iPad except the iPad Air. I've had both years of the Nexus. I've had a Toshiba Thrive. This Galaxy Tab Pro 8.4 is the blend of features and usability that I was looking for. Nice display. Nice size. Expandable Memory. Smooth operation. Responsive digitizer. The only thing that I would have liked to have had is an S-Pen...like I have on the Galaxy Note 3. If that's an important feature for you, then consider the Note series tablets.One thing that irks me about this product is the short USB cable...it's like 2ft. Did Samsung really save that much money by including such a ridiculously short cable? Makes no sense whatsoever.", "Title": "Enjoyable Tablet Experience", "Date": "May 5, 2014"}, {"Author": "Batou", "ReviewID": "R1NUZIW44YG80D", "Overall": "5.0", "Content": "Bought this to replace a nook Hd+ I hard bricked. So far it has been great. I did not want to downsize from 8.9\" to 8.4\", but I really find the size ideal. It's not too bulky and the resolution is amazing. The storage and speed are great. I have not found a reason to have to root it yet which is the first thng I did with my Lg F3 and nook. I popped in a Sandisk 64gb sd card without issue. Battery is reasonable. My only real gripe is a limitation with A2DP bluetooth, which prevents mirroring a phone with your tablet, but this is a general Android limitation.", "Title": "Excellent tablet.", "Date": "May 2, 2014"}, {"Author": "M. Kaplan", "ReviewID": "R34TGPHMDX9ZG1", "Overall": "5.0", "Content": "I'm love my new Tab Pro 8.4. It is the perfect size and it is very fast. It performs great. It also interacts well with my Samsung s4 phone and Samsung Smart Camera.", "Title": "Fast and the perfect size.", "Date": "April 1, 2014"}, {"Author": "Rob", "ReviewID": "R2D77ZH00B3R1T", "Overall": "5.0", "Content": "I received this item on 3/26/2014 and so far there's much to like.  The display is brilliant, the CPU is fast.  As perspective for my review, I have a Galaxy S4, so the Samsung style is very familiar to me.  I know there's been much said about the Magazine UX, but I actually like it.  But if you don't, you can easily hide it, and use custom pages like any other Android device.  I have a blend, some Magazine elements, and some I custom created. Having KitKat is a nice perk, I like a few of their improvements, particularly with email.  Overall a very solid device, the only real drawback I've noticed so far is the auto-dimming display just really doesn't work right.  On my Galaxy S4, it is terrific, it is exactly the brightness I need it based on current lighting conditions.  On the Tab Pro, it is way too dim.  In a completely dark room, I can barely see the screen.  Obviously manually setting the brightness alleviates this problem.  Just odd that the S4 does it so right and this does it so wrong.  I don't have much experience so far with battery life, seems to drain pretty steadily with video,  but it does seem to sleep very well (overnight it lost just 2% of it's charge while on with Wifi enabled.)Summary:Pros: Gorgeous display, fast CPU, expandable storage, KitKatCons: Auto-dimming display isn't good, retrieving \"extras\" isn't as intuitive as it should beNeutral: Magazine UX, battery life", "Title": "Brilliant display, solid value", "Date": "March 27, 2014"}, {"Author": "Charles Rivers", "ReviewID": "R1DIAYH1T8D543", "Overall": "5.0", "Content": "I've been using an iPad one, and an iPad two, but decided to get something smaller, and the option to use a 64GB SD card sold me.It took some time comparing this unit to my wife's new iPad air, but I really have come to love this little tablet. And after copying some movies i burnt in Cucusoft, I'm very impressed. My iTunes movies won't play on it though, but that's cool.", "Title": "Took some time", "Date": "March 23, 2014"}, {"Author": "Cr Nagelschmidt", "ReviewID": "R34R4IWDWIOACA", "Overall": "5.0", "Content": "Awesome product!  Fantastic screen. very stable Android implementation, mirrors my Galaxy s4 and more seamlessly.  Best of class, a bit pricey but worth the small incremental when you consider all the features.  Battery life better than expected and better than the reviews.", "Title": "Highly recommended", "Date": "May 11, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1UJN7ANOI5J2F", "Overall": "5.0", "Content": "Best mini tablet ever! I have the iPad mini & Kindle HDX 7, but the tab pro is my favorite! So fast & it does so much more...Love it!", "Title": "Best mini tablet ever!", "Date": "March 21, 2014"}, {"Author": "Brian", "ReviewID": "R2FCRHA4FBLTV2", "Overall": "4.0", "Content": "The screen is truly beautiful. I think this size hits the sweet spot.  10 inch feels too big and a little awkward to hold, 7 inch is hardly an upgrade from my smartphone. Also, the multitasking is actually useful and usable.", "Title": "Very nice", "Date": "February 23, 2014"}, {"Author": "A. Edmonds", "ReviewID": "R147ZKTHQ33LN2", "Overall": "5.0", "Content": "Love It. Great for all my e-reading and other computing. Perfect size for traveling. Battery is reasonable. Recommend to anyone that loves to read books.", "Title": "Love it.", "Date": "June 12, 2014"}, {"Author": "andrew", "ReviewID": "R2O7NMQDMERPKC", "Overall": "5.0", "Content": "Been looking for a tablet to use so my phone doesn't die from using apps all day. I got this in perfect condition not damages in package. Once turned on it just amazed me. Picture and color quality is amazing and so is the speed of the tablet. It is the perfect size for a tablet. Best works with a case the will tilt in landscape and portrait modes.", "Title": "best tablet out there.", "Date": "June 10, 2014"}, {"Author": "Greg", "ReviewID": "RC74UPKRARSN2", "Overall": "1.0", "Content": "I've had this thing six weeks and for the last week, it won't hold a charge.  When plugged in, it won't run, it just displays a charging battery.", "Title": "Won't Hold Charge", "Date": "April 10, 2014"}, {"Author": "doubledeckersoulwrecker", "ReviewID": "R8A62VFJ29RWI", "Overall": "4.0", "Content": "I came from a a Tab 3 8\" and thought this tablet would blow me away, it was nice (like how your mom tells you somethings nice when she doesn't mean it) but was cold, I enjoyed the Tab 3 experience more. Now as I've had it a few weeks, the touch response of the screen has gone nuts and had to send it back to Samsung. So now I'm tabletless... almost 400 bucks and it's in the shop for a couple weeks, b.s. And now I have a S5, from Verizon, and I'm hearing a lot of bad news of the camera shutting down on these. Samsung, if your listening,  q.c,,, quality control", "Title": "It's niiiiiiice, BUT,,,,,", "Date": "April 26, 2014"}, {"Author": "eliezer martinez", "ReviewID": "R360MN8X3ZD7D8", "Overall": "5.0", "Content": "This product's retail price is $399 so I don't know where Amazon got a \"list price\" of $479 from. There is no savings don't be fooled. Just walk into a Best Buy with a Samsung Experience Shop in it and buy this amazing tablet today. No need to wait for shipping.", "Title": "Great Product but Amazon's pricing is misleading", "Date": "March 8, 2014"}, {"Author": "wrangler", "ReviewID": "R1NQM65Z35FFLE", "Overall": "3.0", "Content": "Things I love about, things I think they missed the mark, firstly, best screen resolution and pixels on the market,  hands down amazing. No one even come close. It is also very bright, even on halfway,  it has a better brightness they any tab I have owned. 2nd , it is fast. No lag from going from a to b, even with multi windows I use. 3rd, very light...seems to weight nothing, nice to use to take notes or hold for long periods.Ok, on to what they failed on,  and why this will not be my last tab....will most likely get the next Samsung tab when it comes out.The battery is horrible,  seems that I charge it more then I use it, it may have something to do  with the new Samsung magazine UI: I not sure, but I am tempted to try to return the tab because of the horrible battery. Also, it is priced a bit high, should have been a hundred dollars cheap, but I think this has to do more with the horrible battery then anything. Let me say it again,  this has a horrible battery!All in all it is an OK tab, if I had the money I would get the tab pro 10.1 in or the note 2014", "Title": "Some good, one really bad", "Date": "April 7, 2014"}, {"Author": "Debra", "ReviewID": "R3QX301WY01B1V", "Overall": "2.0", "Content": "I had an Acer A-100 tablet for four years that I loved.  Never had any major problems with it until it started having charging problems.  I went on the hunt for a replacment.  This Samsung was tablet #3 in that search.  I was feeling a litte iffy about it but then used the camera and was in love.  Lots of nice features there, almost worth keeping it.  The display was outstanding, very high def and clear.  It worked quickly, loading  apps, playing music, watching a few movies.  I thought I had  found the replacement for my poor old Acer.  Then we did some travelling and I noticed  that it had trouble working  with wi fi in various locations so I contacted customer  service.  That's when I realized that I did not want to keep it.  Every \"tech\" that I talked  to had a different solution.  One had me do a factory reset (such a pain in the butt), another blamed the wi fi at the  locations I tried.  I couldn't buy that theory because other  tablets I had worked in those places and everyone around  me  seemed connected with no problems.  After about the fourth time of hearing this I asked to be transferred to someone higher up and their solution was for me to send it in.  I said no thanks and returned it to Amazon.Another  word about Samsung  customer service - before I had the wi fi problems I had tried to connect this tablet to a bluetooth keyboard and had tried to print to my Canon cloud printer.  Had trouble with both and both times customer service told me that unless I used a Samsung keyboard and printer I would not be able to accomplish these things.  I feel like their customer  service people must get bonuses if they sell Samsung products while \"helping\" solve problems.", "Title": "Disappointing customer service.", "Date": "April 6, 2014"}, {"Author": "Andrew Sanderson", "ReviewID": "R3RCOXOPWRLZZD", "Overall": "2.0", "Content": "I recently purchased this tablet after reading the reviews. There is a lag switching from screen to screen which I found very noticeable. I didn't appreciate how heavily Samsung customize the android OS making the installed build quite bloated.This tablet wasn't for me and given how expensive it is I couldn't ignore the cons, sadly I am sending the tablet back.I used to use a stock Nexus7 which was very fast and made the switch for the larger 8.4\" screen . I will probably wait for the Nexus 8 or make the switch to the ipad mini retina.My advice, wait for Version 2 of this tablet.", "Title": "Bloated and Slow.", "Date": "March 14, 2014"}, {"Author": "onion", "ReviewID": "RR76FPV2J42YU", "Overall": "5.0", "Content": "The screen is very clear, the software runs very fast, photographs with good results.It is very thin, so I'm a little worried about the accident will make my tablet is damaged. So I also bought:. WAWO samsung galaxy tab pro 8.4 smart case. quality is very good. Recommend that you buy", "Title": "very good", "Date": "March 22, 2014"}, {"Author": "George", "ReviewID": "R1GIT2PR918VIQ", "Overall": "4.0", "Content": "I can't get the micro memory card to stay in the slot without using something like the end of a credit card to insert it all the way until it stays put. It just keeps coming out unless I use something to push if farther in. Maybe my fingernails aren't long enough, I don't know.Anyone else having this problem? Thanks........", "Title": "So far so good except........", "Date": "March 4, 2014"}, {"Author": "Janna Bastardo", "ReviewID": "R2LZ1NLRA4BOJT", "Overall": "5.0", "Content": "This item was as expected,  brand new and works perfect. It did not have any scratch or stains, the only thing is that the battery doesn't last long.", "Title": "it was brand new", "Date": "April 9, 2014"}, {"Author": "Sam", "ReviewID": "R22C3CMJ9358VK", "Overall": "2.0", "Content": "I received the order in 2 days, which was great, but upon arrival I noticed that it came with a small scratch. No big deal right? I called Amazon and they apologized and gave me a $60 refund.A few weeks later, I was browsing through the contacts and schedule section of the tablet, and I noticed MANY pages where there were unknown e-mails and even phone numbers as well as his daily schedule!!! The previous owner didn't even bother to reformat it!!!It works great, but IF I WANTED A USED TABLET, I WOULD'VE BOUGHT A USED TABLET!!I feel like I shouldn't reach out to Amazon because they already gave me a $60 discount for the random scratch...Very disappointed with this purchase, but happy with the tablet's performance overall....BE SURE YOU GUYS CLOSELY LOOK AT/BROWSE THROUGH YOUR TABLET BEFORE COMMITTING TO KEEPING IT!", "Title": "IT WAS USED!!!", "Date": "May 14, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00HWMPRNY", "Features": null, "ImgURL": null, "Name": null}}