{"Reviews": [{"Title": "Incredibly light, fast and beautiful. Is it the best tablet for you?", "Author": "John Ryan", "ReviewID": "R28RTZWTH8FEH7", "Overall": "5.0", "Content": "The new iPad Air is Apple's latest, slimmest, lightest release of their hand-held computer. Oddly enough, it's so beautifully easy to use (my one year old daughter loves playing with it), it's almost doesn't feel like a computer at all.A word of warning - this review is written for people who've never owned an iPad before - and are wondering what all the fuss is about. If you're thinking of upgrading skip down to the \"What's great about the Air\" section below, or just buy it - it's amazing.Just what's all the fuss about?--------------------------------------I used to own a laptop for work, and (very occasionally), it'd sit on my lap on the sofa, and I'd use it for pleasure (eMail, watching films or playing the odd game). Then I bought my first iPad, and the laptop became redundant, a boring \"work device\". Hard to explain, but the fact the iPad is so small and light, and you navigate around with your finger by pointing and gently swiping the screen makes the whole experience a lot easier - a lot more fun.Even my most \"luddite\" of friends have been won over.It's incredibly simple and easy to use (it only has one main button), and everyone from my one year old daughter to my 85 year old dad have taken to without problems. It's size and shape also support using it like a book (literally to read a book or web page), but you can also watch TV and films.Personally I'm also paranoid about my password getting \"hacked\", and someone running up a huge Amazon bill or buying stuff with my credit card on eBay. Well one of the benefits of the iPad (and iPhone) is it's \"almost impossible\" to get a virus - one of the most common ways to get hacked. This doesn't mean you shouldn't use strong passwords, (both Sony and Adobe got hacked), but it's reassuring to leave the Windows world behind.Finally, I love the way these devices (iPad, iPhone, Apple TV, Apple Mac), increasingly work together. The fact you can start a Pages document on your Mac and edit it on your iPad, or take photos on the iPhone, and in seconds see them on the iPad or Mac and display them on the Apple TV.The thing is, \"it just works\".What would you use if for?----------------------------------* Shopping online. Obviously - you could be reading a review on Amazon about the iPad Air!* Reading web pages. As you can hold it like a book it's great to read the news online (my wife loves the Daily Mail Online).* Reading Books. It's great for reading books from Amazon Kindle or Apple Books with the benefit of 1,000s of online book reviews* Navigating web pages. Instead of clicking with a mouse, you gently swipe your fingers on screen to scroll around* Watching Films. I use it to watch Netflix online videos (with an Apple TV you can send stuff to the telly)* Watching TV. With the free BBC iPlayer app you can catch up or download BBC programs* Reading and replying to mail. I use \"mailbox\" a great free app to read and reply to mails, but there's a free one included* Showing and organising photos. Any photos on an iPhone are automatically available within minutes in \"the cloud\"* Playing games. From fun puzzle games like \"Cut the Rope\" to fully fledged first person shooters.* Listening to the Radio. With \"Tune in Radio\" you can listen to thousands of radio stations world-wide.* Listening to music. I stream mine to an Apple TV, but you can also buy portable speakers or just plug into the AUX socket* Editing Word, Excel and Powerpoint documents using FREE App \"QuickOffice\" (owned and supported by Google).* Editing Pages, Numbers and Keynote documents (Office for the Apple) on the FREE Apple apps.* The list goes on and on.Update: You can edit Word, Excel and Powerpoint documents (plus Pages, Numbers and Keynote) on the iPad (although I'd recommend an external keyboard - see below). It's definately powerful enough, although I'd not expect these apps to cope with REALLY complex document layouts. Great for general letter and document writing though.Which model should I buy?----------------------------------I can't comment about Android tablets (apart from the Google Nexus 7 which is well regarded), but in terms of the Apple tablet line-up in order of cost:-1. Avoid the Apple iPad 2, it's a relatively old model, under-powered and with a lower resolution screen. If you really want an Apple but don't want to spend the cash, buy a 16g WIFI 3rd or 4th generation iPad from eBay. Avoid this one.2. iPad mini is a lovely tablet. A 7.9 inch screen and astonishingly light and remarkably thin - it feels like a light-weight book.3. iPad mini with retina screen. Again 7.9 inch screen, but with the blazingly fast A7 chip and a \"retina\" (high definition) screen. Worth the upgrade if you can afford it.4. iPad Air. Much larger screen size (9.7 inches - doesn't sound much but it makes a huge difference). Same fast (A7) chip as the Mini with Retina - the latest and fastest iPad available.Clearly (from my viewpoint) there's only really three options. The iPad Mini, the Mini with retina screen and Air.What are the Optional add-ons?-----------------------------------------Well, assuming you've dropped by the Apple Store or John Lewis (which I would highly recommend), and handled the iPad Mini (with/without retina screen), and iPad Air then your options are around memory size and cellular option.Memory: Once bought, you can't add memory (space for apps, films, books etc). However, the basic price goes up a huge amount (+£80 for the 16g to 32g iPad Air). But, having owned a 16g and then a 32g iPad - I can safely recommend the 16g unless you really want to store a huge amount of videos and downloads. Only you can decide, and if you're lucky enough that money is no object then splash out. Otherwise, 16g should be fine for most people.Celular: Allows you to connect to the internet while you're out and about. This will add an additional +£100 to the price and means you can slip in a mobile phone SIM card. This means (for an additional £7-15 a month extra), you can access the internet on the move. Alternatively, you can opt for the WIFI option, and use it at home or at at \"hot spot\" (eg. Starbucks, most rail stations and hotels etc).Personally I'd buy (and indeed did), the 16Gb iPad Air WIFI.Do I need anything else?-------------------------------Most people (me included) buy a cover. Apple (and now several copy-cats) make a \"smart-cover\" which automatically shuts down the iPad when you close it, and switches it on when you open it. There's versions which cover the back, or just the screen. Apple charge from £35 to £65 for their (admittedly) high quality fabric or leather covers, but there's many available from £10. Be aware, you do get what you pay for.Personally,I think it's a pity to cover the beautiful aluminium industrial design of the iPad with a cover - but if you've spent hundreds of pounds you'll want to protect it from scrapes and bangs.I also invested in a keyboard (£25-80), as I tend to write a lot of mails and documents (remember it comes with a word processor). I'd recommend the Logitech Ultra Thin iPad Air Case with Keyboard - Space Greyand the ZAGG Keys iPad Air Case Folio with Backlit Keyboard - Black although these are strictly optional unless you want to use your iPad as a proper laptop.Finally, if you have another Apple device (eg. an iPhone, Apple TV or Mac) you'll find these work together beautifully. For example, you can create a reminder on your iPad and it appears on your iPhone. Equally, photos taken on your iPhone appear on your iPad, and you can stream music or videos from iPad, iPhone or Mac to an Apple TV.Some people think this \"locks you in\" - but it's your choice.What's great about the Air?-----------------------------------* Lighter (30%) and thinner than the previous version (469g from 650g)* Even faster A7 chip. Blazingly fast!* Improved sound (compared to the iPad 4)* Software including+ iMovie - edit and publish home made movies+ Numbers - Fully functional Excel for the iPad+ Pages - Word processor+ GarageBand - Play a piano or a drum kit+ iPhoto - Edit and organise your photosWhat's not so great?--------------------------* The change in physical size means you'll need a new keyboard or replacement cover if you're upgrading* Pity Apple didn't include the \"touch ID\" to secure your passwordsOverall Opinion---------------------It's hard to believe the iPad version 1 was released just four years ago, and there's a huge raft of \"me too\" tablet computers to choose from, but the Apple iPad Air is still the one to beat. As \"Which?\" magazine (in the UK) put it - \"...the best tablet we've ever tested. Apple packs a beautiful screen and lightning fast processor into a slimmer-than-ever shell, and battery life is very impressive\".Yes, there are cheaper Android based alternatives, but the quality, design and beauty of this tablet just sets it apart. If it were a car it'd be a top of the range Mercedes or a BMW.Highly Recommended.", "Date": "February 23, 2014"}, {"Title": "Perfect companion", "Author": "Victor AJibola", "ReviewID": "R2WWQ4BGW6N98", "Overall": "5.0", "Content": "It is a good product with enough space to perform several assignments. Very light and handy well packaged and will recommend seller to colleagues", "Date": "May 5, 2014"}, {"Title": "Best of the best!!", "Author": "Hairol Beca", "ReviewID": "R2ER43QQBCEF8H", "Overall": "5.0", "Content": "Just the best desicion I ever made on items bought through Amazon. I was afraid of having any issue with this item but, I received it as perfect as I would bought it myself from the Apple Store!!", "Date": "April 13, 2014"}, {"Title": "Outstanding product", "Author": "pupimir1981", "ReviewID": "RF9NIXWJ6KNZ4", "Overall": "5.0", "Content": "It was actually ordered as a gift for someone else. Still waiting on  feedback, will post more in the future.", "Date": "March 16, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00H7OF4IK"}}