{"Reviews": [{"Title": "Nice!", "Author": "dsp", "ReviewID": "R3LNOYID83CBEU", "Overall": "5.0", "Content": "I have owned a few tablets including an acer a500. This is light years ahead of it. My only complaint is the plastic screen. That being said with a screen protector you are set. You also don't have to worry about cracking it. It also takes off some of the weight and that's a good thing. If your like me and you just use it to surf the net and check your email and do every day things. You can't beat the a3 price and features.", "Date": "April 17, 2014"}, {"Title": "Great buy you won't be disappointed.", "Author": "G P", "ReviewID": "R2SSWHAKIME1JY", "Overall": "5.0", "Content": "Have had this tablet for a couple of weeks now and love it. Fast fast fast!  Every thing I needed and more!", "Date": "March 22, 2014"}, {"Title": "acer a-3", "Author": "IRMA PEREZ", "ReviewID": "R143B3XN6MLC14", "Overall": "5.0", "Content": "Great buy, would recomend to anyone whos not wanting to pay too much for a tablet, does everything suppose to do.", "Date": "April 26, 2014"}, {"Title": "Great Value", "Author": "Taicheez", "ReviewID": "R1H0MDO9057KI", "Overall": "5.0", "Content": "Have only had for about a week, but this tablet fulfills all my tablet needs. It is fast and clean with very few pre-loaded apps. Great for browsing, email, and most other apps. Not sure about games. It doesn't have as high resolution screen as more expensive tablets, but it doesn't really bother me. It may be noticeable if you sat two tablets next to each other, but the screen is bright and colorful and not pixelated on video playback. The biggest drawback is the charging time. It takes it about 10 hours to fully charge. The battery life seems pretty good. I have not completely tested with video playback. It appears to use about 8% of battery for an hour of netflix over wifi. So their claim of 11 hours maybe pretty close. The case and screen are plastic, so it may not be the most durable tablet available. Based on my experience the performance and price makes this a no brainer. I have used an ipad 3 and while the build quality and screen is better it isn't any faster and overall doesn't make for any better tablet experience.", "Date": "April 29, 2014"}, {"Title": "Very disappointed.", "Author": "S B", "ReviewID": "R29RDOP998PEDB", "Overall": "1.0", "Content": "The tablet worked fine for all but 1 week. Then the screen started flickering. We tried having it plugged in, working off the battery charge, having it in hand, put flat on the table. Turning it off, back on - nothing worked. It flickers once or twice and goes black, but doesn't shut off. It is impossible to work with, we had to return it.I understand that there might be manufacturer defects, I wanted a replacement of the same make and model. Amazon did not have that option available. Only return for refund (after having bought accessories). I paid roughly $250 for this tablet, the one available now is $280 sold by another seller. Amazon has it listed for $455 as of the moment I submitted my return request.I really want to give this tablet a shot, but I find it unreasonable for such a big company not to be able to send me a replacement but rather have me go somewhere else. Not to mention, the purchase was a gift, that I had to rush overnight and pay premium shipping and it only lasted a week.This review goes for both - the way the Acer A3 worked (or rather didn't) and the way Amazon handled the replacement request.", "Date": "May 12, 2014"}, {"Title": "Great tablet", "Author": "Aline Long", "ReviewID": "R15RR48T1ZMSDS", "Overall": "5.0", "Content": "This tablet is fast and it does what I expects of it.I purchase office suite, and now I can use words, excel and do powerpoint's. I can also open document s in PDF. It has lots of great media apps for those people who are a little more technical. My son is  very technical. He work for best buy before and he likes it.I love it.", "Date": "April 26, 2014"}, {"Title": "great tablet", "Author": "William Mallindine", "ReviewID": "R3CF23A2HA4XJU", "Overall": "5.0", "Content": "fast, plenty of storage with SD card: built in GPs very accurate (I use it for flying my own plane); camera is fantastic.only drawback, the microphone could be better, using Skype can be problematic.", "Date": "June 4, 2014"}, {"Title": "the one to buy", "Author": "jim", "ReviewID": "R2B4MCODE6HORA", "Overall": "5.0", "Content": "it's the best. It plays games that my other one couldn't. It's very light. Great price too.  great resolution too", "Date": "May 28, 2014"}, {"Title": "Great Tablet", "Author": "Daniellia M. Hazelton \"mystery reader\"", "ReviewID": "R1LTEUEU94FYMG", "Overall": "5.0", "Content": "Took me a while to figure out some of the technical stuff, but now I'm having a blast with it.  Only disappointment is the battery has never lasted 11 hours as stated, but last a lot longer then some other tablets.", "Date": "May 27, 2014"}, {"Title": "Awesome", "Author": "C. Powers", "ReviewID": "RGV9TJJMVXKDS", "Overall": "5.0", "Content": "One of the best investments I've made on Amazon. No nagging ads and much less expensive than the tablets that are being pushed.", "Date": "May 26, 2014"}, {"Title": "GREAT TABLET", "Author": "COCOA", "ReviewID": "RNH889WKSPMXE", "Overall": "5.0", "Content": "THIS TABLET IS A VERY FAST AND STABLE TABLET I HAD A ASUS TF302 BEFORE I BOUGHT THIS ONE AND I MUST SAY THE ACER IS JUST AS GOOD. SO I RETURNED THE ASUS WHICH WAS MORE HIGHER IN PRICE AND DID NOT PROFORM AS GOOD AS THE ACER. IT DID NOT PLAY WWE NETWORK AT ALL. THE ACER PLAYED WWE NETWORK WITH OUT ANY ISSUES IF THIS IS ANY HELP TO WWE FANS. BUT ON THAT NOTE THE ACER TABLET IS JUST AS GOOD AS YOUR HIGH END TABLETS THE SCREEN HAS VERY GOOD QUALITY FOR STREAMING VIDEO AND FAST PERFORMANCE ALL AROUND. I WOULD DEFINITELY RECOMMEND TO A FRIEND.", "Date": "May 9, 2014"}, {"Title": "Great Tablet", "Author": "Anson B. Isaac", "ReviewID": "R3DXHO6Y0EF6CS", "Overall": "5.0", "Content": "This tablet is packed with so much features and at such a great price that it makes the other big brands that are more expensive look weak.", "Date": "May 24, 2014"}, {"Title": "Wonderful", "Author": "Shallom Nwokedi \"DrAmaQueen\"", "ReviewID": "R3FJ239DVLEG3R", "Overall": "5.0", "Content": "This is basically the best tablet I have owned and I own an iPad, but this is perfect, for the price I'll say its a steal. So glad I picked, the camera might not be dope but neither is iPad's. Didn't expect Acer to be this good, once I got the tab personalised with my apps and all, it became the envy of my class. Great purchase", "Date": "May 8, 2014"}, {"Title": "Fantastic", "Author": "Cami's Kindle", "ReviewID": "R3AKZ1LRLB9N0E", "Overall": "5.0", "Content": "Love it.  Great feel, sound and performance.  This is my second Acer tablet and they are my tablet of choice.", "Date": "May 6, 2014"}, {"Title": "A3", "Author": "Paul H Ferris", "ReviewID": "ROY46AOOTVCEX", "Overall": "5.0", "Content": "Its great fun  really like its fast  the a3 has great look and feel! And the price is just right,, so far so good****", "Date": "April 22, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HYAL936"}}