{"Reviews": [{"Title": "Doesn't get any better", "Author": "Ralf Conquest \"RJC\"", "ReviewID": "R1HQN191F1EQ3S", "Overall": "5.0", "Content": "I bought a generic tablet back before tablets were really popular.  It was android 1.5 and no upgrades were really feasible.  I used it and loved it.  But finally decided to replace it.  So I did lots of research and found that tablets are all over the charts these days from reasonably priced to extreme.  I read the specs on this tablet and it was a story of sounding a little too good to be true.  But I took a gamble based on the low price and I bought.  I will say I couldn't be happier.  Everything works.  Browsing the web is just like a pc speedwise.  The Googleplay store works like a champ.  I love the voice active search.  I can speak what I want it to look for and it finds it.  I have used this many more times that I ever thought I would.  And this wasn't even listed on the features for the product listing so I consider it a bonus.  My wife and I raced to see who could lookup a listing of songs by an old band we remembered.  She on her laptop and I on my tablet.  I spoke and she typed.  I won of course.  You will be happy you bought this tablet.  Its better than some of those twice this price easy.", "Date": "March 28, 2013"}, {"Title": "Best Tablet .", "Author": "Techpreneur", "ReviewID": "RMQGPSFK3O62D", "Overall": "5.0", "Content": "Really amazed that this level of technology is available for this price. The simple and elegant design rivals that of ipad, yet it come pre-loaded with google play so you can download all the apps you want. I use for business mostly, PDF, CRMs, etc... Works great with any Wi Fi(i.e starbucks, barnes and noble, mcdonalds). Full HTML5 web browsing (i was surprised by that). Screen is responsive and easy to clean battery holds chrage for a long time as long as you dim the brightness. No complaints here. Just lots of impressed clients.", "Date": "March 4, 2013"}, {"Title": "A really good tablet", "Author": "pennywyze", "ReviewID": "R3NXEO7R31HXRS", "Overall": "5.0", "Content": "After being pleased with a Coby Kyros Mid 7122 and later being disappointed after buying a Coby Kyros MID 7042, I decided to give a shot to another budget tablet company that I haven't heard of. In fact, I'm not even sure what the name of the Tablet is other than an A13 tablet.I have to say...I'm more than pleased with my purchase. Now, onto my review-Appearance/Design-The first thing I noticed about this tablet is the fact that it's really thin. Not paper thin or anything, but comparable to Razr products being that it's about a centimeter in thickness.The colors are quite typical of budget tablets; it has a dark gray finish with black trim around the screen.One thing I wasn't too crazy about because I'm so used to my budget tablets being Coby Kyros design, would be that the inputs are in awkward spots. For example, the AC power jack input it located at the very top of the tablet as is the USB input. It just seems weird.The power button is on top (when I'm used to it being on the side as well) and the volume button is on the side of the tablet. (right side)Score- 8/10Interface/stability-This runs on android 4.0, but it can be upgraded and I believe mine is running on 4.1 or something along the lines.The one thing I wasn't crazy about was how big the icons are. I mean, they're huge and seem more suitable for a 10-inch tablet, however, this isn't the case. I've also noted that there aren't any options to change the size of the icons whatsoever. (Perhaps there's an app to help out, but why waste space?)Anyway, unlike the craptacular Coby Kyros mid 7042, this tablet DOES NOT HAVE ANY ISSUES WITH CRASHING.The customizable options are a little limited however and certain options found in earlier versions of android tablets are nowhere to be found in this one.Apps work really well on this tablet. Apps such as Netflix, Youtube (which is not pre-installed), Angry Birds, Temple Run, Fruit Ninja HD (which is pre-installed), Fish game and others run just fine with the only flaw I can possibly think of being that if you play a game while using a live wallpaper and the screen goes to \"sleep\", once you tap the program again, the screen will be a weird color (equivalent to that of a negative photo), until you do a quick exit and tap the game again to play it. This was minor at best and it wasn't a tablet-breaking experience. This minor quirk also didn't \"freeze\" the tablet or cause it to restart.It's just an excellent firmware with 4.0 plus interface that works as described.Score- 9.5/10Speed-This tablet is really fast. The speed is comparable to the Coby Kyros 4.0 or perhaps even some high end tablets.The only downer is that at times after web pages load, you'll often have to touch the screen an extra time or two because for \"some\" web pages, it has a slight delay. It's really not much to speak of but still worth noting. Games run like a charm. I played Fruit Ninja and it's really fast, the graphics have no lag, there's no input lag or anything.Netflix was slightly different because it needed a little extra time to start, but once it started, I was able to watch movies and shows, exit and re-initialize the program and actually the second time I re-opened Netflix, it loaded slightly faster for some reason. The start up time is somewhere around 20 seconds or less in some cases.Score- 9.8/10Features/toucscreen/Sound-This tablet features Google Play and it's very easy to setup. Basically, if you have a google account (gmail), you'll enter your gmail with password and it syncs. Nothing more needs to be done. In addition to syncing with google, you can also add your regular emails to keep in sync with everything.Personally, I'm not that crazy about Google play and I sort of prefer 1mobilemarket, but in Googleplay, you have all the apps you could possibly ask for with the exception of the few that are signature apps such as Amazon Kindle (my favorite)...This tablet also has a sound recorder, camera/camcorder (yes, you can do skype and such, but the camera is just ok. Make sure you have enough light or at least tweak the camera settings for Skype), it comes with what's called a 2160p pvideo player which actually has really good quality for streaming videos off an SD card or downloaded videos. I haven't tried the music player but there's one pre-installed, it has voice search capability, I'm assuming a GPS/satellite addy that comes with Google play. I have the slightest idea how it works, and it also comes pre-installed with some games.Anything else that you want will have to be downloaded by Googleplay, amazon app or 1mobile etc.Now, onto the touchscreen which I love. It's fast, it's responsive, however, you can't calibrate it. It's no big deal because it's sensitive enough. The only delay you'll have with the touchscreen would be when web pages are loading.One of the odd things about this tablet is actually the screen, because I'm not sure what it's made off, but it isn't slick like the other tablets I own. It feels dry, and it doesn't smudge for me.The sound is good, but it doesn't have an equalizer or any tweaks to boost the volume. You may want to download an app called 'Speakerboost' if you want loud volume. Of course, it sounds great with earphones/headphones or any external speakers.And finally, my cons list-Cons-The first thing I noticed about this tablet was how bright it was. It's extremely bright to the point of calling it slight oversaturation. Similar to if you turn your TV's brightness all the way up. This has no effect on videos but it does bother the battery life.The battery life itself was really bad until I turned the brightness all the way down. (don't worry, it's still going to be bright) and downloaded an app called \"Night Mode\" which helped the battery life. Initially, however, the first few minutes of fiddling around with the tablet, the battery was dying by the minute. I can't estimate how long the battery life is but I've tested it without charging it for the past 2 and a half hours and it's still kicking at around 50 percent and lower. (Keep in mind that initially, I DID NOT download an app to tune the screen brightness)Now that I have that app installed, the battery is quite normal. I'll have to update with an edit to tell everyone the exact battery life.In my opinion however, the Coby Kyros brand has a much better battery life than this tablet. (also, the ac adapter doesn't plug all the way into the jack. It sticks out slightly. It looks weird)Really, that's about the only con I could think of because I really like this tablet. It's fast, it was cheap (62 dollars), the placements are a little on the weird side, but the fact that it's so cheap and is comparable to my high end tablets, I'd definitely recommend buying this. Just keep in mind that the battery life is probably not the greatest, but you really can't beat the features for such a cheap price.Edit- May, 13th, 2013I'm still very happy with my tablet and still stand by my review. I'd definitely buy another one. Anyway...The battery life is variable. It really depends on how bright the screen is and since there's no way to adjust the contrast other than an app extension, I'd estimate it around 3- 3 and a half hours max. (That's considering the fact that Wi-fi is on, sound is used and the device isn't on a charger)The good thing about this tablet is that although the battery life isn't the best, it will charge really fast. (Barely takes 30 minutes to get it near full charge.)I'm actually thinking of having a battery transplant done to this tablet.Also, I had a question e-mailed to me about the date and time display on this tablet. The problem with the date/time is the fact that you have to manually set it. You really shouldn't have to set the time/date being that it's google play ready and the Wi-Fi connection usually takes care of that.Update- (July, 10th, 2013)Tablet is still going strong. I actually used it to play Rockpacalypse and it runs the game good. Still haven't had any issues with this tablet.", "Date": "May 9, 2013"}, {"Title": "PLEASE DO NOT BUY!!!", "Author": "Porsha Jones", "ReviewID": "RJ137P3MHZW5D", "Overall": "1.0", "Content": "Alldaymall(TM) 7-inch Capacitive Touch Screen Android 4.0 Tablet PC with Allwinner A13 1.0GHz 512MB/4GB WiFi Front-camera (Black)First of all, I ordered 2 of these for my 5yr old and 3yr old who both know how to work tablets very well. At this price I was not expecting miracles but I thought that they would at least work for more than one day. Wow! I have never been more compelled to write a review as I am now.When we first received the tablets (fast and packaged well) the kids were so excited. They came dead so that meant a few hours of charge time. The chargers are apparently not made for the tablet because they do not go down all the way (weird). One of the chargers just simply did not work at all. So I charged them both with the other charger.At first they both worked fine but about an hour into using them the screens began to flicker and the graphics turned black and faded away. BIG DISAPPOINTMENT!Please DO NOT BUY THIS TABLET! THEY ARE PURE CRAP!I will just spend more to get Kindle Fires so at least my kids won't have to be broken-hearted again!Please don't ignore the bad reviews like I did. I REPEAT:THEY ARE CRAP!!!!!!!!!!!", "Date": "July 28, 2013"}, {"Title": "Great for what it is", "Author": "Amazon Customer", "ReviewID": "RWP2KT45K7FEW", "Overall": "5.0", "Content": "I bought this little tablet for my 6 year old to be able to get online to do some of the educational activities that her school supports as well as be able to play some games and read books.  I have to update the flash player I think, because some of the webpages don't perform correctly.  I'm not really too terribly surprised by that though.The screen is not very sensitive, but that's to be expected, I think, at this extremely low price, so I'm not really going to take anything off on that. The only reason I deducted a star is that the screen IS extremely scratch prone.  My 6 year old has used it for a total of about 2 1/2 hours at this point and the screen has a dozen or more fine scratches on it.  (fruit ninja)  Given that this tablet is mainly going to be used by a kid I should have known to get a screen protector, but I didn't think about it.  Still though, I would never have expected it to be scratched so easily.Other than that, I really don't have any serious complaints.  Took a while for the Google Play Store to come up.  It just stayed there loading for more than an hour, and I wasn't sure it was ever going to come up, but just as I was giving up on it for the night, it came up.  (causing me to lose another hour of sleep haha)The camera isn't very good, but I didn't expect it to be.  Again though, this is for a kid, and as I am writing this, she's running around with her sister taking videos of anything she can find. (including me writing this)Audio is actually pretty good.  It's actually a bit louder than I would have expected it to be, and it's pretty clear. No complaints there at all.Alldaymall was surprisingly very speedy on delivery.  I ordered the tablet and it couldn't have been more than 2 - 3 hours later Amazon sent me an email that said my order had shipped.  I was pretty skeptical that it was accurate, but I checked later that night and it had already been scanned by the carrier.  The order was scheduled for April 3rd - 5th but it arrived on the 1st. I was pretty pleased by that to say the least.  In fact I ordered a protective cover (no screen protector) at the same time to go with it that was being shipped by Amazon, and it didn't SHIP until the 1st.  I would give the seller 5+ stars.  The tablet came in the original packaging wrapped in 2 sets of shipping material 1 UPS bubble envelope and a USPS shipping bag (no box, I was a little surprised by this, but it turned out ok).OK well seeing how this is only the first full day that I've had the tablet, these are my first impressions and I'll update this review after we have gotten to know it a little better.Update: After about a week now I thought I'd give an update.  I downloaded several interactive books from Amazon and they all performed well.  A couple of days ago my daughter was running across a parking lot and CRASH the tablet falls out of her hands and goes skidding across the asphalt.  I figured it was toast, but other than some scratches on the back where it skidded and a scuffed corner where it impacted, the tablet works fine.  Says a little something for durability in my book!::Update::Thanks to a comment made by another member, I found out that there is a nearly invisible shipping protector on the screen.  That's what was scratched not the screen.  Upgraded review to 5 stars, because even though the tablet isn't a great performer, it's not expensive either.", "Date": "April 2, 2013"}, {"Title": "the perfect lil tablet", "Author": "DivaBrown", "ReviewID": "R3RVP67AM86ZNJ", "Overall": "5.0", "Content": "This tablet was a replacement but I have to say it sounds better than the one it replaced that is the speakers and it dose more than I could have thought if you are looking for a 7\". Tablet this is the one and at a great price. I just love it", "Date": "March 9, 2013"}, {"Title": "Buyer Beware!!!", "Author": "Peter Iversen", "ReviewID": "R1PL3PMP0FH65E", "Overall": "1.0", "Content": "It is August 1 - this tablet stopped working today.I have hardly used it - just downloaded 2 apps to read books and one book.  Today I was using the calculator for some volunteer work and it just quit!I charged it in the morning and now - nothing.  The tablet does not respond to anything.  Recharging or - anything.I expected it to be simple and did not have a lot of heavy duty tasks for something that only cost $63.00 - but I did hope it would last for more than 6 weeks!  Lots of things I can get for $10 a week that would be much more gratifying!  The \"warranty' expired 11 days ago!BUYER BEWARE - there is no recourse when something like this just dies - only thing I can do now is use it as a paperweight.How disappointing.  This was my entry into the tablet age - a stepping stone to... whatever - and now...So - is there anyone at Amazon who reads this?  Anyone who wants to be accountable for the business they run - or is it the fault of the Chinese company that made this piece of junk.Time will tell...", "Date": "August 1, 2013"}, {"Title": "pretty good", "Author": "frank dye", "ReviewID": "RIX586GR80GNJ", "Overall": "4.0", "Content": "I got this cause it was a great price for a \"quad core\", but to find out that other dual core tablets will outperform this particular processor. so just do your homework. it works good and the battery life is just ok. i watched a movie and was left with 36% battery. so its not great. the screen is responsive and overall i like the tab. i like the charging options, either micro usb or the charger it comes with. thats nice. no bluetooth to connect other speakers or keyboards. the built in speaker will leave you wanting more sound. on a budget it will be a fun toy. and the \"8gb\" is actually just over 5gbs usable. i wouldnt buy another one. but on the other hand glad i got it. hope this helped.", "Date": "July 31, 2013"}, {"Title": "Great Product", "Author": "Shawn D Koga", "ReviewID": "R145CR5SGZLSJO", "Overall": "5.0", "Content": "Bought 2, my fiancé and I both use these every day. Would have no problem recommending this product to my friends", "Date": "March 14, 2013"}, {"Title": "usable. comes with root", "Author": "Joey Hess", "ReviewID": "R28K1PMBXF5NOR", "Overall": "4.0", "Content": "This tablet was a pleasant surprise, since it comes with root access built in. Just go to Storage, enable MTP, connect a USB cable, and \"adb shell\" will present a root@android prompt, which apparently has full permissions to do anything you desire with the hardware you just bought.(It's a sad state of affairs where full access to hardware you own is not guaranteed.)As far as the hardware goes, it seems acceptable for what it is. Battery life seems unlikely to go much over 2 hours. Having only a front-facing camera limits the utility of the tablet some. Built-in storage is limited; only 2.65 gb are free once annoying preloaded games are uninstalled. Hardware seems reasonably solid for the price.", "Date": "May 1, 2013"}, {"Title": "The product was a disappointment", "Author": "C.J. Sallee", "ReviewID": "R3OGSLL28M22A5", "Overall": "1.0", "Content": "It stopped working after a week. I wasn't pleased with the product. I wish things would have worked out, but stuff happens.", "Date": "March 6, 2014"}, {"Title": "Semi Good", "Author": "BigRayne \"Rayne Armstrong\"", "ReviewID": "R1O84ATHH7L0X3", "Overall": "3.0", "Content": "It is a great pad to have but there are some downsides to it.  The battery is constantly being drained and you cannot update the android software.", "Date": "November 27, 2013"}, {"Title": "Very nice!!", "Author": "Emily hollingshead", "ReviewID": "RCB03QGGWDLQP", "Overall": "4.0", "Content": "I've gotten pretty attached to this little tablet, though it's a little slow and it doesn't pick up wifi connection very well. It's got plenty of memory and it's durable.  (I'm very clumsy and drop it all the time, and it's still fine). Great for gaming. It may not be the best if you're looking for a tablet for work, but it's great for kids and teens.", "Date": "August 16, 2013"}, {"Title": "I love the tablet", "Author": "Nicole Murphy", "ReviewID": "R3PC9YIOKPZHKR", "Overall": "5.0", "Content": "Had a few issues at first and they had so send me a replacement tablet but I can not say enough about the seller AllDayMall has the best customer service I have ever delt with they were prompt with responses and got everything sorted out! A+++++++++ I would definently buy from them again and would recomend them for sure!!!!", "Date": "July 12, 2013"}, {"Title": "You Get More Than You Pay For", "Author": "Amy", "ReviewID": "RXKXQ0F61SIXR", "Overall": "5.0", "Content": "I've had this tablet for three days now, so of course first impressions will last onto my review. If anything changes I will be sure to add it onto my review.This is also my first tablet, so I cannot compare very well to other tablets.In the box is a neatly packaged tablet, a self-explanatory user manual (it appears to be translated so the English is a little iffy, but understandable), a USB cable to connect to the computer, and a USB converter thing that allows you to use USB devices on the tablet. I tried connecting my iPod there, but it just charges without anything special popping up. And then there's the AC adapter for standard charging.First off, this 7-inch tablet is really fit for anyone's budget. If you don't want to be spending 3x the amount of money on those higher end tablets, then this is extremely suitable. As far as I'm concerned, this tablet can do anything the higher end tablets can do, but with less battery life and slower speed (this tablet lags quite easily from the use of some applications).The gravity aspect works well; it's also a bit slow but it works. The brightness is a huge battery waster, so I always tune down the lighting. At the lowest brightness setting, this tablet will work for about 4 hours max (on the browser, searching, watching videos, etc.). I'm sure the battery will leak much faster on brighter settings.This tablet comes with Google Play (and Angry Birds) so you can download all of your familiar apps on this thing. My only issue is that this tablet has very low storage space, so you can only fiddle around with several apps before uninstalling them and replacing them with new ones to conserve space. There's also a TF slot for anyone with a micro-SD card who needs more storage space, but since I do plan on getting a higher end tablet, I believe the kids can handle several apps and lose interest quickly enough to replace them.The audio is fine with headphones, the quality is unchanging. But the speakers are pretty bad so I'd say use external speakers as a substitute or headphones.In conclusion I can easily say that the price for this tablet is very reasonable, but I think I would spend more money on a larger storage, faster speed, and a longer battery life if I ever plan to use a tablet in a more significant setting. As for now, this tablet serves as a great substitute to the computer for the kids on the go and it's very thin and light so it's a great choice.I recommend this product to anyone who doesn't expect too much from a cheap tablet or wants to have a \"starter tablet\".5 stars for fast shipping and a great product.", "Date": "July 5, 2013"}, {"Title": "good", "Author": "hannah", "ReviewID": "R3FU8FQZZ3MOZU", "Overall": "4.0", "Content": "Its good for being an off brand tablet better then I expected and pretty durable got it for my 12 year old and its holding up", "Date": "June 24, 2013"}, {"Title": "Excellent tablet", "Author": "Shirley Largent", "ReviewID": "RH48ZAIBVBQEJ", "Overall": "5.0", "Content": "This is a really nice little tablet, more than expected. Bought it for my son, and he and my grandson use it daily", "Date": "June 7, 2013"}, {"Title": "cool 4 cheap", "Author": "reader", "ReviewID": "RYW58NJNTYNSD", "Overall": "5.0", "Content": "For the price I could stand a litlle slower response than the pricier tabletsand with that I would recommend it for someone needing the surf and or play a game or two.", "Date": "June 6, 2013"}, {"Title": "A Reasonable Tablet", "Author": "Tim \"Timdiana\" Dunn", "ReviewID": "R1E2IYXUH017SV", "Overall": "5.0", "Content": "I think this is a fairly useful tablet. I find that this tablet works best with the likes of New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa!. I think is good one to use if you are just starting off with Tablet. Plus it's at a reasonable price.", "Date": "May 30, 2013"}, {"Title": "Great Tablet", "Author": "Chris Stockton", "ReviewID": "R1V0DLQE71C2NE", "Overall": "4.0", "Content": "This is a great tablet for the money. I was very happy with everything from the speed and the easy interface. The android 4.0.4 is a great operating system, but I wish there was an easy way to update to 4.1. The only problem that I have is that it was not advertised the Android 4.0.4 will not allow you to use the expandable sd card to store apps. You can put your own media on the card and the tablet will read it however it will move anything to the external sd card(without a very strong understanding of the Android OS). Even then it can mess up the tablet. This should be advertised.", "Date": "April 20, 2013"}, {"Title": "great for its price", "Author": "m", "ReviewID": "R3OZWA9KWC4D9Y", "Overall": "5.0", "Content": "excellent thanks, works great runs fast games work well  lightweight easy to use. Fast internet access and WiFi linking I recommend this tablet", "Date": "July 3, 2013"}, {"Title": "Low end budget tablet", "Author": "Wycked Knight", "ReviewID": "R1RCL1IHRFFBKO", "Overall": "3.0", "Content": "It's good for watching Netflix on, but it lacks in memory even when using a min Sd chip it detects it but not sure if  it actually is moving apps to the sd. color is also a bit off when viewing at a angle.", "Date": "July 2, 2013"}, {"Title": "Bad product but if your lucky you might get a good one.", "Author": "JManuwal", "ReviewID": "R3HDU75P5GDGRK", "Overall": "2.0", "Content": "It took five days to charge then it died in minutes. After charging again it worked for awhile longer. I loaded a few things on it and liked it. But when I took the plastic cover off I realized that some of it was trapped between the plastic pieces so now I have the protective cover shreds hanging out. It look really bad. If you buy this tablet play with it as soon as you get it so you can return it in time if needed.", "Date": "June 19, 2013"}, {"Title": "One of the best Cheap tablet out.", "Author": "49ersFan", "ReviewID": "R3LOS4OLWOUTHJ", "Overall": "4.0", "Content": "For how much you pay it is actually pretty good. The battery last a good amount of time if you play alot of games like me.", "Date": "June 7, 2013"}, {"Title": "not so sure yet!", "Author": "Adriana I.", "ReviewID": "R2AOZ0P49WDFIE", "Overall": "4.0", "Content": "The tablet seems good but I am not sure it will last long. So far I have some issues with the connector for the power charge. Battery life goes very quickly I like the product for the price.", "Date": "May 26, 2013"}, {"Title": "For the price - it's decent", "Author": "Gene Y. Moore \"G\"", "ReviewID": "RE2SS5MVBNF9U", "Overall": "4.0", "Content": "Keep in mind the price.  I've had the unit 3 hours so far and it's pretty cool.  Unit comes with a a separate charger but will also charge from the micro usb.  Trust me, use the micro usb.  The tablet itself is a little sluggish when switching apps, but for the kids (which is my primary focus) it's great.  Kids games and movies play great.  The sound is a little on the quiet side and the speaker is in the back.  Keep this in mind when you buy a case.  I had to cut a small hole in the back to get the sound louder.  But like I said.  For the price.  It's not a bad little unit.", "Date": "May 23, 2013"}, {"Title": "Happy with it so far", "Author": "Bigfoot", "ReviewID": "RGY1BPXXGCJ9B", "Overall": "4.0", "Content": "Smaller and lighter, yet has the same screen size as my old 7\" tablet. Faster than I expected it to be... I also installed Smart RAM Booster (free) to quash all those \"background\" apps. I timed bootup at under 40 seconds. Loaded with features. Quick to identify networks and connect to wifi. You can disable any of the preloaded apps, but you can's uninstall them.As other reviewers state, battery life is short, about 2 hours or a little more. It WILL charge through the USB. The speaker sucks (but volume and sound quality is very good with earbuds).There is no trash can! Even with the file manager, you can't delete pictures or files; instead you must connect to your computer via USB and use Windows Explorer or equivalent to delete unwanted stuff. BTW, once you're in picture mode, you can't turn it off... the only way to exit it is to tap the on/off button, which will get you to the home screen, then force close from settings; otherwise, you may see yourself on next season's Tosh.0.Aside from a few quirks, it's an excellent tablet for the price.", "Date": "May 8, 2013"}, {"Title": "Alldaymall good for kids but thats about it.", "Author": "korvon", "ReviewID": "R7T9QLITE51EM", "Overall": "3.0", "Content": "Okay, I've had some time to work with this tablet so here it is... Pro's: inexpensive, responsive touch screen, can be charged on charger or USB, comes with everything you need to get started, Has 2 cameras instead of one.  Con's: if you turn it off you will have to do a hard reset in order to get the touch screen to respond. Battery life is maybe 2 hours if display is set to low, display has to be viewed directly not side to side, No support for updates this is a big issue since you would have to try to find the right one as the model number is not what it is. Processor is slow for a quad core, battery gets very hot during use and charging, you have to have a micro-SD card as the 8GB gets full very fast.  Wi-Fi is very slow, cameras are not the best very low resolution, OVERALL: If you are new to tablets this one is okay but don't expect the quality of Samsung, HP, Google, or others with single or dual core processors.  I gave a 3 star rating as for what it is it works and comes on every time you turn it on unlike some of the name brands that still have issues with that.  another thing is its nice to have a round pin charger instead of just a micro-USB charger.  I would get another one but this is more for a child to use that won't break the bank if it gets broken.  Hope this rating helps you with your decision on this tablet.", "Date": "November 28, 2013"}, {"Title": "Disappointed with the picture quality.", "Author": "Mark J \"Mark\"", "ReviewID": "R1BJN77DMMWG6M", "Overall": "2.0", "Content": "Display quality was very poor.  When holding the tablet in portrait, the background color was patchy, especially when the background was a dark color.  When holding the tablet in landscape, it worked better, but there was a very narrow viewing angle in which the picture looked good.Although it claims to be able to output video in HD, when I connected it to my TV, the picture was terrible.Even given the very low price for a quad-core processor, you are better off spending another 35 or so bucks and getting a tablet with a better quality picture.  If all you want is an inexpensive tablet to use as a reader and to play some basic games, then there are some dual core tablets that are cheaper and have a better picture quality than this one.", "Date": "November 5, 2013"}, {"Title": "decent tablet for price but has noticably slower response than iphone, poor wifi connectivity, bad speakers and poor touchscreen", "Author": "Zachary A. Rose", "ReviewID": "R38YVQI7CL9O3Q", "Overall": "2.0", "Content": "I purchased this item for my dad for fathers day.  Given it's price I was not expecting much, mainly I was hoping that he would be able to surf the internet / watch videos and maybe play some games.  Unfortunately the wifi connectivity has been very poor thus far.  Surfing the web is relatively slow and tedious, with long page load times, and videos are practically unplayable due to the exceptionally long load times (I waited for roughly 30 seconds for a 2 minute movie trailer to load, and when it did play it was halting.)  Even if videos did work they would require headphones as it is almost impossible to hear the speakers.  Additionally overall the tablet responds significantly slower than my iphone, even for normal tasks.  I did not expect a gaming or graphical powerhouse but I did expect relatively responsive basic navigation.  Finally, the touch screen leaves much to be desired.  It takes several attempts to click into any word boxes to bring up the keyboard, which is especially difficult given my dad's lack of experience with smart phones / tablets.  Overall my father seems to enjoy his new tablet, but it has failed to live up to my relatively low expectations.  I wish that I had spent more to get him a more functional tablet.  this is truly a case of you get what you paid for I suppos.", "Date": "June 26, 2013"}, {"Title": "Love It", "Author": "Sheronda Hines", "ReviewID": "R2MBG5YQFVPYDQ", "Overall": "5.0", "Content": "I ordered this for my fiancé so he wouldn't take over mine and he loves it. Its pocket size and he uses it for music, reading and plays games on it.", "Date": "March 2, 2014"}, {"Title": "It's Ok", "Author": "Natasha A Campbell", "ReviewID": "R3GBZAB190STPY", "Overall": "4.0", "Content": "I bought it as a gift for my niece. Haven't gotten a bad feed back from niece about this table.", "Date": "February 22, 2014"}, {"Title": "Nice Pad for the money", "Author": "Paul L Smith", "ReviewID": "R785ZOTK3D70D", "Overall": "5.0", "Content": "Nothing like my IPad but the price was right. I put all our family photos on it and gave it to my elderly mother. Works great.", "Date": "February 18, 2014"}, {"Title": "LIKE IT", "Author": "ina", "ReviewID": "RMJ0NFZ3S5QU8", "Overall": "5.0", "Content": "LIKE IT , LIKE IT, I LIKE AND LIKE. THANK  YOU. THE SIZE IS GOOD , AM GLAD I ORDER IT.", "Date": "February 5, 2014"}, {"Title": "Beware", "Author": "Amazon Customer", "ReviewID": "R25U26A3XXIA8D", "Overall": "2.0", "Content": "These tablet starts out great. The play great. Graphic good. The problem starts a month later, the charger dont work, the or the tablet wont come on, even though it says fully charged. Runs hot very fast, within 30 minute use. The price is good but not worth it.", "Date": "January 29, 2014"}, {"Title": "awesome tablet", "Author": "Sandra Martinez", "ReviewID": "R1YP9K8S34JK85", "Overall": "4.0", "Content": "Purchased this as a Christmas gift for my 17yo Stepdaughter & she absolutely loves it. She can take it with her & the amounts of apps & functions it has is insane!! Would definitely recommend if you're looking for Alot of product at a reasonable price!!", "Date": "January 23, 2014"}, {"Title": "bad product", "Author": "wilvis", "ReviewID": "R395ALUFWMXEXJ", "Overall": "1.0", "Content": "This product is damage with only two months of use, too bad. I installed 2 apps on there and the performance was slow. I lost my money and the warranty is one month", "Date": "January 9, 2014"}, {"Title": "Are you kidding me", "Author": "Shawna LaVine", "ReviewID": "RRJK0VKHU1HAF", "Overall": "1.0", "Content": "This thing worked for one day now it won't even turn on and I'm told I can not return it!!!!! My daughter is so upset, Christmas down the drain.", "Date": "January 3, 2014"}, {"Title": "less than 2 1/2 month life?", "Author": "Roger Jackson", "ReviewID": "R1946ZWKGGNCGB", "Overall": "1.0", "Content": "My son purchased this tablet with money he earned over the entire summer. After less than 2 months it started to have problems turning on but we were able to work through the glitch. He has only had it for 2 months and a couple weeks and it will no longer turn on. We found a video online where we could perform a hard reset (because apparently others have a problem with it too). We did the hard reset and it went through the process just as it did on the video, however, and unfortunately, for us it still would never make it through the opening screen. I'm not one to bail out my kids but I feel a little responsible for this because I helped him research and pick out this tablet so it looks like I'm on the hook to get him a new one. (Definitely not this model.) I knew it wasn't going to be a top of line tablet but for his budget and use it seemed perfect. However, I did not expect such a short and faulty life. I have also tried to find some kind of tech support assistance but have found none. Some have had luck with this tablet. Purchase at your own risk.", "Date": "October 9, 2013"}, {"Title": "good except screen breaks", "Author": "kim mitchell", "ReviewID": "R2I69GUUIORTSQ", "Overall": "2.0", "Content": "The screen breaks when you use it for just a short time other than that before screen broke it was a good tablet for the price especially for youg teens to play games", "Date": "October 6, 2013"}, {"Title": "It works ok,but product appeared to be used and not brand new.", "Author": "Lisa Beal", "ReviewID": "R3DS9F1LWPFGEL", "Overall": "3.0", "Content": "I purchased these in April to replace the Koby Kyros that my kids got for Christmas,because both units had quit charging. This is a decent tablet,my kids use them very frequently,and thus far have outlasted the Koby Kyros,which was JUNK. They are a little slow when running apps,my daugter plays littlest pet shop,my little pony,etc and they are useable,but slow to load. For an adult this would probably be horribly frustrating,but I think they are ok for younger children. However,on my sons tablet,there was a google play login stored to the tablet,and also a past used wifi name stored in the tablet. My understanding is that these were supposed to be brand new,meaning NEVER used. They came packaged as though they were new,but my sons clearly had been used before by somebody. So that's just an FYI for anybody thinking of purchasing,it may not be a brand new product.", "Date": "September 11, 2013"}, {"Title": "I like it a lot.", "Author": "Jessica Paaluhi", "ReviewID": "R2MAF4ZX0JEOIE", "Overall": "5.0", "Content": "I love it I get to do pretty much everything on it. I can play game on it and check my emails and shop online too.", "Date": "September 8, 2013"}, {"Title": "cheap", "Author": "Shalone Collins", "ReviewID": "R3BFLGVYJYLI1P", "Overall": "1.0", "Content": "This thing broke within the first week even with a protective case. my daughter is very disappointed and so am I because I had to buy a more expensive one", "Date": "September 6, 2013"}, {"Title": "grated screen", "Author": "merylin", "ReviewID": "RNTSB0CZ84J1N", "Overall": "2.0", "Content": "the prducto Alldaymall (TM) 7-inch Capacitive Touch Screen Android 4.0 Tablet PC with ... arrived at his destination with grated screen, I request a NEW product so I did not understand because I send with this defect, \"grated screen\" thanks", "Date": "September 5, 2013"}, {"Title": "Does NOT work!!!!!", "Author": "brenda espino", "ReviewID": "R154ODIK6I1BIX", "Overall": "1.0", "Content": "Where to start... After reading several reviews on this product we finally decided to order for my youngest sister. When it came in the charger was bent didn't fit properly at all. Then the thing came apart! Mind you this was minutes after taking it out of the package. Now it's been maybe two weeks after the purchase and it doesn't want to turn on it stays frozen on one thing and will not move any further. This has been a waste of money!!!! I'm very disappointed with this purchase. I honestly don't recommend it at all. For all this we should have just spent the little extra for a child's tablet.", "Date": "August 20, 2013"}, {"Title": "Waste of money...", "Author": "S. Higgins", "ReviewID": "RAPI3EY6WVE1D", "Overall": "1.0", "Content": "I bought two of these tablets for my kids. They were great for about three days then they both broke. Very disappointed kiddos and very annoyed mom out of the money. Will be saving up to buy better quality next time...", "Date": "August 16, 2013"}, {"Title": "Worked for 2 weeks!", "Author": "Amy Smallwood", "ReviewID": "R2SLTIMUTC93G5", "Overall": "1.0", "Content": "I bought this tablet for my daughter and it worked for 2 weeks and just stopped. Before it malfunctioned, it was great. WiFi connectivity was simple, Netflix ran great, Google Play store was great. Just shipped it back this morning. Unfortunate that they cannot exchange as I now have to wait for a refund and then reorder a tablet for my child. I will not be ordering another one of these.", "Date": "August 12, 2013"}, {"Title": "disappointed", "Author": "jasmine brazier", "ReviewID": "R2PGR6QIIWGSSP", "Overall": "1.0", "Content": "The tablet looked okay in the box but after I charged it and turned it on I realized that it was of very poor quality. Yes I know I only bought it for $60 but I was expecting better performance after all it comes with a 4.1 android O S . The battery life is like one hour at the most, the screen isn't very sensitive and it moves in choppy sort of way, plus it makes some sort of crackling back ground noise whenever you try to load a game. I bought it for my son to play games on but I am thinking of returning it. Think twice before you purchase.", "Date": "August 9, 2013"}, {"Title": "junk", "Author": "Arden McCartney", "ReviewID": "R2XLLV3QA3PXCT", "Overall": "2.0", "Content": "low quality poor performance cheap plastic surface that scratches easily do not waste your money wifi useless for any thing", "Date": "August 3, 2013"}, {"Title": "JFox", "Author": "JFox", "ReviewID": "R3PTHU6TNU7E5E", "Overall": "4.0", "Content": "This product more than met my expectations, which were low because of the price.  While I complain below, I am very very pleased with this tablet.Issue 1)This tablet does everything my Android phone with a quad core processor can do, it is just a little slower.  There is a lag when opening apps; I wouldn't have cared or probably wouldn't have noticed if I hadn't seen how fast my phone can open the same exact apps.Issue 2)The headphone jack is very simple.  It does not have a microphone in it like standard Iphones/Ipads or almost all Android cell phones.  That means you cannot use the Square card reader because it requires a headphone/mic input.  Square card readers will not work on this tablet.  The app works, just not the card reader.  Square wallet works fine too.Issue 3)Battery life keeps getting lost by the tablet looking for cell service!  Bizarre because this is a wifi only tablet.  Cell standby was using up to 70% of my battery.  You can save your battery by rooting the tablet and removing Phone and Telephony.apk.  This will void your warranty with Alldaymall.  Alldaymall should have fixed this before installing it on all their tablets (morons).Issues 4,5)Microphone and speakers could be better.", "Date": "July 26, 2013"}, {"Title": "Great value.", "Author": "David D. Dixon", "ReviewID": "R2RQ2048H0AP4O", "Overall": "4.0", "Content": "I wasn't expecting much here, given the price, but they've worked great.  We plug a corded USB laser barcode scanner into these, and use them with a web-based inventory management system.  They'd be too slow for my taste as a tablet for web browsing, videos, etc., but in this application they work fine.  Many tablets much more expensive don't have a USB host controller like this one.", "Date": "July 3, 2013"}, {"Title": "Excellent Product", "Author": "Kerry", "ReviewID": "R3FB4S68Y5GXGS", "Overall": "4.0", "Content": "I've wanted a tablet for a while. I was waiting for technology to improve and prices to drop. My son bought this item as a gift. I love this tablet. I had done research as I always do before purchasing electroincs. This tablet exceeded my expectations. I love everything about this item. The screen is just the right size, the wifi zooms, the apps works perfectly, music, camera, video-recorder and video player works great. Excellent tablet at a great price! If you are in the market for tablet especially if this is you're first time owning a tablet you can't go wrong. I highly recommend this product. Also Iwould suggest purchasing the tablet cover, it comes with a keyboard and proctects the tablet.", "Date": "June 29, 2013"}, {"Title": "Loving it.", "Author": "June B.", "ReviewID": "R3IJP5800L95GD", "Overall": "5.0", "Content": "This was my first entry into tablet computing.  I did  not have, or wish to spend, an exorbitant amount on the purchase.  After surfing the web for info and prices, I settled on this one.  My initial experience with it was great, but after about a week, the screen froze and I couldn't use it any longer.  I contacted the seller, \"Edge Cutter\", in an Email explaining the prob.  They requested that I return the tablet for replacement, or refund.  Also, after they received the return, I received a call from their staff offering a refund or replacement.  I opted for replacement which arrived 2 days later.  I am totally pleased with the replacement, it is even nicer than the original.  I use it constantly.  I have had no probs with the apps, downloading, and etc.  I am a newbie, but it does exactly what I wanted, which is to surf, use it for facebook, reading ebooks, and  playing games wherever I happen to be.  It is much nicer and easier than carrying around my netbook.  I am very, very pleased with its performance and have reccomended it to family and friends.", "Date": "June 20, 2013"}, {"Title": "great Tablet !", "Author": "Evelin", "ReviewID": "R153KN8TWURR07", "Overall": "5.0", "Content": "I love this tablet perfect to read books, emails, thuits , facebook . And many aplication. Thank you . My mom like one to", "Date": "June 20, 2013"}, {"Title": "Good Tablet", "Author": "Jean P.Baptiste", "ReviewID": "R4URM5FIGU8F9", "Overall": "5.0", "Content": "The product met my requirements ; I love it and I already recommended a friend who asked me to buy a 9 inch for him.", "Date": "May 29, 2013"}, {"Title": "Battery charge", "Author": "Yolanda", "ReviewID": "R38RLP969RS3WN", "Overall": "3.0", "Content": "I bought this and i like it but I found  a problem with the charge. I can't used for a lot of time because i have to recharged many times, and don't like the cable of the charger it's to short. So I can't use and charge at the time.", "Date": "May 22, 2013"}, {"Title": "works perfectly", "Author": "Mike", "ReviewID": "R12YGT1R1RTWMM", "Overall": "4.0", "Content": "When i first saw this my buddy had one and could not believe how well it worked.I have tried lots of other brands and this is the best one also like that you can connect more than one to get true surround sound i like it can use it at the pool and everyone asks what brand it is so they can get one", "Date": "May 21, 2013"}, {"Title": "tablet", "Author": "sbarry", "ReviewID": "RNWAQ0ZGUG780", "Overall": "3.0", "Content": "This is slow but it is fine for the few things that i need to do. The conection is slow.for a few things it is good but not a lot of space with not to much memory.", "Date": "May 11, 2013"}, {"Title": "Simply didn't work!", "Author": "Patricia Cox", "ReviewID": "R3SDJXNB308E7D", "Overall": "1.0", "Content": "The package came as expected, the wrapping seemed secure, but after charging the unit it was very difficult to get it turned on. Once I powered it down, because the battery charge only lasted 30 mins after the first use, I could not get it started again after a second recharge attempt. The light on the charger was lit, but the battery scroll that was described in the barely legible instruction manual did not occur at all. I noticed too that the charger did not seat well into the unit at all; perhaps this was part of the problem; I will never know for sure. Regardless of the cause, it did not work nor did it meet my expectations. I was very disappointed since I was looking forward to having my first tablet and using it on the go. Now I have to order another one but will most likely try another brand and will buy it locally as well so I don't have to go through all of this again.", "Date": "May 11, 2013"}, {"Title": "Works Great", "Author": "S. Moseley \"Summer\"", "ReviewID": "R2VIQE9I7YWBTZ", "Overall": "5.0", "Content": "I got this for my 6 year old son and he uses it almost every day. The screen is more responsive than the 2 other tablets our family owns. The colors are brighter and more apps work on this. Ive had no problem with angry birds, netflix, minecraft, etc. Now, if you are looking for something comparable to an IPAD, youre not gonna find it here but if youre looking for an inexpensive tablet for your kid to play games on, this will do the trick. :)", "Date": "May 9, 2013"}, {"Title": "worth the wait", "Author": "rlcookson", "ReviewID": "RWC785QVBWFK9", "Overall": "4.0", "Content": "Took a long time to get the and one of the chargers didn't work but the tablets themselves were great", "Date": "May 2, 2013"}, {"Title": "wasted money", "Author": "travis l hill", "ReviewID": "R3C67YJBE3S4MS", "Overall": "1.0", "Content": "It did not work proper it keep getting stuck on me. I feel like i wasted my money on buyinig it. Resetting it did not help it at all either.", "Date": "April 22, 2013"}, {"Title": "Be careful", "Author": "JOYCE MURFF", "ReviewID": "R1N0P766IXESTG", "Overall": "1.0", "Content": "I bought this tablet for my daughter, I received yesterday and has it packed for pick-up today. It appears to be used, it has bubbles around the screen and a long scratch on it.  I was expecting a new one.", "Date": "March 20, 2013"}, {"Title": "My ATM7029 Review", "Author": "Luci", "ReviewID": "R1MQGRQ6EFYBYE", "Overall": "4.0", "Content": "Overall we are very happy with this tablet purchase. Our first tablet was a KOBO VOX, 800 MHZ, 512RAM/8gig HDD. This tablet is very responsive with little lag. Game play is similar in speed to playing on our PC. Netflix plays smoothly. \"Touch\" on the screen is what I call normal, not too hard and not many accidental clicks. The only thing I miss on my VOX is the screen. With the VOX sitting in bed beside my partner I could easily see his screen as though I was sitting directly in front of it. With the ATM7029 looking at it from the same angle the screen is washed out grayish looking. So be prepared to get a case/stand for optimal viewing. There were very few 'stock' apps installed and I missed some from the VOX. Thankfully getting apps is easy and knowing what I liked on the VOX was a big help. So all in all we would purchase this tablet again it seems to be a decent mid range table.", "Date": "August 9, 2013"}, {"Title": "poor q", "Author": "Beckie McLarty", "ReviewID": "R18DL88GR1UD3F", "Overall": "1.0", "Content": "This was a disappointing gift for my grandson. I guess you get what you pay for. Was unusuable after afew weeks.", "Date": "August 6, 2013"}, {"Title": "Don't waste your money!!!!!", "Author": "Laura", "ReviewID": "R11PEIAJGX13F2", "Overall": "1.0", "Content": "Buyers beware delivered to me on April 8th not working right less than 3 months later! To top that Amazon says it's not elegible for return or replacement! So do not waste your money on a disposable tablet! It did work good for the first 3 months, but I expected a whole lot more time for what it cost!", "Date": "August 3, 2013"}, {"Title": "PERFECT for children", "Author": "Danielle C.", "ReviewID": "R3FNFXUKLDGKBW", "Overall": "5.0", "Content": "I have 3 sons. They are 11, 6, and 5. They all wanted tablets, and I was having a hard time deciding on something that I thought would hold up to these 3, be reasonably priced, and still do everything they wanted it too. They had been saving their own money for months waiting for me to find something. ( I don't think it's ever too early to teach kids the value of a dollar and they had to earn their own money) I looked for probably the better part of a month. My kids were all interested in different games. This tablet however had proved to be perfect for all 3 of my kids. They play all the games they want. The tablets came installed with fruit ninja and angry birds. I did purchase 3 cheap cases for the tablets as a little added security, but all in all they are perfect. They've been dropped, sat on, whatever else you think 3 boys can do to something, and they're still working perfectly. BEST tablet I could have purchased at a reasonable price for 3 children!!!", "Date": "July 1, 2013"}, {"Title": "Alldaymall  7\" Touch Screen Android 4.0 Tablet PC", "Author": "Nancy Marcantoni \"Liberty & Tirany\"", "ReviewID": "RT0F2U4OOTEOK", "Overall": "5.0", "Content": "This is my first tablet ever.  It is wonderful, log everything fast, I can watch what ever.  For the price is to good. It is very clear, sounds good, and I can play games.  I love it.  I recommended to my friends and people interested.  Thanks", "Date": "May 13, 2013"}, {"Title": "Works Perfectly!", "Author": "8684310", "ReviewID": "R1ECIFL68XTIDX", "Overall": "5.0", "Content": "Five stars! It works perfectly for what Intendly bought it for and then some. Would definitely recommend it and it's price was definitely in my budget range as a college student.", "Date": "April 24, 2013"}, {"Title": "GOOD VALUE FOR THE PRICE", "Author": "tami williams", "ReviewID": "RY2KSEMR5FP8T", "Overall": "4.0", "Content": "For the Price It DOES  everything I need it to do  I wish it had front and rear  FACING CAMERA . FOR UNDER $100 GOOD BUY.", "Date": "April 12, 2013"}, {"Title": "Not good", "Author": "Rebecca", "ReviewID": "R3KPAA77HMUJP2", "Overall": "1.0", "Content": "the product that I received got scratched easily and keeps freezing up. it keeps refusing to work right. I don't like what I paid for.", "Date": "July 15, 2013"}, {"Title": "Not Good", "Author": "Xochitl", "ReviewID": "R28MD8MPNUSJUA", "Overall": "1.0", "Content": "I bought the tablet knowing it was not top noch but I didn't think it was this bad! It arrived a couple days after I ordered it so I was happy about that. But after 3 days of using it the screen was all scratched (thanks to fruit ninja) I put it to charge and the charger was loose! Then on the 4th day after it had charged all night I go and turn it on and all I get is a white screen! I tried contacting the company so I can return it and neve got an answer on the phone and never got a reply to my email. Very unhappy about throwing $70 dollars away!", "Date": "June 26, 2013"}, {"Title": "Definitely not what I expected", "Author": "Kevin Rhodes", "ReviewID": "R17GK70KQQDBB2", "Overall": "1.0", "Content": "It just sucked.  The power cord did not fit. The USB connection was out of alignment and the battery drained quickly.  You get exactly what you pay for.", "Date": "June 25, 2013"}, {"Title": "Great Bargain", "Author": "Kera", "ReviewID": "R104P1FW4K5JWY", "Overall": "3.0", "Content": "Great little tablet, love it so far. Few knicks though.Some of the apps crash.The speaker is very hard to hear out of.The camera is low quality.Internet can be slow and click on other things than what you were directing too. (Definately recommend a capactice screen stylus.)But hey for $65 I can deal with those few mishaps! We all know $65 won't buy you a perfect tablet but it sure does buy you a nice one! Very pleased with my purchase. :)One last thing, shipping was horrible! Took 8 days to come in! And it shipped very close to the state I live in.-Update:Well, this tablet was working great for me but after having it a couple weeks found some more problems.I tried to video chat on both Oovoo & Skype and they were both horrible. The camera & speaker are just absolutely terrible! The pictures look very low resolution and the front view camera was the whole reason I decided to get this tablet. Very dissapointed.Tablet itself is nice but just completely bad battery life, and the charger that came with it will not charge it. Luckily, I had one to fit it from an old phone I had.I would recommend this to someone just looking for a tablet to play games, or maybe use internet but those looking for a tablet for webcam and picture taking, also to listen to music. I definately do not recommend this one!", "Date": "June 11, 2013"}, {"Title": "Exellent Product!", "Author": "Enrique Rojas", "ReviewID": "R27G0NDO6AIQ2K", "Overall": "5.0", "Content": "Good device on a low budget. I had my reservation about getting this device, but, I was surprise by all the features it provides. The battery holds for a few hours, but, its not a device that you are going to spend a lot of time in it. I will strongly recommend this device for a family that is looking for a device for a young one.", "Date": "June 7, 2013"}, {"Title": "Great starter tablet!", "Author": "Shareelew", "ReviewID": "R3ACFNSCL6KO7P", "Overall": "5.0", "Content": "I bought this for my computer-illiterate husband as a tool for him to check his own email.  It was so simple that I watched a YouTube video, set up his email and loaded a couple of apps, and then started training him.  Now he knows how to start it up all by himself, read his email, and delete what he doesn't need anymore.  Has a touch very similar to my iPad.  In fact, sometimes I prefer the smaller format and I have already borrowed it from him on occasion.Hubby will still need a few more lessons, but I am simply thrilled that he can check his own mail by himself!  And he is proud of himself too.  Great starter item and reasonably priced.", "Date": "June 1, 2013"}, {"Title": "This tablet did not work.", "Author": "Daphne Jinnette", "ReviewID": "R37UVAJLSSYOQF", "Overall": "1.0", "Content": "The tablet didn't work, wouldn't stay on.  I sent it back and bought one from Walmart for the same price which is working fine.", "Date": "May 20, 2013"}, {"Title": "No IMEI or UDID device in these tablets. Not happy!", "Author": "gr8fulmom", "ReviewID": "R3K7DJZG6AV7S5", "Overall": "1.0", "Content": "Still waiting for a reply from the manufacturer of this tablet. There's NO UDID or IMEI card in the device. So if u r a gamer and use Google play store its not a good device for you! W/O these installed in the tablet when you download an app you get someone else game in progress. I.e team lava games can't install any of them. Just tried plants vs zombies and having issues with that one too and I paid for that game. When the COMPANY responds I will update my comment. But for now its a No in my book.", "Date": "May 18, 2013"}, {"Title": "perfect", "Author": "Sharon", "ReviewID": "RSKQEET7W9VBF", "Overall": "5.0", "Content": "just the way I wanted it to come, nice in size and perfect for the price..thanks and I will always get from Amazon. just because of the items come as advertised", "Date": "April 11, 2013"}, {"Title": "Horrible!", "Author": "Sharon Johnston", "ReviewID": "RS2RTDP5XT7X7", "Overall": "1.0", "Content": "Ordered new tablet, and received tablet that had screen damaged, previous downloads on it, and a user account already set up by previous owner...tablet was in horrible condition!", "Date": "June 9, 2014"}, {"Title": "I received the tablet quicker than I expected, which was a good thing.", "Author": "Brown Eyes", "ReviewID": "R2IHBEJ10B6FWT", "Overall": "3.0", "Content": "The tablet was a Christmas gift for my nine year old grandson. He loves it, he hasn't had any problems with it, that I have heardof.", "Date": "January 6, 2014"}, {"Title": "Unreliable", "Author": "Charles A. Corley", "ReviewID": "R3951WA1A7MOQ6", "Overall": "1.0", "Content": "This tablet was difficult to manage while using and quickly became dysfunctional.  Amazon was wonderful on return and offered me the same replacement model at a much discounted price.  However, I was unhappy enough with this model to not take the deal.", "Date": "January 5, 2014"}, {"Title": "Great work", "Author": "howcori", "ReviewID": "R2EGKZNGHG7NHF", "Overall": "5.0", "Content": "The only downside to this tablet would be off center forward & rear facing cameras, but it is easy to get used to it. For the price, there is no better option with the 1 year service plan. Don't let the product name fool you. This tablet is as slick as any of the well known brands.", "Date": "January 3, 2014"}, {"Title": "Save your money", "Author": "Tara", "ReviewID": "R2TI8ZU9LZI37E", "Overall": "1.0", "Content": "I bought this only a couple of months ago, and it will no longer hold a charge. When I first purchased it was very slow, but still worked. Now it is unbearably slow, and you have to hold the plug in to get any charge on it... Don't waist your money on this junk.!.", "Date": "December 31, 2013"}, {"Title": "tablet", "Author": "susanreg", "ReviewID": "R1435J4E3OTZTX", "Overall": "5.0", "Content": "my grandson just loves it I got it for him for xmas and he hasn't put it down as long as he awake and falls with it he loves it that much and his dad loaded a lot of games for him to play", "Date": "December 30, 2013"}, {"Title": "there product is what it is", "Author": "Mr.notypo", "ReviewID": "R2KASMNBUZA7ZN", "Overall": "5.0", "Content": "this product is slow but you get what you pay for as they say but all in all it was useful", "Date": "December 26, 2013"}, {"Title": "good low range tablet. cheap plastic, cheap wifi though", "Author": "caleb mc", "ReviewID": "R1YCGQ4U1G1OT2", "Overall": "4.0", "Content": "Easy on the wallet, but not an high quality tablet..WiFi has an issue from time to time.. know what your buying.  Do the research, it's always a good idea. And play with the features to see if they work properly", "Date": "December 26, 2013"}, {"Title": "Product sucks... broke after a week...", "Author": "MICHAEL F LUTZ", "ReviewID": "R3VCZD7IIH83FQ", "Overall": "1.0", "Content": "Didn't bother the seller because it was so cheaply made that I just chalked it up to a bad purchase.  When you get something this cheap and it looks too good to be true then it probably is.  My mistake, will never buy electronics at a discount again.", "Date": "December 18, 2013"}, {"Title": "OK, but be careful with it", "Author": "jeff in beaverton", "ReviewID": "R1I1S303UI64Y4", "Overall": "3.0", "Content": "Weakest point is probably the power connector - really bad design. Easily bent/broken. But tablet operation has been OK so far, running all Android games fairly well, with only an occasional system restart (power and volume buttons press) required. Reasonable for the price, but glad I got the protection plan!", "Date": "December 16, 2013"}, {"Title": "poor", "Author": "cowgirlup \"cowgirl\"", "ReviewID": "R2R8MTBK486JKA", "Overall": "2.0", "Content": "bought 2 and one only lasted about 30 days and the other one locks up a lot. probably going to send it back also,", "Date": "December 15, 2013"}, {"Title": "works well but needs frequent recharging", "Author": "Srul", "ReviewID": "R8DD0EOWL7SZX", "Overall": "4.0", "Content": "works well but battery life is low, have to keep recharging when on wi-fi or games with graphics and sound. Otherwise it's a good machine comparable to the name brands.", "Date": "November 26, 2013"}, {"Title": "Maybe good for a child to play with, but not much more than that", "Author": "IronChefMIk", "ReviewID": "R30C3SOGG61J3C", "Overall": "2.0", "Content": "This thing is barely a toy. For $60 I was not expecting too much, I mostly wanted to see how much I would bother with using a tablet to see if I wanted to buy a more expensive tablet. The front facing camera on this does not work and there is not camera on the back. The tablet is extremly slow and only has a 2 gig hd meaning that you have a limited number of apps you can install. Fortunately it comes with a slot for a micro sd card. The charger it comes with is an odd adapter, fortunately you can also charge it with a micro usb charger if you have one. Because the device runs so slow you wont be doing much typing on it. I mostly use this as a Plex media remote. If you are just tying to do some simple webbrowsing or even netflex viewing this will work, but don't expect to use this to take notes for school or anything like that.If you do have a kid though this is probably what I would give them to play with.", "Date": "November 25, 2013"}, {"Title": "I liked the very good quality product", "Author": "jorge martinez", "ReviewID": "R2523NO8BD6QJG", "Overall": "4.0", "Content": "I liked the very good quality productI recommend buying that . very good good quality. I wanted. thank you thank you very much", "Date": "November 22, 2013"}, {"Title": "AWESOME!!!!!!!!!!!", "Author": "Brent", "ReviewID": "R1YYX50MFK8JO7", "Overall": "4.0", "Content": "Great deal for the money and I got exactly what I wanted ! Need a cheap tablet this is it yo!!!!!!!!", "Date": "November 19, 2013"}, {"Title": "Pretty good for the price", "Author": "Seanny boy", "ReviewID": "R1CIZAFANIS5WO", "Overall": "4.0", "Content": "This is my first touch screen so without anything to compare it to, it does enough for me to justify having purchased it.", "Date": "November 17, 2013"}, {"Title": "JUNK", "Author": "Desiree Quirk", "ReviewID": "R38BWC8HH5HTU7", "Overall": "1.0", "Content": "I bought two of these for my younger daughters. The first issue I had was they did not keep there charge well. They used them for a couple of weeks and then one of them the charger would no longer fit in the tablet. I tried using the other charger and reallized it was the tablet itself. Then a week later almost the same happened to the other tablet, it would not charge correctly unless you wiggled the charger around! And soon after that also did not work.  Both my girls are waiting for me to have them fixed but it not worth my time or money to spend on these pieces of crap!! True that you get what you pay for!!!! I highly recommend that you spend alittle more money and get something that is better quality.B00AXWLFO0", "Date": "November 11, 2013"}, {"Title": "cool", "Author": "collin", "ReviewID": "R1IJ9W0A775X5Q", "Overall": "4.0", "Content": "the price was what attracted me to this and i think its worth it, cant do heavy work with it though but that alright, basically bought for gaming and if it brakes it it wouldn't be a bie invesment lost", "Date": "November 8, 2013"}, {"Title": "Device is NOT useful to my work as it does not connect to We-Fi", "Author": "Vicki", "ReviewID": "R1KGOVNO2HTRWI", "Overall": "2.0", "Content": "The tablet has  a number of things I like about it but there are some IMOPORTANT things that I am very distressed about!! Like I am unable to connect to internet so all of the taks I need to do requiring internet capability I am unable to do. I have Wi/-Fi in my home. It SHOWS me being connected. And yet it consistently says \"webpage not available\" no matter how many times or how many different sites I type in!!!  I have even had my 11 yr old IPod/DS whiz grandson try and help me as he has on my OTHER devices and he can't get it working either!!!", "Date": "November 6, 2013"}, {"Title": "better then expected", "Author": "Amazon Customer", "ReviewID": "R3FJ6PUU3GG589", "Overall": "5.0", "Content": "This is the second tablet that I have ordered. The last one was from China and I have to say I hated it. I returned it a week later. This one is great. It surpasses what I was expecting for the cost. I could NOT be happier. If you are looking for a tablet, this is the one you want.", "Date": "November 3, 2013"}, {"Title": "It's worth the price", "Author": "Omar Mohammed", "ReviewID": "R251HHA0BESUFP", "Overall": "2.0", "Content": "For the price I didn't expect much and I got exactly what I expected.It did teach me to save and buy the better stuff", "Date": "October 27, 2013"}, {"Title": "Not so bad", "Author": "Lisa Hoshaw", "ReviewID": "RNV050B0AZ0J1", "Overall": "3.0", "Content": "Just received the tablet.  Seems to work fine.  The screen has terrible off-axis viewing.  Just a little to the side and you cant see anything.  The screen is a bit less responsive than I would like.  These are first impressions.", "Date": "October 24, 2013"}, {"Title": "Horrible battery life", "Author": "Oliver", "ReviewID": "R19F00261M46C0", "Overall": "1.0", "Content": "Slow tablet but for the price it is about what I expect.  My real complaint is that the tablet dies after only a couple hours of use.  The batteries will die when it is on stand-by for a day or so.  The batteries will die after about two hours of use.", "Date": "October 24, 2013"}, {"Title": "Good Product", "Author": "Funky Funny", "ReviewID": "R1KYNK4NBAF4O7", "Overall": "5.0", "Content": "It was cool but my 4 years son broke the glass after a week. I'm planning to buy another one soon", "Date": "October 24, 2013"}, {"Title": "You get what you pay for.", "Author": "Robert L. Lee", "ReviewID": "RB81JMFGUPK5Q", "Overall": "1.0", "Content": "The old adage, you get what you pay for, well that's true here.  The tablet arrived completely dead. I had to wait several hours for it to charge. I setup my email and got everything working, in about 2 hours the battery died. I charged it for 2 days and when I turned it on it booted up with a fault and when it reset itself it came up asking for a password. I was never able to get back into the tablet. It is now on its way back to the seller.I would not recommened you waste your time or money on cheep tablets. Spend a few more bucks and get you a good one.PS : The seller was very understanding and worked with me on the return transaction.  Only problem I now have to wait 30 to 40 days for my refund. Who ever heard of such a thing!", "Date": "October 20, 2013"}, {"Title": "Wow!", "Author": "Amazon Customer", "ReviewID": "R23R54E4DEBK81", "Overall": "4.0", "Content": "What an awesome little gizmo. Amazing buy for the price. Shipped super fast straight from China. My son is in love after his older Kindle Fire broke. This thing does all that could do and in HD. Great buy, I want one next.", "Date": "October 11, 2013"}, {"Title": "No battery Life", "Author": "grea", "ReviewID": "R39W9QRYS7Z7W3", "Overall": "3.0", "Content": "Easy to set up if only it had some battery life; still waiting now to even get 100% charged and that was 2 days ago. Price point cheap but sometime you pay for battery life I will have to buy a strong tablet to see better results", "Date": "October 11, 2013"}, {"Title": "Meh", "Author": "downsouthgagirl", "ReviewID": "R14XUXX2GBXSV8", "Overall": "3.0", "Content": "Screen broke after one slight fall, onto the carpet. =/ It was sent back and refunded, as I decided maybe my 6 year old wasn't ready for a tablet quite yet.", "Date": "October 10, 2013"}, {"Title": "Nice Table", "Author": "ALBERT V.", "ReviewID": "R138PKOYW33CM8", "Overall": "5.0", "Content": "Wow,  very nice and helpful tablet. my grandson loves it. easy to set up and quick start. camera works great for both videos and pictures", "Date": "August 29, 2013"}, {"Title": "i like it", "Author": "rexrex", "ReviewID": "R1EDX6DLQGXW2", "Overall": "4.0", "Content": "Good no problems at all i wish it had gps and other thing like better camera video volume button hdmi output", "Date": "August 23, 2013"}, {"Title": "Good value for money", "Author": "Jama Basinger", "ReviewID": "R1ESRRODR33I2D", "Overall": "4.0", "Content": "Pros -- Easy to use and good value.  Nice picture qualityCons -- Battery doesn't seem to last long.  I bought the USB keyboard/case so it's easy to type.  Power cord seems a little \"junky\"", "Date": "August 23, 2013"}, {"Title": "Kinda pokey, but a good value", "Author": "dhrachth", "ReviewID": "R19A8VM54C54H9", "Overall": "4.0", "Content": "The viewing angle on the screen is kinda narrow.  The battery life isn't great.  It runs a bit slow.However, it does work.  I can check my email, watch a youtube vid, and play a few rounds of Angry Birds.  It is small and light enough to easily fit in my purse or carry on.  At the price I paid if gets kicked or crunched when shoved under a seat or into a over head compartment, no big deal.I purchased this specifically to travel with and for that purpose it is great.  For a tablet for everyday use I would recommend paying extra for a little better model--but for the price this one works surprisingly well.  One thing I will say in this tablet's favor is that it didn't come with a lot of pre-installed bloatware.  My pricier tablet came loaded with a lot of apps I don't want and won't use.", "Date": "July 23, 2013"}, {"Title": "This is a steal and a great Android", "Author": "Bookie \"Bookie\"", "ReviewID": "R13PACWP09F3N4", "Overall": "5.0", "Content": "I absolutely love this tablet.I read books and read and send emails. for the price you cannot beat it.And it works great. Easy for a beginner.I went back and bought another for a gift for a friend and they loved it also.", "Date": "July 23, 2013"}, {"Title": "better instructions", "Author": "peter greenwood", "ReviewID": "R1C6VYLFNSQ8WV", "Overall": "3.0", "Content": "its reasonable,.instructions hard to understand, screen not good when working outside otherwise fairly satisfactory but would not buy again for anyone", "Date": "July 22, 2013"}, {"Title": "Screen Very Fragile", "Author": "cm", "ReviewID": "R1NJCW3Q3MRDB", "Overall": "3.0", "Content": "Just be careful and not for kids under 15..wait til they are responsible enough to use this product lol lol", "Date": "July 21, 2013"}, {"Title": "Support 3G Dongle?", "Author": "LRBB from CRC", "ReviewID": "R3NWUKM9M8G9RY", "Overall": "2.0", "Content": "I'm very disspointed since it doesn't support #G dongle as described. And the battery life is simple the worst I ever had in and electronic device.", "Date": "July 17, 2013"}, {"Title": "Low price negated by having to buy extra stuff to make it work", "Author": "Sylvia Hutson", "ReviewID": "R14ZFC51P7MT76", "Overall": "2.0", "Content": "This tablet would not charge with the cord that came with it, so I have had to spend $25 on different charging accessories... It also will not recognize the \"Square\" card reader, which it the main purpose that I bought the thing for... I spent more money buying an extension for the headphone plug in hopes that it was just the connection with that particular \"square\", but it did not work... The square works on other android units, but not mine...  It does allow me to use some android apps that I need right now, so that is the only reason I have not returned it...", "Date": "July 17, 2013"}, {"Title": "Price/Function, I like it.", "Author": "Gary Gone", "ReviewID": "RX1392P0ZUROB", "Overall": "4.0", "Content": "With the reasonable price,  the Tablet is suitable for travelling...  but battery last only 2 hours...may need to have power-bank on the road.  I like it.", "Date": "June 19, 2013"}, {"Title": "Oh my gosh", "Author": "brianna filips", "ReviewID": "R1X4Y6CP5VP29F", "Overall": "2.0", "Content": "well, i bought this for my brother's birthday, which was yesterday. i was waiting to review this item until he had it in his hands. he opened it and saw it needed charged. no big deal. we put it on the charger and it took ALL DAY to charge. not only that,  but he said it was slower than ever. i was hoping i could review high on this but i don't believe the product deserves it.", "Date": "June 16, 2013"}, {"Title": "You're throwing your money away.", "Author": "Sarah Bellotti", "ReviewID": "RBW15D1CITFOT", "Overall": "2.0", "Content": "It's really slow to respond and the photo quality is horrible. It's slow, disconnects itself from the internet randomly, and the mini USB port or whatever fell off the motherboard so I can't plug it into my computer anymore. I took it to a computer repair shop and they said to repair it would cost more than the whole thing is worth. I got it a month ago and have only used it a handful of times - sad.", "Date": "June 14, 2013"}, {"Title": "Excellent", "Author": "Bonnie Bolen", "ReviewID": "R1A90M89FAV14W", "Overall": "5.0", "Content": "This is a great value. I handed it to our 14 year old granddaughter and she loved it! Thank you", "Date": "June 12, 2013"}, {"Title": "daughter loves it", "Author": "daniel spina", "ReviewID": "RYH90DHKFP2YU", "Overall": "5.0", "Content": "I bought this and my daughter loves it she uses all the time and has not had any problems ever", "Date": "April 8, 2013"}, {"Title": "If your poor and this is all you can afford - maybe then....", "Author": "Adam", "ReviewID": "R96ICJ03MONL3", "Overall": "1.0", "Content": "To preface my opinion -- I bought this for strictly development Android work, and it is only $68...BUT, if you are expecting a decent tablet to use in your everyday life, I would say stay away!  Windows 8 didn't even recognize this device and I had to download some unsigned drivers to even get the my development machine to \"talk\" with it...As you can tell, I  do software development for a living and have worked with MANY mobile devices on all 3 platforms (Apple, Microsoft and Android), and this one is pretty bad.  The screen colors are very dim (relative to an iPhone), the battery life is about an hour if you are doing anything intensive, and if you where to drop it, it would probably break into a 1,000 pieces.  Lastly, the web surfing is very slow.It did run the games my kids wanted to try, like Fruit Ninja, but again, you could tell the processor was struggling.All in all, you get what you pay for... This works for what I need in the short term, which is just a device to test out my prototypes...Again, it is only $68, so I wasn't expected too much, but I was still surprised with what I got (in a bad way)... If I was going to use this everyday I would send this back and would spend the extra $$$ to get a decent performing tablet.  Though, in my world of development, we try to work with the minimum possible to try and cover all basis, so it works for me...To wrap up, if you want something you will be using everyday, don't get this tablet and spend the extra money to get something decent and from a known manufacturer...Just my opinion...", "Date": "March 22, 2013"}, {"Title": "Great Android tablet for most uses", "Author": "Fiona", "ReviewID": "R1C7844S9L9EGZ", "Overall": "4.0", "Content": "I got this for my 8 yr old daughter so she could watch youtube and play without taking the computer.  So far, it has been great - it took a little while to get it set up with the apps she wanted, but now she is so happy with it.  Obviously it is not as fast as my kindle fire, but it is a great option for what she wants.  It came quickly and already had the google play store installed and I was also able to put on the amazon app store, so she can get access to just about any app she wants.  The battery life is not too good, but again for the price it was a great deal.  If you are getting it, just remember to be patient with setup, she tried to install 6 apps all at once and it was too much for this tablet to handle, but when I went back and did one at a time for her, it went very smoothly.A bonus, it fits the older generic case I had bought for my kindle fire, so until we get out for her to choose her own case, it is protected, which is better for my peace of mind.", "Date": "March 11, 2013"}, {"Title": "So far, so good.", "Author": "perlywhitz911", "ReviewID": "RHDXNVW8A4AFP", "Overall": "4.0", "Content": "I have only had this for a few days, but so far am very happy.  I did have to have my teen download the apps I wanted, and set it up for me.  So far, tho, it seems to be working very well.  I don't notice any lag or slow down from my desktop computer.  Definitely a happy customer!", "Date": "March 27, 2013"}, {"Title": "great tab", "Author": "Auden Henry", "ReviewID": "R3P4AWBTJAMRIL", "Overall": "4.0", "Content": "Nice tablet, however the camera is a bit glossy I was very disappointed.maybe thst id ehy it was do cheap other than the camera it eotkd grest do far", "Date": "May 8, 2014"}, {"Title": "Not a good tablet", "Author": "Big Daddy Cool \"Gadget Junkie\"", "ReviewID": "R2P4035K1MUFI3", "Overall": "1.0", "Content": "First it arrived broken - dead zone on lower 3rd of screen if held in portrait mode.Second the screen looked silver'ish... you know the effect a cheap cell phone screen looks like when you are not looking at it straight on? Like thatI installed 2 apps on there and the performance was ... slowI reset back to factory defaults and returned itBe careful on this one", "Date": "January 3, 2014"}, {"Title": "Great tablet", "Author": "Amazon Customer", "ReviewID": "R2QKO5470O6FYN", "Overall": "5.0", "Content": "I've had my tablet a couple months or so.  It's working great.  Have put many applications on it.  Nice for traveling.  No problems with it.", "Date": "October 14, 2013"}, {"Title": "problem", "Author": "sdcalicutie", "ReviewID": "R3T5516UWRHH3T", "Overall": "1.0", "Content": "it stopped working my son had had it for 2 months  he's 8  years old  it ain't even cut on", "Date": "October 4, 2013"}, {"Title": "Insurance", "Author": "Marlene dill", "ReviewID": "R3CQWPM7JQ2K3E", "Overall": "5.0", "Content": "Still waiting on my insurance that I purchased after buying the product will someone look into it for me thank you", "Date": "September 20, 2013"}, {"Title": "This one is okay for the price", "Author": "Steve Whitman", "ReviewID": "R16UB3652I9T8U", "Overall": "3.0", "Content": "for $60, it performs better than expected.  It works for the purpose of my 2 year old kid playing educational games.  I would not want to use as a web surfing tool, or even to read the news as the performance is a bit slow.  Visability is acceptable but not the best. But agian accetable, keep in mind this is a $60 tablet.", "Date": "September 11, 2013"}, {"Title": "no documentation in box or on internet", "Author": "John L. Benson", "ReviewID": "RXMOGO8IY0DLM", "Overall": "2.0", "Content": "The positive:  It looks OK, not cheaply made, has a nice screen.  Relatively easy to connect to my home network.  decent sizeThe negative:  Very non-intuitive to use.  Non-existent user manual.  Camera only takes a picture of user (major negative for me)  Very \"cumbersome\" file system...took me a long time to figure out how to delete unwanted files (pictures of myself.)  AC adapter connection to the device is very \"delicate\"...does not go fully into the receptacle...I think it would be easy to break it off.", "Date": "June 26, 2013"}, {"Title": "WiFi worked for 2 days.", "Author": "gilbert g rubio", "ReviewID": "R2PJROJFZNAYTU", "Overall": "1.0", "Content": "I was very happy with this tablet for a whole 2 days. Then the WiFi stopped working, which means no more downloading apps, no more updating apps, no internet browsing, nothing. Now I need to send it back out of pocket, and try again. I bought this tablet for my little girl, and she was happy with it, til it broke. Now she has to wait another week or so til I can replace it for her. I bought her a generic tablet three years ago, and it was time for her to get a new one, she was very much looking forward to this tablet. Avoid this tablet all cost, it's not worth half of what it was sold for.", "Date": "May 20, 2013"}, {"Title": "Disappointed", "Author": "Carlos", "ReviewID": "R1YWNOIM0E6W4A", "Overall": "1.0", "Content": "I am very disappointed with this tablet, the battery lasts about 30 minutes, plus heated, I'm really not satisfied with the product", "Date": "May 13, 2013"}, {"Title": "A promised update!", "Author": "E. Lindgren", "ReviewID": "R2G3JPW7NMFN37", "Overall": "5.0", "Content": "I purchased this tablet in April, 2013.  I promised an update review:  Due to my busy schedule in April and May, I didn't get to use this tablet much.  About 10 days ago (June 10th) I freed up some time to spend with it, and I would say \"save your money\" and by a Kindle, a Samsung, an Acer, an HP, or any brand name that is credible.  This tablet is basically useless.  It does not hold a battery charge, it drops Wifi, it has no sound whatsoever.  From the reviews I've read, it appears that many folks who purchased this tablet had issues with it.", "Date": "April 24, 2013"}, {"Title": "Solid product & Good price point - FOR KIDS", "Author": "Laurence J CACHO", "ReviewID": "R3ICSTYJFN9ZWY", "Overall": "4.0", "Content": "Purchased for my kids, the tablet performed as required.  The tablet arrived in quick order, and my kids havent experienced any out of the usual issues with the product.  Once or twice the tablet froze, and had to be rebooted.  But this is to be expected, not to mention it is being tested by children.  Would definitely suggest.One thing that is noteworthy, I have had difficulty finding a suitable cover for the tablet which may suggest that it is not a \"standard\" size - length and width.", "Date": "April 21, 2013"}, {"Title": "Really Nice", "Author": "Manuel Dominguez Gurrola", "ReviewID": "R2D8WBL82HKY8F", "Overall": "5.0", "Content": "Perfect for kids and basic tasks, we use it to play, read books, web surfing, watch videos, and it works like a charm, even battery life its very good, can last up to 5 hours !", "Date": "April 18, 2013"}, {"Title": "it's pretty kool and i like it", "Author": "monique rolle", "ReviewID": "R293K2C7IUYY0Y", "Overall": "4.0", "Content": "i'm trying it for the first time, i choose this reating cause it is a great product and i will recommented this to a friend", "Date": "April 12, 2013"}, {"Title": "For a Kid...", "Author": "C. Cornett", "ReviewID": "R3VWNDFYZJW7L", "Overall": "1.0", "Content": "Bought this item for my son, who, at the time, was 3-4 years old... For a while it was a good product... A while being a month or two. One day, it was lying in a chair on charge, and my mom picked it up to look at it and dropped it... Mind you, she dropped it on padded carpet... when she picked it up, everything on the screen was like a mirror image... We called the company, contacted the seller, did some online research, all to try and figure out what caused the screen to \"flip\" and had no luck what so ever. Soo.... Unless you collect junk, don't waste your time or your money on this one....", "Date": "June 4, 2014"}, {"Title": "Is there a warranty for this item", "Author": "Corey Lavender", "ReviewID": "R28Q01BXTNPJEJ", "Overall": "1.0", "Content": "Power button is stuck into tablet and screen freezes a lot been happening since first week of having it. Is there a warranty for this item", "Date": "April 10, 2014"}, {"Title": "Great product for basic users", "Author": "Shawn D.Taylor", "ReviewID": "R3UBIQUIIUKVRQ", "Overall": "5.0", "Content": "I know this is just a cheapo tablet, but I have been very impressed.  I haven't had one problem with it.  It is just as described, plays movies well, game works great, and looks nice.  The only down side is the Wi-Fi seems to be a bit weak maybe...but overall, is a great tablet for basic users.", "Date": "November 8, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00H7VU2C6"}}