{"Reviews": [{"Title": "The Best", "Author": "The Handsome Hammer", "ReviewID": "RVLYP7ASCJG12", "Overall": "5.0", "Content": "My wife and I are new to tablets but we always have the latest smart phones. She has the iPhone 5s and I've got the Galaxy Note 3. I bought her the iPad Mini Retina and the Galaxy Tab Pro 8.4 for myself. I only mention this because if you are like me, you are considering the Pro 8.4 and are comparing it vs the iPad Mini Retina.After using both,  I have to say this tablet is amazing. I am a lot more techy than my wife,  and you can tell this thing is built for speed. The multitasking and shortcut features feel natural and there is Zero screen lag after the initial setup. The ipad mini feels a bit more aesthetically polished in it's physical design,  but severely limited in customization for my tastes once you start playing with it. I am also not fond of the 4:3 aspect ratio Apple uses,  especially apparent when watching videos or looking at pics in landscape mode.  The tab pro 8.4 is a beast with an even shaper display,  and movies fill nearly the entirety of it's perfect screen. Also Swiftkey is a major plus for me.  The Samsung keyboard is far superior to apple's, and even offers shift and ctrl keys that function like a pc keyboard where you can hold down shift and hit other keys if you wish.Everything else I can tell you about specs is already written somewhere else.  If you are an android lover,  this is absolutely the best tab out there and is due to be a flagship device for Samsung,  much like the Note 3 is now. Buy it and you will have no regrets.", "Date": "March 2, 2014"}, {"Title": "Beauty of a Resolution - Stunning!", "Author": "rpv", "ReviewID": "R3CZE3U482FGMD", "Overall": "5.0", "Content": "Got this on first day of release from a big box store few days ago. What a stunner resolution! You will be surely blown away.  This has to be the best tablet of 2014 with Android 4.4 and a gorgeous resolution. Before I dive into the details, let me compare the PRO lines from Samsung. I will compare first the TabPROs briefly. I  give a crisp overview of the popular Tablets in market at the end.  I feel this will give a good perspective and enhance your buying decision.  If you have any questions, do ask in the forum and I will respond within a day.The single most fascinating part of the TabPRO lines is the resolution. Astounding 2560 x 1600 on all lines which means on 8.4\" has the maximum ppi and excellent look. In comparison last year's Tabs have much lower resolution. Just go to your local electronics physical store and play with it. The biggest downside of this tablet is the price. It should be $100 cheaper, but you pay the premium for the Samsung brand as well as their experience in this industry. It is like Apple on the iOS world.key_specs: { model: resolution, ppi, CPU, RAM, Flash memory, SD_card, camera spec, weight, OS_type, size, charging/sync port type, GPS:y/n }Samsung Galaxy TabPRO 8.4-Inch {B,W},  WQXGA 2560 x 1600, 359 ppi, 2.3 GHz Qualcomm Snapdragon 800 quad-core processor, 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB,  8MP Rear + 2MP Front, 331 gm, Android 4.4 Kit Kat OS, 8.62 x 5.06 x 0.28 in, microUSB, GPS yes.  4800 mAh battery (BEST RESOLUTION and ppi on a tablet!)Samsung Galaxy TabPRO 10.1 {B, W}, WQXGA  2560x1600, 298 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB,  8MP Rear + 2MP Front, 469 gm, Android 4.4 KitKat, 9.57 x 6.75 x 0.29 in, microUSB, GPS: y, 8,200mAh batterySamsung Galaxy TabPRO 12.2 {B, W}, not in USA Now,  WQXGA  2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32GB/64GB Flash, microSD upto 64 GB, 8MP Rear + 2MP Front, 732 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.31 in, microUSB, GPS: y, 9500mAh batterySamsung Galaxy NotePRO 12.2 {B, W},  WQXGA  2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32/64 GB Flash, microSD card slot up to 64GB, 8MP Rear + 2MP Front, 748 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.33 in, microUSB 3.0 port with backwards compatibility with microUSB 2.0, GPS - y, 9500mAh battery, S-Pen,  NFC, Ethernet connectivity via adapter.A broad range of popular tablets as of now are Kindle Fire HDX 8.9\", Samsung Galaxy Note 10.1\"2014 edition, iPAD Air 9.7\", Samsung Galaxy Tab 3 10.1\", Google Nexus 10\" and Samsung Galaxy Tab 3 8\". If you are planning to buy TabPRO, do look at the comparison of 3 top features you need. This will enhance your buying decision. I have included specs of these at the end if you are interested in comparing your needs.RESOLUTION:Samsung Galaxy TabPRO 8.4-Inch  is in my opinion best tablet out in the market now for the size, resolution and weight. I was a big fan of Galaxy Tab 8\" and still have one. But the 8.4 beat it in the best resolution. weight is same as an iPAD Mini.  Tabpro 8.4\" is a beauty! The resolution of WQXGA 2560 x 1600, 359 ppi is mind boggling on a tablet. The videos were very crisp and text so sharp. The new Magazine UX interface makes the screen really pop. I am able to read ebooks through Aldiko. I have so many epubs that I just imported all into a great library. Magazine interface seems completely stripped out of Flipboard. How similar they look?! You can add newer categories by squeezing the UI and adding categories.PROCESSING POWER:2.3 GHz Qualcomm Snapdragon 800 quad-core processor, 2 GB RAM, Powerful for what it does. I have played games/watched youtube videos and have seen no lag or any latencies.PRO MEANS?I really doubt if this tablet will be used by Pros. The tablet market is more centric to consumers or prosumers. This size is ideal for a home user with its resolution, size and weight. The TabPro series has free subscriptions to popular services such as Hulu Plus, Dropbox, Bloomberg Businessweek+, and Cisco WebEx Premium for varying times. It also has Hancom office suite is  an office suite developer in Korea. Hancom Office consists of Hanword, Hancell (Spreadsheet), and Hanshow (Presentation program). Since there is Google office, I don't know if this will be any sell in the US and other countries.  Remote desktoping to my Windows 7 desktop was a breeze.STORAGE:This model is for 16 GB tablets. Samsung does make 32 GB internationally, and will most likely appear in Amazon later.  Having the expandable memory to 64 GB is awesome feature. Most phones/tablets are ignoring it these days. Well, putting bunch of video/audio/books on the SD card which is so cheap these days, the tablet suddenly has more memory with no lag observed.  With prices plummeting for 64 GB cards, it is a great boon. Put all your music, books, photos on the SD card and you have a powerful computer in hand always! I personally use the 64 GB microSD card on my mobile devices. Get this mobileUltra (SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging.CAMERA:Having a tablet is a plus on smaller tablets, though I hate the feature on 10 or 12\" tablets. The resolution is 8MP Rear + 2MP Front. Video is 1080 p 60 fps. Nowadays there is nothing much to say of cameras, they just work for the required purpose.ERGONOMICS:Of all the tablets I have experienced, 8\" is the perfect size for me. This tablet at 8.4 is a little bigger which is good, and is perfect for me. I cannot keep praising the form factor. Frankly I like the default portrait orientation with capacitive buttons. At 331 gm, this is super!. The size also is ideal for single hand holding as well as reading books. (8.62 x 5.06 x 0.28 in). The battery is 4800 mAh battery and it came for easily couple of days for me at nominal usage. The best part I liked is the beautiful resolution and is the best resolution on a tablet! HD videos are crisp. I don't use a built in cover. I put it in a pouch and use the tablet naked for the best experience and for what it is designed for. The plether skin is good contrary to what many people say. The faux leather with stitched side look is not too cold. If you take a cold electronic device with metal back it is very cold. Once it heats up, it is too warm. This plastic leather look removes those issues.A comment pointed out that the ergonomics is not suitable for viewing in landscape mode. On the bigger tablets 10.1\" people complain it is not suitable for viewing in portrait mode. This could be a reason but for viewing a movie I use a stand such as  TechMatte Multi-Angle Mini Portable Stand Durable Aluminum (Silver/Dark Gray) for Apple iPad Air/Mini, iPhone 5/5s/5c, Samsung Galaxy Tab 2/Note 10.1/S4, Google Nexus 5/4 and most other Tablets, E-readers and Smartphones (with Drawstring Travel Tote/Bag...] which is great.SOUND:Excellent sound system with stereo speakers and microphone. I was able to ask questions to Google Now and get precise answers.MISC:This has USB 2.0 capability not USB 3. I tested OTG capability and it is great to have a external USB support.  USB Host is one of the most undernoticed features of Androids and is in my opinion one of the best features compared to iPad lines. What this means you get a USB Host cable also otherwise called OTG (On the Go) cables and plug in your USB thumb drive or other USB devices and the device recognizes it. I have used it with Alfa AWUS036H for a wireless project with Android PCAP Capture from reputable Kismet wireless.Having a GPS is great for immediate needs and I could get immediate lock on this tablet. Wi-Fi is 802.11 a/b/g/n/ac, dual-band. Also has infrared which cas be used for WatchON as a TV remote control. Worked straightaway on Samsung TV. This is also great for sharing your tablet with family members, multi user mode lets different users log in separately, so you each see only your own apps, backgrounds, and email.APP POWER:I tried following apps and they just worked awesome. Apps CAN BE stored in SD card. Samsung has hacked Android to do it again. A tablet is only as good as the apps you have and how productive it makes you. It's almost like the camera/lens analogy in the DSLR space. What good it is to have a great DSLR body if you have no good lens? Same with Tablet body and apps you have.WolframAlpha (I can go on for hours praising this. This is a truly genius app powered by hundreds of supercomputers in the background. Wolfram is a computational genius). Well worth the $3 price.Withings HealthMate. (another remarkable app great UI/UX). I use Pulse and the integration with it as well as Weight machine is very good.23andMe app (I love their reports)Aldiko Book Reader Premium (absolutely love it, many libraries have magazines for checkout)Amazon MobileAndroid StatusAndroid Central app (great and must have for Android users)Androidify (kids love it)Angry Birds (Space/Seasons)Asphalt Car gameBattery Monitor Widget Pro (a great app)BeyondPod (use it daily!)BoxChromeCNET TVDictionary M-W PremiumNAVIGON (from Garmin - offline maps)TOM TOM app (has some advantages over NAVIGON)Google Navigation/Earth/Maps using a portable MiFi boxGoogle Currents (nice way to read News)Google Keep/Keyboard/Drive/Search/Books/Voice/HangoutsEbayFlipboardLinkedinGoogle Music (Awesome, I have now upto 10,000 songs halfway through Google's 20K Limit)Tapatalk HD (awesome forum browsing app)OverDrive Media Console: Library eBooks & AudiobooksMicrosoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for AndroidTwit.TvSkypeRealCalc Plus (Awesome calculator app)Wolfram AlphaZillowPlenty of WidgetsAPPENDIX: Other Models to compare against if you are on the edge:Kindle Fire HDX 8.9\" model: 2560 x 1600, 339 ppi, Snapdragon 800 2.2 GHz quad-core, 2 GB RAM, 16/32/64 Flash Memory, No microSD card, 8MP rear-facing camera, front-facing 720p HD camera, 374 grams, FireOS 3.0, 9.1 x 6.2 x 0.31 inches, microUSB, GPS:no [cellular versions have GPS]Samsung Galaxy Note 10.1\" 2014 Edition: 2560x1600, 299 ppi, 1.9GHz Samsung Exynos 5420 Quad-Core Processor, 3GB RAM, 16/32 GB Flash Memory, microSD slot:yes(upto 64 GB), 8MP rear camera and 2 MP front-facing camera, 560 grams, Android 4.3 Jelly Bean OS, 9.57 x 6.75 x 0.31 inches, microUSB, GPS:yes. S-Pen (flagship),iPAD Air 9.7\" (2013): 2048 x 1536 resolution, 264 ppi, A7/M7/64 bit processor, Flash Memory: 16/32/64/128 GB, SD Card:no, 5 MP back, 1.2 MP front, 469 grams, iOS 7, 9.4 x 6.6 x 0.29 in, lightning port, GPS:no [cellular versions have GPS]Samsung Galaxy Tab 3 10.1\" model: 1280 x 800, 149 ppi, Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, Flash Memory: 16/32GB, microSD slot: yes upto 64 GB, 3.2MP rear-facing, 1.3MP front-facing, 510 grams, Android 4.2.2, 9.57 x 6.93 x 0.31 in, micoUSB port:yes, GPS:yesGoogle Nexus 10\" model: 2560 x 1600, 300 ppi, CPU: Dual-core A15, 2GB RAM, 16/32 GB, SD:no, rear:5 MP, front:1.9 MP, 603g, 10.4\" x 7\" x 0.35\", mcroUSB, GPS:yesSamsung Galaxy Tab 3 8\" model: 1280 x 800, 189 ppi, Exynos 1.5GHz dual-core processor, 1.5GB RAM, Flash memory: 16/32GB, microSD slot: yes upto 64 GB, 5MP rear-facing, 1.3MP front-facing, 309 grams, Android 4.2, 8.26 x 4.87 x 0.29 in, microUSB port:yes, GPS: yesYou should come up with three top three specs you want and should be able to nail it down with the above spec. Ask questions, the reviews cannot do full justice. I will be glad to answer any questions and usually answer within 24 hours to any query. Overall the Tabpro 8.4\" is a winner outright!", "Date": "February 19, 2014"}, {"Title": "Samsung Galaxy Tab Pro 8.4-Inch Tablet (White) (Model SM-T320)", "Author": "Dr. M \"Professor\"", "ReviewID": "RPM7H4ZIAIL4Z", "Overall": "5.0", "Content": "UPDATE 08 Jun 2014 - Added \"Internet Browsers\" review, and minor tweaks.From time to time, as I learn more about this very powerful system, I will add to my review and adjust my comments when I think it is something noteworthy or that may help your decisionMY \"TECHINESS\"I have in my house both Apple and Android mobile devices (iPad - original) , iPod - touch, mini-iPads, iDream Tablet running Android 4.0), PC's running Windows XP, Vista, and 8.1, cell phones running Android 2.3, and feature phones -- so I consider myself tech savvy.  And what I don't know, or can't figure out, my teenagers can.The Samsung Galaxy Tab Pro 8.4 is my latest acquisition and I use it for myself.  As of this update I have had it for a month, playing with constantly.PLACE IN SAMSUNG PRODUCT LINESamsung makes a variety of models, and it is often hard to tell what one model does that another does not, and which model or sub-model is the right one for you.  For Samsung, the two Galaxy Pro lines that overlap are the Tab Pro and the Note Pro.  The difference between the two is that Note has the S-pen stylus handwriting and drawing on the screen, while the Tab Pro 8.4 has no S-pen.  The Note Pro also comes in two screen size (10.1' and 12.2\"), while the Tab Pro comes in three sizes (8.4\", 10.1\", and 12.2\".)  Otherwise, they all have similar top-of-the-line specs.The Samsung Galaxy Tab Pro is at the very top of the Tab line.  The Tab, Tab 2, Tab 3, and Tab 4 are successive budget models, while the Tab Pro is the elite high-end (and expensive) version.  It comes in four flavors: WiFi only, and WiFi plus data (3G/4G), combined with either 16GB or 32GB of internal storage.  It also comes in two colors: black, or white (I guess that would make eight flavors.)COMPETITIONAs I go through the features and specs below, I think it will be increasingly clear that Samsung has targeted the Tab Pro 8.4 to one-up (or more) over the Apple mini-iPad Retina -- and at a significantly better price-point ($350+ versus $600 for a comparable Retina.)  And there are numerous comparisons available in print and on YouTube, most favoring the Tab Pro 8.4.  Just google \"Tab Pro 8.4 versus mini-iPad Retina\" to find the comparisons.CASEThe Galaxy Tab Pro 8.4 is ten percent taller, four percent narrower, and maybe a smidge thinner than the Apple mini-iPad Retina. The two are almost exactly the same weight.  The Tab Pro 8.4 has a pleasing simulated-leather back, which is very realistic in look and feel, including stitching. The mini-iPad retina has a metal back.O/S, RAM & STORAGEThe Tab Pro 8.4 runs on Android 4.4.2 (Kit Kat) which is the latest released version of Android -- seems to be a very stable and a well executed O/S.  I have yet to run into anything funny or alarming with it.  One thing I like very much about Kit Kat is that the O/S manages your memory for you -- you no longer have to worry about where things go.  And it has a massive memory/storage capability -- 2 GB RAM, plus 16 GB of fast internal storage, plus up to 64 GB external micoSDXC storage, for a whopping 80 GB of very fast combined on-board storage capability.In comparison, the Apple min-iPad Retina does not have a user-accessible external storage, so once you purchase your mini-iPad, you can't add more storage later.  Apple does offer sub-models with more internal storage, but at a greatly increased price, for example at 64GB, nearly $600.  Compare that to an 80GB Tab Pro 8.4 at $400 ($350 for the 16 GB Tab Pro + $50 for the 64GB microSDXC card.).USER GUIDEThe 175 page hyper-text user manual (available only on-line) states that some microSD cards may not be compatible, which influenced me to by a Samsung-brand 64 GB microSDXC card.  A very small-format printed Quick-Start guide comes in the package, but you can download the digital User Guide from Samsung's web site (even before you buy), which is more comprehensive.CONNECTIVITY-- WiFi & BluetoothThe Tab Pro 8.4 has the latest versions of Bluetooth (version 4.0), and WiFi (802.11 a/b/g/n/ac),.-- Infra Red BlasterInfra Red Blaster provides an all-device remote control.-- HDMIThe tab Pro 8.4 does NOT have a dedicated HDMI port, though it does support a USB to HDMI adapter, which you can purchase at many outlets, including Amazon.com.-- WiFi DirectWiFi Direct allows you to connect wirelessly with multiple devices (that also have WiFi Direct capability) and share information and files.  WiFi Direct may not be immediately useful to you, but it is a feature you would probably want in all your future devices.-- USB to PCNormally, when you connect a handheld device to a PC by USB cable, the device becomes just an external storage device to your PC (or Mac), and no other features of the device can be used while so connected.  If you do this on the Tab Pro 8.4, you will see two new storage devices on your PC:  \"Card\" and \"Tablet.\"  \"Tablet\" is the internal storage (16 GB) that comes with the device - don't mess with it.  \"Card\" is the external microSD card that you can install, and add files to from your PC. If you go about changing folder and file names you didn't add, you can screw up your device. When you are connected to a PC by USB, the Tab Pro 8.4's battery will not be charged.  So you should have the Tab Pro 8.4 fully charged before attaching it to a PC by USB cable.-- KiesSamsung Kies is software to install on your PC or Mac which enables you to connect safely using a USB cable to update firmware, synchronize files, and transfer data much faster that Bluetooth.  You can also synch with your PC's Windows Media Player (but forget synching with Apple iTunes - Apple just won't cooperate with Samsung or Google in any way.)You download Kies to your PC from Samsung's website. There may be more than one version -- You use the latest version For the Tab Pro 8.4.  After you install Kies, it will ask you to download a Samsung Kies USB driver that will increase the speed of the connection.When you use Samsung's Kies software to connect your PC by USB cable to the Tab Pro 8.4, you won't see the Internal and external storage drives.  Kies will perform firmware upgrades, and while doing so, you can't use the device for anything else.  However, if you are just transmitting folder and file, or synching, you can simultaneously use the Tab Pro 8.4 features and apps. Using Kies makes transfers safe, and it knows where to put your music, pictures, and videos. For those files and folders, Kies will give you a choice whether to store on the internal storage or external microSD card.-- OTGI don't find any information or spec from Samsung about USB OTG (On the Go), which would allow the USB port to host external devices connected by USB (such as an external USB flash drive or an external GPS antenna.)  However, some reviewers report that it does support OTG.  OTG requires a special OTG USB cable/adapter, which is available from Amazon.com and other outlets.To check it for myself I connected my USB flash drive by an OTG USB-to-microUSB cable, and I could see all the files on the flash drive, and the Tab Pro 8.4 could open the files that it had a type for, such as graphics, music, and video files, and some documents.  If it didn't know what file type the file was, it couldn't open it. So OTG (with an OTG USB cable)does work.When you are properly connected to a flash drive, you find the flash drive within the app named \"My Files.\"  Open \"My Files\" and on the left side of the screen will be a list of \"folders\" as follows:- - - Device Storage (that's your internal 16 GB or 32GB storage)- - - SD Memory Card (f you added a microSD card), and- - - USBDriveA (if your flash drive is properly attached)When you are finished with the flash drive, don't just disconnect it - first unmount the flash drive.In comparison, the Apple mini-iPad Retina has the same Bluetooth and Wifi, but not Direct WiFi.  It has USB to its proprietary Lightening connector, which is about the same size as a microUSB connector.  Apple touts its lightening connector as very high speed, but that would only be true if the PC on the other side has USB 3.0.  Leave it to Apple to be as incompatible as possible with any other standard.  The mini-iPad Retina has no IR Blaster, nor capability for additional user-furnished storage. The Apple mini-iPad Retina does not mention OTG, so I can't say whether or not it has it.PROCESSORA Snapdragon 800 2.3 GHz Quad-Core Processor (with 2GB RAM), and on-board GPU powers the Tab Pro 8.4, which is the most advanced and fastest processor used in Android devices.The mini-iPad, by contrast, uses a Apple A7 CPU, which is no slouch, but only 1 GB of RAM on board.  In throughput test comparisons, the edge goes to the Tab Pro 8.4.DISPLAYThe Tab Pro 8.4 has a 5% larger screen area than the min-iPad Retina.The Tab Pro 8.4's also has a higher pixel density -- display resolution is WQXGA (2560 x 1600 pixels) at 359 pixels per inch.  That is better than Apple's retina display (2048 x 1536 pixels) at 326 pixels per inch.The aspect ratio of the Tab Pro 8.4's screen is 16:10, which is the same as my computer monitor - so everything I see on my PC screen can be shown in even higher resolution on the Tab Pro 8.4.A 16:10 aspect ratio is nearly the same as the HDTV aspect ratio of 16:9.  Contrast that to mini-iPad's aspect ratio of 4:3, which causes HDTV content to either be truncated on the sides, or the HDTV image to be very small on the screen.Samsung's default screen settings are a little too dim for my tastes.  The Tab Pro 8.4 really shines with blazing, vivid colors at slightly higher brightness levels.  The downside to increasing the brightness level is that the screen (which is the primary culprit in battery usage) depletes the battery faster.White is the color with the highest battery drain (white requires all color pixels to be on).  So the use of white backgrounds should be eliminated or minimized.  I created a wallpaper that is just a totally black rectangle (stored as a .jpg file).  The black wallpaper allows images on the screen to stand out better, even at reduced brightness levels.  I also set my Kindle app to \"white type on black background\" for the same effect.  Finally, I created a lock-screen which has my logo on it on a black background.Clearly, the Tab Pro 8.4 is positioned to compete aggressively (both feature and price wise) with the Apple Retina mini-iPad.  Excellent, very sharp images on the display (depending on the resolution of the image itself).  This is the type of display that you only want high-definition images on.MULTI-TASKING / MULTI-VIEWINGAll Android devices can multi-task, but you can normally only view one screen at a time for any running app.  The Tab Pro 8.4 allows up to four multi-tasking apps to be displayed simultaneously, and you can pair any two so they always show up together.  This is a great feature for comparing two documents side by side, organizing files into different folders, or displaying a graphic in a separate window while browsing a document.  It is a big step that brings much of the power of the PC display to the Android Tablet.BATTERYHere the edge clearly goes to the mini-iPad Retina with a 6,470 mAh battery to the Tab Pro 8.4's 4,800 mAh battery.  That translates to roughly 10+ hours for the mini-iPad Retina versus 8 hours for the Tab Pro 8.4.  Of course, user time will vary greatly - depending on screen brightness, sound volume, and the number of apps open.  If you need more time between charges, consider purchasing a mobile battery extender, and/or invest in a car charger.BATTERY CHARGER (wall mount)The supplied Samsung USB Battery charger is rated at 2 amps, which is designed to rapidly recharge the device.  Don't use any battery charger with less than a 2-amp capacity (which would include most cell phone charges) - they won't charge rapidly, if at all.The same goes for the included Samsung USB cable - it is designed to handle a 2-amp load on recharging.  Other USB cables may not be able to handle a 2-amp current.ERGONOMICSThe Tab Pro 8.4 is (in my humble opinion) the perfect size for a handheld mobile device.  Any bigger display/device, and you would have trouble holding it with one hand.  Any smaller and you would be sacrificing clarity and resolution.The Tab Pro 8.4 has a higher aspect ratio (16:10 to mini-iPad's 4:3), which is easier to hold in one hand.  And the higher aspect ratio of the Tab Pro 8.4 is better for watching HD movies and video content.That this size tablet is the new norm is testified by the fact that my wife and daughters have pretty much abandoned their larger iPad and smaller iPods for the mini-iPad.  And I have pretty much done the same for Android devices.  While my wife and daughters are designer brand afficionado snobs, and will probably always choose Apple over Android, they were impressed by the Samsung Tab Pro 8.4's display.CAMERATwo Cameras -- 8MP Rear + 2MP Front.  That is better than the mini-iPad Retina's cameras (5MP rear + 1.2MP front.)  Not the highest resolution for professional photographers, but very good for the price range, and excellent for the amateur.  The higher camera resolution allows a wider utility for the digital zoom without undue pixalation.  And the Tab Pro 8.4's rear camera has flash, which the mini-iPad Retina doesn't.  Both have auto-focus.  Neither have an optical zoom.GPSThe Tab Pro 8.4 has a fully functional on-board GPS.  And it is fully compatible with Google Maps and Google Earth.  The Apple mini-iPad Retina does not have GPS.SOUNDThe Tab Pro 8.4 has stereo speakers on the bottom (same as the min-iPad Retina.)  Surprisingly good sound comes out these tiny speakers - no deep bass, but good enough to listen to movies and music without earphones.  Put on some HiFi earphones for the best sound, or plug into some quality big speakers with a woofer for that big bass component.MUSIC PLAYERAt first glance, the included Samsung music player (simply labled \"Music\") appears to be just a plain, simple, featureless music player.  But it is actually a very understated, but feature rich, player.  I mention it here because it would be all too easy to prematurely dismiss it.You access the features from the Music screen by tapping on the small \"Options\" icon (three vertical dots) in the upper right corner of the screen, and then tap \"Settings,\" and then \"Player.\"  It would have been better (and much more noticeable and convenient) to have these in tabbed folders directly from the player screen, but it is what it is.The options under \"Settings > Player\" are:- - Sound AliveThis is a multi-feature that has \"Basic\" and \"Advanced\" tabs.Under the \"Basic\" tab is a graphic square layout that allows you to choose a setting between \"Instrument\" and \"Vocal\" (Karaoke effect) in five levels on the horizontal; scale, and simultaneously a setting between \"Treble\" and Bass\" in five levels on the vertical scale.  Some of the setting possibilities are labeled, such as: Classic, Normal, Pop, Rock, and Jazz.Under the \"Advanced\" tab is a seven-band equalizer, and three special effects choices for \"3D,\" \"Bass,\" and \"Clarity.\"Available under either \"Basic\" or \"Advanced\" is a \"Tube Amp Effect\" that puts a little reverb in the sound.  The \"Tube Amp Effect\" is only available with the earphones plugged in.-- Adapt SoundIt is either on or off.  I'm not sure what it does, but it only works with the earphones plugged in.- - Play SpeedYou can slow the music down, or speed it up -- by quite a bit - using a bar scale.- - Music Auto Off.Turns the Music player off after a time interval you choose.- - LyricsProvides song lyrics.  It is an on/off switch, and I presume you have to be subscribed to Google Music, or some lyrics service, to use it.- - Smart VolumeIt is an on/off switch that adjusts the sound level of all music tracks to level 13.The options under \"Setting\" > \"My Music\" are:- - TabsTabs allow you to choose which attributes you want to be able to sort your music by (Playlists, Tracks, Albums, Artists, Folders, Genres.)  \"Playlist\" and \"Tracks\" are mandatory defaults.  In addition, when you sort, you can choose to sort by where your music is stored (Bluetooth folder, Music (internal storage), external SD card.)- - PlaylistsThese are the default playlist choices (Favorites, Most Played, Recently Played, Recently Added) plus any playlists you created (in another screen.)Other Music options directly on the music player are music \"Shuffle,\" and \"Repeat.\"  \"Repeat\" has the following settings: play all, repeat all continuously, and repeat once.BUILT-IN APPS & APP MARKETSBoth of these devices have a slew of apps to choose from, running in the hundreds of thousands.  The edge in apps probably goes to the Apple mini-iPad Retina because any app for Apple usually runs across all of its product lines, regardless of O/S version.Android apps tend to be more device and O/S specific - many apps created for older Android versions, or a specific manufacturer, or made for cell phones, won't work on the Tab Pro 8.4.  Google Play Store will advise you if you try to buy or install an app that is not compatible with your Android device.  And it asks you to report apps (with a single tap) that stop working, so it can prevent future downloads until the app is fixed.The Samsung Apps store (tap the \"Samsung App\" icon) should be your first resort to look for Apps.  Samsung has produced a line of apps specifically for its Galaxy lines, and new apps are being added all the time.  Samsung is serious about bettering Apple in every way, including apps, many of which are not available on Google Play.  And some apps originally designed for the Galaxy Note also work on the Tab Pro, and are free.- - SAMSUNGThe included Samsung apps for the Tab Pro 8.4 are in a folder named \"Samsung\" while the Samsung App Store icon is named \"Samsung Apps.\"  That is a little confusing, so I thought I would mention it, because the \"Samsung\" folder icon looks just like an app icon rather than a folder.  When you tap on the \"Samsung\" icon, a window opens up with the included apps displayed (Alarm, Calculator, Downloads, Help, KNOX, S Voice, Side Sync, World Clock.)- - KNOXThink of Knox as in Fort Knox - a place of high security.  Knox is the secure (encrypted) part of your Tab Pro 8.4 - password protected.  When you tap on the Knox icon, it prompts you to create a password and creates a secure folder for all your Knox-secured applications and files.  It then opens a table of secure (KNOX) versions of applications, some of which are free, and some you might have to pay for.In addition to the included apps, Samsung includes a $25 voucher for your choice of apps to purchase (from the Samsung App Store, not Google Play.)  Some very powerful business apps in the Samsung store may be free, such as the Hancom Office set (HOffice, Hword, Hcell, Hshow, etc.) which will give you all the power to read, modify, and create Microsoft Office compatible documents.INTERNET BROWSERSTwo internet browsers are included.  Both are mobile versions, and both will look for a mobile version of the website you are visiting, but both will also provide full internet browsing.- - Google Chrome Mobile, just labeled \"Chrome,\" will synch itself with your Google account (if you are signed in.)  And if you have tabs pinned on your PC version of Chrome, they will also be pinned in the mobile version.  What you won't get with the mobile version are the apps and extensions that your PC version of Chrome can have.  But word is out that Google is working on adding the apps and extensions to the mobile version, with a target release of late 2014.  Chrome will allow you to zoom in and out on the web page.- - Samsung mobile browser, just labeled \"Internet,\" has a different tactic - you set the \"small\" print at the level most easily read by your eyes, and the content is sized accordingly.  You can still zoom in and out on the web page.  I had my doubts about this small print-setting tactic, but after using it, I rather like it.CONCLUSIONIt may be debatable exactly what the best hand-held thing on the market is now, but the Samsung Galaxy Tab Pro 8.4 is right up there at the top - feature wise, and price-point.RECOMMENDATIONI, as a rational engineer, would pick the clearly superior Samsung Tab Pro 8.4 over the Apple Mini-iPad Retina. I bought one for myself.  And my wife said she was going to upgrade to the Tab Pro 8.4 and abandon her Apple mini-iPad.And I would definitely recommend the Tab Pro 8.4 to my friends.", "Date": "May 16, 2014"}, {"Title": "My first 5-star tablet", "Author": "The Bee Bee \"BB\"", "ReviewID": "RX10MS1K8YKFW", "Overall": "5.0", "Content": "At various times over the years, I have owned an iPad, iPad 3, Kindle, Kindle Fire HD, Nook, Galaxy Note 10.1, Microsoft Surface, and a couple of models that were literally forgettable. At this point, I think I have a fairly refined sense of what makes a tablet great, and my bar for a five-star model is set extremely high.What makes the Samsung Galaxy Tab Pro 8.4\" my favorite--and first five-star--tablet?1) It's size. 8.4\" is the perfect size for a tablet. Given the extremely high resolution of the Galaxy Tab Pro, the fact that it's a little smaller than the \"standard\" large tablet (10\" or so) doesn't seem to make any difference in terms of reading or viewing. Where the 8.4\" form factor really shines is portability. Whereas I used to hesitate when deciding whether to carry along my iPad or Galaxy Note 10.1, the Galaxy Tab Pro 8.4\" goes everywhere with me. That kind of \"no brainer\" portability is worth a lot these days.2) The quality of the camera. I have been slow to embrace cell phone and tablet photography because the cameras that are built into these devices are generally crap, no matter what the hipsters and hype machine tells you. I have enough experience with SLRs and DSLRs to appreciate a good camera and a quality lens, and what passes for a camera in many portable devices is a far cry from what you get from a real camera and lens. Having said that, portability is still the critical factor when it comes to tablets, so having a surprisingly good camera in the Galaxy Tab Pro 8.4\" makes me very happy and expands the range of things I want to do with my tablet.3) Android 4.4. In a word, Android 4.4 (Kit Kat) is superb. It's stable, smooth, and reliable. I have access to virtually every app worth having, and I know that my device is not going to become obsolete in a few months.4) Price. Yes, I know the Galaxy Tab Pro 8.4\" costs more than competing models, but when you add up the list of features--along with some mighty nice extras like the $25 Play Store credit and the 2 years of 50Gb Dropbox service, the price seems downright competitive. Factor in the incredible build quality and the overall user experience and you have a home run. I couldn't be more pleased.", "Date": "April 16, 2014"}, {"Title": "Best tablet I've seen", "Author": "Van E. Hodges", "ReviewID": "REQOKCH0LKMTW", "Overall": "5.0", "Content": "I'm an apple product lover but don't really care for the iPad so I decided to try the galaxy tab pro because I've loved my Galaxy S3 phone. In my opinion this tablet is more than superior to the iPad. The new magazine ui is really cool and love having easy access to all kinds of news stories.  Highly customizable and not short on features.  I've been using it for almost a week without any hiccups what so ever. It's been able to handle everything I've wanted.  Videos look amazing and the processor is super fast.  Highly recommend buying this tablet. The 8.4\" is the perfect size for holding and watching videos while still being able to be productive.Update: March 6thAfter using it for a few weeks I've loved being able to multi task with 2 apps at the same time.  There are a limited number of apps you are able to pick from, for example you can't use Netflix with another app but you can use video player with another app. There are about 20 to 25 apps you can use together on the same screen.  Each app can be sized as you wish on the screen and work in both landscape and portrait modes.  If someone finds a way to use other apps then let me know but it seems you are limited to what can be used.  I did install podcast addict and it let me add this app to the side bar for use with this feature. But haven't seen a way to add Netflix or Hulu with out going through the Web browser.Additionally,  the file management on Android is far superior than Apple. I use my tablet for graduate school and I have friends using iPad who can't do simple talks like downloading a word document without using third party apps. Additionally,  having the ability to edit documents with Google Quick office and editing PDFs with Adobe Reader is awesome.", "Date": "February 19, 2014"}, {"Title": "After the update, it's perfect", "Author": "L", "ReviewID": "R18VWJ9D1Z57LL", "Overall": "5.0", "Content": "I upgraded from an Asus transformer Infinity 10.1. I also had a Nexus 7\" 2012 (too small for me). I bought this to see if I could consolidate both sizes into one that would be big enough, but still portable.  I think the 8.4\" does a fine job at this, but I wouldn't say that if the screen resolution was subpar. Samsung's screen is top notch and makes even the smallest text readable.So for me 8.4 is doable, but only if the screen is high end, which the Samsung's is.It's also noticeably faster in general and especially in loading web pages than both my prior tablets.  This is another thing I wanted in my next tablet, and I'm satisfied with the speed.I also like the included IR blaster for controlling my TV. It has become an integral part of my couch potato command center :) No need to take my hands off my tablet to reach for the remote anymore!There is one problem though that knocks a star off for me. As also mentioned by one other reviewer here, the screen is overly sensitive at times. When I try to scroll a webpage in my browser or a pdf document in Mantano reader it will zoom in or out instead. So it's interpreting my scroll movement as a double tap. Scrolling through youtube videos will sometimes result in it playing one when I didn't select it, so it's interpreting my scrolling motion as a tap.Of course this happened on my Asus and Nexus too, but no where near as often as on the Samsung. I bought a stylus, the amPen 3 in 1 Hybrid, thinking it might help, but it is actually worse than my finger. It also skips when trying to write with it. Same with an old Griffin rubber tipped stylus I had. The amPen stylus works perfectly on my old Asus transformer though, better than a finger.I've spent hours trying to come up with a solution to this, and I did find a few things that help. First I noticed that it doesn't happen very often if I use my ring finger to navigate my tablet. My index finger and middle finger are the problem. I examined my fingers to see what could be different and came to the conclusion that my ring finger is smoother/softer than the other too. So I got out some very find sandpaper and sanded my fingertips. That seemed to help.I also did a google search on adjusting touch screen sensitivity. One hint which seems to make a big difference is to adjust the press and hold delay. Go to settings, device, accessibility, press and hold delay. The default is 0.5 seconds. I changed it to 1.0 seconds.The third thing is to clear RAM in the task manager. I notice when I first power up the tablet everything works fine, even the stylus works beautifully and scrolls and writes like a dream. After 10 minutes or so of use though it stops working. Clearing RAM can usually get it working again temporarily.So I think something is loading that affects the screen. I haven't loaded any apps that aren't also on my Asus and as I said, the stylus works fine on the Asus. So I think it's either some Samsung bloatware running in the background or 4.4 Kitkat. Asus hasn't upgraded to Kitkat yet.So if a guy has to sand his fingertips to get his tablet to work and can't use a stylus that works fine on an older tablet then the tablet probably doesn't rate 5 stars. I like the Samsung. I've got it to work with my fingers, but it's not perfect, so I'm giving it a 4.UPDATE 3/17/14:Reviewer Joe C gave some tips on how to improve lag for the Samsung Galaxy Note 10.1 2014 edition tablet. Here they are\"LAG ISSUES CAN BE IMPROVED, READ HERE:Turn on developer options by tapping \"build number\" found in the \"about\" section within options 7 times. Once developer options are turned on, scroll down to window animation transition animation, animator duration and turn each one off. You will notice no more lag for scrolling and exiting apps.To solve the home button issue where there is lag, go to S voice. Once in S voice, hit the menu button which is located left of the home button. Choose the option to \"not initiate S voice by double tapping the home button\". You will notice considerable changes in speed of the home button to wake up the screen, however it won't be snappy until there is an update.In addition, the more apps you have on your device, the more cache data your device will accumulate. Just like your web browser, you should remove your app cache data once a day or every few days to save up space. I suggest AVG memory and cache cleaner, or clean master. Also I highly suggest you install an anti-virus software like AVG on your Note 10.1 2014.\"I did the developer options tips on my Tab Pro 8.4\" and also set my browser to delete cache on exit (I use NB browser pro). These tips helped remove most of the stutter I sometimes see when scrolling webpages. It also helps with the stylus problems I've been having.Turning on developer options comes with the risk that your tablet might not work right in some cases, but I haven't noticed anything bad with changing the above settings.Update: 3/19/14:Installed Clean Master to manage my RAM and cache and I think it made a noticeable improvement in my screen issues. CM also deletes junk files. I had uninstalled a mail app the regular way through the tablet's settings menu. CM found additional files that Samsung's uninstaller left behind and deleted them for me. If you install and uninstall lots of apps, over time you'll probably accumulate a fair number of junk files. CM says it can find most of these. Here's a link to it on Amazon. Clean Master It's also on Google's Play Store. Note: Be mindful of what you are doing. CM will delete your photos, videos, etc too, if you tell it too. It doesn't do this by default, and it takes extra steps to do so, but you do need to pay attention.Also, if you are having touch screen sensitivity issues there is a thread discussing it on XDA Developers you might want to read. You can find it by searching forGalaxy Tab Pro 8.4 screen sensitivity - xda-developersUpdate: 5/13/14My tablet received an update a couple days ago, which seems to have resolved the screen sensitivity. I haven't noticed any of the prior issues with sensitivity since the update. The stylus now works well and I prefer it over using my finger. So I've changed my rating from 4 to 5 stars. If you like this screen size it will be hard to find a better tablet than this one at this time.", "Date": "March 10, 2014"}, {"Title": "Awesome (upgraded from 2013 Nexus 7)", "Author": "Amazon Customer \"Tim\"", "ReviewID": "R2A7CTJOO22ACD", "Overall": "4.0", "Content": "Coming from a 2013 Nexus 7, this this is faster and better at every turn. That can be attributed to the Snapdragon 800 vs the S4 pro. Although the Nexus 7 is no slouch in performance. I really like the 8.4\" screen size and it's why I upgraded it in the first place. I found the Nexus 7 to be just a bit too small for web browsing. The extra screen real estate really makes a difference but the tablet itself is still very small and portable. And the screen resolution is absolutely the best I've seen on ANY device, hands down.It's also extremely thin and light. I'd be hard pressed to tell the difference in weight vs the Nexus 7. Seems thinner too. I assume since there's more space for the internals. The way it's shaped makes it easier to hold one handed, even though it's larger.The addition of an SD card slot is also a nice feature, since 16GB will be eaten up very quickly with Samsung's Touchwiz UI  (some call it bloat, I actually prefer it) and my apps. I am all set up with a good amount of apps and have 7.8GB left. That's enough for one or so HD movie rental, which is enough for me. I'll use the SD card for spotify if I need it. But I stream everything from a tablet. no need for storage unless I'm on a plane without wifi...and those days are coming to an end as well.The only thing I don't really like is the magazine launcher. I prefer the Google launcher with Google Now on the left page. There's no way to disable the magazine pages, so I just don't swipe left on my homescreen. You can also install 3rd party launchers (I like Apex) which solves the issue as well.Price seems fair. Although $350 would have been OK with me. I would have sacrificed the SD card slot for this price. -1 star for that. $400 puts it in iPad mini competition. And I prefer Android so that's an easy decision.Some people dislike Samsung Touchwiz UI. I actually prefer it and find it useful, aside from the Magazine launcher as noted above.Battery life seems to be on par with reviews and what my Nexus 7 got with daily use. I've been on it quite a bit. Wifi is always on and the screen is usually set to around 25% brightness (it's a crazy bright screen). 7-8 hours screen on time seems to be average. It's not seeing my charger until bed time, if at all.It was between this and the LG G Pad 8.3 for me. The LG has a snapdragon 600 (vs this one's 800) and the screen on the LG wasn't good for me at all when I tested it. I had to turn it up to 90-100% to get good brightness and even that seemed dim. The resolution was a lot lower as well. For $250 it seemed like a good value, but this tablet definitely is more premium at every turn, which you obviously pay for.", "Date": "February 21, 2014"}, {"Title": "4 Hundred Dollars !! It Better Be Pro LoL !!", "Author": "Weikuang Wong", "ReviewID": "R1FMQ7KB34K9LU", "Overall": "5.0", "Content": "I read the reviews before buying this tablet. There are a lot of positive and negative reviews so it was kind of hard to tell if this was worth 4 hundred dollars. If you are reading this review, most likely you are also wondering if this is worth the money. I am writing this review to give people a quick list of things I liked and didn't like about this product. Maybe this review can help you decide if the Tab Pro 8.4 is right for you.There are 7 things I didn't like about the Tab Pro but I don't think these things are really that bad...-- The tablet lags a little once in awhile but it's really not a big deal and most people will not notice it.-- Even with really low settings the battery will last only 4 to 5 hours if you are watching YouTube videos nonstop.-- The magazine layout cannot be turned off.  Some people like the look of it but I really don't...-- 16 gigs really equals about 11 gigs for you to use. System software take up a lot of space.-- Even though the tablet has a high resolution screen, some icons for apps still have low resolution and are not very detailed.-- The tablet is good for reading books but not great... That's just my opinion. Other people will disagree...-- The price is FOUR HUNDRED DOLLARS !!!!!  For some people that's cheap and would list this as a positive LoLThere are 7 really good things about the Tab Pro.-- The tablet has a high resolution screen that everyone is talking about-- The tablet allows you to use a mini SD card. It would be great if the ipad mini had that too...-- The tablet has 10 hours of battery life when you turn most of the settings off and the brightness low/medium.-- The battery will last 6.5 to 10 hours if you are using FaceBook nonstop and with low/medium settings.-- The battery will last around 10 hours if you are using Pandora nonstop and with low/medium settings.-- The free games don't have a lot of adds like they do on the ipad...-- Angry Birds still works on this tablet :-)I think nothing is perfect so even with a few negative things, I would still give this 5 stars and recommend this product. This isn't for everyone. Some people like Android and some people like Apple IOS. I personally like them both. In my opinion, If you want a tablet to read books buy the ipad mini with retina display. If you want a tablet for games, movies, and widgets, buy the Tab Pro 8.4I hope this review is helpful to anyone reading this review. If anything in this review is false please let me know so I can make a quick update", "Date": "February 28, 2014"}, {"Title": "Close to just right, but not quite.", "Author": "gauchotodd", "ReviewID": "R3I3JYECCBFLRT", "Overall": "4.0", "Content": "Although I have several years of professional experience using a wide variety of tablets and other consumer mobile devices, this is the first tablet that appeared enticing enough for me to spend my own hard-earned money. I've had this tablet for four days now, which is plenty of time for me to get a good feel for it, given how much I've used it during this time. Please keep in mind while reading this that I am very picky with what I am looking for in this sort of device (which is part of why it took me so long to pull the trigger), and am very perceptive to imperfections, for lack of a better word. I can already tell I'll have a bit of a love-hate relationship with this Tab Pro 8.4, which may ultimately make me replace it with a similar next-generation device sooner than I had desired while considering it. I won't go through all the specs since you can do that yourself, I'll just offer my take on it in hopes that it will help somebody else with their own well-informed decision on making or not making their own purchase.The screen, as is the consensus, is absolutely gorgeous; my lock screen background is the included espresso photo, and it looks real. I mean, it really looks real. The bubbles in the espresso are lifelike enough that it actually looks like there is a two-dimensional latte on my desk. I have really great (20/10) eyesight, too, so it's not a matter of it just having more pixels than the average person would notice. I'm skeptical that cramming 4K resolution into a display this size would make any perceptible difference, even to myself. The backlight is plenty bright, so I generally keep it under 20% brightness unless I'm viewing photos or videos.The form factor is great overall - the display size, in my opinion, is perfect, which is one of the main reasons I bought it. To give a better idea of how its size compares to me, I have slightly larger hands than average - I can palm a basketball, but just barely. The bezels are a bit wider than I would prefer (considering if it were custom designed for me, which of course, it's not), but they're not bad like virtually all tablets used to be. Ideally, I would like to see a tablet this size with bezels about half the size that they are, on all four sides. I really wouldn't expect this to cause any issues with incidental gestures while holding it. It's nice and thin proportional to its length and width, but this too I'd like to see eventually trimmed down as well. I know we're already getting close to the limits of still being able to include things like a 3.5mm headphone jack and a microSD slot, but I'm sure there's still a little more room for improvement before having to change these standards to even smaller or wireless means.It feels nice and durable, but just a touch more dense than I'd like. The glass on front seems nice and tough, scratch and shatter-resistant, and the weight is totally acceptable, but not quite up to the same \"wow, that's so light for how big it is\" standard as the iPad Air, for instance. The only thing I'm not really a fan of with the build quality is the faux leather on the back, not because it doesn't look or feel good, but because it is just too damn slippery. If my hands or fingers are even the tiniest bit damp or sweaty, it becomes a noticeable hassle to hold on to because it will slide between my fingers or down my palm. Not that one should be holding it all the time with wet hands, but it's really touchy in this regard. The glass on front I can totally understand, and again I'm not knocking Samsung's decision on the faux leather; at the very least, it should've had more texture for a better grip.I'm always on top of keeping all of my devices' batteries charged, but this may be the first device that I won't stress over recharging every night. I'm sure sometimes I'll go through the battery in less than a day, but in general I think most people would be fine charging it every other day. The speakers and cameras are fine, not mind-blowing by any means, but not terrible like these devices used to be. Completely acceptable for every day casual use. I do agree with other users that it would have been preferable to have one speaker on the other side for viewing videos in landscape orientation.The speed of the tablet is what disappoints me most. There is so much lag on this device with pretty much anything I do to it that I'm wondering if I happened to get a bad one. I know the processor is plenty powerful enough to handle even the Touchwiz UI that Samsung loads onto it, but it's just not as quick and fluid as I had hoped. Yes, it's far and away faster than most things out there up to this point, but my S4 with CM flies circles around this thing (no, I haven't overclocked it or anything, they're both running stock hardware). I see slight delays with pretty much anything I do to it, even just scrolling between home screens or the app drawer. One of the worst cases is moving from a home screen page to the Samsung Magazine page - there's a solid second delay. Am I being a whiny, spoiled brat complaining about this minor inconvenience? Sure am. Is it warranted given market expectations and its price point? Absolutely.I'll reiterate here that I'm being particularly harsh with my analysis, and I think it would be unlikely for most consumers to have a less positive experience than mine. It really is a fantastic device, and I expect it will be the one I turn to for most activities, over my phone, laptop, and desktop (all of which are wonderful in every regard and less than a year old). I'm going to give it some time to see how it fares as a laptop replacement for most daily activities, and I expect it will step up to the job just fine. But it's not perfect. I suppose there will always be room for improvement, and I would give it a 4.5 out of 5, or a 9 out of 10 rating if the option were there, but I just can't quite convince myself to give it the highest score. I'll update as necessary, and please feel free to send any questions or comments you may have about my opinion and I'll happily answer for you!", "Date": "March 16, 2014"}, {"Title": "Excellent Tablet", "Author": "derek duncan", "ReviewID": "R6RCBL1I10TJO", "Overall": "5.0", "Content": "I picked up the Tab Pro on Thursday. Let me just say, the display on this thing is far and away the best display I have seen on any device I've ever used, included the iPad Retina's!Not only is the resolution very high, but since the tablet is 8.4\", the PPI is very dense as well. I'm not sure the exact number, but it's the best I've seen.The speakers are also surprisingly terrific. They are loud and clarity is good.I really enjoy the extra features on the tablet like the Multi-Window mode where you can view two apps on the screen at the same time. Small apps like the Calendar app and Email app are very good as well.I am happy that Samsung finally ditched the menu button on this tablet. It now adheres to more of the Android guidelines, although still have physical keys instead of on-screen keys. That's ok though, I think people have grown to like the physical home button.I don't use Samsung Voice or some of the other Samsung apps, but it has the full Google Play services which includes the terrific Google Now experience. The apps on the Play Store rival and in many cases, surpass those on the Apple App Store.The only thing average on this tablet is the price. At $399, you can get a great little 7-inch tablet, the Nexus 7, for only $229. However, I feel that the 8-inch form factor is perfect, and the resolution on this Tab Pro 8.4 is nothing short of breathtaking.What a great tablet.", "Date": "February 19, 2014"}, {"Title": "Impressive HD screen - Perfect for entertainment", "Author": "Tenny Sin", "ReviewID": "R25AUXAN18P2PT", "Overall": "5.0", "Content": "I enjoy the super clear HD screen with a resolution of 1600x2560 pixels. I like the image quality of the 8MP central camera with autofocus, flash.  We watched some online video YouTube, MLB.com on the Tab Pro 8.4-Inch , we enjoy the clarity of the screen and the speed of the 2.3 GHz Quad Core Processor. I read the specification, it is Corporate E-mail/Calendar/Contacts Microsoft Office compatible. I am ready to try Outlook E-mail on my Galaxy Tab Pro.", "Date": "May 8, 2014"}, {"Title": "love!!", "Author": "root", "ReviewID": "R24V5RGR688ON2", "Overall": "5.0", "Content": "I've had most of the tablets and I switch frequently.  I have managed to keep this one the longest and I am still in love with it.", "Date": "May 5, 2014"}, {"Title": "Enjoyable Tablet Experience", "Author": "FSJUNKIE", "ReviewID": "R5LVE2L0GMY3L", "Overall": "4.0", "Content": "I've had all versions of the iPad except the iPad Air. I've had both years of the Nexus. I've had a Toshiba Thrive. This Galaxy Tab Pro 8.4 is the blend of features and usability that I was looking for. Nice display. Nice size. Expandable Memory. Smooth operation. Responsive digitizer. The only thing that I would have liked to have had is an S-Pen...like I have on the Galaxy Note 3. If that's an important feature for you, then consider the Note series tablets.One thing that irks me about this product is the short USB cable...it's like 2ft. Did Samsung really save that much money by including such a ridiculously short cable? Makes no sense whatsoever.", "Date": "May 5, 2014"}, {"Title": "Excellent tablet.", "Author": "Batou", "ReviewID": "R1NUZIW44YG80D", "Overall": "5.0", "Content": "Bought this to replace a nook Hd+ I hard bricked. So far it has been great. I did not want to downsize from 8.9\" to 8.4\", but I really find the size ideal. It's not too bulky and the resolution is amazing. The storage and speed are great. I have not found a reason to have to root it yet which is the first thng I did with my Lg F3 and nook. I popped in a Sandisk 64gb sd card without issue. Battery is reasonable. My only real gripe is a limitation with A2DP bluetooth, which prevents mirroring a phone with your tablet, but this is a general Android limitation.", "Date": "May 2, 2014"}, {"Title": "Fast and the perfect size.", "Author": "M. Kaplan", "ReviewID": "R34TGPHMDX9ZG1", "Overall": "5.0", "Content": "I'm love my new Tab Pro 8.4. It is the perfect size and it is very fast. It performs great. It also interacts well with my Samsung s4 phone and Samsung Smart Camera.", "Date": "April 1, 2014"}, {"Title": "Brilliant display, solid value", "Author": "Rob", "ReviewID": "R2D77ZH00B3R1T", "Overall": "5.0", "Content": "I received this item on 3/26/2014 and so far there's much to like.  The display is brilliant, the CPU is fast.  As perspective for my review, I have a Galaxy S4, so the Samsung style is very familiar to me.  I know there's been much said about the Magazine UX, but I actually like it.  But if you don't, you can easily hide it, and use custom pages like any other Android device.  I have a blend, some Magazine elements, and some I custom created. Having KitKat is a nice perk, I like a few of their improvements, particularly with email.  Overall a very solid device, the only real drawback I've noticed so far is the auto-dimming display just really doesn't work right.  On my Galaxy S4, it is terrific, it is exactly the brightness I need it based on current lighting conditions.  On the Tab Pro, it is way too dim.  In a completely dark room, I can barely see the screen.  Obviously manually setting the brightness alleviates this problem.  Just odd that the S4 does it so right and this does it so wrong.  I don't have much experience so far with battery life, seems to drain pretty steadily with video,  but it does seem to sleep very well (overnight it lost just 2% of it's charge while on with Wifi enabled.)Summary:Pros: Gorgeous display, fast CPU, expandable storage, KitKatCons: Auto-dimming display isn't good, retrieving \"extras\" isn't as intuitive as it should beNeutral: Magazine UX, battery life", "Date": "March 27, 2014"}, {"Title": "Took some time", "Author": "Charles Rivers", "ReviewID": "R1DIAYH1T8D543", "Overall": "5.0", "Content": "I've been using an iPad one, and an iPad two, but decided to get something smaller, and the option to use a 64GB SD card sold me.It took some time comparing this unit to my wife's new iPad air, but I really have come to love this little tablet. And after copying some movies i burnt in Cucusoft, I'm very impressed. My iTunes movies won't play on it though, but that's cool.", "Date": "March 23, 2014"}, {"Title": "the best android tablet available", "Author": "seon", "ReviewID": "R1BJPYRTVV2L8R", "Overall": "5.0", "Content": "Phenomenal screen, fast processing speed, very useful multi-tasking feature , ample battery life, tons of interesting features and perks, highly customizable, good speakers, good weight. Only downside is its price. Overall, my wife and I are very satisfied with this product.Note: In order to receive perks, register your device at the samsung website.  Google \"register galaxy tab pro for perks.\"", "Date": "March 19, 2014"}, {"Title": "Highly recommended", "Author": "Cr Nagelschmidt", "ReviewID": "R34R4IWDWIOACA", "Overall": "5.0", "Content": "Awesome product!  Fantastic screen. very stable Android implementation, mirrors my Galaxy s4 and more seamlessly.  Best of class, a bit pricey but worth the small incremental when you consider all the features.  Battery life better than expected and better than the reviews.", "Date": "May 11, 2014"}, {"Title": "Best mini tablet ever!", "Author": "Amazon Customer", "ReviewID": "R1UJN7ANOI5J2F", "Overall": "5.0", "Content": "Best mini tablet ever! I have the iPad mini & Kindle HDX 7, but the tab pro is my favorite! So fast & it does so much more...Love it!", "Date": "March 21, 2014"}, {"Title": "Very nice", "Author": "Brian", "ReviewID": "R2FCRHA4FBLTV2", "Overall": "4.0", "Content": "The screen is truly beautiful. I think this size hits the sweet spot.  10 inch feels too big and a little awkward to hold, 7 inch is hardly an upgrade from my smartphone. Also, the multitasking is actually useful and usable.", "Date": "February 23, 2014"}, {"Title": "Awesome first tablet", "Author": "chr0nix", "ReviewID": "R2INJ1G4MWJMPT", "Overall": "5.0", "Content": "Amazing tablet. Disable the Samsung touch wiz launcher by installing Nova Launcher or Google Now to make it fly. 8.4 inches is the sweet spot for tablets.", "Date": "February 22, 2014"}, {"Title": "Pros and Cons", "Author": "James Foldenauer", "ReviewID": "R20OAMGN2MOU5Y", "Overall": "4.0", "Content": "I choose a 4 out of 5 rating because there is some pros and cons to this Samsung Galaxy Tab Pro 8.4. First, I will explain the pros of this tablet. The Samsung Galaxy Tab Pro 8.4 has a nearly 2k with a pixel density of around 350, the highest in the market. The performance is outstanding as I would get a score around 23,000 in Quadrant Standard Benchmarking test (similar score to Galaxy S5). Finally, the tablet is light and thin that makes it more portable. Next, I will explain the cons of this tablet. The cost of this tablet is $399, which is expensive for some people to purchase. The speakers is not the best, it gets the job done but the quality is low comparing to other tablets. Finally, the battery is not the best according to the comparison. The specs on the Samsung's official page shows the internet usage of 10 hours, music for 126 hours, and watching a video for 12 hours. With these pros and cons, I would still recommend this tablet to users that is in interest of getting a tablet.", "Date": "June 9, 2014"}, {"Title": "Really good", "Author": "Pedja", "ReviewID": "R1N6CHO7OB5XKG", "Overall": "5.0", "Content": "Display is amazing! Colors and resolution are awesome! It`s really fast due to its 2.3 GHZ CPU, and It`s really light which is perfect for gaming and watching videos. Sound is good and it`s pretty loud. Battery life is really good. It can hold up to 8-9 hours if it is heavily used (games for hours + facebook + internet surfing + youtube). Under light use ( a little bit of games, FB, email, youtube) it holds up to 3 days.I disabled most default applications. For example Samsung magazine is boring and annoying. I can browse fun stuff my self using dolphin player and youtube. Also Google chrome does not support flash player (hacked version for kitkat) and its slow. Magazine and other default apps I never use just reduce battery life, slow down tablet and take up space. Rooting the tablet would probably be the best solution.", "Date": "May 27, 2014"}, {"Title": "Awesome", "Author": "Vincent Kruzel", "ReviewID": "R2AVTZYVU9YMXL", "Overall": "5.0", "Content": "Excellent tablet for my needs. I use it every day. I bought a gum drop cover for it to protect it.", "Date": "May 17, 2014"}, {"Title": "Love the galaxy tablet!", "Author": "sherry jacobson", "ReviewID": "R1GUPL7WCI3YO6", "Overall": "5.0", "Content": "Easy to use and so very light for traveling. Great for business and organizing both your personal and professional lives", "Date": "May 4, 2014"}, {"Title": "Tab Pro 8.4", "Author": "Velociphile", "ReviewID": "R2C0B8TQRHW10", "Overall": "4.0", "Content": "The display's, color, clarity/resolution are phenomenal! Combine that with the power of this tablet they are the main reasons I decided to finally purchase my first tablet which I used to replace an aged laptop.I love the size, fits great in my hand, I really enjoy reading and watching videos on this tablet.I do have issues with the WIFI constantly scanning and occasionally dropping off due to some error which is only fixed by turning the tablets wifi off then back on.I wish it had the indicator LEDs for charging or email/messages like my phone does.", "Date": "April 19, 2014"}, {"Title": "amazing", "Author": "Robert Olmsted", "ReviewID": "R16Z6L48GQV591", "Overall": "5.0", "Content": "I have both the 8.4 and 12.2 and i can't say enough about them if your sitting there scratchingYour head about them stop and get either one of them or in my case get both you won't go wrong", "Date": "April 17, 2014"}, {"Title": "Better then all the rest", "Author": "LHoskins", "ReviewID": "RPHV137TI2ZAO", "Overall": "5.0", "Content": "The Samsung Galaxy Tab Pro 8.4 is hands down the best tablet that I've ever owned it's lightning fast has a great display perfect for professional users like myself and those people who just want the best 8.4 tablet around okay one con it's like four hundred dollars but it's 369.00 now every where, do yourself a favor buy it buy it buy it you'll love it love it love it! I'm done!", "Date": "March 30, 2014"}, {"Title": "Great tablet", "Author": "Nick", "ReviewID": "RWL52CRFB3XLD", "Overall": "4.0", "Content": "I love my 8.4 pro. It is a bit pricey compared to other tablets, but it is way faster, the screen is beautiful, runs apps quickly, surfs the net like a pc, and I popped a 64gig card in it and it uses it effectively. So I got a high end tablet with 80 gig for $399. Not easy to do if you are looking at IPADs. And this thing compares well with IPAD. For me the size is perfect too. I fly a lot and watch movies. The 8.4 in screen is big enough to enjoy movies but small enough to fit in my brief case or use in my hands. Sure beats watching the movies on my phone. Yes the battery life maybe only five hours instead of 10 but that is plenty for me and it still goes for one or two days if I am not using it to constantly watch movies. Also the infrared remote and online TV guide is awesome too. I travel between two places and it let me set up seperate rooms so I can use it in NH and FL. One reviewer rejected it altogether becasue of the limited power  and I think (s)/he was an IPAD snob just looking for excuse to put down machine. I did take away one star becasue of the limited power, but am glad I spent the money on a pro instead of the regular tablet. I also have an IPAD 2 for my wife who doesn't mind it being slow but I can tell a big difference. You can even use the usb port to read from flash drives so you really have a lot of storage capability if you need it and with my movies and music I need it.  I installed Amazon mobile app and get free apps of the day which also eat up space but are a lot of fun to try.", "Date": "March 28, 2014"}, {"Title": "Best tablet I've owned yet", "Author": "Jeffrey Olsen", "ReviewID": "RHBE88SKKHOQC", "Overall": "5.0", "Content": "I've had 3 android tablets, Surface RT as well as Pro and the Galaxy 8.4 is exceptional, Samsung continues to impress and exceed my expectations each time I buy one of their devices. This tab is blazing fast, picture quality is next to none. The form factor is perfect which allows you to type with two thumbs. The only downside I see thus far is it gets slightly warm with heavy use but that is expected with something this fast.", "Date": "February 24, 2014"}, {"Title": "Better than my Nexus 7!", "Author": "KingNigel", "ReviewID": "R3N9BCNBX7V8VN", "Overall": "5.0", "Content": "This tablet is awesome. I'll just go ahead and list the pros and cons..Pros:Great screenComes loaded with features to make up for high price. (Dropbox, Google play credit, etc)Good standby timeHaptic feedback/vibration (something the nexus 7 lacks)Feel in the handCons:-Camera. Now I know most people are thinking \"Who cares about camera quality on a tablet?\". Well, taking away the camera completely could have saved $50 on this product and made it competitively priced.-Speaker placement. In landscape mode, your hands will cover the speakers a bit. Although I don't get irritated by itI recommend this tablet for everyone! No matter how simple or big your purpose is. Not usually a big fan of Samsung and Touchwiz, but I'm 100% satisfied with this purchase.", "Date": "April 19, 2014"}, {"Title": "The Good, The Bad, and The Ugly...", "Author": "Anthony", "ReviewID": "R39G03LPPQVJI4", "Overall": "3.0", "Content": "The Good:Screen size, processor speed, and balance/weight distribution. The Battery life is about 5 hours or so which isn't that great but isn't that bad either. A little better than Nexus 7, I think.The Bad:The home button and touchable back and application keys are in the worse possible area as with the sound. Your hand is literally covering up the sound a lot of times (which gets muffled really bad if you don't watch yourself), accidentally hitting the touchable keys, and it wasn't design with landscape in mind even though that is how you would use it a lot of times for games. Also, hate the Magazine UX that you can't disable or uninstall and even if you replace it, it's still integrated so deeply into the system that it uses resources.THE UGLY:You have a 16 gigabyte hard drive but 4 gigs is used by the system and then maybe another gig or so in bloatware, so you are left with about 11 gigs for yourself.What makes me annoyed even more is the SD card slot doesn't transfer all of the apps to it, most of the application size is stored on the internal memory still and only resources seem to be installed on the sd card which is less than 20 percent of the application in games.For example: The Squid 1 game is about 400 MBs but only like 60 MB is actually put onto the card.So your memory gets eaten up just as fast on the internal while your external SD is overflowing with memory. Sigh.What's more annoying is the ram the system/bloatware uses is about a gig and a half out of the 2 gigs: so you are left with about half a gig or about. Most of the time my ram memory is about 80 percent used with just a few apps opened.So, to sum it up, you are left with a device which is really 11 gigs of usable hard drive space, half a gig of usable ram or around 800 megabytes, and has a lot of bloatware which Samsung denies you from removing. You have the keys in the wrong areas, applications can't be installed on the SD completely and most of the application data is on the internal anyways, and you probably are going to have to juggle apps by installing and uninstalling them from google play at some point.I almost want to return it but it's not that bad of a device: just feels like it was made lacking on purpose outside of specs which would get people to buy it but who knows.Take care,", "Date": "February 24, 2014"}, {"Title": "My First Tablet", "Author": "Melody M.", "ReviewID": "R29UBMA6TRX2SD", "Overall": "5.0", "Content": "I don't usually write reviews, I just read them because when I think about buying a product, I really want something worth purchasing, especially for the price, and something that I at least think will last me a while. I am very careful with my electronics because they can be really pricey. I read and watched every single review I could find on youtube, google, amazon, etc. to help my decision about whether to buy an iPad, Nexus, Samsung or a Kindle. I'm sure its pretty obvious that Samsung Galaxy won my vote.  Although, there are some cheaper brands out there, I want a good and solid tablet. Tab Pro has been really good for me so far.  I haven't had any regrets yet and if you ask my husband, I do have regrets from time to time when it comes to my purchases.  I always go to Amazon first when it comes to buying products because they always offer great prices and it arrives fairly quick and in good quality.", "Date": "May 15, 2014"}, {"Title": "LOVE SAMSUNG", "Author": "Vanessa Waller \"book luva\"", "ReviewID": "RNI2QFRCAHU6M", "Overall": "5.0", "Content": "I love this tablet.  It has everything you need to do on the run.  you can't go wrong.  A must buy.", "Date": "May 12, 2014"}, {"Title": "Better than Retina", "Author": "Bill Blackburn", "ReviewID": "R2CJVP0R22RQ5D", "Overall": "5.0", "Content": "Wow, what a bright, sharp & beautiful display!  359dpi; way better/sharper resolution than Apple's best Retina offering on any device they make.  And bright; I can read it outdoors on a sunny day (not that I do that much).  The Tab Pro 8.4 is faster than my wife's older Tab 2 7.0\" & my buddy's iPad 2.  This is especially noticeable when surfing the web.  One complaint that actually applies to all tablets I've looked at, the rear/main camera resolutions are typically lower than current smartphones.  This one has an 8MP main camera, while my Samsung Galaxy Note 3 (bought Oct'13) has a 13MP main camera.  Enjoy . . . :-)", "Date": "May 8, 2014"}, {"Title": "Great Tablet with some quality control issues", "Author": "Kevin T", "ReviewID": "R1ITPE43HSL46C", "Overall": "5.0", "Content": "1st tablet I received from Amazon had speakers that made a low muffled crackling sound while volume was muted.  Replacement tablet from Amazon worked perfectly.This is the best screen you can get on a tablet, and 8.4\" is the perfect size, and weight.The only negative is the Samsung bloatware and Touchwiz/Magazine launcher, which has some noticeable lag.I installed the Google Experience launcher and now the tablet is perfect.  It's like a premium Nexus device with a bigger and better screen.", "Date": "April 25, 2014"}, {"Title": "Fantastic tablet.", "Author": "lily", "ReviewID": "R18UT8B2X2UKNV", "Overall": "5.0", "Content": "I've had this galaxy tab pro 8.4 tablet for a week and it is the best I've ever had!!  The screen is so clear and crisp, it is lightning fast, I like the new magazine format, and the battery life is great.  If you don't want to use the magazine format you don't have to, the home page is the regular android that we are use to.  I just love everything about it.  Samsung has out done itself in my humble opinion.  I have used the the Samsung tab 8, the nexus 7 2013, and the Kindle Fire HDX, and this new Galaxy is by far the best!  The faux leather back is very nice, very soft feeling.  It is very light to hold, no hand cramping.  The price is a bit high, but in mho worth every penny.  I say go for it, you will be amazed!!  As usual ordering it from Amazon was great, it arrived in 2 days with prime, and packaged perfectly.  Enjoy!! Should add one more important point....the battery charges very fast...within about 2 hours!!  WOW!!", "Date": "March 10, 2014"}, {"Title": "Love it.", "Author": "A. Edmonds", "ReviewID": "R147ZKTHQ33LN2", "Overall": "5.0", "Content": "Love It. Great for all my e-reading and other computing. Perfect size for traveling. Battery is reasonable. Recommend to anyone that loves to read books.", "Date": "June 12, 2014"}, {"Title": "best tablet out there.", "Author": "andrew", "ReviewID": "R2O7NMQDMERPKC", "Overall": "5.0", "Content": "Been looking for a tablet to use so my phone doesn't die from using apps all day. I got this in perfect condition not damages in package. Once turned on it just amazed me. Picture and color quality is amazing and so is the speed of the tablet. It is the perfect size for a tablet. Best works with a case the will tilt in landscape and portrait modes.", "Date": "June 10, 2014"}, {"Title": "Great Buy", "Author": "Sharon", "ReviewID": "RBZP1B77XFXUA", "Overall": "5.0", "Content": "Lots of bells and whistles...Can't wait to do more surfing and get more use...Glad I decided to buy...I'm enjoying my purchase!", "Date": "May 19, 2014"}, {"Title": "Perfect companion to Samsung Galaxy S4 phone", "Author": "James", "ReviewID": "R1OZZF6WHVKBAN", "Overall": "5.0", "Content": "Pros: Good size tablet; fantastic image. Easy to set up, especially if you're comfortable with Android.Perfect companion to Samsung Galaxy S4 phone. Apps purchased through Amazon and Google Play don't have to be bought twice.Cons: WiFi reception is a little weak; dropped connection that was steady on S4. No other complaints.Overall: Highly recommended.", "Date": "May 19, 2014"}, {"Title": "fun", "Author": "Charles Dunnewind", "ReviewID": "R1I59WGL1V04GG", "Overall": "4.0", "Content": "Works well and does what I thought it would do. Size is good. Easy to use and understand. Battery runs out with some use, sooner that a ereader", "Date": "May 18, 2014"}, {"Title": "just plainly love it", "Author": "Snakeyees", "ReviewID": "R1IVTLDV7K16CJ", "Overall": "5.0", "Content": "the screen is so clear it's beautiful, everything I throw at it applications it runs flawlessly no lag very happy just wish I could afford is a bigger screen", "Date": "May 11, 2014"}, {"Title": "excellent device", "Author": "Guillermo Ascanio", "ReviewID": "RZLUD6YSFIEKJ", "Overall": "4.0", "Content": "I thought this tablet had an option for 3g it doesn't but still is a very good device. I fully recommend it.", "Date": "May 4, 2014"}, {"Title": "Tab Pro 8.4", "Author": "c®c_31", "ReviewID": "R4N4K9SI0IHWH", "Overall": "5.0", "Content": "I really loved my Tab Pro 8.4 since the day I got it from our local supplier.Stunning screen display.Highly Recommended buy!", "Date": "May 1, 2014"}, {"Title": "Love it. !!!", "Author": "Mafalda Quinn", "ReviewID": "R3R5YCYMV6QJA0", "Overall": "5.0", "Content": "I have an 8\" galaxy note, and this one is an improved version, fast, glorious screen, decent camera. I only miss the stylus.  Very happy with it.  And i know that if they come with a new Note version  of this Pro, will get it too..", "Date": "April 29, 2014"}, {"Title": "Just Right", "Author": "aqualeo", "ReviewID": "RVFM67N1UCEJV", "Overall": "5.0", "Content": "This has everything I wanted in my new tablet.  Not too big nor too small, the size is perfect for me.  I also like that Samsung has its own store for purchasing apps.  I'm very happy with my purchase.", "Date": "April 27, 2014"}, {"Title": "Amazing Tablet!", "Author": "C. Stence", "ReviewID": "RMV5R1MJATDTC", "Overall": "5.0", "Content": "I did a lot of research before buying a tablet - I settled on this despite the somewhat \"higher\" price compared to what's out there. TOTALLY WORTH IT! The interface is beautiful, intuitive and smooth as silk right out of the box. The Samsung \"skin\" doesn't appear to slow things down at all and is quite helpful. It also doesn't limit usage of standard Android features or access to Google Play. In fact, it seems like all the added perks and bonus that Samsung added are outstanding! I still haven't finished finding all the goodies that Samsung has added to this perfectly sized tablet. Way to go Samsung!", "Date": "April 22, 2014"}, {"Title": "So far so good", "Author": "scott collins", "ReviewID": "RX7PUUROFCKFK", "Overall": "4.0", "Content": "I am pleased with this product so far. The speed is good. The apps work well so far. I love the remote pc app.", "Date": "April 20, 2014"}, {"Title": "Galaxy 8.4 is awesome!", "Author": "Craig Durrell", "ReviewID": "R2YZ6UH4T2NBTM", "Overall": "5.0", "Content": "The screen is amazing!  In the brightest sunlight,  it's beautiful and easily readable.Gaming is pushed to new levels of speed thanks to the Snap Dragon processor.When used in the panoramic mode my right hand covers the two speakers sometimes.  I hope the next new model places them in a front facing location.The 8.4 Galaxy Tab is well made, useful for hours (9+), and I am very pleased overall.The informational booklet is worthless however.  Fortunately Youtube is your friend and that's where I learned most of it's operation.", "Date": "March 30, 2014"}, {"Title": "AWESOME!!!", "Author": "S. Curtis \"Peek lover\"", "ReviewID": "R2QBMMO6H60X2", "Overall": "5.0", "Content": "Samsung never lets me down and hasn't started yet. There is a learning curve, but the display is AWESOME!!! Also can't figure out how to make the weather icon smaller, it's like half the screen but I'll figure it out.", "Date": "March 29, 2014"}, {"Title": "First Impressions", "Author": "Molly", "ReviewID": "R7BSK15D5SGFP", "Overall": "5.0", "Content": "I really like this tablet. The display is bright, and the text is sharp. It is a nice device for older folks, because Samsung software has a user friendly feel. You can customize the setting with ease.I don't want to come out with a list of negatives. I am just wonder where are the good quality cases for this device like the \"Snugg\".", "Date": "March 11, 2014"}, {"Title": "My first tablet", "Author": "Bottleofwhat", "ReviewID": "R1YZKTTDTAGRQ1", "Overall": "5.0", "Content": "And I am satisfied with my purchase. The main factor that decided my purchase was the fact that this is the latest and best in the tablet arena. Although there are obviously lower price points to jump into the tablet game, the Tab 8.4 feels like premium hardware at a time where most other tablets are nearing their end of life cycles.Observations: The multitasking is great although still hiccups at times, hoping a software update or android development smooths it out.Samsung also needs to come out with better protective cases for their premium devices at time of launch, what is currently out there is lackluster.", "Date": "March 11, 2014"}, {"Title": "Great product, but slightly pricey", "Author": "C. Suan", "ReviewID": "R1KIZPSVLPN3IQ", "Overall": "4.0", "Content": "This is my second tablet, 1st one was ASUS TF300t, but spoil by my kid after dropping from staircase.After using for a month, below is my summarize:Battery performance:The full charge battery is sufficient for my daily activity, I average spends 3hrs reading & surfing, while 2hrs for gaming. It usually drop to 20-30% before sleep and i left it charge for overnight. Once I encounter the battery indicator stagnated at 100% after 5hrs usage, but after reset, the indicator back alive. Another incidence was the battery didn't get full charge, it always goes saturated after 61%. After refix my 2 pins power plug from wall, the problem resolved, suspect due to bad contact.WIFI signalThe signal sense is strong. Even i get 1 bar of signal, it still load webpage faster than my old TF300t. But for Splashtop (i use it to remote my desktop), not sure why the display will hang after 30sec but sound still continue, I don't face that issue with my old tablet.Graphic, display, Sound & CameraThe high ppi make the 8.4\" display clearer. It out perform my old 10\" tablet. There is some lagging on Dragon Age game, not sure is that cause by graphic limitation or CPU performance issue. Sound quality is average. The camera quality is below average.", "Date": "May 7, 2014"}, {"Title": "couldn't be happier", "Author": "R. Kaur \"Sheena\"", "ReviewID": "R28C9GRX9NV8GW", "Overall": "5.0", "Content": "My brother got this tab, and he loved it so much that he even changed his iPhone to a samsung galaxy. The tab is very light and much more useful compared to an iPad.", "Date": "May 3, 2014"}, {"Title": "WIFI issues", "Author": "R1", "ReviewID": "R230X9ZDYE15AH", "Overall": "3.0", "Content": "The first thing I noticed is the WIFI seems to have problems staying connected.  We have other Smart Phones and tablets that have no issues staying connected to the same networks.  You can search the net and find others that have also noticed this.  Question is, is this a hardware issue or something that can be fixed by a software push.", "Date": "April 13, 2014"}, {"Title": "Buy It Buy It Buy It!!!!!!", "Author": "Mallory Olsen", "ReviewID": "R2W1E6ZM469XD7", "Overall": "5.0", "Content": "Love it!  Gorgeous piece of tech. Light weight, sturdy, fast response, brilliant screen (even at half brightness).  I'm a musician, I use my tablet for work and play.", "Date": "April 4, 2014"}, {"Title": "Not as small as I thought", "Author": "My Fake Name", "ReviewID": "R2GBQ9CGC2J9ZV", "Overall": "5.0", "Content": "*****I had gotten used to an Android 10.1-inch tablet when this product arrived, the Samsung Galaxy Tab Pro 8.4-Inch Tablet (Black).  I assumed I would be disappointed by the smaller size, which according to my simple math is 16.83% smaller.  Although that's a considerable difference in sheer screen size, it seems to be made up for by the extreme clarity and brightness of the display.There are many times I need to zoom in and back out using the product under review, but that was the case no less often with the 10.1-inch model.The Tab Pro 8.4 can be held portrait-wise in most people's hands.  My 10.1-incher can be so only just barely and then only if you have larger than average sized hands and only then if you take a break every so often.  The 8.4-incher can fit in more places such as pockets in clothing or pockets in a handbag than the 10.1-incher, i.e., it is more portable.For this, compared to my only other tablet, I add one star to five.You will probably want to add a micro SD card, which can range up to 128 gigabytes.  The unit comes with 16 gigabytes of internal memory, of which maybe 11 are free, which isn't a lot.  If you don't intend to add many apps or music or photos or any other space-hogging things, then maybe 11 gigs are enough for you, in which case ignore the first sentence of this paragraph.  You don't have to decide right away; just keep an eye on how much free space you have in internal memory, and if it gets too small then buy an SD card.  If Moore's Law is correct, and it has been for quite some time, the longer you wait to buy storage space such as a micro SD card the cheaper it will be.*****The device does not, repeat not, have a telephone in it.  If you say to it, \"Call work\" or \"Dial work\" or \"Call [ . . . ]\" (not my real work number) it completely and totally ignores you.  I mean 100%.  No flashing light, no confirming beeps, no matter how plainly you speak and no matter how directly into the microphone.  Even if you shout, which disturbs people sleeping nearby, for which I subtract one star from six.  There is no keyboardly way to make an outgoing call either.  I swear.  As to incoming phone calls I have never received any whatsoever that I know of.  Sometimes I think maybe I received one and I shout at the tablet, \"Accept\" or \"Answer\" but nothing ever happens.  Based on this evidence I conclude the Samsung Galaxy Tab Pro 8.4-Inch Tablet (Black) really does not have a telephone in it.  The evolution of some smartphones' getting bigger and some tablets' getting smaller will surely eventually intersect in a perfect size or two, and I think it will be just about around this size.  A fully operational tablet with a telephone in it is what I want.*****The product under review underwent unusual tests at my hand I thought you'd want to know about.  First, it will not survive a drop onto concrete from a height of two smoots; thereafter it did not start.  Second, it will not withstand being left out in my back yard in the rain and snow for a winter; thereafter it did not start.  Third, it will not tolerate being attacked dead center by a .22-caliber rifle round and then by a 20-pound sledge hammer; thereafter it did not start.Still, I find this to be a wholly satisfactory tablet, not as small as I thought it would be, if you remember what I mean.  The sum total after adding and subtracting various stars is five.  The product delivers what it says it will, and if the size is right for you then you should buy it.*****", "Date": "March 22, 2014"}, {"Title": "the best", "Author": "Greg", "ReviewID": "R33M00T83AB4AT", "Overall": "5.0", "Content": "Great display, lots of features need time to process all the features.Was going to purchase a cheaper version but changed my mind. The display is a perfect size for my old eyes!Samsung has always been the best choice for me,never disappointed.", "Date": "June 5, 2014"}, {"Title": "Misleading Product Description", "Author": "Tracie E.", "ReviewID": "R8OE04S4MWUV8", "Overall": "3.0", "Content": "The tablet itself I totally love. I purchased this model as it was a lot like my Galaxy phone, and the controls are about the same. Also comes with KitKat OS which was a plus. Only comes with 16GB of memory, so if that's a big deal for you, you may want to spend the extra $50 to upgrade to the 32GB.My only gripe is that in the product description, Amazon made it sound like a lot of perks came with it. Such as a $25 Google Play Credit, Hulu Plus, and GoGo Inflight Wifi.  This greatly influenced my decision to purchase this model, as it made it sound like an even better deal. Sadly, it did not come with these perks. You could only get them from signing up with Samsung Perks, and even then Samsung did not offer them.So I would say the tablet is great, but don't let the product description fool you or influence your choice.", "Date": "June 5, 2014"}, {"Title": "Not entirely multilanguage", "Author": "Cyrius Almeida", "ReviewID": "R2C3Y3I9CIALM1", "Overall": "4.0", "Content": "i love the tablet and all but i thought it was multilanguage. as i turned it on, i noticed that it didnt have brazilian portuguese as a display language. i hope samsung fixes that in a near future so my wife can be happier with it :)", "Date": "June 4, 2014"}, {"Title": "Galaxy Tab Pro 8.4 a Winner", "Author": "Bill", "ReviewID": "R17XJED3EQ033G", "Overall": "5.0", "Content": "This is a fantastic device and rates 5 stars.  I highly recommend it.  The only thing I can't do with it is make a phone call, which is just fine.  It is light weight and very powerful.  This is a must have device.", "Date": "May 27, 2014"}, {"Title": "tab pro 8.4 is a beast", "Author": "Rob", "ReviewID": "RRB7QLRGQ5ZH1", "Overall": "5.0", "Content": "This is the most amazing tablet I've ever owned. It is fast and it feels great in the hand. The size I think is perfect, portable yet productive. 3 thumbs up.", "Date": "April 23, 2014"}, {"Title": "Love it, Love it, Love it", "Author": "Albert Tuten", "ReviewID": "R2YPA5BELEFAL9", "Overall": "5.0", "Content": "Those were the words my wife said to me as I gave her birthday present a little early.  It does more than she will ever learn to do.  I love it too, when she lets me get my hands on it.  I've held it twice in 45 days.  Great job Samsung!!", "Date": "April 18, 2014"}, {"Title": "Amazing Device", "Author": "Bader alqahtani", "ReviewID": "R36W7UVCJ571Z3", "Overall": "5.0", "Content": "I can said this tab it is the best tab ever i have used itQuality of the material it is excellent", "Date": "April 5, 2014"}, {"Title": "I really wanted to love this, but...", "Author": "J. Robinson", "ReviewID": "R4HV3WFCCA3CO", "Overall": "3.0", "Content": "I can't get over the fact that Google has made it so that Flash no longer works with Kit Kat. I've tried several workarounds, but none seems to consistently work.Maybe it's not fair to lower the rating of the tablet for Google's doings, but...I REALLY wanted to love this over the Kindle Fire HDX 8.9, but I'm finding the HDX more to my liking. I've side-loaded Flash and the Dolphin browser on the HDX and the combination works fast and fine.Update: 04-27-14The tablet has been returned. Having a tablet that won't allow me to access flash just doesn't work for me. If this is the track Google is going to take with Android, then I just will have to stick with my Galaxy Tab 3 8.0 inch tablet for the foreseeable future. I might even consider switching to another platform if flash is available and the battery-life is comparable.", "Date": "April 22, 2014"}, {"Title": "great tablet. great screen size. great performance.", "Author": "Torture", "ReviewID": "R18XNMY26HWAZI", "Overall": "5.0", "Content": "Amazing tablet.The screen resolution is just out of this world.You just need to use a loader to get rid of samsung's customizations. They kill the performance.", "Date": "April 28, 2014"}, {"Title": "Great tablet", "Author": "Amazon Customer", "ReviewID": "R9OUGTTU8UJIU", "Overall": "5.0", "Content": "Has met or exceeded all my expectations about form, function, design, performance, you name it.Have used it extensively for several days and have yet to find a weakness. Love it!", "Date": "March 17, 2014"}, {"Title": "Great Device, but...", "Author": "Tim Oien", "ReviewID": "R2K6E9TR110AG0", "Overall": "4.0", "Content": "For $400 I thought there would be NOTHING wrong with the tablet. The screen is GREAT!!!! Like the size right between a 10 inch and 7 inch. But for $400 the screen is a little unreceptive and the device is hard to hold by itself without a case. Just got my case today so over the weekend was a little pain to use.", "Date": "March 11, 2014"}, {"Title": "Won't Hold Charge", "Author": "Greg", "ReviewID": "RC74UPKRARSN2", "Overall": "1.0", "Content": "I've had this thing six weeks and for the last week, it won't hold a charge.  When plugged in, it won't run, it just displays a charging battery.", "Date": "April 10, 2014"}, {"Title": "It's niiiiiiice, BUT,,,,,", "Author": "doubledeckersoulwrecker", "ReviewID": "R8A62VFJ29RWI", "Overall": "4.0", "Content": "I came from a a Tab 3 8\" and thought this tablet would blow me away, it was nice (like how your mom tells you somethings nice when she doesn't mean it) but was cold, I enjoyed the Tab 3 experience more. Now as I've had it a few weeks, the touch response of the screen has gone nuts and had to send it back to Samsung. So now I'm tabletless... almost 400 bucks and it's in the shop for a couple weeks, b.s. And now I have a S5, from Verizon, and I'm hearing a lot of bad news of the camera shutting down on these. Samsung, if your listening,  q.c,,, quality control", "Date": "April 26, 2014"}, {"Title": "Great Product but Amazon's pricing is misleading", "Author": "eliezer martinez", "ReviewID": "R360MN8X3ZD7D8", "Overall": "5.0", "Content": "This product's retail price is $399 so I don't know where Amazon got a \"list price\" of $479 from. There is no savings don't be fooled. Just walk into a Best Buy with a Samsung Experience Shop in it and buy this amazing tablet today. No need to wait for shipping.", "Date": "March 8, 2014"}, {"Title": "Some good, one really bad", "Author": "wrangler", "ReviewID": "R1NQM65Z35FFLE", "Overall": "3.0", "Content": "Things I love about, things I think they missed the mark, firstly, best screen resolution and pixels on the market,  hands down amazing. No one even come close. It is also very bright, even on halfway,  it has a better brightness they any tab I have owned. 2nd , it is fast. No lag from going from a to b, even with multi windows I use. 3rd, very light...seems to weight nothing, nice to use to take notes or hold for long periods.Ok, on to what they failed on,  and why this will not be my last tab....will most likely get the next Samsung tab when it comes out.The battery is horrible,  seems that I charge it more then I use it, it may have something to do  with the new Samsung magazine UI: I not sure, but I am tempted to try to return the tab because of the horrible battery. Also, it is priced a bit high, should have been a hundred dollars cheap, but I think this has to do more with the horrible battery then anything. Let me say it again,  this has a horrible battery!All in all it is an OK tab, if I had the money I would get the tab pro 10.1 in or the note 2014", "Date": "April 7, 2014"}, {"Title": "Disappointing customer service.", "Author": "Debra", "ReviewID": "R3QX301WY01B1V", "Overall": "2.0", "Content": "I had an Acer A-100 tablet for four years that I loved.  Never had any major problems with it until it started having charging problems.  I went on the hunt for a replacment.  This Samsung was tablet #3 in that search.  I was feeling a litte iffy about it but then used the camera and was in love.  Lots of nice features there, almost worth keeping it.  The display was outstanding, very high def and clear.  It worked quickly, loading  apps, playing music, watching a few movies.  I thought I had  found the replacement for my poor old Acer.  Then we did some travelling and I noticed  that it had trouble working  with wi fi in various locations so I contacted customer  service.  That's when I realized that I did not want to keep it.  Every \"tech\" that I talked  to had a different solution.  One had me do a factory reset (such a pain in the butt), another blamed the wi fi at the  locations I tried.  I couldn't buy that theory because other  tablets I had worked in those places and everyone around  me  seemed connected with no problems.  After about the fourth time of hearing this I asked to be transferred to someone higher up and their solution was for me to send it in.  I said no thanks and returned it to Amazon.Another  word about Samsung  customer service - before I had the wi fi problems I had tried to connect this tablet to a bluetooth keyboard and had tried to print to my Canon cloud printer.  Had trouble with both and both times customer service told me that unless I used a Samsung keyboard and printer I would not be able to accomplish these things.  I feel like their customer  service people must get bonuses if they sell Samsung products while \"helping\" solve problems.", "Date": "April 6, 2014"}, {"Title": "Bloated and Slow.", "Author": "Andrew Sanderson", "ReviewID": "R3RCOXOPWRLZZD", "Overall": "2.0", "Content": "I recently purchased this tablet after reading the reviews. There is a lag switching from screen to screen which I found very noticeable. I didn't appreciate how heavily Samsung customize the android OS making the installed build quite bloated.This tablet wasn't for me and given how expensive it is I couldn't ignore the cons, sadly I am sending the tablet back.I used to use a stock Nexus7 which was very fast and made the switch for the larger 8.4\" screen . I will probably wait for the Nexus 8 or make the switch to the ipad mini retina.My advice, wait for Version 2 of this tablet.", "Date": "March 14, 2014"}, {"Title": "very good", "Author": "onion", "ReviewID": "RR76FPV2J42YU", "Overall": "5.0", "Content": "The screen is very clear, the software runs very fast, photographs with good results.It is very thin, so I'm a little worried about the accident will make my tablet is damaged. So I also bought:. WAWO samsung galaxy tab pro 8.4 smart case. quality is very good. Recommend that you buy", "Date": "March 22, 2014"}, {"Title": "So far so good except........", "Author": "George", "ReviewID": "R1GIT2PR918VIQ", "Overall": "4.0", "Content": "I can't get the micro memory card to stay in the slot without using something like the end of a credit card to insert it all the way until it stays put. It just keeps coming out unless I use something to push if farther in. Maybe my fingernails aren't long enough, I don't know.Anyone else having this problem? Thanks........", "Date": "March 4, 2014"}, {"Title": "it was brand new", "Author": "Janna Bastardo", "ReviewID": "R2LZ1NLRA4BOJT", "Overall": "5.0", "Content": "This item was as expected,  brand new and works perfect. It did not have any scratch or stains, the only thing is that the battery doesn't last long.", "Date": "April 9, 2014"}, {"Title": "IT WAS USED!!!", "Author": "Sam", "ReviewID": "R22C3CMJ9358VK", "Overall": "2.0", "Content": "I received the order in 2 days, which was great, but upon arrival I noticed that it came with a small scratch. No big deal right? I called Amazon and they apologized and gave me a $60 refund.A few weeks later, I was browsing through the contacts and schedule section of the tablet, and I noticed MANY pages where there were unknown e-mails and even phone numbers as well as his daily schedule!!! The previous owner didn't even bother to reformat it!!!It works great, but IF I WANTED A USED TABLET, I WOULD'VE BOUGHT A USED TABLET!!I feel like I shouldn't reach out to Amazon because they already gave me a $60 discount for the random scratch...Very disappointed with this purchase, but happy with the tablet's performance overall....BE SURE YOU GUYS CLOSELY LOOK AT/BROWSE THROUGH YOUR TABLET BEFORE COMMITTING TO KEEPING IT!", "Date": "May 14, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HWMPRNY"}}