{"Reviews": [{"Title": "Great tablet.  Second one to come in wrong color.....Fixed!", "Author": "Scott Thompson", "ReviewID": "R180PYQQOHH0OY", "Overall": "5.0", "Content": "Second tablet I ordered. Arrived on time, but wrong color again. Ordered black, got white. Otherwise, it is a great tablet for a fantastic price.  Many more features and better specs than any other in it's price range. Wifi works very well. Dual cameras a huge plus. Higher res screen makes a big difference. Overall very happy. Second one that came wrong color.  I would have given a 5 rating if not for color issue.  I received an email from the provider within 24 hours of posting this review.  They offered a discount to make up for the mix up in color.  Perfect customer satisfaction move.  I would not hesitate to buy again.  I appreciate that they were concerned enough to contact me and make things right.", "Date": "January 28, 2014"}, {"Title": "Excellent Tablet for all round purpose.", "Author": "rpv", "ReviewID": "R280NV55P4FXWP", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3A218TQFBBZ60embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3A218TQFBBZ60refresh_preplay() {\n\ndocument.getElementById(\"cv_mo3A218TQFBBZ60chiDiv\").innerHTML = document.getElementById(\"cv_mo3A218TQFBBZ60hiddenPre\").innerHTML;\n};\ncv_mo3A218TQFBBZ60refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3A218TQFBBZ60so;\t   \n\n\nfunction cv_mo3A218TQFBBZ60loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3A218TQFBBZ60so = new SWFObject(swfLocation, \"cv_mo3A218TQFBBZ60AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3A218TQFBBZ60so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3A218TQFBBZ60so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3A218TQFBBZ60so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3A218TQFBBZ60so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3A218TQFBBZ60so.setAttribute(\"height\", swfHeight);\n          cv_mo3A218TQFBBZ60so.setAttribute(\"width\", swfWidth);\n          cv_mo3A218TQFBBZ60so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3A218TQFBBZ60so.write(\"cv_mo3A218TQFBBZ60flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3A218TQFBBZ60', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3A218TQFBBZ60';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3A218TQFBBZ60', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3A218TQFBBZ60loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3A218TQFBBZ60\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m37EWSRSZU6FFK\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m37EWSRSZU6FFK\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R280NV55P4FXWP\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m37EWSRSZU6FFK/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3A218TQFBBZ60duration')) {\n      document.getElementById('cv_mo3A218TQFBBZ60duration').style.display='none';\n    }\n    cv_mo3A218TQFBBZ60loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3A218TQFBBZ60loadSwf(movieID, playerVersion) {\n   return _cv_mo3A218TQFBBZ60loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3A218TQFBBZ60newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3A218TQFBBZ60', 0, h);\n}\n\nfunction cv_mo3A218TQFBBZ60resetPlayer(w,h,bw,cc) {\n  cv_mo3A218TQFBBZ60newHeight(h);\n\n  cv_mo3A218TQFBBZ60so.addVariable(\"resetBandwidth\", bw);\n  cv_mo3A218TQFBBZ60so.addVariable(\"cacheCode\", cc);\n  cv_mo3A218TQFBBZ60so.setAttribute(\"height\", h);\n  cv_mo3A218TQFBBZ60so.setAttribute(\"width\", w);\n  cv_mo3A218TQFBBZ60so.write(\"cv_mo3A218TQFBBZ60flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3A218TQFBBZ60RollOverImg = new Image();\ncv_mo3A218TQFBBZ60RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81SkWokK1%2BS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3A218TQFBBZ60preplay = document.getElementById('cv_mo3A218TQFBBZ60preplayImageId');\nif (cv_mo3A218TQFBBZ60preplay) {\n  cv_mo3A218TQFBBZ60preplay.onmouseover = function() {\n    cv_mo3A218TQFBBZ60preplay.src = \"http://ecx.images-amazon.com/images/I/81SkWokK1%2BS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3A218TQFBBZ60preplay.onmouseout = function() {\n    cv_mo3A218TQFBBZ60preplay.src = \"http://ecx.images-amazon.com/images/I/81SkWokK1%2BS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3A218TQFBBZ60preplay.parentNode;\n\n  var cv_mo3A218TQFBBZ60currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3A218TQFBBZ60currentClick) {\n      return cv_mo3A218TQFBBZ60currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 8:39 MinsProntoTec 9 inch PT9 series is a Cortex A9 at 1.2 GHz  dual core processor and is a very good value in price per performance.  It has 1 GB RAM and also has a GPU. This runs Android 4.2.2 Android. I will go into the specifications and review based on my user experience.  The dimensions are 9.25 x 0.43 x 5.91 in and weighs just over a pound. The screen resolution is 1024 x 600. The screen is excellent for reading documents/ePub books via Aldiko Reader Premium, playing games etc. I have bunch of screenshots at the end of my video review. I played Temple Run Oz and it was nice! Puzzle games like the addictive 2048 also performed flawlessly.Most of tablets have ARM based processors.  This makes sure all of the Apps in Google Play ecosystem available.  If you look at my video review, I have screenshots showing the CPU speed and other kernel details. Android Status is an app which gives lot of stats based of Linux /proc files in the system. This is always up to date. This supports wireless with Wi-Fi (802.11 BGN). Tablet has 2 cameras - front and back.  This has 8 GB storage and you can use an extensible SD card slot upto 32 GB as well as cloud storage.  Though not built in, the tablet supports external 3G/WCDMA dongle.  Battery came for a good 8 hours with moderate usage. Battery usage really depends on how heavy you use the system. This tablet has a 4000 mAh battery. I have enclosed battery details from the battery widget pro app  at the end of video review. Overnight it drained very less. Mobile Networking was on by default. I switched off as I was using only Wi-Fi mode now.  I am tempted to buy a 3G dongle. I suggest you go to Settings and tweak things which are not required. Developer Mode was enabled by default. I turned it off. The capacitive touch screen was really good, some occasions I had to press little harder and at right locations, but pinch-zoom, highlight, Copy-Paste all worked very well.It is great the tablet has micro USB Port, 3.5-mm stereo Headphone Jack, built-in speaker, microphone, HDMI (yes, HDMI), micro SD card slot and a DC Input Jack. Note that for powering through wall adapter you need to use the provided DC input jack. Speaker was loud enough. In a room, once I keep the tablet in a stand it was good. Speaker is on the backside, so you don't want to lie this down on back as it will hamper the audio coming out. This is a design I hope changes in Android manufacturers in future. Android tablets are really customizable to your heart's content. It is here where ProntoTec shines. Using a native Android 4.2.2, they have achieved something at a low cost. This can have a very wide reaching audience. In many countries, where affordability is key, having a tablet like this with Wi-Fi is a big boon. Imagine having entire Wikipedia at your fingertips for a child. I tried few educational applications on this. I consider this as a big hit with educators than gamers.I tried Google Voice Search and asked \"what is capital of United States\". The voice recognition part was great and it was able to recognize and dictate the answer. I also tried Wolfram Alpha and asked bunch of questions. E.g., what is world population, what is population of China etc? The microphone picked up correctly and answered through Wolfram Alpha.  Apps like Calculator, Gmail performed flawlessly. I watched multiple video through few applications. Obvious first choice was YouTube. Was able to search and watch videos. I used TwIT.TV app and watched some segments of a podcast (video streaming through Wi-Fi). Again smooth playback. Hand-holding is really easy given the weight of it. No heat observed handholding the tablet. It is plastic, and buttons are made of plastic. For a kid, this is perfect also though the feature set is equally appealing to an adult. I was so enamored with low cost computers in late 90s and it seems I am reliving them with tablet. If you want to listen to podcasts/watch video then this is perfect. Just keep it in a stand and watch video. See my video review to get an idea of what I am referring to.For a computer geek, it is a challenge to design something with minimal resources - screen resolution, RAM, storage, chipset. ProntoTec has designed a tablet with budget conscious customer in mind. Out of the box, it worked to my satisfaction given the specification and price. Once powered on, it directly came to a working condition. No need to setup account prior to using. I signed with Wi-Fi, the Wi-Fi router was in one bedroom. I configured in another room separated by two rooms. There was no issue with Wi-Fi signal. Once connected, I created a Google account as well. I generated a Application Specific password as I had 2 factor authentication. Once signed on, I updated applications like YouTube, Google Keyboard etc. I also downloaded few applications like TwiT.TV, Tetris from EA, etc. I downloaded Chrome and browsed few websites. Listened to Audio / Watched Video. Out of the box battery needed a full charge. Initially without charge, I did a video stream and wanted to see how device shutdown. Sure enough it shut down as battery drained. Powered on after charging and everything was fine.I am impressed enough at the engineering for the price/value/budget it delivers. The ARM Cortex(tm)-A9 processor is the power-efficient and popular high performance choice in low power or thermally constrained cost-sensitive devices. Cortex-A9 is available as a single processor solution offering an overall performance enhancement of well above 50% compared to ARM Cortex-A8 solutions. Cortex-A9 MPCore offers up to 4 processors delivering when needed, on lightweight workload as well as peak performance. Its configurability and flexibility allows Cortex-A9 to scale across a wide variety of markets and applications.  This is from ARM specification. ProntoTec has pulled in many off the shelf components and assembled at a terrific value. I was particularly interested how it performs to streaming video. That is the golden test and it performed beautifully!", "Date": "March 26, 2014"}, {"Title": "good deal decent tablet", "Author": "joe 9872", "ReviewID": "R128DS0PYDSGE8", "Overall": "4.0", "Content": "Looks good screen quality is nice. Pretty quick for your basic uses. Gave it 4 instead of 5 because with WiFi on battery life leaves a little to be desired but this may be do to much higher screen resolution that most tablets in this price range. Bottom line for 80 wish dollars you can't go wrong. If you want to spend twice as much you can get a faster tablet or one that supports Netflix but who uses that anyways.", "Date": "February 6, 2014"}, {"Title": "Very good tablet", "Author": "Christopher Burton", "ReviewID": "R2FH8YF4GMT5GW", "Overall": "4.0", "Content": "For the price you won't find a better tablet. I would have rated a 5 but like the other person i ordered a white one and i received a pink one.. Not the color for me but instead of taking the time to return it over color i will just get a case for it. Very simple to use, great HD screen, easy setup.", "Date": "February 8, 2014"}, {"Title": "Excellent Performance", "Author": "Yaneth", "ReviewID": "RGZ7B6K24SXAV", "Overall": "5.0", "Content": "For the price, this tablet is a hidden jewel. The performance is great and I couldn't be happier with it. It came pre-installed with some applications that can be easily removed if you wish, though I kept them as I found them very entertaining. I've been using it for 3 weeks now and it still works as it did when it came out of the box. Overall, I got much more than I what paid for. Lastly, there is a lot to be said about the seller as they will make sure you are satisfied. Feel very confident purchasing from this seller and the quality of their products.", "Date": "February 15, 2014"}, {"Title": "Stay away.", "Author": "racingfan3 \"racingfan3\"", "ReviewID": "R11GGGD7TQFJIJ", "Overall": "1.0", "Content": "I am very disappointed in this product. I guess you get what you pay for a piece of junk.It will not hold a charge over a few hours in idle let alone using it. I am constantly having todo a restart because it freezes up. Most times when try to do a search forget because itwill not open. Also they sent a pink one and there is no way I would pink of anything.RUN AWAY AS FAST AS YOU CAN", "Date": "April 12, 2014"}, {"Title": "Nice one", "Author": "Alice", "ReviewID": "R39TY885M0B433", "Overall": "5.0", "Content": "Purchased this one for my mum,who always watching TV shows everywhere.This one makes her very happy everyday.No any complaint for it's performance and price.", "Date": "March 12, 2014"}, {"Title": "Great tablet", "Author": "DELLA", "ReviewID": "R3R3B3WXN8CIY2", "Overall": "5.0", "Content": "I've been looking for entry level tablets as gifts for my family day. So far as I know my nephews and nieces are very happy with this products, consider the price I paid I will definitely recommend.", "Date": "March 26, 2014"}, {"Title": "keep it 100", "Author": "matt", "ReviewID": "RTEJHJCDDPQ2Z", "Overall": "5.0", "Content": "I love it for the price. The others out there do what this does. it was slow at first but it just needed to be updated. Overall its nice if you don't want to pay over a $100 for a tablet", "Date": "March 19, 2014"}, {"Title": "MISLEADING SPECS!", "Author": "Gustavo E Ulffe Whu", "ReviewID": "R2CZYLB789NNM3", "Overall": "2.0", "Content": "Got the Tablet with the right color but, when I tried to use the rear camera (described as 2MP), I noticed a low quality capture.. so I used a few Android Hardware Apps and confirmed that REAR CAMERA IS 0.3MP (exactly like the front camera), NOT 2MP. With those apps, and also with the Settings icon, we discovered that the INTERNAL MEMORY IS NOT 8GB NAND FLASH, but just 1 GB with and \"internal SD storage \" of 5.8 GB. Other than that, Tablet seems to work OK... but with those lower specs, the price should be some 10s lower (some Apps don't run well if they're installed in a SD card rather than the \"detected\" internal memory).", "Date": "February 18, 2014"}, {"Title": "Birthday gift", "Author": "just for me", "ReviewID": "R17X746BFFVZZN", "Overall": "5.0", "Content": "I chose this tablet for my adult sister birthday. She could not have been more happier. Does everything that she needed product to do.", "Date": "February 12, 2014"}, {"Title": "i love it", "Author": "elenny", "ReviewID": "RCN7XHPKV4QHZ", "Overall": "5.0", "Content": "I would say that this table is very good .. I absolutely loved, not really complain about it, it is fast, good internal memory capacity, super-simple really ... I recommend it 100%, I get accessories they publish, exactly to that shown in photo", "Date": "May 28, 2014"}, {"Title": "what I expected", "Author": "Mark Peters", "ReviewID": "R1070M0BC97KIU", "Overall": "5.0", "Content": "I waited a few weeks before reviewing this product so I would have time to use it and see how it performed.I chose 5 stars because the product is as advertised and exactly what I needed.I did not expect it to be a camera a laptop or a Television but a supplement to those items.The wifi is adequate as is the 1g processing speed and the HD screen is very vivid.This is a basic use tablet and it performs that function very well, it included a screen protector which was a nice surprise as that is not listed as being included, the included manual does not have much detail so be prepared to figure some things out, fortunately it is not that difficult.", "Date": "May 23, 2014"}, {"Title": "Not awful for the price", "Author": "John F.", "ReviewID": "R3E7IH5OSBNKIT", "Overall": "3.0", "Content": "The bang for the buck on this product isn't bad, but to be completely honest another 20$ takes you to the next tier of tablets. The difference between this ~90$ (sale?) vs ~110-120$ tablet is worth it imho, but if you're looking for a baseline (e-mail, web browser, scheduling, YouTube) tablet this one isn't too bad at all.", "Date": "May 9, 2014"}, {"Title": "I LIKE THIS TABLET HOWEVER THERE IS NOW WAY TO CONTACT ...", "Author": "ANNETTE", "ReviewID": "R34RBSTN1YHE45", "Overall": "3.0", "Content": "I LIKE THIS TABLET HOWEVER THERE IS NOW WAY TO CONTACT THE SELLER TO SEE IF I COULD REPLACE THE TABLET OR FIX ANY PROBLEMS THAT I HAVE WITH THE TABLET LIKE THE SCREEN HAS SOME LITTLE SCRATCHES ON IT THAT SHOULD NOT BE THERE BECAUSE I KEEP MY TABLET IN A CASE AND WHEN I GOT THE TABLET IT DIDN'T HAVE ONE OF THOSE PROTECTIVE SCREEN COVERS ON IT LIKE MY DAUGHTER'S DID.KIND OF A BUMMER THOUGH NICE TABLET I DON'T WANT TO SEND IT BACK UNLESS THEY GIVE ME A REPLACEMENT.", "Date": "April 29, 2014"}, {"Title": "Good product for the price", "Author": "J. Queenan \"JQ Public\"", "ReviewID": "R2J0EM0HTLP82P", "Overall": "4.0", "Content": "For the current price ($90) this is a very good buy. Wifi sets up easy, reasonably quick, compact. Very slippery, might want a case to protect it.", "Date": "April 26, 2014"}, {"Title": "Pronto Tec 9", "Author": "Robert R. Sebelist", "ReviewID": "RT10KKNI91ROF", "Overall": "5.0", "Content": "This was exactly what I had expected and more. It is a bit slow and very touchy for an old man like me but works great! Only thing I found to be a little troubling was the volume. Very low. Will have to use earphones. But that is very minor.  What can I say \" It's wonderful!\"", "Date": "April 10, 2014"}, {"Title": "Perfect for the price !!!", "Author": "Amazon Customer", "ReviewID": "R2FWF1C246L7H", "Overall": "5.0", "Content": "I can't give you a technical perfomance review. I don't know the terms. The only drawback is that it doesn't fit my purse, I will have to make a new one.", "Date": "April 5, 2014"}, {"Title": "when it arrived i turned it on and it turned on and them it just kept restarting over and over again it wont stop i cant use it", "Author": "Kayden Ha'o", "ReviewID": "R3VETSDUUJTQZD", "Overall": "1.0", "Content": "when it arrived i turned it on and it turned on and them it just kept restarting over and over again it wont stop i cant use it  i think im going to send it back and demand my money back.", "Date": "March 25, 2014"}, {"Title": "Great Product", "Author": "S. Rene'e Veal", "ReviewID": "RTXGE3NKBYR0E", "Overall": "4.0", "Content": "I have really enjoyed my Android Tablit PC.  The battery life better than I expected.  Work will with Kamar case and keyboard", "Date": "March 24, 2014"}, {"Title": "good stuff", "Author": "gaspar bucio", "ReviewID": "RT08N9133Z569", "Overall": "4.0", "Content": "nice screen, good performance overall for the price, some issues with video flash player but i dont used so nevermind", "Date": "March 9, 2014"}, {"Title": "decent product", "Author": "Punkin5979", "ReviewID": "R3MFFGASXQTCG6", "Overall": "4.0", "Content": "very big and great colors.  has everything i needed in it.  only problem is that the dimmer function doesn't seem to get very bright or dim....looks the same no matter what the setting", "Date": "March 9, 2014"}, {"Title": "Crash and Burn =(", "Author": "Moises Modesto", "ReviewID": "R36H2SSAVWY0C3", "Overall": "1.0", "Content": "Bought this for my Mom, so I lived with it for a week. It crashed after a couple hours out of the box. Then it stabalized, so I gave it a chance and loaded simple apps on it. Then it was a total crash party. Resolution was very week on the camera. The charge wasn't bad. On Day 3, it wouldn't turn on, so had to send it back. I was lucky it turned on last minute long enough to delete relevant data....then it perished quietly.Don't recommend.", "Date": "February 20, 2014"}, {"Title": "nice tablet for the price", "Author": "Southwest mom \"Malilover\"", "ReviewID": "R1Z8O99YT242D7", "Overall": "4.0", "Content": "The Pronto Tec 9\" tablet is great for the price and my daughter, who is the main user, loves it. She can download games from the Google play store, the display is clear and we have not had any issues except for a short battery life. The batteries do not last more than two - three hours when the tablet is in use and about 1 day when it is on sleep mode, not even turned on!! But since it is really only used for leisure purposes it is not a big deal. For the price it is really a steal.", "Date": "February 20, 2014"}, {"Title": "Not good", "Author": "Wing-hay Chan", "ReviewID": "R3IO9VUML6HAP2", "Overall": "1.0", "Content": "The back is cheap plastic. For being HD the color is horrible. So far it works ok. I wouldn't recommend buying.", "Date": "March 27, 2014"}, {"Title": "horribly dissatisfied.", "Author": "Brittany", "ReviewID": "R2242ND3BC92KZ", "Overall": "1.0", "Content": "I bought this because most of the reviews were positive and I also didn't want to pay a lot for a tablet.  I saw the price and I was like heck yeah!  Well it's cheap for a reason,  it's a piece of crap.  It is painfully slow and freezes constantly.  It can't even run simple things without freezing. I can't even say that I'm disappointed because I should have known that cheap = horrible.  I have a Samsung note 2 and my phone is faster and more competent than this tablet.  I wish I could return this paperweight but I live in Japan and there is too much of a hassle.  Please don't buy this if you intend to get a quality tablet.  My 5 year old even got annoyed with it and wanted to throw it out the window.", "Date": "March 25, 2014"}, {"Title": "Hopping made good quality !", "Author": "rick deng", "ReviewID": "RGGAKR6FIU3TU", "Overall": "2.0", "Content": "Only users 3 weeks and shut down ! That is bad quality  bad  and so and ,  wish will making nice", "Date": "March 17, 2014"}, {"Title": "Could not get it to work...", "Author": "vonBorks \"vonBorks\"", "ReviewID": "R2XQKEZZG5M45D", "Overall": "1.0", "Content": "Do not buy this product unless your are already totally familiar with touch screens, pads, tablets and the Android system as the skimpy instructions are incorrect, show a different configuration from received product and worthless. The Seller has no Web Page, no e-mail address or telephone number. Was able to contact seller via Amazon, reply was not helpful. May be a good product but I was not able to get it on-line. This Product/Seller is not ready to support the product, they are not ready for U.S. Prime Time.", "Date": "February 8, 2014"}], "ProductInfo": {"Price": "$76.99", "Features": "Cortex A9 1.2GHz Dual Core Processor\nHi-Def 9-Inch Capacitive Multi-Touch Screen; 1024x600 Pixel\nInternal Memory: 8GB Nand flash; 1G DDR3 RAM ; External Memory: supports up to 1 x 32GB MicroSD card\nOperating System: Android 4.2 ; Supports Flash, Wifi, G-Sensor and videos\nSupports Google Play Store, Skype, YouTube, and more! (Netflix Not Supported)", "Name": "ProntoTec 9 Inch HD Android Tablet PC, Cortex A9 Dual Core 1.2 Ghz, HD (1024 x 600 Pixel) Touch Screen, Android 4.2 OS, 8G Nand Flash, DDR3 1GB RAM, Dual Cameras, Wi-Fi, G-Sensor (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/512G5-ToUsL._SY300_.jpg", "ProductID": "B00H79JANA"}}