{"Reviews": [{"Title": "This Tab Pro 10.1 is amazingly fast, with super vivid screen and I rate it at 4.5 stars, a detailed review follows...", "Author": "Daisy S \"Daisy S\"", "ReviewID": "RXRGDE6J5LA1U", "Overall": "5.0", "Content": "UPDATED REVIEW 5/7/14 - Since February, 2014, I have been using this Pro and am very impressed with it for several reasons. Keep in mind that this is a high end tablet meant for one who wants a very high screen resolution and has excellent specs on a WiFi only tablet. The performance I found peppy, the screen is just amazing in clarity and readability! And I love the new Kit Kat. First I list the PROS, which are wonderful, however, I give this 4.5 stars because there are some Cons that I want you to consider BEFORE you decide to purchase this or not...PROS/SPECIAL FEATURES ON THE TAB PRO 10.1:+ Screen Resolution/Weight/Size etc - The first thing I noticed is that side by side the screen spec are so so much better on this then previous Tab 2 and Tab 3. This model has a resolution of 2560 x 1600 (with 299 PPI-Pixels per inch) vs the older Tab 2 10.1 and Tab 3 10.1 had 800x1280 (with 149 PPI-Pixels per inch). Therefore, this model has DOUBLE the resolution of the older TAB line! Result: It is that much clearer and vivid screen with truly amazing clarity.+ Speed/Extra Memory - To check out how fast my apps opened and websites etc, I placed my Tab Pro next to my older Tab 2 and my Tab 3 8.0, the Pro was faster to load websites, faster to open apps etc. The memory in the Pro is 2GB of RAM vs the Tab 2 and 3 in the 10.1 the RAM is 1GB (it is 1.5GB on the Tab 3 8.0). So I am finding that this extra memory has made a difference in speed in my opinion.+ Speed of this unit / Memory etc (and special testing of speed) - This tablet has more memory and is MUCH faster than my other tablets. So I performed a tests today using my: Tab Pro 10.1, Tab 3 8.0 and Tab 2 10.1 (all WiFi only tablets. Results: I found that my Tab Pro 10.1 runs faster than my older Tab 2 10.1 does (with 4.2.2). **To better gauge the speed, I opened the same apps, etc using this tablet, Tab 3 8.0 and Tab 2 10.1 - This one opened apps, webpages and more so much faster than my other tablets!+ Ability to turn off the apps I did not want (helped my battery life). Did an actual test today to see if this made a difference and it did. After I safely turned off the apps that are safe to turn off, I now have more free memory and my battery life per hour has increased. So I documented this. If you have any questions about this, please ask in the comment section. Just a little tweak like this can really make a difference in battery lasting longer and better control over the memory etc.+ WiFi Connecting/Speed of WiFi and MORE - This tablet connects very quickly to my home WiFi and has never ever dropped the WIFi signal no matter where I am in my home. WiFi is OK in this device and does work very well, however, it is not as strong of a WiFi signal as SOME my other WiFi devices that I own presently. When I move closer to the router, it shows 4.5 to 5 bars, which is very good to excellent.*** To test the speed and strength of this WiFi and compare it to my other Android devices, I went to the Playstore and got the free app called WiFi Analyzer. This is a MUST HAVE app for any Android device as it gives you a visual report on the WiFi strength of your tablet, phone etc.****Do you need to know how to get on the internet when you are out of a WiFi range? Ask me about this as I have written an article on how to do this using a MiFi type of service from different service providers (please ask in the comment section for more info).+ SPECIAL INFO about INTERNET CONNECTION - Yes, this is a WiFi only, but when you are away from an WiFi internet hotspot location, there are ways to can get onto the internet such as MiFi and there are ways that you can purchase equipment so that you can have data when you do not have a WiFi hotspot available.+ Internet & Webpage & Video Viewing - The stock browser does a great job, however, I use Maxthon Browser and installed archived flash so I have great internet flash video viewing results and it renders webpages quite fast for me. And I suggest the free app called Pocket from the Playstore so you can read internet articles later offline.+ EXTERNAL SLOT FOR MICRO SD CARD up to 64GB - This is no real change over the Tab 3 line, but still it is a must for me as I keep my personal files, photos, and music on my internal SD card. Note that this was one of the deciding factors that sold me on this tablet.+ Camera / Video Camera - The front camera is now 8MP which is much better than then older Tab 2 and Tab 3 lines. And I took pictures inside and outside and they came out very SHARP and VERY CLEAR! So I am impressed with the camera!And I took some videos inside and outside to test this and they are much clearer and better resolution than on my Tab 2 tablet.+ Home Videos - The stock video player is OK and plays MOST home videos, however, may I suggest QQ Player (Free App from Playstore and the ONLY one I recommend as it plays every home video I tried).+ Reading/Creating/Editing Word, Excel, Text Files and much more on this tablet: This comes with a So So Office app (viewer) for reading Office documents, however, I STILL prefer Kingsoft Office which is a free app from Playstore. It is the best I have ever tried and I am very picky about so called Office programs. It is very compatible with MS Office as it reads, edits and creates Office files and reads PDF files, and it has more features of any other Android Office program that I tried. This app is a MUST have for tablet owners in my opinion.+ Music Player/Sound Quality - Stock player has clear sound through the outside \"speakers\" and very clear using headphones. To sync easily with Windows Media Player may I suggest the Playstore app free) WinAmp for the tablet as it is very highly rated and the sound is good, but I use a very high quality Bluetooth speaker for great sound! Suggestions: The best way to really enjoy music is through a high quality Bluetooth speaker or Bluetooth headset as the sound quality is superb this way and you can walk about your home listening to your music!+ Battery Life- Since I have done a few tweaks on this tablet, now I have found that my battery life is better than the first and even the second day. In fact, the battery life now I find that when I use WiFi just when I need it, I now get about 6 to 8 hours with it(this reflects 100 percent brightness however). Still this is better than I received on my older Tab 2, so I am happy.***Where battery life is concerned: To make your battery last as long as possible is to be sure to turn off BLUETOOTH AND WIFI when you do not need these. Both are these are memory hogs! Also, I turn off my GPS and even SYNC sometimes to conserve battery and then turn them on later.+ OTG USB Compatible - You can add an optional OTG (On the Go adapter cable to the Micro port for copying files to your flash drive and from your flash drive to the Tab Pro). You can also plug in a mouse, I tried it and it worked. *Note that portable external hard drives and portable DVD/CD drives will not work using OTG in the Tab Pro because these both require a lot of power to be compatible with the Tab Pro and most tablets that have the OTG. However, it is still good to know that you can easily plug in your flash drive and copy files to the Tab Pro and from Tab Pro to PC--what a time-saver. I have written an article on OTG and how to use it, just request this in the comments.+ Bluetooth Speed and Performance - The Bluetooth keyboard I own (generic OKA) paired quickly with several devices and copied files at a great rate of speed. Speaking of Bluetooth: Also there will be Bluetooth keyboards out for the Tab Pro coming soon. (Just make sure you purchase one for JUST THE TAB Pro 10.1 size).+ Lighter Weight - This is very light and easy to carry, the weigh is just about the same as iPad Air.CONS:- No support for Flash Videos - Adobe does not support flash in any Android tablets this days. This non support is for all Android tablets, not just Samsung tablets. + Watching Flash Videos - This device does not come with installed flash, however, I found a workaround to solve this. So if you request it in the comments, I will send you instructions on how to installed Archived Flash so you can watch flash videos and what proper browsers I recommend for this tablet...The only browser that I could get the Archived Flash to play on and well was Puffin Browser for 2.99 in the Playstore. (I tried Maxthon, FoxFire Beta and more and this was the only one that played consistently flash videos).**Here is what I do to watch videos: I use free Playstore apps as YouTube, Netflix, CBS.COM and more and open up the app instead of going to the browser to watch videos that I want to. They play fine in an APP rather than in a Browser.******* Need a tablet with 3G/Phone and Data that cost less than the Pro? There is the Tab 3 10.1 with 3G and a phone and data in it the P5200 model in white or brown. The P5200 Tab 3 10.1 is 90 dollars less than this Pro and you can make phone calls with it, use your data plan as it accepts an activated GSM Micro Sim card. Having a tablet with phone and data capabilities I have found are great, especially when you cannot find a WiFi hotspot when traveling!- No installed Adobe Flash (This can be fixed by installing an Archived Adobe Flash from Adobe website. And I did so and now I can watch flash videos using Puffin Paid browser. (No new Android tablets or phones come with flash, but the Archived Adobe Flash can be installed). Most flash videos play OK with this older Archived Flash, with the exception of Amazon videos (as of March 30, 2014).If you have questions about this tablet, I will be happy to answer any questions you may have through the comment section.", "Date": "February 14, 2014"}, {"Title": "Great tablet, few flaws", "Author": "Would-be-box-man", "ReviewID": "R21OGXW8J7A23E", "Overall": "5.0", "Content": "*****EDIT: As promised, I just received my case and it fit perfectly -- it does look like cases for the Galaxy Note 10.1\" 2014 Edition (make absolute sure you pick the 2014 Edition, not an earlier model) work precisely the same. The case I got was the MoKo leather case, though there are plenty of options out there.*****UPDATED EXPERIENCE: I'm a big, big fan after a week of ownership -- particularly the screen and sound, both of which surprised me with their clarity. I did note that a lot of app developers were not ready for the 4.4.2 version, so there's minor tweaking of a number of apps in order to get back to full operation; I expect those problems will be filtered out in the next few weeks at most. One thing I am nervous about is regarding how the screen is going to look in bright light, but most tablets are going to be in good company in that regard.First, as a background, let me divulge that my background with tablets has primarily been the iPad (3rd Generation), which I absolutely loved. I recently made the switch from an iPhone to the Galaxy S4, and I found the change quite likable, so I awaited a new tablet announcement that met my need. This did that quite a bit, though I'm sure MWC at the end of the month will release quite a few more like-wise tablets.PERFORMANCE/EXPERIENCE THUS FAR: Fantastic. It works incredibly quick, has smooth transitions, and looks absolutely gorgeous -- I don't know what they did to the screen, but it's a beast. I can't say I cared particularly too much for the Magazine UX (the on-the-top-of-TouchWiz-interface), but that was easily fixable with a launcher (as I did with my S4 as well). Also, the dang tablet is incredibly light.QUIRKS: I don't understand why, but when you hold down the Home button, it goes to Google Search rather than the multi-task menu (as on the S4). Instead, they did a swap of sorts: the old menu button (to the left of the home button) was replaced by the multitask window, and holding down the Home button will get you Google Search. As to the why, I couldn't possibly fathom.ONLY CON: Depending on the task and what brightness you're using, the battery can drain pretty quick. I gave the ladyfriend my old iPad, and myself the Tab Pro. It took two and a half hours to drain my battery from 100% to 77% (roughly 9.5-10ish battery life), but in the same time period, her iPad had only gone down to 93% (which I'd usually have two days of heavy usage out of). The Tab Pro *is* a more powerful device, as shown by the battery consumption, but I'd advise toning down the brightness waaaaaay down if, say, you have a long day of traveling ahead of you.", "Date": "February 17, 2014"}, {"Title": "Love it! Super Resolution.", "Author": "rpv", "ReviewID": "R2PET2VLBP54G5", "Overall": "5.0", "Content": "I have been a fan of Galaxy Tab series tablets and love the current lineup. I have been buying all new versions and sell off previous generations. The single most fascinating part of the new TabPRO lines is the resolution. Astounding 2560 x 1600 on all lines which means on 8.4\" has the maximum ppi and excellent look. In comparison last year's Tabs have much lower resolution.Let us compare the PRO lines from Samsung. I will compare first the TabPROs briefly, and then give a crisp overview of the popular Tablets in market now. Then I will do in depth into the current tablet itself. I feel this will give a good perspective and enhance your buying decision. I am sure you are looking at multiple tablets to determine which sits you. If you have any questions, do ask in the forum and I will respond within a day.COMPARISONS GALORE:key_specs: { model: resolution, ppi, CPU, RAM, Flash memory, SD_card, camera spec, weight, OS_type, size, charging/sync port type, GPS:y/n }Samsung Galaxy TabPRO 8.4-Inch {B,W},  WQXGA 2560 x 1600, 359 ppi, 2.3 GHz Qualcomm Snapdragon 800 quad-core processor, 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB,  8MP Rear + 2MP Front, 331 gm, Android 4.4 Kit Kat OS, 8.62 x 5.06 x 0.28 in, microUSB, GPS yes.  4800 mAh battery (best resolution on a tablet!)Samsung Galaxy TabPRO 10.1 {B, W}, WQXGA  2560x1600, 298 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB,  8MP Rear + 2MP Front, 469 gm, Android 4.4 KitKat, 9.57 x 6.75 x 0.29 in, microUSB, GPS: y, 8,200mAh batteryWow, a 12.2\" tablet now! This is just like a laptop with no physical keyboard built in.Samsung Galaxy TabPRO 12.2 {B, W},  WQXGA  2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32GB/64GB Flash, microSD upto 64 GB, 8MP Rear + 2MP Front, 732 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.31 in, microUSB, GPS: y, 9500mAh batterySamsung Galaxy NotePRO 12.2 {B, W},  WQXGA  2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32/64 GB Flash, microSD card slot up to 64GB, 8MP Rear + 2MP Front, 748 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.33 in, microUSB 3.0 port with backwards compatibility with microUSB 2.0, GPS - y, 9500mAh battery, S-Pen,  NFC, Ethernet connectivity via adapter.A broad range of popular tablets as of now are Kindle Fire HDX 8.9\", Samsung Galaxy Note 10.1\"2014 edition, iPAD Air 9.7\", Samsung Galaxy Tab 3 10.1\", Google Nexus 10\" and Samsung Galaxy Tab 3 8\". If you are planning to buy TabPRO, do look at the comparison of 3 top features you need. This will enhance your buying decision.Kindle Fire HDX 8.9\" model: 2560 x 1600, 339 ppi, Snapdragon 800 2.2 GHz quad-core, 2 GB RAM, 16/32/64 Flash Memory, No microSD card, 8MP rear-facing camera, front-facing 720p HD camera, 374 grams, FireOS 3.0, 9.1 x 6.2 x 0.31 inches, microUSB, GPS:no [cellular versions have GPS]Samsung Galaxy Note 10.1\" 2014 Edition: 2560x1600, 299 ppi, 1.9GHz Samsung Exynos 5420 Quad-Core Processor, 3GB RAM, 16/32 GB Flash Memory, microSD slot:yes(upto 64 GB), 8MP rear camera and 2 MP front-facing camera, 560 grams, Android 4.3 Jelly Bean OS, 9.57 x 6.75 x 0.31 inches, microUSB, GPS:yes. S-Pen (flagship),iPAD Air 9.7\" (2013): 2048 x 1536 resolution, 264 ppi, A7/M7/64 bit processor, Flash Memory: 16/32/64/128 GB, SD Card:no, 5 MP back, 1.2 MP front, 469 grams, iOS 7, 9.4 x 6.6 x 0.29 in, lightning port, GPS:no [cellular versions have GPS]Samsung Galaxy Tab 3 10.1\" model: 1280 x 800, 149 ppi, Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, Flash Memory: 16/32GB, microSD slot: yes upto 64 GB, 3.2MP rear-facing, 1.3MP front-facing, 510 grams, Android 4.2.2, 9.57 x 6.93 x 0.31 in, micoUSB port:yes, GPS:yesGoogle Nexus 10\" model: 2560 x 1600, 300 ppi, CPU: Dual-core A15, 2GB RAM, 16/32 GB, SD:no, rear:5 MP, front:1.9 MP, 603g, 10.4\" x 7\" x 0.35\", mcroUSB, GPS:yesSamsung Galaxy Tab 3 8\" model: 1280 x 800, 189 ppi, Exynos 1.5GHz dual-core processor, 1.5GB RAM, Flash memory: 16/32GB, microSD slot: yes upto 64 GB, 5MP rear-facing, 1.3MP front-facing, 309 grams, Android 4.2, 8.26 x 4.87 x 0.29 in, microUSB port:yes, GPS: yesYou should come up with three top three specs you want and should be able to nail it down with the above spec. If you have doubts shoot me a comment, I can help!RESOLUTION:The tablet has a resolution of WQXGA 2560 x 1600, and has a pixel density of 298 ppi. All the TabPROs are same resolution,  so we increase in size, the pixel density decreases. The videos were very crisp and text so sharp. The new Magazine UX interface makes the screen really pop. I was able to read magazines very easily. Aldiko and many libraries have teamed up and magazines can be checked out through the app. Resolution will blow you away. Reading magazine and pdf files are easier in 10.1in than 8\".PROCESSING POWER:Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore),2 GB RAM, Powerful for what it does. I have played games/watched youtube videos and have seen no lag or any latencies. Though the chip is octa core, do bear in mind only 4 cores are active at a time. This is done for minimizing heat.PRO MEANS?Tablet is certainly is a productivity tool. The TabPro series has free subscriptions to popular services such as Hulu Plus, Dropbox, Bloomberg Businessweek+, and Cisco WebEx Premium for varying times. It also has Hancom office suite which is an office suite developer in Korea. Hancom Office consists of Hanword, Hancell (Spreadsheet), and Hanshow (Presentation program). Since there is Google office, I don't know if this will be any market in the US and other countries.STORAGE:This model is for 16 GB tablets. Samsung does make 32 GB internationally, and will most likely appear in Amazon later.  Having the expandable memory to 64 GB is the greatest invention since sliced bread. Well, putting bunch of video/audio/books on the SD card which is so cheap these days, the tablet suddenly has more memory with no lag observed.  With prices plummeting for 64 GB cards, it is a great boon. Put all your music, books, photos on the SD card and you have a powerful computer in hand always! I personally use the 64 GB microSD card on my mobile devices. Get this mobileUltra (SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging.CAMERA:Having a tablet is a plus on smaller tablets, though I hate the feature on 10 or 12\" tablets.  I personally don't use cameras as much on 10\"+. If you use publicly, it is like having a big magazine in front of you. Imagine the guy in the sports stand using in front of you! The resolution is 8MP Rear + 2MP Front. Video is 1080p 60 fps. Nowadays there is nothing much to say of cameras, they just work for the required purpose.ERGONOMICS:I personally like for home uses 8\", but for work 10\" is good. At 469 gm, the weight is definitely not single hand holdable.  Size of this tablet is 9.57 x 6.75 x 0.29 in. The battery is 8200 mAh battery. The best part I liked is the beautiful resolution and is the best resolution on a tablet! HD videos are crisp.SOUND:Excellent sound system with stereo speakers and microphone. I was able to ask questions to Google Now and get precise answers.MISC:I tested OTG capability and it is great to have a external USB support.  USB Host is one of the most undernoticed features of Androids and is in my opinion one of the best features compared to iPad lines. What this means you get a USB Host cable also otherwise called OTG (On the Go) cables and plug in your USB thumb drive or other USB devices and the device recognizes it. I have used it with Alfa AWUS036H for a wireless project with Android PCAP Capture from reputable Kismet wireless.Having a GPS is great for immediate needs and I could get immediate lock on this tablet. Wi-Fi is 802.11 a/b/g/n/ac, dual-band. Also has infrared which can be used for WatchON as a TV remote control. Worked straightaway on Samsung TV. This is also great for sharing your tablet with family members, multi user mode lets different users log in separately, so you each see only your own apps, backgrounds, and email.APP POWER:I tried following apps and they just worked awesome. A tablet is only as good as the apps you have and how productive it makes you. It's almost like the camera/lens analogy in the DSLR space. What good it is to have a great DSLR body if you have no good lens? Same with Tablet body and apps you have.WolframAlpha (I can go on for hours praising this. This is a truly genius app powered by hundreds of supercomputers in the background. Wolfram is a computational genius). Well worth the $3 price.Withings HealthMate. (another remarkable app great UI/UX). I use Pulse and the integration with it as well as Weight machine is very good.23andMe app (I love their reports)Aldiko Book Reader Premium (absolutely love it, many libraries have magazines for checkout)Amazon MobileAndroid StatusAndroid Central app (great and must have for Android users)Androidify (kids love it)Angry Birds (Space/Seasons)Asphalt Car gameBattery Monitor Widget Pro (a great app)BeyondPod (use it daily!)BoxChromeCNET TVDictionary M-W PremiumNAVIGON (from Garmin - offline maps)TOM TOM app (has some advantages over NAVIGON)Google Navigation/Earth/Maps using a portable MiFi boxGoogle Currents (nice way to read News)Google Keep/Keyboard/Drive/Search/Books/Voice/HangoutsEbayFlipboardLinkedinGoogle Music (Awesome, I have now upto 10,000 songs halfway through Google's 20K Limit)Tapatalk HD (awesome forum browsing app)OverDrive Media Console: Library eBooks & AudiobooksMicrosoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for AndroidTwit.TvSkypeRealCalc Plus (Awesome calculator app)Wolfram AlphaZillowPlenty of WidgetsAsk questions, the reviews cannot do full justice. I will be glad to answer any questions and usually answer within 24 hours to any query.", "Date": "February 13, 2014"}, {"Title": "Good Resolution & Sound, Not enough Ram or memory", "Author": "BigGaryAlan", "ReviewID": "R3M7Q7I1WFER7G", "Overall": "3.0", "Content": "I bought this tablet because the Rep told me I could link with my pc. I tried to streama movie online from my computer but it does not flow. I thought it was the internet speed in the store but its the new samsung tablet.The Most troublesome thing about this tablet is, it says 2 GB of Ram, when its only 1.4 and with all the bloatware on this tablet it leaves almost no ram space. The 16 GB rom is actually 10gb. So you say you can use your sd card for your apps. Not on kit kat 4.4. Unless you root the tablet you can't do it. Lastly, Because of 4.4 kit kat downloading an archived flash player will only work on one browser: Dolphin. Not on any other. I returned my tablet and bought a Galaxy Note 10.1 2014 edition 32gb with 3GB of ram. It has 4.3 and it lets you move your apps to sd card plus flash player works on many browsers. The Only drawback for all of these tablets except the 12.2\" pro, It only uses 2.0 usb to charge. The 12.2 uses 3.0 which is alot quicker,like the note 3 phone. I hope this is helpful for you.", "Date": "February 23, 2014"}, {"Title": "Best tablet I've owned, period.", "Author": "Neil Fish", "ReviewID": "R1X63H11DYB4QR", "Overall": "5.0", "Content": "There have been enough reviews and comparisons and tech specs posted already, so let me just talk about user experience.Absolutely the clearest, most accurate color screen I've ever used. I own the Ipad Air (my wife does) and pulling up the same websites or photo, I prefer the Samsung just a bit better. To be fair, she prefers the Ipad, so it just might be personal preference.As far as the negative comments about the flipboard page, if you don't like it, it's easy to delete it, or customize it and then change your home screen to the screen you want. I own the Samsung Galaxy S3, so I was already extremely familiar with the interface.The $25 Google Play store credit and the 50gb Dropbox for 2 years was a fantastic bonus. I really have no use for the other 3 month trials and such.I have over 150 apps installed, and it runs smooth as silk. fast transitions, quick startup, the speed and power is there. Only a few apps are compatible with the multitask function, so it's nice to have, but not always available.The built-in IR Blaster and the right app turns this beast into the best universal remote control that blasts the Logitech units away. Great feature.16gb memory is a little tight, but a less-than $40 64gb micro sd card solves that. Most of the Samsung app bloatware can either be uninstalled or disabled.The Cable Matters (2-Pack) Micro-USB 2.0 On-The-Go (OTG) Adapter allows you to plug in a full-sized USB mouse, keyboard, external hard drive or game controller. Nice accessory to have.Tablets are a personal thing, and YMMV. For me, at $540 and $125 of perks I would have paid for anyway, the price is great. And I'm enjoying the heck out of this thing.", "Date": "May 8, 2014"}, {"Title": "Too bad Samsung caved in to Google on this one...", "Author": "M. Phillips \"tx.parrothead\"", "ReviewID": "R14OJ2RVH3RIAC", "Overall": "4.0", "Content": "One of the primary reasons I like Samsung tablets is the support for external SD cards, allowing you to store your pictures, music, books, etc. on an easily removable device.  For that reason, I was EXTREMELY disappointed to find that Samsung has caved in to Google on the issue of file access on external SD cards. In case you are wondering what I mean, it's this. Beginning with this tablet and the Samsung implementation of Android 4.4 (Kitkat)it uses, your external SD card files can no longer be modified by any app on your tablet/phone, other than the app that \"owns\" the file. For example, if you use your external SD card to store photos, you can't edit them, crop, delete, etc. KitKat will not allow it. The same applies to music and books.  I always used Syncme to keep my books and music on my SD card in sync with my PC wirelessly. Now Kitkat will not allow it. I would say this is annoying, but it is way beyond that. The bad part is, Samsung could have chosen not to implement this behavior, but they did not. Had I known this before my purchase, I probably would have chosen different device with another version of Android.  Otherwise it is very nice.Does anyone have a work around for this non-consumer friendly change?", "Date": "April 4, 2014"}, {"Title": "don't use windex on the back! awesome tablet", "Author": "DJ Sterks", "ReviewID": "R3IOKHMH0ZME43", "Overall": "5.0", "Content": "I wrote a review on Newegg already telling people not to use windex on the back because it causes discoloration if you try to clean it. Otherwise this tablet is simply amazing. I had a lot of use with an iPad air before using this tablet and I have to say this tablet slightly beats out it's apple competitor. I think the screen is more vibrant on this tablet and the text is slightly more crisp thanks to the higher pixel density. If you are in the market for a high end tablet this is the answer to all your needs, unless you can't live without the app store. But the Google store has plenty of apps that look amazing on this tablet. I also picked up a case with a blue tooth keyboard from here which makes it super easy to type documents and reviews such as this one! Now this thing is like a super portable laptop (almost!) I was debating between a tablet and a laptop as I am a pc power user but with this keyboard I am extremely satisfied. I will now be bringing this to class as it is extremely easy to type word documents on here now! Greatest tablet on earth!!", "Date": "February 28, 2014"}, {"Title": "Terrific Device, but It Wasn't for Me", "Author": "americayay", "ReviewID": "R385EFMYQKXJHO", "Overall": "4.0", "Content": "I had this tablet for 10 days, and I really liked it. I had no problems at all. The display was beautiful, the processor fast, the interface user friendly. I own a Kindle Paperwhite, so I had no need to use this as a reader, but video and sound quality were terrific and playing games was a blast with the great touch screen. The leather backing looked classy, not cheap, and it was really light. Having bought the item on something of a whim, though, I spent the next 10 days researching reviews. Ultimately, I realized that the features that make this tablet \"PRO\" are business apps I will never use and a weight comparable to that of the iPad Air. Since I put the device in a case, anyway, the light weight didn't mean much to me.Best Buy guaranteed the return of the tablet for any reason, within 15 days. After reading enough of these reviews, I realized that the extra gig of ram and the S pen included with the Note 10.1 2014 Edition were far more valuable to me, personally, than the lighter weight, slimmer appearance, and business apps. Fortunately, the devices are so similar that I didn't have to return my case. It's a matter of personal needs and if you're looking for a tablet to use for professional purposes that require electronic group meetings and presentations, or something super lightweight, this is a GREAT device. If you're wanting something for fun and personal use, I'd recommend the extra gig of ram and S pen that comes with the Note 10.1 2014.", "Date": "February 20, 2014"}, {"Title": "Perfect size, perfect weight, the android equivalent of the IPAD air", "Author": "Homer \"consumer\"", "ReviewID": "R11QBKILMW2A7K", "Overall": "5.0", "Content": "I just received this product. It comes in a simple box and has enough juice to start up immediately.I was waiting for Google to release a new tablet with a basic Android interface as I am a huge fan and user of the Nexus 7. However, in my opinion, the wait is over for all of those who have been on the fence, waiting for Google to announce a new tablet.This device is, in my opinion, the next Android tablet that beats the others. It is, on initial evaluation, without any current equal.On start up it immediately goes into settings which take only a minute to complete. I am a Google user, so I entered my account and it downloaded all of my apps that I have installed on my other Google accounts.I also use a Microsoft exchange e-mail. It installed, downloaded my contacts and calendar.I am a user of the Nexus 7, and a Samsung Note 3 cell phone. So, I am very familiar and happy with the Android/Samsung environment.This device is absolutely flawless and present. Great screen, incredible clarity, and the touch screen responds as quickly as the Nexus 7.The new interface is somewhat different, but I actual like the fact that when I open it, it shows me my calendar, e-mails and the news. It can be changed to include more or less.I have used the Nexus for almost 6 months, wishing there was a larger device with up to date hardware and software. Well, this device is fast and handles every app and function without a hiccup. It has never hesitated or had a slow response rate. No freezes or any complaints. The touchscreen has an instant response. There is no evidence of any response problem.I did install the new Hancom and my first impression are good. Microsoft documents opened without a hitch.I was not able to get the free Bloomberg download to download. Not certain if the server is overwhelmed as it comes from the Samsung site.It also comes with free inflight GOGO for one year, which I will use... and hulu, which I could live without. Sirius radio for three months if you don't already have a subscription.The WIFI seems very good. I was able to connect throughout my area without any loss of signal or drops.The weight and size is almost identical to the IPAD air, Easy to hold and use.So, easy setup, new but nice touchwiz interface, good WIFI, light as the IPAD Air but with Android and it looks great.I did consider that this does not have the  S pen. However, this device is lighter than the 10.1 Note, and the typewriter on the screen is \"THE BEST\" I have ever used. Great touch and feel. Great haptic feedback.So, call me very pleased.The Nexus 7 is going to be used by other household members. This is now my device for portable use.I have not had it long enough to comment on battery life... I am going to see if a 10.1 Note tablet case will fit.", "Date": "February 13, 2014"}, {"Title": "The Best tablet I have ever owned or used !!", "Author": "Amazon Customer \"formerly a Road Warrior of t...", "ReviewID": "R1GDZS3JAKYG7E", "Overall": "5.0", "Content": "Samsung.  When I was in the wafer production they were known as a midline company (20 years ago.)  Since then they have really stepped forward with some very innovative technology.  Overall I have been VERY impressed with Samsung in general and the Galaxy line in particular.  After my experiences with this Samsung Galaxy Tab Pro 10 I also ended up getting the Samsung Galaxy S5 cell phones - I could not ask for anything more between this combination!  Both devices use the same Samsung account for stream-lining the automatic installation of apps and settings.I needed a tablet where I can set up multiple profiles to easily log into multiple email addresses, linkedIn accounts, facebook accounts, etc. The Samsung Galaxy Tab Pro 10.1 has been absolutely perfect for my needs - this has been the best tablet I have ever owned (several) or used (many).  I am very delighted and intend to keep this tablet for quite some time!The technical specs off the box:* 10.1\" (255.4 mm) WQXGA (2560x1600) TFT LCD* Full HD (1080p) playback and recording* GPS* IR LED (WatchON)* CPU - 1.9 GHz Quad Core* 8mp AF rear camera and 2 mp front facing camera (video conferencing or Skype)* 2 GB ram* 8,220 mAh battery (it lasts a LONG time!!)*Bluetooth*Wifi* Ant+* Apt X csrModel: SM-T520. Made in Vietnam by SamsungI also appreciate the packaging is 100% post consumer recycled paper and printed with soy based inks to be 100% recyclable.", "Date": "April 24, 2014"}, {"Title": "Outstanding tablet", "Author": "Jakester", "ReviewID": "R1Z94V1OT45S8E", "Overall": "5.0", "Content": "This is an exceptional tablet and I’ve found it to be very useful so far. Here’s what I like about it:1. Setup: Setup was drop dead easy. I have a Samsung Note II phone and once I logged into my account via the tablet it synched with my account and downloaded all the apps I had setup on my phone. The wizard steps were simple and easy to follow. Connecting to wi-fi worked first time as well as all the other configuration settings.2. Operating System: If you know any android system device you know this tablet. Although tailored somewhat for the Galaxy the overall look and feel is pretty similar between Android devices. No problems there. Ease of use is great. I was up and playing Candy Crush 15 minutes after I opened the box.3. Hardware: The footprint of this tablet is the smallest yet so if you have a case for a prior Samsung 10.1 tablet (as I did), it won’t work.  There aren’t a lot of cases available for this model yet and the ones that are available are pretty plain and, depending on where you shop, over-priced. The charging port has changed from earlier models (my wife has a 2nd generation Galaxy tablet) and it’s now a mini-USB plug. This is a plus as it means my existing phone chargers work with this tablet. The picture is bright and exceptionally sharp and the gorilla glass looks to be the best yet at being able to easily clean off smudges.Overall I would say this is an excellent device and very handy for a quick connect for web research or just casual browsing. Highly recommended.", "Date": "March 16, 2014"}, {"Title": "Love this tablet, i had the 8.4 but returned it for this", "Author": "Daniel Gage", "ReviewID": "R1MZWAWVM00VAK", "Overall": "5.0", "Content": "screen is superb on this, and its super fast, the exynos is every bit as fast as the Snapdragon, looks great in black.I had the 8.4 Tab Pro which is really nice but... i got a Note 3 over the weekend and the size is just to close so if you have a Note 3 i would recommend the 10.1.Easy to use in portrait mode.To save cash when looking for a case... Buy cases for the note 2014 edition as they are almost half the price and fir just the same with everything where it should be :)", "Date": "February 26, 2014"}, {"Title": "Better tablet than the IPad Air", "Author": "Sandy", "ReviewID": "R12SL082CKO6C4", "Overall": "5.0", "Content": "Took back the Ipad Air to Best Buy to get the Samsung Pro 10.1 & I love it.  Easy to set up, excellent screen resolution, lighter than the Ipad, so much cheaper than the IPad, easy to manouver all the apps & sync's with my Kindle.  Between this tablet & the Kindle 8.9 HDX - there is no comparison & they both beat the IPad.  The Ipad is nice, but you are just paying a high price for the NAME.  I strongly suggest the Kindle & the PRO.  Also, the keyboard so, so easy to use.  Like using a regular keyboard with a desktop computer.  Highly recommended tablet.", "Date": "March 25, 2014"}, {"Title": "This is the tablet to buy!", "Author": "Lawrence C. Smith", "ReviewID": "R1WMO114EJ5L8W", "Overall": "5.0", "Content": "I received this tablet from Amazon on Sunday April 18 after ordering it on the previous Friday evening.  Needless to say this was outstanding service from Amazon!  I am equally impressed by this tablet.  As I was already an Android user I was tempted to crossover to the I pad Air.  My wife has one of those.  She has very limited tech skills so Apple works for her.  I love being able to create the screens as I like them and not Apple.  I have found this tablet to be very smooth and a great value.  One more time Samsung shows why they are the tech leader.  Get this one!", "Date": "May 19, 2014"}, {"Title": "Outstanding tablet. Would be better if less bloated.", "Author": "T. Zeppa", "ReviewID": "R3V3WD8G81BT3", "Overall": "4.0", "Content": "This tablet is very fast and works great compared to our old one. It is pretty heavily bloated with things you don't need though. Overall we are happy. Maybe after rooting I can remove some unwanted applications.", "Date": "May 21, 2014"}, {"Title": "Great tablet", "Author": "Opti Mist", "ReviewID": "R2I9I2GXZLFL24", "Overall": "5.0", "Content": "I wanted the Galaxy 10.1, and I wanted the Pro edition.I did not see me using the Pen in the Note, but was tempted by the 3 Gig of Ram in the Note.However, the Pro is great.  Fast, brilliant screen, plenty of storage with my card.Great tablet", "Date": "April 26, 2014"}, {"Title": "Very nice tablet", "Author": "C. Augustyniak", "ReviewID": "R3R4DFTLIRUM1P", "Overall": "4.0", "Content": "This is a very nice tablet.  I was originally waiting for a Nexus device so I could get the true Android experience instead of all the Samsung \"junk\" included on all of their phones and tablets.  Since there has been no updates on when/if an updated Nexus 10 tablet will ever be sold, I decided to go with the Samsung Galaxy Tab Pro 10.1 tablet.Google has been releasing their individual apps to the Google Play store over time so I have been able to install the stock Google Keyboard, Google Calendar, Google Camera, Chrome, etc and avoid the Samsung versions of the apps.I'm deducting a star due to all the Samsung extra \"junk\" included.  Samsung should stick with being a hardware company and leave the software to Google/Android and all the other app developers of the world.  If they feel their apps are better, they are more than welcome to make them available to all users via the Play store.", "Date": "April 23, 2014"}, {"Title": "Excellent", "Author": "K. Cheung \"Chance\"", "ReviewID": "R2K3J30GJ64T3G", "Overall": "5.0", "Content": "Fast, great graphics, big upgrade from my Asus Prime T201. No issues at all so far. Battery life is pretty good", "Date": "March 27, 2014"}, {"Title": "Nice picture and light", "Author": "Jenny F \"Jenny\"", "ReviewID": "RHMH72IT8U8HI", "Overall": "3.0", "Content": "This is a good tablet. The pictures are great and so is video quality. Very easy to use and light weight. The downfall is the battery on back of the device gets hot when using it continuously for more that 30 minutes or less at times. When the device gets hot sometimes it causes the device to freeze up. I exchanged the first one and hoped this would work better, but it seems to just got hotter later than sooner. I hope this is just me but I am disappointed as I spent a great deal on this item.", "Date": "March 18, 2014"}, {"Title": "Excellent", "Author": "Bruce E. Dersch", "ReviewID": "R3BEWU6L7W3MYB", "Overall": "5.0", "Content": "The Samsung Galaxy Tab Pro is everything it was promised to be.  It is lightweight and meets my needs for communication both here and across the pond.  The quality of the pictures is actually better than my wife's Apple tablet, but you didn't hear it from me!", "Date": "May 22, 2014"}, {"Title": "NICE, but disappointing in one thing...", "Author": "SB", "ReviewID": "R3QUGYWNVPUY0E", "Overall": "4.0", "Content": "OK, so let's begin...First, this tablet is nice and powerful. The processor is speedy, has the latest android build, the screen is excellent, blah blah blah, pretty much the same thing other reviews, whether professional or user based, said are true. There is the occasional 1 second lag because of the touch wiz interface and it's much to be desired implementation, so that is also true, the battery is pretty durable. I played heavy games for about 2-3 hours and only about 20-30% was wasted(with a lowered brightness). The only thing that really annoyed me and if I had known would have made me not buy this tablet was controller support...there is NONE. My nexus 7 detects and already supports xbox 360 controllers, so it really is just plug and play, and it works as it should(full support for analog sticks, trigger buttons, etc.) However, on this tablet, this is not so, when you connect the controller, it will just blink the green lights forever with no response at all from buttons, you need to purchase an app that will detect your controller(usb/bt joystick center) and even then it doesn't work as an xbox controller but instead as a generic IME device where you have to map buttons, this is a problem for games and emulators because you have to do different mappings for different games and emulators will not detect the analog sticks as actual analog sticks and trigger buttons as trigger buttons, but only as mapped keys(a problem if you want to use epsxe for android as it only lets you map axis, but not other emulated mappings)...In other words, NO native support for gamepads is a hassle on this tablet, but other than that, I guess it is a pretty good tablet for the other various things tablets do.", "Date": "May 6, 2014"}, {"Title": "Best purchase I've made in a long time", "Author": "Amazon Customer \"Promgoers Mom\"", "ReviewID": "R3SM9K6Y1BBAZ5", "Overall": "4.0", "Content": "This is my first tablet and I am happy that I waited to get it! It does everything that my laptop would do. It is much lighter to carry around. I am pleased with the performance and the many functions that are available. I especially like being able to open more than one window at the same time!", "Date": "May 4, 2014"}, {"Title": "best tablet I ever owned", "Author": "Tammy Burress", "ReviewID": "R1C7T7YB833B17", "Overall": "5.0", "Content": "I love my Samsung galaxy tab pro 10.1. I bought my tablet on Valentines Day one day after it first came out and I don't have anything bad to write about. It is fast, great picture, and no buffering when watching movies.  I bought mine at best buy when we went there we was going to get a laptop but I seen this and after I played with it I had to have it.  I think apple has a little competition.", "Date": "February 25, 2014"}, {"Title": "Galaxy Tab Pro 10.1 Tablet (Black)", "Author": "William P. Smith", "ReviewID": "RZITWX4IQ34EV", "Overall": "5.0", "Content": "Great tablet.  Very light and thin. Better than the iPad air. Quick processor, good performance. Beautiful resolution and great graphics.", "Date": "March 24, 2014"}, {"Title": "Love this Tablet", "Author": "Grandmom", "ReviewID": "R3B465F4R2ZLTM", "Overall": "5.0", "Content": "I won't (can't) go into as much technical detail as some other reviewers have,  but their in-depth reviews were very helpful to me.  I will simply tell you what I do and do not like about this tablet after using it for a few days. If later I feel differently,  I will update.LIKES:*  The beautiful display,  surpassed only by the smaller 8.4 model.*  The physical aspects: very thin,  very light,  comfortable-to-hold material on the back.*  No lagging or stuttering,  but that could be because I minimized the presence of that magazine interface.  It requires at least one pane on one home screen,  so I set up one pane to show recent docs opened in the office apps, and that one pane does not eat up resources.*  Very customizable.*  It works.  I had THREE Nexus 7s, first generation,  in less than a month,  all of them defective.  That put me off tablets until I just now worked up the nerve to try again.DISLIKES:*  That magazine interface.  Too busy, and one can use only certain sources for the feeds.  But it is easily minimized, ignored and forgotten.*  The home button is a physical button.  It,  and the back button and the active apps button,  do not follow when the device is held in the portrait orientation. But I'm used to this as I have the Galaxy S4 phone.*  The price,  but I paid it because this device kept coming out on top when compared to others.", "Date": "March 13, 2014"}, {"Title": "Best tablet out there!", "Author": "Amazon Customer", "ReviewID": "R2LXO94B90EGG", "Overall": "5.0", "Content": "Amazing!  Fast. Light.  Beautiful screen.  Expandable Memory.  I was considering the ipad air but I have no doubt made the better choice with this Android tablet.  It does EVERYTHING.  Seamless integration with wireless capability and the freedom of Androids ecosystem.", "Date": "April 29, 2014"}, {"Title": "Disappointed", "Author": "Digital Shopper \"Jon S\"", "ReviewID": "R4XFLUMU5I20C", "Overall": "3.0", "Content": "I love everything about my Samsung Galaxy S3 so I thought I would love this tablet.  The design, display and build quality of the Tab pro is great, but unfortunately, the Touchwiz UI ruins it for me.  Particularly, the Magazine UX could use some more refinement as it doesn't seem fully baked.  In my case, it pulls most of its content from Flipboard so when I open something from Magazine UX it launches in Flipboard and I end up going back and forth.  Could save myself a lot of time and tapping if I just launch flipboard to begin with. I would just turn Magazine UX off but you can't so it is always there as you swipe through the home screens.My other two complaints; there is about a one second lag from the time you click the power button to the time it actually comes on and when streaming audio via bluetooth, the volume is very low and there isn't much base. My Nexus 7 (2013) doesn't have any of these issues so I am keeping it and sending the GTP back.Not worth $500 to me.", "Date": "March 5, 2014"}, {"Title": "Excellent Tablet", "Author": "K.", "ReviewID": "RD2E54OBS466H", "Overall": "5.0", "Content": "I had previously received the Ipad 2 as a gift a few years ago and while I liked it, didn't like being locked into the Apple universe. I also have had many iterations of the Kindle fire and HDX, but just wanted something a bit larger to read magazines, read my kindle books, watch videos and do some work.  This is a home run.  The screen is excellent (comparable IMHO to the HDX).  Love that you can upgrade the memory (which I did).  However, just know that apparently you cannot utilize prime books on the lending library with the Tab Pro....Amazon only lets you utilize the lending library on their devices.  So sadly, I ended my prime account as I wanted to use only one main device.  (At least this is what their help desk told me).  It's an excellent tablet, light and zippy.  Highly recommend.", "Date": "March 26, 2014"}, {"Title": "Superior Android Tablet. Packed with Features & Can Multitask - There is A Lot To Love About this Tablet.", "Author": "Carrie", "ReviewID": "R3IAP562PRCBLX", "Overall": "5.0", "Content": "The Samsung Galaxy Pro 10.1 is one of the nicest Android tablets on the market & is a tablet a business user should consider.  Unlike its 8.4 sibling, the 10.1 has a Samsung Exynos 5 octa processor so that it can handle multitasking with ease.  There are still a few annoying things, especially if you use Windows for business. All in all, however, the positives outweigh the negatives, and, for light business use, the Galaxy Tab 10.1 is a strong contender in the tablet arena.What to Love:1. Bright, clear display2. Easy to set up/intuitive3. Quickly downloaded my contact information (from outlook/hotmail)4. Expansion slot allows for a 64GB microSD card5. Lightweight & thin (for a 10.1)6. Decent battery life7. Easy to connect to wifi8. Decent rear/back camera9. Can split windows/open multiple windows10. Did a good, quick job of transferring large files from folder to folder, USB or SD card to tablet folderCould be better:1. Gmail emails are in a different folder/app than other emails (hotmail, roadrunner, etc). It would be nice to have them together.2. Need to use a USB adapter in order to use a flash drive3. Have to download each HanCom App separately4. There doesn't seem to be an equivalent HanCom version of OneNote5. Have not tried, but other reports indicate that Excel Macros do not transfer to the HanCom version6. If you are using the USB adapter, you cannot charge the tablet at the same timeI did not try the tablet as a remote, but to do so, you must have or register for a Samsung account.I travelled overseas with the 8.4 tablet. While I loved the fact that the 8.4 was lightweight & very packable, I did not like the fact that it choked on large file downloads, thus eliminating one of the advantages for taking the 8.4 over the 10.1 or (my old) Surface (which is larger & heavier, but also can handle all of my required tasks).  Had I toted the 10.1, which isn't that much heavier or larger than the 8.4, I not only could have used it daily to connect to the internet for emails & social media, I could have also transferred everyone's pictures easily & quickly.  Consequently, the 10.1 is the better travel tablet for my needs.I've used a Sony Experia tablet (10\" Android), a Surface tablet (Windows) & the Samsung Galaxy Tab Pro tablets (8.4 & 10.1). Of the two Android tablets, I think the Samsung 10.1 is a superior tablet for light business use and travel.  For simple tasks - email, social media, light gaming (time killer gaming), the 8.4 tablet is a good choice. As compared to the Surface, the 10.1 Tab Pro is more lightweight, but the Surface is more functional as a business tablet because Word/Excel/Powerpoint are seamless applications.  However, for light business use (reading files, small file edits), the Galaxy's HanCom suites work well and can handle simple Word/Excel/Powerpoint files. Keep in mind that the HanCom version is not the complete version, so certain items may be lacking (ie, Excel's macros).Scorecard:Sony Experia: good for email, social media, light gamingSamsung Galaxy Tab Pro 8.4: good for email, social media, light gaming, travel.Samsung Galazy TabPro 10.1: good for email, social media, light gaming, travel, light business useSurface: good for email, social media, light gaming, travel, light-moderate business useBetween the Samsung Galaxy Tab Pro 10.1 & the Surface, if you are a light Office Suite business user, the Tab Pro has an advantage because it is lighter & easier to carry.  The Surface is heavier, but has more business functionality (full USB port, can charge at same time as using the USB, kickstand, touch or type cover). The Samsung does not have a manufacturer created touch or type cover, and I did not do the research on after market covers.In the end, I like both the Samsung Galaxy 10.1 & the Surface.  I will carry the Galaxy 10.1 on trips & the Surface will be my daily office tablet.", "Date": "April 13, 2014"}, {"Title": "A very good tablet", "Author": "VT Woodman", "ReviewID": "R1NKEWS8ALAZFK", "Overall": "5.0", "Content": "I've had the Pro 10.1 for about 10 days and really am enjoying it. It is light, fast and a big improvement over my Nexus 7 tablet. I gave it 5 stars but really wanted to give it 4.8 stars. Maybe I'm being nit-picky but the Nexus tablet (which my wife now uses) had a very nice feature that is missing on the PRO 10.1. When you rotate the Nexus the 'App Mgr', 'Home' and 'Back' \"buttons\" rotate with you, so you always know where they are when you need them. Not so with the Galaxy. Those \"buttons\" are fixed for landscape viewing and thus do not move when you rotate to portrait view. Not a big problem unless you (1) have several apps that only run in portrait mode and/or (2) you have a big thumb that occasionally hits one of those \"buttons\" and takes you where you were not planning to go.That being said, I do believe that the Galaxy is the way to go. I chose the Tab Pro 10.1 for the screen size and for its high quality display. It is much better tablet than the plain Tab 4, which I almost bought until I got a good deal on the price of the Tab Pro. I'm glad I waited.", "Date": "June 6, 2014"}, {"Title": "Great KitKat Tablet", "Author": "Richard Maule-ffinch", "ReviewID": "R1JOLSNGW0KDAU", "Overall": "5.0", "Content": "Much lighter than the Tab 3 10.1 and a fantastic display. Very quick - the twin quad core processors work brilliantly. I cannot find a fault anywhere. Buy it - it is, in my opinion, better than the ipad air.", "Date": "June 5, 2014"}, {"Title": "Precision engineering for maximum user experience", "Author": "Todd Kleinert \"WareWolf\"", "ReviewID": "R25H6YK6VC6PK", "Overall": "4.0", "Content": "Only complaint is lack of USB 2.0 port. Very fast processor, excellent battery life,  bright clear screen. Stylus works OK for most use too. Really seems solid well made compared to cheaper tabs I have owned in the past. Kit kat 4.4 os for maximum security. I picked it up at a big box retailer which included a $50 gift card, for 349 in 16gb/2gb/black model ..520.. loving it.", "Date": "May 26, 2014"}, {"Title": "excellent conditions and quickly deliver.", "Author": "FON", "ReviewID": "RTMP2TSVB5LFL", "Overall": "5.0", "Content": "I like it very much. The tab is in a excellent conditions. and it beyonded my expectations Thanks a lot!", "Date": "May 4, 2014"}, {"Title": "Amazon Rock!!!", "Author": "robert waldron", "ReviewID": "R14A0BBI250CPB", "Overall": "5.0", "Content": "Super nice tablet. Ordered Thursday night at 7pm and had my tablet Friday afternoon!!!Outstanding!!! Very Happy with my purchase.", "Date": "May 2, 2014"}, {"Title": "Decent tablet but I expected ...", "Author": "commops7", "ReviewID": "R1C511LG546JWL", "Overall": "3.0", "Content": "A little more from Samsung. It had a nice finish, faux leather in white I got. It was fast and performed nicely but the item I had was flickering on the screen, had to return it. Otherwise, a nice item. Very sweet, best yet actually.", "Date": "May 2, 2014"}, {"Title": "Cool light and powerful device", "Author": "Vlad", "ReviewID": "R1XVWQ0JZYCO1D", "Overall": "5.0", "Content": "I use it for a month. There are no significant problems. Time to time there are lags but it is not annoying. Battery is very good! It can work without charging for a week with power saving function. The led is awesome, very bright ans clear. It has enought performance to play BD fioms via WiFi smb storage, but games like Asphalt 9 too hard. Multi window mode is brilliant as the rest features such as smart view.", "Date": "April 29, 2014"}, {"Title": "So far I am really enjoying my tablet.", "Author": "Curt Mader \"Geekazoid\"", "ReviewID": "RPYNY0AAO7INZ", "Overall": "5.0", "Content": "So far I am really enjoying my tablet. I use it for email, facebook, games, and an e-reader. I also use it to remote into work...", "Date": "April 25, 2014"}, {"Title": "Amazing tablet, I love my purchase!", "Author": "Pen Name", "ReviewID": "R1IUH041KYCUX6", "Overall": "5.0", "Content": "My 1st tablet! Works perfectly. I love the screen and I love that it's so thin. I'm glad I chose this tablet you will not go wrong. You'll go wrong getting any other tablet.", "Date": "April 25, 2014"}, {"Title": "Great tablet.", "Author": "Carol", "ReviewID": "R4O33MNVXD0", "Overall": "5.0", "Content": "Great tablet.  I did a lot of research and decided that this was the best choice for me.  Well worth the money!", "Date": "April 18, 2014"}, {"Title": "The Best Tablet I've ever had!", "Author": "amprg", "ReviewID": "R11YNR96D78MT5", "Overall": "5.0", "Content": "Don't waste your money, time and nerves with the other tablets. I believe, this is the best one. I've had different brands before. This is something else! You can feel the real high quality product. I have this tablet over a month now. Its performance is the same as the first day it was.", "Date": "April 12, 2014"}, {"Title": "Love it", "Author": "Amazon Customer", "ReviewID": "R3IGIKJIZ57H4Z", "Overall": "5.0", "Content": "Simply awesome. Resolution is great. Feels great in hands. Android 4.4 is smooth, I was deciding between Galaxy Note or this one. Finally went for this one.", "Date": "February 17, 2014"}, {"Title": "Nice but do not care for magazine UI", "Author": "D. Chieng", "ReviewID": "R26L5BFE6LEQ2J", "Overall": "5.0", "Content": "It is thin, pretty, and study. Runs fast, screen is awesome, stereo speakers' sound is surprising good. As for the magazine UI in TouchWiz, don't care for it. Stinks that it can't be disabled. The solution is to download other launchers such as Nova Launcher and use it in place of Samsung's TouchWiz and rid of Magazine UI forever. Kitkat is nice, but use of external SD card with apps is kinda confusing and some apps do not seem to work properly with external SD.", "Date": "March 27, 2014"}, {"Title": "Samsung Galaxy Tab Pro 10.1", "Author": "Gloria J. Nicolas", "ReviewID": "R1SZ8SC97QKELU", "Overall": "2.0", "Content": "This is not my first tablet. This is my first review. I have always been happy with Samsung products and have many in my home. I ordered this tablet from Amazon and when I received it, the memory slot would not read my external card. Tried several cards and tried them in other tablets and they worked fine. I returned the tablet to Amazon and they sent me another one. I have had this one for about 6 weeks. I have been happy with it's performance until this week. It just turns itself off randomly when I am using it while it has a 50-75% charge. You have to hold the button down for about 20 sec to get it to come back on. I contacted Samsung support and after troubleshooting they told me to return it or fill out a service request. This is a $500 tablet that is 6 weeks old. Are you kidding me? It is too late to return to Amazon so I guess I will be dealing with Samsung service. What a disappointment. I must say I have never had any problems with my kindles. Thank you Amazon.", "Date": "May 28, 2014"}, {"Title": "Samsung Galaxy Tab Pro 10.1", "Author": "John Pears", "ReviewID": "R3HDWMIDXO3IEP", "Overall": "5.0", "Content": "This may sound a little lame, but I highly recommend this tablet! You can pretty much stop the chase of looking at tablet specs for comparison and just move straight to the purchase phase right away!Like you, I always do a lot of research before I decide to make an investment in any new gadget because I've been burned before, but after buying this tablet, it definitely has delivered on the promise.I looked at the 12.2 inch version and the Note Pro versions, but I just could not justify the extra expense of going with any of those and so I ended up getting the 10.1 Pro tablet. It definitely is a little pricey compared to other tablets which definitely makes you question whether it is a good idea to go for it. That old adage of you get what you pay for doesn't always hold true, but I feel that it does in this case.You'll see other reviews about the specs of this tablet and they definitely helped me in my decision to get this tablet.Happy shopping!", "Date": "May 17, 2014"}, {"Title": "Excellent+++", "Author": "G. L. Powers \"Inspired\"", "ReviewID": "R14S0KFV0VDU8O", "Overall": "5.0", "Content": "Most advanced tablet we could find.  Snappy performance and battery life is as advertised.  Multiple user capability is helpful.  In short, an excellent tablet....", "Date": "May 11, 2014"}, {"Title": "Better than an IPad", "Author": "Larry Lewis", "ReviewID": "RGPAYWCYS82LN", "Overall": "5.0", "Content": "Excellent speed, colors, easy to use.far exceeds IPad both in ease of use, color brilliance, and speed, This is a 5 star unit.", "Date": "May 9, 2014"}, {"Title": "Great tablet", "Author": "Amazon Customer", "ReviewID": "RTGPQL947LXEI", "Overall": "5.0", "Content": "This is great  tablet it so many great things I so glad that I investment in this tablet great color I love it I would say everyone should have they will love it", "Date": "March 29, 2014"}, {"Title": "Fun, Fast & Easy to use!", "Author": "BrittNae", "ReviewID": "R18ZGQT7J3K73S", "Overall": "5.0", "Content": "I bought this tablet to help in my business life as a Realtor.  It is easy to use, fast and a nice easy to read display.", "Date": "March 28, 2014"}, {"Title": "Even better than the note 8", "Author": "surfnut", "ReviewID": "R9YMOA1YT08NX", "Overall": "5.0", "Content": "the pic quality is the best I have seen, have had it for a month and a half and no problems at all, really fast. I am still discovering what all it can do. speakers are the best I have heard from any tab. would recommend to anybody. Worth the $499 !!", "Date": "March 21, 2014"}, {"Title": "My wife loves it", "Author": "S. Fox \"regular guy\"", "ReviewID": "R3A5EN2K3BUGI0", "Overall": "5.0", "Content": "I purchased this to replace my wife's Amazon tablet.  I don't care for the magazine display and, while it can be customized, I don't see where it can be turned off.  I have an Asus tablet with all five Android screens,  The magazine display uses two of these screens.  My wife loves it, though, so it gets five stars.  The display is as crisp as that on my TF700T, battery life is good, and it recharges relatively quickly, though not as fast as my Asus.  She likes (as I do) that the three Android buttons are below the screen and she likes the pseudo leather back of the tablet.  I like that Samsung updates its Android version, a gripe I have with my not current Asus.", "Date": "March 18, 2014"}, {"Title": "Great tablet", "Author": "Chris Jensen", "ReviewID": "RYEDML5WE2SSR", "Overall": "5.0", "Content": "I had been looking at tablets for a while now. I was looking to get a Google Nexus 2 but they never came out so when these hit the market I jumped. It's been great for browsing the web and playing a few games. That is all I would ever want to use a tablet for anyways. Too small for my tastes to use for any real work.", "Date": "March 13, 2014"}, {"Title": "Good Android tablet with a fabulous display", "Author": "MikeSp", "ReviewID": "RS0Y035IMH078", "Overall": "3.0", "Content": "The good: outstanding display, and unlike the iPad I gladly got rid of, I can drag and drop files into the MicroSD card such as movies or music without using the cursed iTunes and having Apple control my life.  It is easy to use and while some people do not like the TouchWhiz UI, I saw nothing wrong with it except for the Magazine version.  The build quality is excellent.The bad:  The Magazine UI is worthless and I deleted every pane that I could and went back to the normal looking UI.  The price dropped $100 since I bought two of these and is now a much more appropriate price.  There are times that when typing an email, it simply stops for 10 seconds or so and then catches up, and sometimes it slows down to a crawl and rebooting is necessary to bring it back up to speed which is no faster than my old version 1 of this tablet.  It also stops using the Comcast POP3 configuration so that I cannot receive emails about once a week even though all settings are correct -- I delete my Comcast email account in the tablet, put it right back in (takes two minutes) and all is good except that it will then download every email of mine still on the Comcast mailserver.  I feel that it is far too slow in opening graphics in emails considering it has 8 cores.  My iPad was more rock solid in operation -- BUT, I would NEVER again own a tablet that I could not easily drag and drop files into some type of external storage like a microSD card or be held captive by iTunes.", "Date": "June 8, 2014"}, {"Title": "Awesome! Better than expected!", "Author": "CCG", "ReviewID": "R1F8OUV7LPPWYU", "Overall": "5.0", "Content": "It allows myself to organize better and the new interface is quite straightforward and dynamic.It is very customizable for storing your files, almost like a computer.", "Date": "June 8, 2014"}, {"Title": "As Good as it gets!", "Author": "Amazon Customer", "ReviewID": "R9VAOT3YWA5B1", "Overall": "4.0", "Content": "I have had it for a couple of weeks and I really enjoy using it.  It is probably the best tablet out there at this price. That being said, I have two complaints.1. Videos play with weird lines through them.  Not Youtube videos but video from cnn and other websites.2. Samsung should have made it clear that Tab pro means NO S Pen.  I would have sprang for the extra $30 to get the screen that you can use then S pen with.For some reason I thought that Pro meant that it was stock android but I was mistaken. It is chocked full of Samsung goodies. I guess I prefer the stock android experience. Not a problem as I can flash a new flavor on so this is not a deal breaker.", "Date": "June 6, 2014"}, {"Title": "Great", "Author": "Brandon", "ReviewID": "R27YDN6F7KLPH7", "Overall": "5.0", "Content": "This Product is great I bought it as a gift for my mom for mother's day she loves it she can't put it down I'm going to get one for myself I love the big screen can't say enough about this product it's great", "Date": "June 5, 2014"}, {"Title": "Nice tablet", "Author": "Lawrence Tuczynski \"godzillamusic\"", "ReviewID": "RU2UX3HPLP1RO", "Overall": "5.0", "Content": "I've had this for about a month now and love it. It's easy to use. Updates are fast. I also have a Microsoft Surface that came with Windows 8. Took me a day and a half to download and install all the updates to get to Windows 8.1. While I love Windows 7, version 8 is a real pain to use and not intuitive like the Samsung Galaxy. I use the Galaxy almost daily and rarely use the Surface.", "Date": "June 4, 2014"}, {"Title": "Amazing", "Author": "Paulo Degani", "ReviewID": "RP64IHT6IVLJZ", "Overall": "4.0", "Content": "Samsung Galaxy Tab Pro 10.1 is very good, but some apps (Android)  do not work well, such as Facebook. I recommend the gadget.", "Date": "June 4, 2014"}, {"Title": "A good tablet.", "Author": "Thorbjorn Finnbogason", "ReviewID": "R379DXN1G2OCKZ", "Overall": "5.0", "Content": "I am still learning how to use this tablet, but so far no complaints. It is my first tablet, and I have been using Laptops in the past.", "Date": "May 30, 2014"}, {"Title": "Great product", "Author": "Kimberly Baynes", "ReviewID": "R3TIK6RZ7Y78UD", "Overall": "5.0", "Content": "This is actually my 2nd tablet. I used my other one multiple times a day every day for about 3 or 4 years before it showed signs of problems. I also got a Gumdrop case. I dropped it from shoulder height onto asphalt and not only did the tablet survive without problem the case only had a small nick.Shipped fast and was packaged well.", "Date": "May 29, 2014"}, {"Title": "Galaxy Tab Pro 10.1 vs. Galaxy Note 10.1 2014 Edition? (Is the extra 1GB of RAM worth giving up 2.51oz lighter weight?)", "Author": "Soyokaze44 \"Soyokaze44\"", "ReviewID": "R384F99NDSERK", "Overall": "2.0", "Content": "I posted this question on \"Question & answers\" earlier today, but some dude just ruined it with irrelevant answer which did nothing but had my question moved down the list so that it would be exposed only to those who actually click on the Q & A link. I would really appreciate some input to help me decide to go with either one of two or none. Below is my reviewI bought a tab pro 10.1 four days ago. I love the screen, but it lags time to time. No major delays though, it lags a bit when switching to app list from home screen, changing from horizontal to landscape mode, adjusting a web page to fit the screen (which occurs automatically when opening a web page), and etc... I am currently using Note 3(from Note 2) & Nexus 7 (from original galaxy tab). Compare to what I am using now, this tablet seems  slower. So, I was wondering if it was my particular device or Tab Pro 10.1's in general. If note 10.1(2014) performs better, I wouldn't mind switching to it despite its heavier weight. As I carry my note 3 and use the s pen all the time, note 10.1's stylus is not a factor for me at all.", "Date": "February 27, 2014"}, {"Title": "Samsung Galaxy Pro", "Author": "James Castress", "ReviewID": "R31BG61LXEJQOP", "Overall": "4.0", "Content": "Tablet has great battery life(approx.9-10 hours), a stellar screen and has excellent speakers for a tablet. I got the 16 GB version and have had no problems, but I do not house movies on the tablet. It is very thin and light and easy to transport. I have had  it a little over a month and am very impressed.", "Date": "March 19, 2014"}, {"Title": "Superb Product by Samsung but price is an issue", "Author": "Chintan Jhaveri", "ReviewID": "RK67E1RZPG8DH", "Overall": "4.0", "Content": "Hi - As usual and expected, excellent product by Samsung, no issues at all and delivered on time. A nice to have tablet. The performance of this tablet is superb with all the goodies of Android and hardware by Samsung.Only one complaint, I purchased this product on 4/11/2014. The price at that time was $449 which is currently $399.00, slashed by $50 in a month. The price was $499.00 when launched.", "Date": "May 19, 2014"}, {"Title": "This thing is awesome", "Author": "Jeremy G.", "ReviewID": "RD0N4V0W28N19", "Overall": "5.0", "Content": "I received this on time and in perfect condition.  The tablet works great, better than I could have hoped for.  I love the remote access to my computer and use as a remote control for my home theater system.  It has good resolution for watching Netflix and Hulu Plus...  only complaint is .. well, I don't have any complaints...", "Date": "May 16, 2014"}, {"Title": "luv it", "Author": "jeff Tackett", "ReviewID": "R1P34C89BDKO34", "Overall": "5.0", "Content": "So glad I chose this tablet, it was well worth the money. Shipping was super fast and way easy to set up. Would definitely recommend this product.", "Date": "May 11, 2014"}, {"Title": "Great Tablet", "Author": "Jay", "ReviewID": "R1BLW0GG881100", "Overall": "5.0", "Content": "Great tablet, super fast and just a great value overall. Just got the S4 and both devices married up nicely right away.", "Date": "May 10, 2014"}, {"Title": "The Best...!!!", "Author": "BRAULIO TERAN", "ReviewID": "R1H1513FKOGU3F", "Overall": "5.0", "Content": "For productivity, this one is the best tablet you can find nowadays. Its specifications are great and its performance is really impressive. iPad who...????", "Date": "May 9, 2014"}, {"Title": "Perfect alternative to an iPad for Android lovers!", "Author": "S. Bryan", "ReviewID": "R3JOAQ6BXACUP8", "Overall": "5.0", "Content": "I had been wanting a tablet for quite a while but didn't want to fork out the cash for an iPad, plus we are Android users.  This tablet is perfect!  It has a huge screen, is very user friendly, and I can find tons of accessories and cases for it on Amazon.  Love it!", "Date": "May 9, 2014"}, {"Title": "Samsung great job", "Author": "Raúl Tovar Maldonado", "ReviewID": "RKWEQWZHN2X92", "Overall": "5.0", "Content": "This is a perfect machine for a casual user.  Samsung made it a really nice job with this new series.", "Date": "May 7, 2014"}, {"Title": "Ilike it", "Author": "Gman", "ReviewID": "RS7QCEMM1LN7X", "Overall": "4.0", "Content": "I do not think it is better then an Apple IPAD, but it sure gives you more for the money", "Date": "April 30, 2014"}, {"Title": "Met my expectations", "Author": "Juan Ponce Casasola", "ReviewID": "RCQC7FHXM7BWH", "Overall": "5.0", "Content": "I basically bought this to use for augmented reality apps, and i was impressed by the performance. Both apps that i've tried (Augment and AR Media) work smoothly. Screen is gorgeous with beautiful rich colors and the resolution just makes it a lot better.I waited until this year to finally buy a tablet and since CES 2014 i was leaning to buying this Samsung model, well it has definetely met my expectations.", "Date": "April 25, 2014"}, {"Title": "HIGH END TABLET, VERY VERY LOW END SERVICE", "Author": "Stephen G.", "ReviewID": "R17H9ZCS4GMUQ6", "Overall": "1.0", "Content": "AS someone else commented, this is a high-end tablet advertised for business use.  But evidently (this can be confirmed online) this particular tablet suffers from a defect that can lead one to encounter a dead lcd screen if the battery runs down too much.  Not sure how that's acceptable for people who live in hurricane, tornado or earthquake country, but in my case I just unknowingly plugged it into an outlet that wasn't powered.  In any event, my lcd is now dead.  Samsung is technically \"covering it under warranty\" but their version of this benefit is that I must ship it back to their depot, where it will take ONE TO TWO FULL WEEKS, AFTER THEY RECEIVE IT, to get it repaired or replaced.  That means I could be without my tablet for 3 weeks!  I would have paid to have it repaired faster or locally, but this was not possible.  It's misleading to market this as a BUSINESS Tablet and then have a \"warranty\" that could leave customers without it for 3 weeks.  When one is using a tool for business and it does not perform up to specifications, a responsible company repairs it quickly and a responsible seller is very clear about the quality of guarantee the buyer will have.", "Date": "June 7, 2014"}, {"Title": "Samsung Galaxy Tab 10.1 2014 KitKat", "Author": "Robert Rantschler \"rancho_cr\"", "ReviewID": "R3MQ1A19OXXI6A", "Overall": "3.0", "Content": "I like almost everything about this tablet, which is my first venture into the world of tablets.I bought two of these for me and my wife, largely based on the flexibility offered by the SDcard, which is not available in iPad.  Unfortunately, KitKat keeps users from directly accessing the SDcard, which takes away the advantage of the Galaxy.As a cynic, it appears that Samsung and Google are going down the path of Microsoft, wanting to discourage 3rd party developers that might not contribute to Google's bottom line.The only work-around seems to be to 'root' the device, thereby voiding the warranty.  So Google wants us to either accept the fact that they are freezing out those who bought a tablet from really making use of that tablet or hack your own device.  What a conundrum!!!", "Date": "June 2, 2014"}, {"Title": "Great tablet", "Author": "Luminol", "ReviewID": "R3P0AR2UGG0H6W", "Overall": "5.0", "Content": "I should really be 4/5 but giving a 5 because this tablet does not deserve a 3 star. I used it for 2 hours and i find it much better than the ipad air i purchased 3 month ago.The high resolution screen really pops at you and the new touch-wiz coupled with ki-kat gives you a very smooth experience. Additionally the multi-window function is a MUST. ipad does not have these feature and I do not hing i can use my ipad ever again.", "Date": "February 13, 2014"}, {"Title": "I returned mine", "Author": "Tom Hall", "ReviewID": "R27D713BYRWMIE", "Overall": "3.0", "Content": "The resolution was great. Even with the multiple processors and 2mb ram it seemed slow. The touch screen was frustrating which is probably the main reason for returning.", "Date": "May 15, 2014"}, {"Title": "Frustrating touch screen", "Author": "E. Du", "ReviewID": "RFMVA960JPJD1", "Overall": "2.0", "Content": "I love a lot of things about this tablet, except the touch screen tends to miss one out of 3-4 taps. I don't know if the screen is too sensitive on scrolling so it often thinks I want to scroll rather than tap. The color of screen is way too saturated to me, but this is the issue for all Samsung AMOLED.I don't know if insensitive is the common issue of tab pro or just mine. I've heard from someone else who has exactly the same problem. I just ordered a replacement, but very likely end up with returning it.pro1. lightweight-only 1 pound and is the lightest in its class2. fast-both CPU and wifi are significantly faster than my old touchpadcons1. touch screen not very responsive2. color too saturated3. speakers are loud but not great4. switching between apps is sluggish. Waking up the device is slow too---------------update-------------------Thanks Amazon for the super fast turnaround, I've got my replacement this morning. I filed the return only last night. Impressive!However the replacement has same issue. I'll have to return it too. Don't know if it's worth trying note 10'. I'm getting quite frustrated with Samsung.", "Date": "May 22, 2014"}, {"Title": "Good tablet ruined by bloatware.", "Author": "Andrew Zenk", "ReviewID": "RSQTFM9ZVQJ3W", "Overall": "3.0", "Content": "What's wrong with just shipping stock android?  Samsung, I don't need your keyboard, I don't need your finder, I don't need any of your crappy built in apps.  I'm currently flipping a coin about whether to return the device or not due to the apps.  Stop it!I like the fit and finish of the tablet.  It seems to perform pretty well after the initial app install/update phase completes.  If it weren't for the marketing team at Samsung invading the user experience, I'd be perfectly happy.I guess I'll have to stick with the Nexus line in the future...", "Date": "February 17, 2014"}, {"Title": "This tablet was fail in so many ways for me :-(", "Author": "Shirley M. Hayden \"Bill Mitchell\"", "ReviewID": "R1JTQ2XN7QG7W7", "Overall": "2.0", "Content": "Let me count the ways:1) It's laggy and prone to random freezes.2) Black text looks dark gray - hate this.3) Videos are slightly out of focus (for some odd reason - Star Trek new movie looked plain awful).4) Terrible light bleed from bottom right edge - like mini spotlights - Samsung tablets are infamous for this.5) Back gets uncomfortably warm.Returned it after a day.", "Date": "June 6, 2014"}, {"Title": "good product", "Author": "Jaime Francisco \"ing. Jaime G. Francisco\"", "ReviewID": "R2XKEFBXQK6G5J", "Overall": "4.0", "Content": "Nice product. Cristal clear screen. I wanted to buy the note 10.1 buy this one exceeded my expectation. I recommend this product highly.", "Date": "April 15, 2014"}, {"Title": "A must have!!!!", "Author": "Santina Caruso", "ReviewID": "R3S0RU1XMKL81S", "Overall": "5.0", "Content": "The Samsung Galaxy Tab Pro 10.1 is a great new tablet. I gave it 5 stars for many different reasons. It is easy to use and has many great features. The tablet was at my house a day before it said it would arrive.  I am extremely happy with my purchase.", "Date": "March 13, 2014"}, {"Title": "Awesome Tablet... I think I got the 1 in a billion defective ones...", "Author": "Alan W. Williford", "ReviewID": "R3V9SD0EZ9IL31", "Overall": "4.0", "Content": "FYI - I'm not slamming the tablet... if my new one is perfect, I'll update to 5 stars... Cause the thing rocks... then it rebooted... :(I got my Tab Pro 10.1 and before I could even get through the initial setup, it rebooted several times. All the chatter on the internet says KK 4.4.2 is a stable load. I am really confused and returned as I'm not technical enough to \"try\" some of the other rooting things, or what ever...I have ordered a replacement Tab Pro because the reviews are good...I bought this through Amazon warehouse... it makes me wonder if the previous person did something and sent it back... I'll know when my new one gets here!Alan", "Date": "April 14, 2014"}, {"Title": "a very good tablet", "Author": "tdptexas", "ReviewID": "R2GHXYBBUQ76K", "Overall": "5.0", "Content": "This is a very good tablet the size is great the screen resolution is outstanding, I did a lot of research on different tablets  glad I chose this one I have no regrets so far I will update later after using it more.", "Date": "February 16, 2014"}, {"Title": "not worth the price", "Author": "Mark Langley", "ReviewID": "RNQ5VZWV4AJG8", "Overall": "2.0", "Content": "I owned a galaxy note 1 phone and abandoned it because I often found it too sluggish. I swore off Samsung and touchwiz, but decided that my 7 inch nexus 2013 edition wasn't big enough for college text book display. I can say that the system doesn't have enough ram, because my nexus has the same amount of ram. Samsung desperately needs to update touchwiz, because it has a very noticeable lag. There's no reason a quad core processor with 2gb ram should outperform a octacore processor with the same ram. Major operating system failure. Even worse if you multiwindow or multitask, and absolute standstill if you do both.It has expandable memory, but due to the newest updates in android you don't have permissions to save to SD from an app stored on internal memory. Nothing like highlighting through 40 pages of material and then being unable to save your work! Of course you can install your own ROM to Gert around this, if you're tech proficient, but doing so will void your warranty. I might be willing to do that on a $200 slate, but on a $400+ tablet.... I feel obligated to exercise more caution.Comes with hancom and several other freebies. Of course most slideshows still show up closer to their original format if you use QuickOffice, which is native (and free) on all android systems. It has multiwindow, but this is more gimmick than functional. It also has a beautiful magazine UX which replaces Google now, which I find annoying and ram draining. I never use it , but even if I did like it I could just download Flipboard as a free app rather than it being forced integrated. It has Samsung voice, which is no different than Google now, as well as 100 other copycat apps. Maybe if you've been Samsung loyal for the past 4 years this is what you want, but by and large Samsung copycats seemed convoluted and gimmick ridden. S pen is not included, but you can buy a stylus separately if you prefer using them - just don't buy an S pen.Doesn't have NFC, so if you want to transfer pictures you'll likely have to connect your phone to a computer to get then on you tab or half heartedly promise your friend you'll send them the picture. Also, if you plan to load any custom Roms and void your warranty, the 10.1 tab is last in consideration. Everyone is developing for the 8.4.If I find any other issue with this tablet, I'm going to return it.", "Date": "April 24, 2014"}, {"Title": "More Stars!!!!!!!!", "Author": "sere2086", "ReviewID": "R1CPNP2WMV0DIW", "Overall": "5.0", "Content": "I Love it I Love it I Love it I Love It I Love it I Love It....the multi screen ....what else is there not to like ...all of the feature of a laptop..(per say)...just tablet-ific.... Loveeeee it!", "Date": "April 12, 2014"}, {"Title": "Not as practical as I hoped", "Author": "Dee Lilly", "ReviewID": "R2VEQFJR8OB9WO", "Overall": "3.0", "Content": "I purchased this for the purpose of genealogy.  I am new to tablets, ipads, whatever. I made the mistake of not checking to see if the system would support the program.  This is great for games and email.  And keeping my appointments.  So it's fun and easy in that respect.  I would have purchased a less expensive one for that.  My learning tip would be this, make sure the tablet will do what you want.", "Date": "May 14, 2014"}, {"Title": "Not as I expected", "Author": "Amazon Customer", "ReviewID": "R1CI3KC60UWAV6", "Overall": "4.0", "Content": "First the software does not support Adobe flash. I understand it is being replaced but so many sites still use it. Chrome is OK but I like Dolphin and it runs slow. Not sure the multi screen feature is worth it. It just open another app, does nothing to split the screen.I guess I was waiting for vast improvements. My old desktop is better than any tablet.not impressed but can't imagine any other tablet is better.", "Date": "May 3, 2014"}, {"Title": "Very fast", "Author": "trvlnb3", "ReviewID": "R8NYJL9NWB45G", "Overall": "4.0", "Content": "Just received Note Pro yesterday and still in the process of setting up apps. This is my first tablet so I really can't add any details like the other reviews. I will update as I get further into the tablet. The only reason I give it a 4 star is due to the tablet not having the S pen feature. Wish I would have looked a little harder when researching the other tablets. Why would Samsung not put the S pen into this one like they did with the 10.1 2014 edition?? The only advantage right now that the Pro has over the 2014 edition is android software. Just a matter of time before Samsung updates that. More to come.", "Date": "February 19, 2014"}, {"Title": "Disappointed with  poor video quality!", "Author": "Collin", "ReviewID": "R10U7PA1UAEWIW", "Overall": "2.0", "Content": "I have been waiting a few months to purchase this tablet.  I am replacing a first generation IPad and I was very excited to get the newest Galaxy Tab.  I use my Ipad for reading, surfing the web, Amazon Prime, Netflix, and HBOGO.  That is about it.  The tablet was amazing when I set it up.  It asked for my Google login during setup and had my calendar and email setup in seconds.  I love the layout and the feel of the tablet.  I actually loved everything about it except..... here it comes....watching videos. Amazon Prime isn't available for Android yet.  That leaves Netflix and HBOGO.  No matter what I did the video looked dark and the contrast was horrible.  Watching HBOGO gave my wife a headache.  The video was horrible quality.  I put it up to my IPad 1 and ran the same Netflix movie and the Ipad looked much better.  I guess the issues is with the 2 apps and not the device since I went through trouble shooting with Samsung and that is what the recommended I do, contact Netflix and HBO.  I scoured the internet and no one else had this issue.  I don’t understand.  The specs on this tablet are amazing.I was trying to get away from Apple so I first purchase the Kindle Fire HDX 8.9.  I actually loved the device,  but wanted a larger screen, Google integration, and freedom to use a different browser.  I have come to the conclusion that the IPad is the best tablet on the market and as soon as my money is credited I will purchase the IPad Air.Collin", "Date": "April 22, 2014"}, {"Title": "Don't waste your money.", "Author": "Patricia Driscoll", "ReviewID": "R372UA0FJ3C44G", "Overall": "1.0", "Content": "Issue with tablet turning off during web searches and as I am using it. Sent back twice, still happening. Samsung customer service was not helpful.", "Date": "April 14, 2014"}, {"Title": "Galaxy tab pro 10.1", "Author": "Chandra", "ReviewID": "RLVCUZ0QQ649C", "Overall": "3.0", "Content": "Got it from costco...screenwise excellent..no doubts on that..multitasking sucks..noticeable lag when switching..this is my second android tablet..the only problem that i see with any android tablet is the updates to the latest version..i had samsuing tab 8.0...God knows when i get updated to 4.4....", "Date": "February 24, 2014"}, {"Title": "STOP STOP STOP!", "Author": "CrazyAsian", "ReviewID": "R15GZ3LMI4Q8KA", "Overall": "2.0", "Content": "Why would you buy this? This is exactly the same as the Galaxy Note 10.1. The only difference between these two devices is that the Note has a wacom digitzer. Why would you not get the Note instead? The wacom digitizer is fantastic and does a great job at letting you take HAND WRITTEN notes, annotate PDF's in a HAND WRITTEN fashion, draw on a high resolution screen!Why would you buy this tablet instead? There's not wacom pen support...Please do research about the Galaxy Note 10.1 2014 edition before you get this!I'm currently an owner of the galaxy note 10.1 2014 edition, these two tablets look the same. The note has more ram, but the note does not have kitkat. If a tablet doesn't have a wacom digitizer then it pretty much lacks one of the most important factors of a tablet. The ability to do all the signing, writing, note taking, DIGITALLY LIKE ON A DIGITAL PIECE OF PAPER.Please, don't get this unless you've looked at galaxy note 10.1 2014 edition.Edit:Look at the pricing for both these tablets as of 2-17-14. The note 10.1 2014 edition for 16 gb is 500 dollars. It has digital pen, it has 3 gb of ram, and is 80 grams heavier. Look at the new pro tab 10.1 16 gb edition. It is also 500 dollars, NO pen support, and has 2 gb of ram. It is 80 grams lighter.Do the math in your head, you are getting less by buying this tablet. People are getting mad at this post since they are looking at this AFTER they bought the pro 10.1. And to try to make themselves justified, they throw out stupid arguments.YOU ARE GETTING LESS, IF YOU BUY THIS TABLET, PERIOD.I understand this is not a true review of the tab, this was never mean't to be. This was to inform consumers that samsung is selling two tablets at the same price, but one lacks the pen.Double Edit:Kitkat came out for the Note 10.1, so you have the same OS on both tablets now. Although, this tablet did drop to 400$. It should be 200$ though, seriously...", "Date": "February 17, 2014"}, {"Title": "worst tablet on the market not wort it", "Author": "arturo", "ReviewID": "R1ZDQP859K8NIK", "Overall": "1.0", "Content": "This is crap I bought this thing to enjoy social media,  you cant play any video on facebook, I was somewhat happy but this just kill it for me, there is small nick in the corner of the screen and I took it back, but they won't accept it back because of it, but the little nick was there when I opened,  I didn't care cause I was going to put a protective case anyways, but is going to Craigslist, so it doesn't matter, I will never buy another samsung product, ever again,", "Date": "June 6, 2014"}, {"Title": "Amzaing Screen, poor device", "Author": "Robert Vardell", "ReviewID": "R59RZ65LH9L6U", "Overall": "1.0", "Content": "The screen on this device is only surpassed by the 12.2 Pro yet that cannot overcome for the performance degradation caused by the bloated OS and features added to try and bombard you with \"stuff\". I am not an engineer,but the sluggishness of nearly everything I do on the device simply makes is something that will be added to my shelf collection, which also houses the Touchpad and the Playbook and my original ipad.", "Date": "May 17, 2014"}, {"Title": "BUGGY DEFECTIVE MESS score is 0 for 2!", "Author": "DEALHUNTER", "ReviewID": "R3CFMKKHW7MY9Q", "Overall": "1.0", "Content": "I awaited this to become available like a kid waiting for Xmas and was able to pick one(two) up at my local Best buy this today.Now that I've got my hands on one and then another one, they were both just incredibly defective at best. Spent two hours trying to get far enough along to look for an update on the first one but it kept crashing, with non stop force close messages and random reboots to factory settings every 30-45 seconds. Put all info back in again and ....same thing! Nightmare!Second unit to replace the first stayed on long enough to download the update 14.4mb that take almost 30 minutes on my super high speed WiFi and then hung up on a startup to \"installing updates\" logo/screen that just loops infinitely. I am soooo frustrated!I can't believe this is happening. I have never had this many problems with a tablet in my life let alone all from one! I will go back to the store one more time and if that's defective too, I give up. I desperately want this thing to work but NOTHING DOES! NOTHING.I was able to snap off a picture on the second between crash to factory reboots cycles and I can say that it was the nicest quality picture I've ever seen a tablet take....though I can't say ANYTHING else good about this frustrating piece of dissapointment.It is currently stuck in a boot installing updates cycle that will not stop. The tablet is boiling hot and will not turn off no matter what I do, I had to stick it in a metal cooking pot in case it explodes or starts on fire, this is not a joke.I am waiting for the hidden cameras to appear to see who's punked me but I'm starting to think this is reality after all. I've never seen anything so bizzare in my life, its crazier than a phone after a fresh swim in the toilet.Just a warning for what it's worth. I'm interested to see if there is a flock of other people who are also going through this??Will update tomorrow....", "Date": "February 13, 2014"}], "ProductInfo": {"Price": "$499.99", "Features": "Android 4.4 Kit Kat OS, 1.9GHz Samsung Exynos 5 Octa processor\n16 GB Flash Memory, 2 GB RAM\n10.1-Inch 2560x1600 WQXGA Display\nFeatures Hancom Office, Multi Window, Sidesync, Remote PC\nEnjoy over $800 of premium apps and services: $25 Google Play credit, 1 year of Gogo In-flight Wi-Fi® (up to 36 flights), 50GB Dropbox space for 2 years, and much more", "Name": "Samsung Galaxy Tab Pro 10.1 Tablet (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41x4J9PBLkL._SX300_.jpg", "ProductID": "B00HWMPSF6"}}