{"Reviews": [{"Title": "Build is good, screen is awesome, usage can be tedious but has it's rewards.", "Author": "okiedan \"Pro Bono Publico\"", "ReviewID": "R3IEK6I0GXVX7W", "Overall": "5.0", "Content": "UPDATE:  I wanted to revisit this review and tell you how it is going with this great product.  I have discovered playbook app and the ability to upload my rather extensive book library.  I use calibre with a drm removal program so that I can have all of the books I purchased available anywhere.I have had some issues getting this to sync with my samsung tv.  I have the remote control working and am able to control my tv just fine but I just can not get the screen mirroring to work.  It acts like it is going to connect and show up on my tv screen but then fails.  If anyone has an idea as to what I am doing wrong I would welcome your advise.It continues to function great and is getting free updates from Samsung for software.  I really like the rubber back....around the house i do not need a cover.So you are thinking about buying one of these.  They are rather high in price but you do get a nice large screen and a LOT of free software.....NOT what I would say is bloat ware.  For me bloatware consists of basic come ons that give me a few days for free and then I have to pay more money.  While that is true about some of the software much of what Samsung offers up is FREE>I will not simply cut copy and paste the specs.  You can see those for yourself.This is a new type of device.  A natural evolution of a common device.  It is a new and fresh approach to this whole new category of consumer tablets.  New in that they are still in their diaper stage........ much change has happened to size and weight.  Screens have become better and functions have increased.I like this device.  I am still learning how to use it.  My usage of windows 8.1 definitely helped me get going on this.  Sure I know this is android but it does share some common characteristics with the surface pro2...... i.e......you can have multiple applications running side by side.I like using the pen.  It is unlike any other pen I have used.  It communicates with the screen long before you ever touch it.  It is stowed in the side of the device.  I did not know this so I looked back through the box thinking they had forgotten to send it to me......then I found it.I was able to sync up my microsoft exchange account, my cox account, calendars, contacts, etc....I am able to use the amazon mp3 app to listen to my music..... I uploaded ALL of my music to the amazon mp3 cloud many months ago.Dropbox works fine as does OneDrive.Like many people I have vision problems.  Vision problems are not something for the aged it affects millions of people of all ages.The accessibility options are cool.  I have my voice over set for British female voice.  She sounds sexy.  I think I would like to meet her....anyone have Raj's twitter account..... Since he found Siri maybe he can help me find my sexy British voice......(don't tell my wife that I am looking for her)Sooooo with the pen out you just hover around the screen and it tells you exactly where you are.  Touch the icon for settings or samsung apps and she will talk you through it all.  I have the power button set so that if I hold it down for two seconds it pulls up the accessibility options so I can turn her off just as easily as she turns me on.One caveat with the voice over on is that you HAVE to use the pen..... finger touch does not work to change pages etc.....Playbook.....  a great way to get books and a FANTASTIC way for those of us with vision problems to get the text just right.Now that I have been using my new iPad Air and this Galaxy note for reading I fully realize what I was missing using my amazon HDX 8.9.  You can get the fonts way larger on the iPad Air and the Galaxy note than the amazon device.  When i say bigger i mean BIGGER.  We are talking about the difference between say 40 font and 60 font.PLUS with the added real estate of the galaxy I can get around 15 words per page.  The playbook app also has free and always on text to speech.  You just move the pen to the top and click start speech.Voce over works pretty much like on my iMac.  It works with programs on the note.  i.e...... Netflix.... voice over works with it and will read me what is on the screen.  A big plus for those of us with vision problems.  No more trying to find my high powered glasses...I can just activate voice over and use my lower powered 5.0 magnification glasses.Sadly when I use the google playbook I have to listen to there rather robotic female american voice....... please google let me use the samsung british voice.  I think I love her.I bought one case for this but it just is not what I really want.  I have two of the ionic brand on order.  One is like there Kindle HDX case and has a keyboard and the other is hopefully like a book.", "Date": "February 21, 2014"}, {"Title": "This tablet pricey but awesome", "Author": "Thor20 \"Thor20\"", "ReviewID": "R1HYRS66OVCGA5", "Overall": "5.0", "Content": "It took a while for my to pull the trigger on this one.  I just felt like it cost too much.  However, now that I have the tablet I have nothing but great things to say about it.  My previous tablet was a Gen-1 Ipad and this tablet and my ipad are night and day.  I enjoy using the multitasking and the S-Pen is very handy as well although,  I wish that I could do multitasking with Netflix without rooting the device.  Accessories are  cheap (unlike Apple), but not plentiful (unlike Apple).  I was able to purchase 2 cases and screen protectors for about $30.Battery:I have had the tablet for about a week, I am getting approximately 9-10 hours of use.  I typically stream Netflix, play games and surf the web with some light drawing via S-PenStorage Expansion:I purchased the Samsung 64GB Micro-SDXC-I card.  The card worked great no need to format it.Syncing:This is where I ran into some issue and had to do some serious research.  I wanted to be able to continue using iTunes to organize my media but sync that media including playlist to my android tablet.  I triedSamsung KIES 3:  I thought this would work very well for me, but it seemed to be missing a lot of functionality such as exporting playlist, etc.  KIES 2 had all the feature but was not compatible with the GNP  DoubleTwist:  This product worked well, but it will not sync any DRM protected content, my view here is I paid iTunes for the music and I would like to be able to put it on a non Apple device without paying to use their service.  Doubletwist also would not let me write my music to the SD card.  Android KitKat 4.4 prevents applications from writing to the SD card. This was a show stopper for me.  I want to control where my content goes.  I know they did it for security reasons but they need to find a better way to handle this.  iSyncr:  This is a paid app ($3.99 US)  .  This app allowed me to continue using iTunes as I did in the past, it simply hooks into iTunes and finds your content/playlist and syncs that with your Android device.  iSyncr also allows you to write to the SD card no problem.Screen:The screen is phenomenal I have watched a few bluray movies on it and I am very impressed.Speakers:The speakers on the GNP compared to my Gen-1 Ipad are very good.  The sound is not only loud, but rich and crisp.  I do not see the need of always connecting a Bluetooth speaker to my tablet just to hear over some back ground noises.Docking:I currently use the cable that came with the device, but would really like a docking clock system for my bed side.  Unlike Apple, Samsung has very few options in this space.Camera:Camera doesn't seem to do a very good job in low light, but who takes pictures (often) using a 12.2 inch tablet.  The software for the camera and movies seems to be feature rich, but I cannot provide a lot of detail as i have not used this part of the tablet often.Performance:The tablet is smooth and does multitasking without any issues.  Inititally there seemed to be a little lag as you swiped from screen to screen, but I followed the advice of another Amazon reviewer by the name of Chris Olic to resolve those issues see link below.http://www.amazon.com/gp/pdp/profile/A2OHHGEWFW3577/ref=cm_cr_pr_pdponSummary:I hate that I took so long to purchase this device.  I can see myself using it for a very long time.  Everyday I seems to find a new awesome thing I can do with it.  Do yourself a favor and don't wait as long as I did go get this awesome tablet.", "Date": "April 29, 2014"}, {"Title": "Still new to it, but so far WOW", "Author": "technojunkie", "ReviewID": "R1FZ7JWP205D6C", "Overall": "5.0", "Content": "I've S-pen.only had the tablet an hour now but I love the full screen keyboard and the new tile system is fantastic, I really like it. It's actually less heavy than it looks given its size. I am moving over from a note 10.1 2014 edition and so far immediately very happy with this device. I'll update more later. I'm giving it 4 stars only because it's my first impressions.Update: WOW, I new there could be 4 windows but they are always shown (on various website images) as a quad of windows. In fact you can turn many apps into overlapping windows or Facebook style chat head bubbles. I'm writing this review with my \"s\" pen and it's absolutely fantastic. It's great to have it on your lap while using the S-pen. So far it's very nice and I Love the large Screen. Update still loving the device. Very easy to touch type on. The interface is smooth, no jitters as far as I can see right now. It would be nice if more major apps could be windowed.There are two different ways to use the windows.  If you swipe left from from the side of the screen you see the multi apps. There are currently about 28 apps that use multi window. If you just TAP an app it will open as a floating window, like in, well, Windows.  You can have 5 apps open at once in floating windows and they can be resized and minimized into chat heads. Very handy.  If you DRAG an app it snaps into grid formation and you can have 4 of those. I really like the flexibility in the operating system.Another great thing and I don't know if this is kit kat but I know I can't do it on my note3 which is still running jellybean, but you can set Google play movies to DOWNLOAD MOVIES TO YOUR SD CARD  and for me this is huge!The only reason I wanted a 64gb tablet was to hold more movies but I only need 32 now because I can put a ton of movies on a 64gb sd card. Makes the 64gb version unnecessary.If anyone has questions I'll do my best to answer. Loving this tablet! And no it doesn't feel so big when you get used to it.", "Date": "February 13, 2014"}, {"Title": "I am IN LoVe!", "Author": "amazonian", "ReviewID": "R2ZXT76178YSVF", "Overall": "5.0", "Content": "What is not to LOVE! It's a Samsung product, it's an Android OS and it's NOT an Apple Product! Win, Win and Super Win! Sorry, I know apple makes decent products, but I just don't like them!Ok, I digress on with the Review.I have always had good luck with Samsung Products, I have a Galaxy Note Phone and it's been great!So, it was time to replace my tablet, I had a Kindle Fire, the \"original\" release. It was a fine 7 inch tablet but it was time to upgrade and I wanted a true android operating system.I did my research and once this went on \"sale\", $50. off, I jumped. It has been GREAT! Can you Say FAST! Wow! The Quad-core processor is amazing. It's so fluid and smooth. I like how easy it is to operate and how LIGHT this tablet is considering it's a 12.2 INCH Tablet! I mean, it's not lighter than \"air\" but it's also much larger than any \"good\" tablet on the market.  :\")The freebies that come with it are a nice added bonus, but the tablet is worth every dime I paid for it and the $50. I didn't!The S Pen is great, I love the S Pen on my Galaxy Note Phone and it's even nicer on such a LARGE Screen! Great for drawing, writing, whatever you want to do with a pen, you can do with this S Pen!This tablet is so fast and responsive on Wi-Fi and makes browsing a dream. I tether at work with my phone and it works great too! The Display is amazing, best picture I have seen in a LONG time, watching movies in HD is flawless and beautiful, it's almost immersive and a bit mesmerizing. The speakers actually produce clear crisp sound in stereo or even SURROUND!  It's a pleasant experience to say the least.You are drawn in by its beautiful picture and the 12.2 inch screen is the perfect size for watching TV/movies anywhere! Great Job Samsung! This is the best product I have purchased in a long time.Honestly, for what you get, it is priced just right, it's not expensive at all for what you get. I purchased this product for fun, leisure and enjoyment. If you want a fantastic, beautiful large screen tablet, I truly think there is no reason to look further. I love Android, so it's the android of choice for me.I did not buy this product from amazon.com even though I love them, I got a better deal buying it through Costco, not on the price of the tablet mind you, same price but on the price of the extended warranty.First, you get two years of warranty on all electronics you buy from Costco, secondly, you have a NINETY Day return policy and thirdly, the extended drops spills warranty I purchased was about a fourth of the price for something comparable on amazon.com. So, that's the only reason I didn't purchase from amazon.com.I will probably update this review as time goes on, but for now, I say make the jump, you won't be sorry.For the millions that have abandoned Apple and switched to Android, if you haven't yet but are tired of Apple's overpriced antics, this would be a good first experience with Samsung and All that Android's operating system can do for you.Also, while I love my little Kindle and as I mentioned before I wanted a true Android OS, not an amazon Hybrid, I would have purchased another Kindle Fire if it had a larger Screen and it would be nice to have Google Play on Kindle Fire too! Just sayin.So, Go by this tablet, you WON'T Be Sorry! You will be Happy, like me. :\")P.S. I wanted a 90 day return policy, just in case I had buyer's remorse.  Sometimes with large ticket items, I have buyer's remorse.  I am here to tell you, that didn't and won't happen.  I am \"connected\" to this bad boy, I take it everywhere and why not, it can do ANYTHING! :\")ll be Happy, like Me. :\")", "Date": "March 27, 2014"}, {"Title": "Replaced my notebook with this tablet, really like the tablet, but....", "Author": "PSmith", "ReviewID": "R3S7OI56V8MD1U", "Overall": "4.0", "Content": "I've owned the galaxy note 10.1, 10.1 2014, and now the Note Pro 12.2, this is mostly comparing the tablet to the older versionsI really do like this tablet, compared to the 10.1 it is definitely a bigger tablet, but when you actually have it, you'll be glad you have the real estate (and the updated android!). A lot of online reviews say you wouldn't want to pull this out all the time because it's so big, and I call bologna. It's so much smaller than my laptop, and way more convenient for simple tasks, even compared to my Galaxy S4, I'd much rather pull out my tablet to watch a video or surf the web.Pros:-Even though the specs are the same, it feels a little zipier than the 10.1 2014 did, which could have something to do with the TouchWiz and Android updates.-Unparalelled multitasking compared to other tablets-Awesome battery life (this is like hour 29 of pretty frequent use, and I still have 20% ish left)-Charges faster than traditional devices on laptops/computers thanks to USB 3.0 support-Stylus! The stylus is accurate, and easy to use, and offers a lot of features on-screen.-WHat used to be just the menu button to the left of the home button is now dual purpose, click once to open a much faster and more efficient applcation quick-switch bar, with a short hold to bring up the menu, definitely a plus.Cons:-It's actually lacking a few features from the 10.1 2014, such as NFC, which I don't use often, but would be handy in transfering files from my phone to the tablet instead of using bluetooth. Given that this is the \"Next Generation Samsung Tablet\", AND the \"Pro\" series, I would expect these tablet to have more features, not less.-Price: It's $200 more for the same hardware, absent eye tracking, and no NFC. Really?! Ok, a bigger screen is cool, but is it $200 more cool? Hardly-Stylus (also a con): It's tiny, I'm going to get a Bamboo Feel stylus and just atatch it to my folio when I'm not using it, the small stylus is convenient in that it fits into the tablet, but if you want to get some serious work done or take serious notes, I'd definitely get a bigger stylus.Final Thoughts:Yes it's a big(er) tablet than all of them on the market, but once you have it in hand, it's phenominal. You can hold it in one hand, it isn't hard, the only time I don't do this is when I should be holding it with two anyways (like over my head), it's heavy, but it's bigger. If you can choke down paying an extra $200 for literally the benefit of a bigger screen, it is worth it, the screen is great, the tablet is a great size for anything you could ever need it for, and the updated software is fantastic.", "Date": "March 22, 2014"}, {"Title": "I love it!", "Author": "Andrew S.", "ReviewID": "RO5XH3D40YOYL", "Overall": "4.0", "Content": "I have had my note pro for a few days, being a owner of the Samsung Galaxy Note 10.1 2012, this is much better than the original note. I first got it, yes it is a big tablet, to be exact, it almost covers my HP 17\" laptop's keyboard.A side note on the S Pen- it is the same design as the note 3, however the size is different. It is a little bit longer and a little bit bulkier.When I took it out of the box, it was about 60% charged, took about 3ish hours to fully charge, and this is partially due to the processor. I charge my note 3 from completely dead to 100% in about 2.5 hours.As far as the magazine on home, I personally am not a fan of it. I like how you can swype up on the note 3 to get the magazine. The Hancom office is very useful, I now have no need to get Microsoft Office 2013 for my laptop.Speakers are better sounding on the sides, as I can also close my case and listen to music clearly. App to SD card transfer is adequate. Screen is very sharp, very clear with my live wallpaper in the background.There has been some slight problems with lag time, but I am used to it from my old note 10.1. There is a reason why I knocked it down from 5 to 4, not because of anything but the price. 850.00 is very expensive for a tablet,  as my laptop was cheaper and it has the new intel i7 processor. The starting price should be 600 for the 32GB, 700 for the 64GB. Instead of buying through amazon,  I bought directly from Samsung because they included the cover for it (extremely flimsy, not protective at all), and they didn't charge for tax (savings of about 70 dollars and change).", "Date": "March 22, 2014"}, {"Title": "Bloatware and Magazine UX", "Author": "Grad Student", "ReviewID": "R3FLT3AZH073LQ", "Overall": "3.0", "Content": "I'm a grad student and owner of the Samsung Galaxy Note 10.1. I bought the Note Pro 12.2 for the larger screen and its integration of the Wacom stylus. My primary use for the Note 10.1 and Note Pro 12.2 is to write notes (using LectureNotes), take pictures of professors' notes on whiteboards and view PDF textbooks. I decided to trade up to the Note Pro 12.2 for the larger screen.My dream machine would be the Note Pro 12.2 with Apple OS and applications. I own many Apple products. Unfortunately, Apple products are not integrated with the Wacom stylus that I need for note taking/homework.The Cons of the Note Pro 12.2:1) a RAM hog..the background OS applications use about 45%-55% of the RAM at all times;2) slower than the Note 10.1;3) more bloatware than the Note 10.1;4) Magazine UX is limited to bloatware, social-media and selected Samsung widgets (it would be nice to have such an interface but make it completely open and customizable instead);5) the price;6) Multi-windows (i.e. split screen option) will not allow for horizontal screen split for just two windows (i.e. applications);7) difficult to compose emails using webmail as the Samsung keyboard covers up the substantially all the composition/input area;8) the camera is poor quality (only 8MP) and camera features are harder to use than the Note 10.1.The Pros of the Note Pro 12.2:1) the large screen allows for effective split window use;2) the large screen is great for reading technical textbooks.Fortunately, I had reward points and bought the Note Pro 12.2 cheaper than $750. Although the Note Pro 12.2 meets my needs of stylus note-taking and PDF textbooks, it does so marginally. I think that the Note Pro 12.2 (and the Samsung software) is too expensive for $750. If you don't need a stylus, it may be worthwhile to wait for the purported 12 inch iPad at the end of 2014.", "Date": "March 13, 2014"}, {"Title": "So far I am impressed", "Author": "Jaxbert", "ReviewID": "R39XZO1OAPY5IN", "Overall": "5.0", "Content": "First of all, I am a bit of an Apple guy... so this transition is REALLY difficult for me. But I am trying! The brown truck dropped this HUGE 12.2 inch bad boy off today, and I have been playing around with it for about an hour... or 3.So far, I like it. It's very fast, I like the magazine interface, it's hard to get used to the overall Android interface as I have an Ipad Mini, Retina, and Air at home, as well as iPhones and everything else... but so far I really like, and although I do not hate iOS and plan to keep all my Apple stuff, I just want to be better with Android and really know how to use it before I can say one OS is better then the other.I have not used the S-Pen too much yet, but it works as expected.", "Date": "February 13, 2014"}, {"Title": "Great Tablet. I love the size......it's perfect for me.", "Author": "Saviorself", "ReviewID": "RIOMPBMMTKATS", "Overall": "5.0", "Content": "A little background so you know what I was looking for and why I am satisfied with my purchase.The last tablet I purchased was a 7 inch generic Android Tablet a few years back. Never really cared for it and while I thought I wanted something small and portable I found myself wishing I had gotten something bigger.I currently am using a Note 3 for my phone which I absolutely love. I had been using it as an all purpose device for work to take notes during meetings and looking at excel documents. While it served it's purpose sort of. I had some problems with certain excel files and never did find an office program I was completely happy with and it was hard to take lengthy notes without a proper keyboard and while the screen is big it wasn't big enough for long lecture note taking.For me this product was a good compromise of a tablet and a laptop. The bigger screen of a laptop with the portability of a tablet. I wanted something I could use for work and for play.This thing is big though. With that being said I wanted that extra 2\" of screen real estate. For me 6' tall with longish arms and average sized hands I can comfortably cradle it in one arm and use my other hand to operate it. I also find it very easy to read and operate laying down propping it up on my leg.The display is beautiful. My only complaint is in a dark room I can see a tiny bit of bleeding at the bottom when it's first booting up. Not a deal breaker for me. Movies and games look good.I'm currently using a Note 3 with the quad core snap dragon processor and was not sure what to expect with the Octacore. I am not disappointed in the least. The system is responsive with no real noticeable lag.I love the new Magazine UX Samsung implemented with this tablet. I personally find it a refreshing change up. A lot of the reviews talked about this and it seemed to be a love it or hate it. Don't let that scare you away though the core Android system you are used to is still there. There are still home screens to customize and your standard app tray. The 4 part multi view works awesome and doesn't feel cramped and you can resize the windows.It comes with Hancom office viewer by default and you can go In and download the editor for free. By FAR the best office suite I've used on Android. I have a logitech 810 bluetooth keyboard I bought to sync to this to take notes and I had zero problems getting it to work with this and both were very responsive with no lag. Made typing up emails and word documents a breeze.The S Pen functions work great as they do on the note 3. Though I wish they had made the pen a little bigger. It's the same shape as the pen in the Note 3 but 1/8\" to 1/4\" longer and just a tad thicker personally I didn't notice much difference till I put them side by side.Battery life has been fantastic hard to say how long I have been getting on a charge because I have been playing on it non stop.The built in speakers are quite adequate in both volume and sound quality. I have a bluetooth JBL Flip speaker I usually hook up to listen to music or watch Netflix on my phone to get increased volume. And while the JBL speaker was still better for overall quality and volume I didn't find it a necessity to use like I do with my phone.Camera quality is fine though I don't plan to use it for taking pictures or video I have my phone for that. And rarely will I be using it if at all for video calls. Though the option is certainly there and does a solid job.Internal storage, I went with the 32GB model. Almost 10 gigs of that is taken up by the OS and other bloatware. The good news of course is that it takes a micro ST card so you can expand the memory without having to overpay for a tablet with more space.All in all extremely happy with this tablet. Hope this review can help someone out.Update - 3/10/14I opted to get a keyboard and mouse for this tablet. I picked up the logitech k810 keyboard and logitech t651 trackpad. Both work perfect.I have been using this tablet for a few weeks now and I thought I would update. I am actually typing up this review with my logitech keyboard from my tablet :)I have been using this tablet a lot for work. One question came up which was did it seem to much to have both a Note 3 and the 12.2 pro. I think this comes down to the user. I use sNote and Evernote quite a bit. I like that I can jot down quick notes with my phone and reorganize on my tablet later. I wish evernote had a better tablet layout but thats not samsungs fault thats evernotes fault. However with the large screen size on the tablet I can just go to the main website for Evernote and log in there which is handy.One thing I am really enjoying is reading comics on this. It's one thing I really wanted to be able to do with my Note 3 and it just didn't work. To much zooming and moving around. The screen on this thing is perfect for that and combined with the comixology app...MONEY!What have I been disappointed in? Since everything cant be 100% sunshine and rainbows. Lack of customization for the new magazine UX. Samsung pulled a bunch of the widgets for that. I didn't notice it at first because I didn't really end up using it as much as I thought I would. It wasn't till I was reading on the XDA Developer forums that I noticed this. I have noticed a bit of stutter when sliding between screens now that I have loaded up some of my apps.They could have made the icons smaller to allow more icons in a row rather than making them bigger.The only other thing I wish it had was sPlanner. I love having that widget on my Note 3 as I put everything in there and its nice to be able to slide a screen quick to get a quick glance rather than opening the app.Aside from that I am normally very quick to root my devices but am still rolling stock at the moment.I still don't regret my decision. And I liked this thing enough to dump another 100 bucks into a mouse and keyboard and another 150 for a \"man purse\" if you will that holds the tablet keyboard mouse cables and external battery backup. I got that from sfbags.com", "Date": "February 20, 2014"}, {"Title": "Great Tablet - Bad Software", "Author": "Alpha52", "ReviewID": "RDB4VP86DH3ET", "Overall": "4.0", "Content": "Previous Tablets Owned: ASUS TF700TPrevious Phones Owned: MyTouch 3G, HTC Sensation 4g, Samsung Galaxy S4Pros:- Faux leather backingIt's a very nice texture. I've actually covered it with WAWO's case, but it has a similar faux leather. After owning an S4, i appreciate the grip.- LightI don't care what people say, for a 12.2 inch tablets, the Note PRO is completely reasonable in weight. If you have lead poisoning, this tablet may not be for you.- Thin- S-PenThe S-Pen is a pretty neat piece of hardware. Although you can get a stylus for any touchscreen device, the S-Pens built in software and the inclusion of detecting whether the pen is in it's craddle or out makes it just that much more useful. Utilizing Tasker and Note Buddy, for example, puts the S-Pen on another level.- Hancom OfficeJesus, this piece of software is a gem. Couldn't ask for much more from an android Word replacement.- 4 Window Split Screen & Floating Apps  * Floating apps have been around for ages including browsers and calculators, so that feature isn't very original. But the 4 window split screen is done impressively well and the 12.2 inch screen really provides the real estate to make it viable. The ability to \"pair\" apps together is particularly useful for things like email and calendar.Cons:- TouchWiz & Samsung AppsAs always, TouchWiz remains a fairly unresponsive, crashy UI. WatchON crashes constantly in the background and I've even had the entire UI process repeatedly crash on me until I hard rebooted the tablet. There's also some hitching when returning to home screens, but that's par for the course with most android devices.- PriceYeah, not much to say here.- PPIBecause of the massive screen size, the pixels per inch is significantly lower than, say, the Kindle Fire HDX 8.9\". But honestly, unless you look really closely, you'll hardly notice the difference. For me, the extra screen area more then makes up for it.", "Date": "March 4, 2014"}, {"Title": "Absolutely awesome", "Author": "Amazon Customer", "ReviewID": "R89D6PKPDH8HR", "Overall": "5.0", "Content": "I was very hesitant about taking the plunge with such an overpriced tablet, but it has become on of the most utilized devices in my briefcase (and I have tons and tons of gadgets, including 2 other tablets, one Apple and one Android).The pen is great, and I've been taking it to all my meetings (replacing the notepad).  The performance is very good.  The battery life is amazing compared to what I'm used to, the screen is gorgeous, and the size is just right for me.I'm the type who likes to read everything in hard copy; since buying this thing, I've saved the company rims of paper.  For those of you interested in rooting the device and hacking into the beautiful 8-core ( 2 x 4) CPU and all the goodness of DDR3 RAM it provides, there are plenty of ways to do that without bricking the device.  You'll be very pleased with a clean install of Mint on it and VMs for running full versions of Windows, etc.  It definitely has the horse power to handle it.", "Date": "May 21, 2014"}, {"Title": "This tablet is absolutely amazing!", "Author": "Beau Regard \"Lexus Lover\"", "ReviewID": "R1W2NKOPBP5LPT", "Overall": "5.0", "Content": "This tablet is fast!  Did I say fast?  Oh man, is it fast! And powerful!  The graphics is amazing, the processors are incredible!  This tablet makes my dual-core desktop and dual-core laptop look like snails in comparison!  This tablet is incredibly light and comfortable to hold.  Even when you hold it at insane angles, it won't slip out of your had. This tablet has got it all!  It's a great replacement to both my laptop and my desktop. You can take this puppy anywhere, and it does so much, it's not even funny. This is the best $900 I ever spent on anything in a long time.  This will be a desktop and laptop killer. With this tablet, I just don't need them anymore.  And with wireless and Bluetooth, there is nothing this tablet cannot do! This is everything I hoped it would be and more.  On a scale of 1 to 10, this is a 12! From all of the reviews and articles I have read, this is simply the best professional tablet you can buy. Bar none. Buy it, you will love it! This tablet is nothing short of awesome!", "Date": "May 16, 2014"}, {"Title": "I love this thing!", "Author": "Tom Neal", "ReviewID": "R24K8LZ10U24PD", "Overall": "5.0", "Content": "The screen is absolutely fantastic. It makes email and web sites SO much easier to read. Plus pictures look fabulous. Maps are both easier to read and show a \"bigger picture\". The primary purpose for this was for on the go Bible study, and it is awesome to be able to have multiple windows open with various resources that can easily be seen all at once. Batter life is excellent.The good is that it's big, the bad is that it's big. :) You pay for the size and battery life with weight. But for me the tradeoff was more than worth it.", "Date": "April 28, 2014"}, {"Title": "amazing", "Author": "Robert Olmsted", "ReviewID": "R1PAYI13Y20CTK", "Overall": "5.0", "Content": "It big and it's a beast it nocks one heck of a punch both the 12.2 and 8.4 are just amazing there really is known way to describe it other than just try it you can't put it down out standing job samsung", "Date": "April 17, 2014"}, {"Title": "Worth every penny!", "Author": "Ed S", "ReviewID": "R1FWYUWI4CMEG1", "Overall": "5.0", "Content": "The Samsung Galaxy Note Pro 12.2 is an incredible tablet. From the day it was first rumored I knew I was going to get one and it hasn't let me down. I thought it might be to big but it's not. The ability to run 4 apps at once is a great feature. All of the S-Pen features are very useful. Battery life is good, sound is very good and the screen is incredible. If you're thinking of getting one go out and try it and you'll be hooked.", "Date": "April 13, 2014"}, {"Title": "Glad I waited for the 64GB", "Author": "Arthur J LaForge", "ReviewID": "R3P7ZFA1UZIWDT", "Overall": "5.0", "Content": "Very satisfied with the tablet, hefty price but does what I need with style. Love the speed and screen size.", "Date": "April 5, 2014"}, {"Title": "Great tablet", "Author": "Thomas Roskos", "ReviewID": "R2OLMSFUYJIG1L", "Overall": "5.0", "Content": "Replaced a Xoom.  I have always been an early adopter.  This tablet is simply the best out today. heck yes.", "Date": "March 16, 2014"}, {"Title": "A useful laptop replacement", "Author": "Hugh A. O'Brien", "ReviewID": "REYNIFCD3I2YD", "Overall": "5.0", "Content": "I've been a Windows user since the 1980's and have acquired a dependency on its way of doing things, especially my business tools.  However, I've shared the  frustration of many as we are forced to migrate to  ever more complicated, ponderous and vulnerable versions.  Enter the  Galaxy Note 12.2. This is a sleek, lightweight and fast device with a bright gorgeous screen. Combined with a leather bluetooth keyboard case and an S mouse I have a capable replacement for my much heavier laptop.But bear in mind that Android is a very different world than Windows.  My conversion to Android is a journey that takes a lot of time and study. And  certain programs that I need are not yet available, such as full featured Quicken and TurboTax.Younger people who have been weaned on smartphones and tablets will enjoy the large screen presentation of photosand videos as much as I do spreadsheets.Battery life is impressive, the pen is handy for jotting notes, and there are apps for just about anything.  Excellent product.", "Date": "May 11, 2014"}, {"Title": "Great tablet for the artist and dreamer", "Author": "creeky", "ReviewID": "R3D038HE0K1AHC", "Overall": "4.0", "Content": "I bought this tablet because I carried a sketch pad from young adult hood until I started working with computers. So about 20 years. For the next two decades I lamented the clumsiness of using a  mouse and paint software. It just doesn't work well. When the first digitizers came out I bought one, but drawing on a pad on a table and looking at a screen feet away. Well. It wasn't the same and it wasn't portable.Finally I have a solution. The Note Pro goes everywhere with me. I sketch. Jot down ideas. I'm even 30 hours into a much larger art piece. The draw tools are more than adequate for my needs. The marker pen is so much fun. And transparent! Switch colors/pens/brushes with ease.The only cons are the lack of \"help.\" And the general paucity of good apps. I'm new to tablets and getting the stuff done that I need to do still involves using my laptop.But thank you Samsung. This is an amazing bit of gear and I look forward to many years of use. And unlike my paper sketch pads, I won't run out of pages.", "Date": "May 4, 2014"}, {"Title": "My first Samsung Tablet", "Author": "S. Vong", "ReviewID": "RE2M7YR6ZMO4T", "Overall": "5.0", "Content": "This device does basically anything you want. It is bright and clear.  Screen size is just perfect imo.  I know some people might think it's big but it's not.  I think the 10.1 is a little small for watching video.  You can basically do anything you want with this device.  Watching video and reading text is a dream.  The battery last a long time as well.", "Date": "March 22, 2014"}, {"Title": "love it.....", "Author": "Robyn Grabois", "ReviewID": "R20XZK0K6M7091", "Overall": "5.0", "Content": "It is everything that I expected! I love the larger screen.....It does soo many things that I haven't even used yet....Great dimensions...Thought that it would have been heavier than it is....Real slim....I love having the pen ,also.....I love having the option of the pen....No big deal to bring it with you...I had read that it's sooo heavy.....They are real complainers.....", "Date": "March 18, 2014"}, {"Title": "Perfect", "Author": "Mirage", "ReviewID": "R124SAQIBBB3M", "Overall": "5.0", "Content": "I bought this to replace my Note 10.1. I have had it for 2 weeks. For me, it does everything my 10.1 did but with a much bigger screen which is great. I am an electronic repair tech so whether I am pulling up my repair tickets, my \"how to\" notes, watching a movie at lunch or at home, my emails or remoting into my pc. It is perfect. If you loved your Note 10.1 you will love this one even more.", "Date": "March 8, 2014"}, {"Title": "Samsung Note pro 12.2", "Author": "Mark Riad", "ReviewID": "R23LIAY102DESV", "Overall": "5.0", "Content": "I have always been an apple guy, and then I bought one of these. This product is amazing especially running KitKat operating system. The fact that you can have more then 4 windows open at the same time is amazing. I would defiantly recommend this with the Zagg screen protector. If I had enough money I would buy one for each room. With the USB 3.0 and the quad core processor you will always be blazing at lightning speeds. Great product. I actually bought this for the size, the sketch pen application is fantastic with this device for you artists out there. If you are debating between this device and another, don't think twice. Buy this item, defiantly worth it.", "Date": "February 18, 2014"}, {"Title": "Good Tablet", "Author": "Agnes", "ReviewID": "R12C0ZRQ0O124F", "Overall": "5.0", "Content": "I bought this a few days ago, and I am satisfied its performance and display quality.In terms of hardware, this one is exactly what I have looked for. I like its s pen, its keyboard layer on display, and internet browsing in its big screen and high quality display. Fast speed and process. Overall I am going to give this product high score.However, I am going to return this product for two reason. (1) it does not fit to my purpose of buying this tablet. I wanted to read and note a pdf file. The tablet seemed like being very optimized for this function with the s pen. However, I didn't find software app that handles pdf itself with s pen \"smoothly\" although there are some apps. I tried some apps but its not the quality I have expected. This does not mean that this tablets functionality has any issues, but it does not fit to \"my expectation\" of specific purpose. (2) there are useful apps samsung embedded. I like most of them. However, I found that when I start apps, they ask my accounts saperately, and install something blahblah. I really don't like this process. Of course, you can ask my permission on my account or information. That's fine. but, I don't want to input account information every chances I set up apps. I feel that you really and serious need to think about this.Overall, hardware is the best, but samsung need to pay more attention to software.I want to leave this message because I believe that some of samsung manager can hear and improve this software issue quiet easily if they care and want to listen how the users feel about their new super tablet, for reaching the best quality they can make.", "Date": "February 22, 2014"}, {"Title": "Great Device", "Author": "Y_Y", "ReviewID": "RAOUYXHFMZRRY", "Overall": "5.0", "Content": "For my needs, this tablet is perfect. I like to draw, design, and animate which is nice on a 12.2 inch tablet vs a smaller sized tablet. It gets heavy on the hand when used for extended periods of time which makes this device preferable for stationary use. I would suggest considering a smaller sized tablet if your needs are for the \"go\". But because my needs are \"desk-stationary\" I give it a 5 star rate.", "Date": "February 23, 2014"}, {"Title": "Just bought this yesterday and I love it.", "Author": "Terence", "ReviewID": "R23GAGDBGZBO6Q", "Overall": "4.0", "Content": "I don't have the knowlege that some of the people who write those SUPER LONG reviews.  However: I know enough to tell that this is a SUPER tablet.  My son has already put his stamp of approval on it (like that matters).  Its super fast and after putting the sd card in it got faster as far as the screen not being as sharp as my phione ( I have the galaxy note 3) I can tell when they are side by side but other than that I can't.  I have the logitech keyboard with it and that fit me like a glove, The only problem I have is it charges to slow but the battery life is so long so its not a real problem", "Date": "May 2, 2014"}, {"Title": "Great tablet for reading and annotating pdfs", "Author": "MK", "ReviewID": "R2Z7U42MVO9G2U", "Overall": "5.0", "Content": "This is a great tablet to read and annotate pdfs comfortably (I use the LectureNotes and ezPDFReader apps). Samsung's sPen is incredibly responsive and comfortable to use. Handwriting on this tablet feels very natural, almost like on paper!", "Date": "June 11, 2014"}, {"Title": "Much Better than an iPad", "Author": "Timothy L. Drager", "ReviewID": "R2BR611ILPCBDF", "Overall": "4.0", "Content": "Pros: Superior, full Keyboard, camera with flash and mouse-like hover functionality with s-pen.Cons: Inferior build quality, lacking software integration. Siri is MUCH better. Software conflicts between Samsung, Google and Amazon.", "Date": "June 11, 2014"}, {"Title": "LOVE IT!!!!", "Author": "Brent W.", "ReviewID": "R2ZDCACVLW45ZY", "Overall": "5.0", "Content": "While I While I may be new to tablets and note pads I think this unit is great,  I am sure it has cons compared to others but I think those probably have MORE cons than this one.  Great to work with, you can use a mouse and keyboard, add memory and use USB’s.  Battery life is GREAT!!!  I can last most of the day with average use!", "Date": "June 9, 2014"}, {"Title": "Fantastic buy", "Author": "Deli", "ReviewID": "R3RLL8DR3YKT2R", "Overall": "5.0", "Content": "I was worried about buying it refurbished at first but turned out to be in perfect condition! Not a single scratch.  Fantastic tablet, 110%!!", "Date": "June 5, 2014"}, {"Title": "Good product", "Author": "laretha avant", "ReviewID": "R2E2F3D96MC8LY", "Overall": "5.0", "Content": "I love the tablet because it fits my lifestyle. The stylus with the tablet works beautifully. I would recommend this product to friends.", "Date": "June 3, 2014"}, {"Title": "Great 12\" tablet", "Author": "George Kulczewski", "ReviewID": "R3Q55HAGO6IO1F", "Overall": "5.0", "Content": "I wanted a big tablet with great speed and this fit the bill. Yes it was a bit expensive but I think it is wonderful! Battery life is good but I find it drains a little quicker than I anticipated so I charge it throughout the day especially if I use it quite a bit.", "Date": "June 3, 2014"}, {"Title": "Three weeks of use", "Author": "Tom Walker", "ReviewID": "R1S34QL67M6SAN", "Overall": "4.0", "Content": "So far the note pro is meeting my expectation and i have not used all the features that originally came with it. However, I am using it for my business. I especially like the spen features (still under used by me).", "Date": "June 3, 2014"}, {"Title": "Great purchase", "Author": "Athena Graves", "ReviewID": "R3SPJA191VFEO8", "Overall": "5.0", "Content": "It is everything I needed I luv my windows 8 touch screen laptop but having something more portable is just what I needed", "Date": "May 28, 2014"}, {"Title": "one thing missing", "Author": "Barry Solomon", "ReviewID": "R1WIOKS9TDQBCC", "Overall": "4.0", "Content": "I do enjoy my new Note Pro however waste alot of time trying to figure out how to use. No user manual except on line which doesn't help when trying to use on plane or other area where no wi fi.", "Date": "May 25, 2014"}, {"Title": "Great tablet for everything.", "Author": "Jane", "ReviewID": "R2UDSBV0ODWYNR", "Overall": "5.0", "Content": "I updated the tablet from the first Galaxy note tablet to this one. I am so surprised that the Samsung provided a lot of their technologies to make tablets much  better. Now, I am using this tablet instead of using my Window 8 laptop. I am a graphic designer and illustrator, thus I am drawing ideas often. And, this tablet has all what I was looking for.This one comes with the free Sketchbook Pro for galaxy. You do not have to buy any of apps to draw. It is enough to draw and colorings.If you are so concering about the touch sensitivities, I recommend the Ipad. Because this tablet does not seem that the sensitivities are so great.If you are making a lot of notes, this tablet is going to be your favorite. The S Note does not read your hand sensitivity, but only the pen. Thus, you can simply draw or write with your hand laying on the screen as if Wacom tablets.", "Date": "May 21, 2014"}, {"Title": "AMAZING, AMAZING, AMAZING...The Size is Just Right..!", "Author": "Amazon Customer", "ReviewID": "R2WKWGY0I0P9J7", "Overall": "5.0", "Content": "What a beautiful tablet. I cannot say enough about it. The screen resolution is amazing. The tablet is built very well. This Note 12.2 has better specs than the Tab 12.2. You cannot compare any tablet on the market to this Samsung Monster! If you are looking for a 12\" Tablet, you found one! Buy it...You will love the tablet..! I paid around $725.00, this is the lowest I could find one. If you can buy one for around $650, grab it because this tablet is worth every penny!!! Great Job Samsung...!", "Date": "May 21, 2014"}, {"Title": "Like the large screan", "Author": "Elizabeth A. Louzon", "ReviewID": "R3BC4H4BVD4ZD0", "Overall": "5.0", "Content": "This tablet has more features then I will ever use. I use it every day and am still learning more about it and its capabilities.", "Date": "May 21, 2014"}, {"Title": "absolutely good", "Author": "ptecsaba", "ReviewID": "R3H7OCG145FPU1", "Overall": "5.0", "Content": "Nice tablet just what I thought it would be. As musician I perfectly read PDF music sheets and easy to use. I also use it for lots of meetings and on the ho stuff and the battery life is amazing. Yes it takes to charge but it is a 10000mah battery not a 4000mah as most laptops. Overnight charge is perfect. With all the application at hand it is a windows laptop comparison. Of course android has to polish a lot to be smoothy all the time and take office tasks 100% hopefully it will come soon. For the price and performance it is a 100% review. Slimmer than most of my uni books why not then a notepro?", "Date": "May 21, 2014"}, {"Title": "A movie lovers dream tablet", "Author": "Amazon Customer", "ReviewID": "RRD3T5JQBJ4QY", "Overall": "5.0", "Content": "I wanted to upgrade my Toshiba Thrive to something newer and this is about as new as I could get. I am a fan of watching hbo go and youtube and wanted a good size screen. The 12 inch is marvelous and beutuful. For those saying it is too big, I say you are weenies. I can hold it just fine in one hand and it is super thin for its size. I love this tablet.  You will too if you enjoy watching movies like me.", "Date": "May 19, 2014"}, {"Title": "Android Tablet ON Steroids", "Author": "George Zugg", "ReviewID": "RHPQ6VHJ8GMPW", "Overall": "5.0", "Content": "This things rocks.  You name it it can do it.  Hand writing with the pen, read and write office product on a superb 12\" screen and watching movies is like your own little movie theatre.", "Date": "May 19, 2014"}, {"Title": "great tablet", "Author": "Cenjay", "ReviewID": "R129B84GSCDNGY", "Overall": "5.0", "Content": "I love this! I am now on my tablet more than my PC. Replaced a google nexus 7 with this.", "Date": "May 15, 2014"}, {"Title": "Samsung Galaxy Note Pro 12.2 rating", "Author": "Uray42", "ReviewID": "R2OXLRMWV20ZB", "Overall": "5.0", "Content": "This unit is a very good tablet with a very high resolution screen and has many useful apps to choose from.", "Date": "May 14, 2014"}, {"Title": "Very satisfied!", "Author": "BJ73", "ReviewID": "R14KLLEC0W2NS5", "Overall": "5.0", "Content": "I used to believe in the IPad, however I decided to purchase the galaxy note and  I don't regret it.  It is faster and the camera resolution is better. I love to keep notes and most of the time I need to write right away, I just pull out the pad's stylus, write, and save. There are many other functions to be used, that I just don't have the time to describe. I highly recommend this product. I am a believer and a fan.", "Date": "May 14, 2014"}, {"Title": "fantastic tablet", "Author": "George A.", "ReviewID": "R2TJBRR53CRXMV", "Overall": "5.0", "Content": "The first tablet arrived damaged but amazon had a new one for me next day. Great service!!!. The tablet itself is fantastic. The screen is clear and bright. Has plenty of power to run games and programs. Hardly use my desktop anymore.", "Date": "May 13, 2014"}, {"Title": "I have been very happy with this purchase", "Author": "Wylie, Texas", "ReviewID": "R2K8KBXICKN4TI", "Overall": "5.0", "Content": "I know that part of my satisfaction is due to the fact that this is my second tablet after using my original Motorola Xoom for years (yes..really...) The speed on this thing basically makes it feel like a laptop. I have experienced no lag in application launches, internet browsing, screen flipping, etc.I use this tablet both at work (taking handwritten Evernote notes in all of my meetings) and at home (as a browser and media machine.)I've been using it for a few months, and at this time I can say that I do not have a single complaint. It is odd to me how reviews and some people who see it think it is too large...I acclimated to the screen size very quickly and it does not feel oversized at all.", "Date": "May 11, 2014"}, {"Title": "LOVE IT !!!!", "Author": "PhotoFXusa", "ReviewID": "R7G59CXB967QP", "Overall": "5.0", "Content": "I've had this tablet for 24 hours now, and already I can't see how I survived without it before. I first fell in love with the Samsung Note's when I upgraded my phone to the Samsung Note 3. Now here I am buying the top of the line Note Pro 12.2, which should make life much easier now that I can leave my Alienware 17\" laptop at home.", "Date": "May 7, 2014"}, {"Title": "Super", "Author": "Sharon Englesby \"Blower/Vacuum\"", "ReviewID": "R4JVULEH6384I", "Overall": "5.0", "Content": "I love this Note Pro, especially how it has split screens for multiple projects at the same time.  Yeah for Samsung.", "Date": "May 7, 2014"}, {"Title": "Love it! Apple sure has competition", "Author": "Dcgabe", "ReviewID": "RRQ030ZSINBEK", "Overall": "5.0", "Content": "Love it! Apple sure has competition. In some ways I like the galaxy better than the ipad. The only thing is I don't have a Samsung phone to sync to. Set up is easy, love the stylus feature. Display is outstanding. Apps work seamlessly!", "Date": "May 3, 2014"}, {"Title": "Always loved the note products", "Author": "DDBones \"Dave & JinMing\"", "ReviewID": "R2ADH8JBGYGP9B", "Overall": "5.0", "Content": "I have a galaxy Note 3 (upgraded from the Note 1), and so when this came out I upgraded from my Galaxy Note 10.1.  The larger screen is a welcome change, especially using office apps in a pinch.  The screen is gorgeous, the tablet is generally easy to use with the added features using the pen.  It performs quite well and the battery is good for several days of normal use.I wished samsung included a micro usb to standard usb OTG adapter, would make using existing extras easier.  But overall, love this tablet!Would be nice to set Google NOW as one of the home screens, instead of just an app you can access...", "Date": "April 30, 2014"}, {"Title": "Love this Tablet", "Author": "eman", "ReviewID": "R28I3WPY4DR79I", "Overall": "5.0", "Content": "Love this Tablet.  Will never use Laptop except when I might need to see a CD. Bought USB adapter to use my Thumb drives.", "Date": "March 20, 2014"}, {"Title": "Awesome!!!", "Author": "zt696 \"zt696\"", "ReviewID": "R3SC22W48VNFXZ", "Overall": "5.0", "Content": "What a great tablet. I was looking for something this size for a long time. If you want a larger screen go for it. Do not listen to the people that say it is too heavy. For a screen of this size it is really not heavy at all. Time to retire the old ipad 3. I am now sold on Samsung yet again. They really do make outstanding products.", "Date": "March 8, 2014"}, {"Title": "Just what I've been waiting for!", "Author": "Kunal Dhar", "ReviewID": "R2JKNABF7KIKET", "Overall": "5.0", "Content": "I'm a big guy that reads a lot. Hands down this tablet provides best the reading and web browsing experience on it gorgeous 12 inch screen. The note taking apps and stylus work perfectly for jotting stuff down in and between meetings.", "Date": "May 12, 2014"}, {"Title": "Love the size!", "Author": "grizzly 24", "ReviewID": "R188DDGFRKN8FS", "Overall": "4.0", "Content": "This is a brand new tablet so you have to expect a few issues. Overall I love it! The size is great. The ability to have four screens pulled up at once is awesome. Just a couple of issues that I think samsung cleared up this week with a new firmware download. The battery does seem to drain a bit quick and takes awhile to recharge. Also the sensitivity of the touch screen was poor but that has been corrected. Overall I would highly recommend it. I've got an iPad 2 that I use as well as a kindle fire HDX. This tablet puts them to shame. No comparison in speed or display quality and the 12.2 simply has many more capabilities.", "Date": "April 13, 2014"}, {"Title": "great for class", "Author": "Alexandria", "ReviewID": "R17ZL7RFA02FW8", "Overall": "5.0", "Content": "Great for taking notes in class, and performs well in every other aspect as well. Love it, and highly recommend it for any college student.", "Date": "March 31, 2014"}, {"Title": "I am so in LOVE!!!!!!!!!!", "Author": "magun1975", "ReviewID": "RHAXU3VM7G28F", "Overall": "5.0", "Content": "I have waited diligently for this tablet to come out and I must say that Samsung made no mistakes with this tablet!! It's amazing hands down, the size, the features.I also love the color.  I had to get white to match my iphone and it just brings out the beauty in it. This really was a great investment and semi substitute for my computer when I don't have it with me.BTW:Make sure you get accessories.You wouldn't want a device like this to not be protected!!This is the \"Bentley\" of all Tablets\" right now...", "Date": "March 14, 2014"}, {"Title": "A little Disappointed", "Author": "J. DeBusk \"Zombie Lover\"", "ReviewID": "R1RZ4QU2KRTP6T", "Overall": "4.0", "Content": "When the Asus Transformer Infinity first came out, it was supposed to be the greatest Android tablet so I purchased it and was very unhappy.  It was slow and buggy.  I hated the Asus tablet so much, I've been using an iPad for everything.  I was excited to get this tablet, I don't like Apple and wanted a decent Android tablet.  I have to admit I'm a little disappointed.  From the specs, I thought this thing would fly.  However it still is laggy and I've found myself still using an old iPad 2 because some games and apps I regularly use just work better on it.  I love how open and configurable the Android OS is, just wish it worked a little better.  Something I don't understand is my phone is the Note 3 and it works great.  This tablet basically is a big version of my phone but it has lag I don't have with my phone.**Edit - I'm changing my review from 3 to 4 stars.  Changing some settings suggested in the comments and using Nova Launcher has made the tablet quicker.  The few frustrations that I still have are probably more to do with Android and not this tablet.  Overall I'm very happy with the tablet, especially since my previous Android tablet was the Asus.", "Date": "April 16, 2014"}, {"Title": "I love it!!!", "Author": "Jacqui Daley \"Old School Mom\"", "ReviewID": "RTTH0CFS92FPQ", "Overall": "4.0", "Content": "I absolutely love my Note Pro. I love the large screen that I am able to see my better now. When typing my fingers don't accidently hit the wrong keys. I love reading my books that have been synced with the tablet. It is everything that I wanted in a tablet and I use this more than my Toshiba Satellite laptop.", "Date": "March 4, 2014"}, {"Title": "Nice Concept, Far from Perfect.", "Author": "Eric", "ReviewID": "R2HNP81VG3XQKY", "Overall": "2.0", "Content": "I recently purchase this tablet and decided to return it.  The display was nice, very nice.  The screen eye sensor didn't work very well and the screen sleep mode kept activating.  The reviews and stats claimed this device to have all sorts of processing power but I have to say it was VERY laggy.  Even swiping between screens there was noticeable lag.  This was with no programs running in the background.  Sound from the device was nice.  The value just didn't add up for me.  For the money, this should have been a more polished offering from Samsung...  Battery life was pretty good but nothing a high level tablet shouldn't have...", "Date": "June 11, 2014"}, {"Title": "battery is the short board.", "Author": "john d", "ReviewID": "R27692UVG7IS93", "Overall": "3.0", "Content": "Pro:90% of why choosing this pad is the big screen. Have seen the high resolution  photos on it, I would not go back to the ipad.The other 10% is for multi-tasking. very useful feature.Con:Battery, for web browsing, a 100% charged battery can hold about 7 hour. Up to 13 hours of battery life per charge is a joke! Even when the machine is sleeping, the android system still consume a lot of power. I need to charge it every other day.sofware:  Be prepared that many  apps will not run as smooth as on ipad.", "Date": "May 20, 2014"}, {"Title": "Can't watch amazon prime", "Author": "Derdwin A.", "ReviewID": "R2E1C2JGO0TDY0", "Overall": "3.0", "Content": "Excellent but I can't watch amazon prime on it says device not supported other wise is great.... For my photos the resolution is excellent", "Date": "May 19, 2014"}, {"Title": "Be warned", "Author": "NoTuba", "ReviewID": "R35AR9AWJ4Y4LB", "Overall": "3.0", "Content": "Using Chromecast with this tablet can cause the UI to loop crash. While casting to Chromecast, swiping down on notification bar will cause com.android.systemui to loop crash until you restart the tablet. This is a quite common issue with Samsung's TouchWiz, called Magazine UX on this tablet. There are many reports in online Android forums concerning this issue. @SamsungSupport refuses to acknowledge that this is a problem.CPU is a tad slow for such an expensive, and high end, product. The screen is a beautiful and bright LCD. The free Hancom office suite is nice. Battery life is wonderful for such a large high resolution screen.", "Date": "May 16, 2014"}, {"Title": "great tablet", "Author": "Caleb Jones", "ReviewID": "R3FY364VHX97KG", "Overall": "5.0", "Content": "Great tablet.  Plenty of power on an android platform.  Rhe s pen works great as well.  I would recommend this tablet.", "Date": "April 29, 2014"}, {"Title": "Great product", "Author": "Roger", "ReviewID": "R3AP7W13Q5NG5N", "Overall": "5.0", "Content": "The best tablet that I have ever owned.  It is a great device and makes it easy to be productive on the go.", "Date": "April 24, 2014"}, {"Title": "It's pretty cool", "Author": "Amazon Customer", "ReviewID": "R346G8XR6C30YH", "Overall": "3.0", "Content": "Rewriting this review to keep it short and sweet. I think this table is the best tablet for writing. It's got a higher resolution, larger screen, and longer battery life than anything else. The tip of the stylus also has texture so it doesn't slide across the glass like the surface pro 2 stylus.It is lackluster in many ways though.-glossy screen - terrible for a screen where you have to view what's on the screen when lights are on, like somewhere you might be taking notes (meeting or classroom).-operating system - Android is wonderful, for phones. This operating was not designed for tablets. It was made for phones and modified for tablets. So a lot of basic computer functionality that has been around since the early 90s is not here. No folders in folders, you can't place icons wherever you want on the screen, most programs don't open in popup mode (windows). If you are looking for productivity, don't look here. You will spend time fighting with your system. What would take you 10 seconds on your pc can take several minutes on android, because of the various steps you have to take and not the limitations of the hardware.-no flash support - or rather semi useful flash support, when modded with Dolphin. You will have to look up how to install that. It is buggy and slow compared to other systems with similar or slower hardware.-the total lack of a tablet-based store - you want to find apps made or optimized for tablets? You'll have to google it. Many of the applications that are touted as being designed for tablets are just phone apps that run in landscape mode and look very poor. The vast majority of apps are of low quality compared to what they could be. A quick look over at what applications are available on ipad shows the potential that is being missed here. You can say there are good reasons for this problem, but reasons don't stop this problem from existing. You need to understand how bad the android app store is for tablets. We shouldn't have to sift through piece of garbage after piece of garbage to find software that is decent. The android store needs to have a tablet section and it needs to be curated. A base minimum of specs need to be established and developed for. There are a few wonderful gems out there that really showcase what could be possible on android. Just a few though. I don't have the time to do android's job for them. Some people like to customize and search and test for hours on end. I don't have the time for that.I returned the tablet and I will not be purchasing android again until they've resolved these issues.", "Date": "April 8, 2014"}, {"Title": "Would be a great tablet, but external SD card writing capability is crippled", "Author": "Ken L.", "ReviewID": "RPS5RQK57M6OK", "Overall": "3.0", "Content": "Very happy with the graphics and speed of this tablet. With power saving mode on and using thmenu system is easy to use and chock Full of Features too. I misht be bold to say, this Suite turnse tablet moderately, with a variety of apps, I was able to get more than 10 hours out of the battery. I was mainly inside, so I was able to use the tablet with a lot lower screen brightness than I would if I had been outside. This will make a difference, and in this case the tablet will not yield 10 hours.The main disappointment, of this tablet, and my , main reason of giving the tablet 3 stars, is the fact that external SD card storage capability is greatly diminished due to its use of Android 4.4. The only apps that will be able to save our modify data on the external  SD card are pre installed applications.  So the stock camera, Hancom Office Suite, etc., will work. If you install a custom camera,  or any thing else from Google play,  at the time of this writing, you cannot save data,  or move the apps to SD card.  You can however,  still read from the SD card.  Any modified files will have to be saved to the internal storage.  I don't like this restriction,  and I can't possible see any good coming out of it. If you rely heavily on SD card usage,  do not buy this tablet.  If however,  you can get by with the roughly 22GB of storage you have left after installing Hancom Office,  then it shouldn't be a problem. People might say to blame Google, and not let this affect the product rating,  but this limitation affects my experience, and Samsung and other manufacturers should pressure Google into fixing this!Speaking of Hancom Office, when you get your new tablet, it comes with the Hancom viewer pre-installed,  but you must install the applications to be able to edit and create documents. I can't speak for everyone,  but the download,  install,  and updates took a very long time;  several hours. I was not on a slow connection,  my home router is an AC one which this tablet utilizes very well.  Although you must manually download the application,  you are still able to save and modify files on the SD card. One last note on this is that you may manage the Hancom updates through the included Hancom Office Updater, but it is not managed through Google play or Samsung Apps.Hancom Office is the best Android MS Office replacement I've tried.  Beats all the others, hands down.  I don't want to do a full review on this application as you can go to YouTube and watch hands on videos of it, but I will tell you it has many of the features Word,  Excel,  and PowerPoint have, and by default, saves files in these formats. I'm a heavy user of Excel,  and it was hard to find an Excel formula that wasn't recognized. With word, you have access to shapes, etc. which the other office replacements don't even come close to having.have access to shapes, pictures, fonts, Formatting, etc. which the other office replacements don't even come close to having. The menu system is easy to use and chock Full of Features too. I might be bold to say, this suite turns this tablet into a productive mobile office. It might not have all the features You need, but it's real close.As with all Galaxy Note products, this tablet comes with the S-Pen which works very well.  The integrated handwriting to text application is very accurate too.  I have sloppy handwriting and it recognizes my handwriting better than Swype does.  Of course, Swype is much faster,  but for those who like to write \"Old School\", you will be fascinated.  I only wish you could control the pause delay time,  because I wind up making mistakes when I pause for a second,  because the text moves to the left side of the screen before I'm done writing.  It's not a big deal,  but I'd like more control over that. What's really cool is that when you install an additional language,  the handwriting to text engine recognizes the words of the currently selected language,  not just English.The Sketchbook Pro  app included pre-installed is very awesome if you are an artist.  Checkout Youtube, and search for \" Galaxy Note 12.2 Sketchbook Pro\". Even if you're not an artist it's still awesome anyway.0verall, I would recommend this tablet to anyone without the need of saving data to the external from user installed applications, or attempting to move apps to ext. SD card.", "Date": "April 23, 2014"}, {"Title": "It's everything it should be", "Author": "Mike S. \"mikescr\"", "ReviewID": "R28W59OQFKXI7Q", "Overall": "4.0", "Content": "I got this because I wanted a tablet with a big screen to run the Kindle app in portrait (had to be Android or iOS - the Windows Kindle app doesn't load \"personal documents\" from the cloud), and this was the biggest one commonly available.  I also wanted a bigger screen to connect to my home computer when I'm out.I had recently gotten a Galaxy Note phone and was happy with that, so I took the plunge, and the Galaxy Note Pro delivers on its promises.  The Kindle app is one of the most difficult for an Android device to run in my experience, and the app (and all apps) runs very smoothly, with none of the glitches and lagginess found on less powerful Android tablets.If you're considering this tablet, it's because you're willing to pay a premium for a honking huge screen and a strong processor.  I'd say it's worth the price on that basis.  I've found little to complain about.  I'm using the ZAGG keyboard cover - an external keyboard makes this an excellent laptop replacement.  The RemotePC app that comes with the tablet has not worked well, but I already use LogMeIn.  If you're counting on RemotePC, you should look into people's experiences with that app.", "Date": "April 8, 2014"}, {"Title": "Galaxy Note Pro 12.2 awesomeness", "Author": "Auto-topia", "ReviewID": "R6Q4JBOPCXC9M", "Overall": "5.0", "Content": "Samsung has hit another one out of the Park. Blows my note 10.1away. A must have. Been using for a month,  10 hours a day for work and play.  Screen is incredible,  go with the bigger screen, no regrets. This was the best deal ever,  SAVED OVER $200 on Amazon. There is never a reason to ever shop best buy. AMOZON excels in everyway.  Delivered in 2 days.", "Date": "May 30, 2014"}, {"Title": "Beautiful, Big, a Bit Slow", "Author": "Amazon Customer \"pcorning\"", "ReviewID": "R1O0HT9L48B9C1", "Overall": "3.0", "Content": "This was intended to be an upgrade to a Nexus 10 which is losing battery life and becoming unstable.  I have decided to return it after 3 days of trying to make it work.  It's beautiful, well polished, just not right for me.Pros:*  The screen is gorgeous.  2 more inches makes a huge difference, and the colors are as vivid as you'd expect from Samsung.*  Pen software is well done, nicely integrated with Evernote or other services.  The pen itself is well-designed, and it stores unobtrusively.*  Samsung's garish TouchWiz skin really doesn't detract too much, and it even improves Android's settings menus.Cons:*  It's slow, even after giving it a day to get through all its various downloads and upgrades.  Even with only the browser open, it stutters and lags as you navigate or open new pages.  I didn't expect this from a new device.*  It's really too heavy to hold comfortably, even with two hands, and yet it strangely doesn't include an integrated kickstand.*  If you're used to the stock Android email client you may not like Samsung's email, and you may not find it easy to find an alternative you like.If you want a larger screen to hold for browsing, reading and some data entry, this is probably too heavy and slow to make you happy.If you're going to prop this on a desk in front of you with case or some sort of mount, why not just buy a laptop and get a whole lot more for your money?", "Date": "February 25, 2014"}, {"Title": "Not so bad not so good.", "Author": "MLogician", "ReviewID": "R1PLRIZSH61YGN", "Overall": "3.0", "Content": "Samsung Galaxy Note PRO 12.2 is a monster of tablets. It has amazingly sharp and bright display. The S-Pen is superb. The processing power is OK but the Samsung UI just sucks. It is ugly, boring, slow, inconsistent, and not optimized for tablets. The notification shade is simply stupid. I had been using Nexus 10 before this and stock Android UI on that is awesome. Separate notification and setting toggles at different parts of the screen make sense, look good, and very very useful. I wish there was a GPE version of this tablet.", "Date": "March 26, 2014"}, {"Title": "No Flash/No Samsung", "Author": "T. LaShay", "ReviewID": "RG5K9WK108XJZ", "Overall": "3.0", "Content": "I wanted to Luv this tablet. I bought mine on base as there are no taxes. I was told 3rd party flash players would allow you to play vids. I needed it for online classwork & amazon prime vids. I also use Office software (word, excel, PPt) heavily. Although I luvd the resolution, speed, and ease of use, I had to return it after only 3 days. Samsung offers 24-7 live chat so after working with them each day for issues below, I knew I couldn't keep it.Cons: 1. None of the 3rd party flash apps recommended by Samsung would work. 2. Realized there's no screen mirroring for projectors. 3. When I updated Hancom Viewer to the full free Hancom Office, I opened it up and over 200 files (excel, word, PPt type) were already in there, most in another language.  I signed up to the live chat & Samsung rep said they were there by default once updated to office so we had to delete in groups of 10, close the app, reopen the app so it'd recognize they were deleted then do this process about 19 more times. 4. I could never get used to the onscreen keyboard.I then went to Best Buy to get the HP 13.3 Touch Spectra instead as it wasn't offered at my base. I explained the issue with the galaxy 12.2, and he then showed me the Surface Pro 3 & said it'd be available to purchase on 20 Jun. From what he showed me, the Surface 3 is a cross between the Note 12.2 I had & the Spectra 13.3 Touch I came there to purchase (today's the 7th). He just so happen to own the first surface pro &showed; me the diff. I'll go home & do my research on the Surface Pro 3 because from his demo, it does what the galaxy 12.2 can do so looks like it might blow galaxy out the water, especially with it being able to play flash vids. It even has the note pen.", "Date": "June 7, 2014"}, {"Title": "Working great", "Author": "Lelo & Lela \"Lelo & Lela\"", "ReviewID": "RINLVJBVV5I96", "Overall": "5.0", "Content": "I bought this to replace the Note 2014 Edition. This one is working great so far. I don't like the bloatware that came with it so I stopped the auto updates and removed what I could. Love the TV Remote and Guide App pre-installed. I went through two 2014 Edition Notes (Amazon readily took them back - both simply stopped working and would not turn on.) before deciding to try the newest Note. While I paid more, I am not disappointed.  Love the larger screen.", "Date": "April 24, 2014"}, {"Title": "It's just OK!", "Author": "Carla Martinez \"biruta619\"", "ReviewID": "R3AV2QXASZA2N0", "Overall": "3.0", "Content": "I think it would be a good product for someone that needs a tablet that size. I thought I did! But my main reason for returning it was not the size! It was screen clarity which I found to be somewhat less than what I'm used to, and rotational issues which are apparent on most Samsung products that use the technology!! There's always a lag or a waiting period for the device to go either landscape or portrait, I felt like I needed to shake it in order for it to go where I wanted.Basically it does exactly what it's supposed to do! But not well enough to make me want to keep it.I still would recommend the product without hesitation! as long as you know the pros & cons.Some of the above may not affect everyone! But it did me! I may also be more particular than most people!", "Date": "May 6, 2014"}, {"Title": "Love the bigger size", "Author": "Storm Browne", "ReviewID": "RQPQ7FS23ZCN6", "Overall": "5.0", "Content": "I got this for my partner, who doesn't have the best eyesight, and he tells me that this bigger tablet is perfect for him. He can see text much better, watching videos is awesome and he is very happy with it. If you're someone who doesn't have eye problems, then the 10.1 2014 edition (which is what I still have) should be just fine.", "Date": "May 4, 2014"}, {"Title": "Fits like a glove..", "Author": "Charles", "ReviewID": "R2S7EBJF0KJOVP", "Overall": "4.0", "Content": "Work perfect! No complaints very easy on the hands clean sleek and easy 2 carry.  Stands up very nice, also a great price!", "Date": "April 6, 2014"}, {"Title": "Graphics very buggy", "Author": "Kevin M. Shaw", "ReviewID": "RHFAGPF4RGMZB", "Overall": "2.0", "Content": "The graphics were buggy, especially on some websites such as Zillow where it would completely hang up.  Also sometimes the launch times for some apps and websites were very slow.  The functionality was impressive, but the performance left much to be desired, compared to an iPad.", "Date": "April 21, 2014"}, {"Title": "Gorgeous tablet, but NOT A LAP-TOP REPLACEMENT!", "Author": "Amazon Customer", "ReviewID": "R2HG09X41QS056", "Overall": "3.0", "Content": "First, let me say that this is a magnificent piece of technology.  The screen is gorgeous – amazingly clear and bright, very natural colors.  The s-Pen function alone is worth the device for artists, and it’s super-cool to write notes on on-line articles, clip them out and email them to friends.  Voice to text is flawless. The whole thing is fast, sleek and light.  Watching 4K video on this is a dream.  It’s very hard for me to part with this.  As a tablet I give it 6 stars out of 5.Having said that, the reason I got the Galaxay Note Pro was because it has been touted as a lap-top replacement.  I bought is as an office productivity lap-top replacement for my 81-year old mother, who has never used mobile touch technology.  DOESN'T WORK FOR THIS.  This is still Android, and even if file management, etc. is a little more convenient than iOS, it’s a tablet.  To print a photo, you have to got out of the gallery, open a printing app, find the picture again, and go through many touch-steps (like a dozen touches) to choose all the options.  Compared to a PC, it’s a bear.  And for my 81-year-old non-techno mom to learn this?  Forget it!  That alone would take forever to teach her.  But every basic PC function she’s used to, other than Chrome, is that much more complicated.Hword margins are in mm, not inches.  (Maybe there’s a way to change it, but if so, it’s non-intuitive).  The fonts are better than most Android WP apps, but limited compared to Word.  There is no way to print non-gmail emails from any printing apps I tried.  (Google only wants you to use Gmail, I guess.)  And let’s face it – mobile operating systems were never designed to DO the data management and manipulation which Windows or Mac OS do so naturally.  Mobile devices are still computer ACCESSORIES, designed primarily for communication and media consumption.  Of course, they do many things a computer CAN’T DO.  The touch-world and app-world are amazing.  But not full-on office productivity.Theoretically, yes, you probably could do 80% of what a laptop or PC does on this, but yikes, what a nuisance!  You could also write a novel on your smartphone, but would you want to?I’m bummed, because I love so much about this tablet.  Here’s what I wish it could do, the future of mobile devices as I see it:  Customizable voice-command presets:  “Print 4x6 photo glossy” – “Print letter draft” – etc.  You know, HAL from 2001.  Sigh….Bottom line:  This is an amazing tablet (probably the best), but NOT a laptop replacement, unless all you do on your laptop is gmail and internet.  Or if you’re a dedicated techno-lover who has lots of time and energy.", "Date": "February 18, 2014"}, {"Title": "Good but slow", "Author": "Shaer", "ReviewID": "R224M6CRJJED16", "Overall": "3.0", "Content": "I was hoping they fixed the lag noticed in the note 2014, but it's the same.I don't think it worth this price tag.", "Date": "March 6, 2014"}, {"Title": "good bad but not ugly", "Author": "oscar lopez", "ReviewID": "R2MGNDOYTO8ZMJ", "Overall": "3.0", "Content": "I just got mine so far I really like it I was considering buying another laptop since mine has started to glitch when I dropped it. Sure it's expensive but, I bought it for myself and I deserve it. Netflix looks great sketch apps are good. Memory wise it has its short comings, still planning on getting the laptop since most are fairly inexpensive and I have to upgrade to Windows 8.1, but my note pro 12.2 is great for me to carry around to work or on trips where I can sync it with my note 3 to use the hotspot when needed. I gave it three stars because I just got it and there is always going to be something better later on technology is moving quick and things become obsolete almost as soon as you buy them.", "Date": "May 24, 2014"}, {"Title": "2 defective units in a row", "Author": "Alan", "ReviewID": "R1T1KBW2FY72AS", "Overall": "1.0", "Content": "I must be the most unlucky person because I received 2 defective units in a row. The 1st one had lots of dust underneath the camera glass and a blurry spot showed up in pictures and videos. The 2nd unit also had some dust underneath the camera glass, plus the chrome rim had a dent and looked worn at some spots, and the sprayed rubber back had lots of dust in it causing it to feel rough and peeling off if rubbed. My Tab2 7 and Tab3 8 were perfect OOB. How did they manage to drop the QC so badly within a few months? The fact that it has a sprayed rubber back (not good quality rubber either) which will deteriorated badly down the road based on my experience, I am going to get a refund and look for something else. It is a real pity because it would make an awesome pdf reader otherwise. They should have done much better for the price.*** UPDATE ***I gave it a 3rd try but bought from another retailer this time. This unit is fine except with a 1mm deep dent on the chrome rim (also happened on the 2nd unit). The only problem now is Kitkat 4.4.2 itself which doesn't allow file transfer from USB to extSD. The SD will completely disappear until reboot if trying to do so. A brief research reveals this is a wide spread issue and to me at least, renders the extSD useless as I frequently transfer audio/video/eBooks through USB. Rooting is the only solution AFAIK and obviously Google did this on purpose so looks like I am done with Android. Google is getting out of hand by making more and more questionable decisions in all areas. 1 star remains.", "Date": "March 3, 2014"}, {"Title": "Never buy from Amazon LLC", "Author": "Max", "ReviewID": "R2WFX6PNGJ6SO8", "Overall": "1.0", "Content": "Samsung Galaxy Note Pro is a great product. You can rate other sellers from Amazon, but there no feature to rate AmazonLLC.I am buying a lot from other sellers through Amazon,I had one our two problems before, that time Amazon pushed sellers to cooperate. I thought Amazon is a good option to buy online. But when I got a problem after I bought directly from Amazon LLC and tried to resolve  a problem there is ZERO cooperation ! They just saying I can return a product, but they do not know how much will be restocking fee till they will get it. They said they do not mach prices even from a producer, they said a lot of things short version: We do not care!!!I will never by directly from Amazon LLC.", "Date": "March 12, 2014"}, {"Title": "Note Pad", "Author": "Scott", "ReviewID": "R1YJ6BOW3MCU7L", "Overall": "1.0", "Content": "I returned to order a 11.6 laptop so I could have full operations than having a Notebook. I am sure this is good quality as I have purchased Samsung products before.", "Date": "May 8, 2014"}, {"Title": "simply da best out there", "Author": "6madam9", "ReviewID": "R3AOANY5B574GR", "Overall": "5.0", "Content": "am rating this device before i even receive it because i believe it's the best out there.i just hate the price of it.", "Date": "February 16, 2014"}, {"Title": "First impressions...", "Author": "roaeja \"Hey you!\"", "ReviewID": "R23WJR32DGIBX1", "Overall": "3.0", "Content": "Ok, why is the instruction booklet written on recycled grocery bag paper?And what is that little U shape metal thingy for?  And those five little daggers?Am I missing something here?  I like the BIG SCREEN!  More eye ball strain.My scribe stopped working for some reason, a reboot fixed it.  More later.What is that little U-shaped metal thingy?  It has me puzzled.  Some guy sent me an email, calling me an 'iDIOT!' for not figuring this out.  I am a senior and I am slowing down,but that doesn't make me an idiot, just slow.I'm trying to add my printer and it see it, but keep taking me to the Play store!Why?  I just want to add my printer.  It doesn't tell me why I need to go tothe Play store or what I am suppose to do, after I get there!!!!  Just a bunch ofprinter icon, but which one to pick?  This has go to be THE MOST STUPID printer set up I have ever used.  I still can't select my printer, cause I don't know that thisstupid table want me to do!!!!!!!!!!  My Kinder HDX, no problem!I ran a bead of heated clue around the back side, about an inch in and followed theoutline.  It kept slipping out of my hand and falling on the rug!  It's to slippery.  But, not with the bead of heated glue, from a glue gun, I can hold onto it.  FYI>I thought you could take a desktop picture by swiping your hand across the screen?  I copied one to the scrapbook, but can't find the scrapbook!  Does this tablet have one?  And what is that little u-shaped piece of metal used for?  And those tiny little spears?  Da.I put some velco loop tape on either side on the backside of the tablet, to hold onto it better.  Seem to work!", "Date": "February 17, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HWMPROS"}}