{"Reviews": [{"Title": "The best tablet I have seen", "Author": "Mommybe", "ReviewID": "R2ZP9P5PCZGOTG", "Overall": "5.0", "Content": "I just bought this tablet as I broke my Samsung tablet. You can't go wrong if  you are looking for an Android tablet.The workmanship is great and I researched a lot about the CPU. It is from Rock Chip and it is their top of the line CPU.", "Date": "February 2, 2014"}, {"Title": "its great for me!!!", "Author": "Shana blakeney", "ReviewID": "R19WJ156I0UAS2", "Overall": "5.0", "Content": "It does everything I want with it ..I love it for the pay it works great for me any way", "Date": "April 13, 2014"}, {"Title": "Nice...but", "Author": "mccoyjn \"Jmac\"", "ReviewID": "R289NYO53PP3A4", "Overall": "3.0", "Content": "Nice tablet but I have 2 main complaints(1)No Bluetooth connectivity(2)The charging port w/in the tablet became \"loose\" 50 days after I received it.  I've had to charge it using the micro-usb port since this which is \"disappointing\".One other thing to be aware of is the tablet unusual dimensions.  It’s almost impossible to find a case that will fit it.", "Date": "June 5, 2014"}, {"Title": "Two returns", "Author": "opus1001", "ReviewID": "RXB7A36VUNC4H", "Overall": "3.0", "Content": "So when this tablet was working, I really liked it. When working, it is a great deal for the price. However, Axess customer service is horrible, and I had issues with both tablets I used.The first tablet I ordered never synced the clock or any of my app data when coming out of sleep mode.  Dealing with Axess was problematic, as their solution was to send me a link for a convoluted process to update the firmware using a laptop and some of their software.Couldn't get that to work, so Amazon worked an expedited return and reorder. The second tablet did not have the same defect as the first, but hung when I was trying to use an app downloaded from Google Play. The tablet restarted and could not advance past the splash screen. Axess did not have a way to externally reset the tablet, even to factory defaults, and their only solution again was to upgrade the firmware. When that didn't work, they recommended another return.More trouble than it's worth, so I will not be trying a third time.", "Date": "May 29, 2014"}, {"Title": "Love it", "Author": "NJDEL35", "ReviewID": "RMJOV0K3RBNJJ", "Overall": "5.0", "Content": "This tablet met all my expectations.  It is easy to use and allows me to do everything I wanted it for  Including watching television programs I missed.  Great buy.", "Date": "May 26, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00H90AIOM"}}