{"Reviews": [{"Title": "Super satisfied customer", "Author": "Joshua Donnici", "ReviewID": "R3N3KHOLT9CEQM", "Overall": "5.0", "Content": "I am so pleased with my new tablet! I was considering on spending hundreds on a nexus. Instead took what I thought was a risk only spending 100 on this tablet that had all the features I was looking for like HDMI out, lightweight, newest processor and OS, and a minimum of a 7 in screen. My expectations have been exceeded! I not only received my tablet, but a cool case/stand that housed a mini keyboard for it! I don't know if I overlooked that in the article, but that was a nice plus! Not to mention the mini SD card! I can never have too many of those! All and all, What I thought was a risk purchasing through a company with few reviews and little 'Amazon standing' was worth it! I don't even care that there isn't an overpriced name brand on the back of the tablet that I am typing on!", "Date": "February 18, 2014"}, {"Title": "Great tablet!!", "Author": "Kerouackat", "ReviewID": "R3A8EROA29DQGQ", "Overall": "5.0", "Content": "Housing unit is not great but tablet itself is really great!  I have had iit for months with no problems.  Just do not buy the case it is no good and can hurt your tablets protective screen in the long run from slipping in and out because the case is to big, so be careful when using that case.  Cannot best it for the $ and the options' which all work well!!", "Date": "April 6, 2014"}, {"Title": "Great tablet for the money", "Author": "Linda Campbell \"TXrosebud\"", "ReviewID": "R9BRX1PGZ7EZ6", "Overall": "5.0", "Content": "I love this tablet, it has worked great since day 1. I have had no problems at  all. I have tried movies games with no problems, the only thing I have not been able to do is get Itunes to download & install. I would tell anyone looking at thia tablet and not sure, Buy it!", "Date": "March 7, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HDKWEFO"}}