{"Reviews": [{"Title": "Good enough for the price...", "Author": "Sergio Segovia", "ReviewID": "R2WNIQEGA1VL9V", "Overall": "3.0", "Content": "I bought this tablet expecting very little of it, but it works as well as any other with the exception of screen quality, the screen quality is a little weak but if you need this to check e-mails, and occasional surfing with WIFI, this is pretty good. It is fast enough to keep you browsing with interest and it has a wide range of applications available through the android market. I would give it a 4 if it had a little better camera. The tactile sensitivity is not too accurate compared to other tablets but you can get used to its demands.", "Date": "February 26, 2014"}, {"Title": "You get what you pay for", "Author": "Jessi", "ReviewID": "RI0MT463Y1LUI", "Overall": "3.0", "Content": "I know this isn't a fancy expensive tablet, but you'd think it would last more than a week before the screen stops working.  I have exchanged it, but probably will not be using it very much.", "Date": "January 2, 2014"}, {"Title": "AVOID !!", "Author": "Esther C Terry", "ReviewID": "RZCKNB7NYPVHN", "Overall": "1.0", "Content": "Had it for 6 days when the on button stopped working. Cant turn it on! Total waste of money. Paid $60 Brand new - Should of know it was too good to be true.  I guess you get what you pay for!!", "Date": "January 1, 2014"}, {"Title": "you get what you pay for", "Author": "T. J. Brown", "ReviewID": "R2CGZ76WB2055T", "Overall": "1.0", "Content": "product did not perform like expected return to Polaroid they had to send a new one locked up just have to be careful with it", "Date": "April 13, 2014"}, {"Title": "YOU GET WHAT YOU PAY FOR", "Author": "dolores sandoval", "ReviewID": "R3L2QOBS1PBM4U", "Overall": "1.0", "Content": "PURCHASED THIS FOR MY GRANDSON, BOUGHT HIM A SD CARD , TABLET WELL NOT READ IT, TOOK IT BACK TOTOYS R US AND THEY HAD NO MORE TABLETS AND COULD NOT MAKE IT WORK, I DO NOT RECOMMEND THIS TABLET", "Date": "February 4, 2014"}, {"Title": "Don't waste your time/money", "Author": "kim kucher", "ReviewID": "R3BQIP0G5JOYTI", "Overall": "1.0", "Content": "I purchased this tablet during cyber Monday sales at Toys R Us(including the extended warranty) as a Christmas gift. Opened it Christmas day, followed the instructions for charging it (8hrs) then when I powered it up, a portion of the touch screen was non responsive. Emailed Southern Telecom on the 26th and called every day (on hold 1/2 hr each time) and did not speak to a rep until January 10. I explained my situation, and was told to take a photo of the unit and email it to them! I went back to Toys R Us, but they could not exchange it due to time lapse. When I called the warranty dept., I was told they COULD NOT exchange or repair the unit, only refund my money (minus the cost of the warranty!) Why sell a warranty that cannot replace/repair the unit???I have since received an email telling me to reset to factory settings. Perhaps my downloaded apps caused a crash? Are you kidding, I was unable to so much as register the tablet due to a non functioning screen!!! Well, I reset it and now the screen does not respond at all! I emailed them on Jan. 15th, and have heard nothing back. I called the # today, and they are updating their phone system. The worst customer service ever!!", "Date": "January 17, 2014"}], "ProductInfo": {"Price": "$129.99", "Features": "Dual Cameras\n1GHZ Processor\ncapacty Display\nWi-fi", "Name": "Polaroid V7 7\" Internet Tablet Front & Rear Camera Android 4.1 Jelly Bean Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/41fc3SAoYAL._SY300_.jpg", "ProductID": "B00H03NZB6"}}