{"Reviews": [{"Author": "Pam", "ReviewID": "R2PLBVH8HFM05F", "Overall": "5.0", "Content": "I purchased my tablet from Best Buy for $99. I looked online for hours, and think this was the best deal for the price. It's fast, HD, not to old of and Android version. Charging it is a little annoying. It takes awhile to charge via the USB charger, or USB w/ wall outlet charger. The charge lasts a long time though. I recommend shutting it down for the night or when not in use for awhile, because it uses a lot of juice still when it's on sleep mode. Excellent tablet for the price. I was seeing $200 tablets that had worse specs than this. I spent $185 for a tablet 2 years ago, and this is 10 times better, for almost half the price. Time will tell how it stands up long term.", "Title": "Awesome deal", "Date": "March 28, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1BEMNRCV3OL29", "Overall": "5.0", "Content": "We finally bought Toshiba tablets that were on sale after going through the mistake of trying cheap brand tablets. I waited a month before reviewing our purchases and am pleased. Easy set up, the battery life is decent and I'm able to password protect it so the children have to have permission to get on them. There is glare on the screen when sitting near a window or outdoors but assume a screen protector might help with that.Should have gone with this tablet in the first place.", "Title": "Excellent tablet for reasonable price", "Date": "May 26, 2014"}, {"Author": "Delores C, Nickerson", "ReviewID": "R23I35JE0F1X4R", "Overall": "5.0", "Content": "my old tablet, bit the dust  looked it up on AMAZON  and  there it was, jut what I was looking for a nice7 inch tablet---again  THANKS", "Title": "Toshiba Excite 7 inch", "Date": "April 14, 2014"}, {"Author": "Glafiro Guerrero \"GG\"", "ReviewID": "R166QML3X9FI9", "Overall": "5.0", "Content": "Good quality at an unbeatable price, able to download most Android apps, easy to navigate and set up, reliable tablet by a trusted brand.", "Title": "Good value tablet", "Date": "April 6, 2014"}, {"Author": "D. Gavey", "ReviewID": "R1CM0DLLJC8B7U", "Overall": "5.0", "Content": "Just as the specs said and more.  It really has the Toshiba quality..  For $99, it is a steal, just buy it....", "Title": "Fantastic", "Date": "April 3, 2014"}, {"Author": "Ion M. Kirksey", "ReviewID": "R18CYHHBEEKZR0", "Overall": "3.0", "Content": "It takes an EXTREMELY long time to fully charge. It works great, but I wish I knew about the charge time before I bought it.", "Title": "Functional, but takes forever to charge.", "Date": "April 2, 2014"}, {"Author": "Milagros Alvalle", "ReviewID": "R1DEYE77X1AHB0", "Overall": "5.0", "Content": "love it, i highly recommended it and the price was just right i take it everywhere with me. Get It", "Title": "Love it", "Date": "March 31, 2014"}, {"Author": "John K.", "ReviewID": "R1KVSWPINF8JVX", "Overall": "5.0", "Content": "The person I bought it for loves it. It only has 8 GB of memory but it has an SD card slot.", "Title": "Great tablet for the price", "Date": "May 11, 2014"}, {"Author": "monimone77", "ReviewID": "R26MANY9GD2076", "Overall": "5.0", "Content": "Very nice tablet.  Great screen, fast processing, full featured unit.  Can't believe this thing is soo great for under $100!!!!  Works very well, smooth and extremely happy with purchase.  All apps work flawlessly.  Great purchase.", "Title": "Great inexpensive tablet", "Date": "May 8, 2014"}, {"Author": "Daniel Lafollette", "ReviewID": "RWMJ3CROSUTPW", "Overall": "5.0", "Content": "I'm writing my review on my Toshiba Excite 7c. For $99 it's a great deal. They put the emphisis on the right features. I like it!", "Title": "Great value", "Date": "April 24, 2014"}], "ProductInfo": {"Price": "$99.99", "ProductID": "B00HWI3T1U", "Features": "Android 4.2.2 Jelly Bean; 7-inch Display\nRK3168 Dual-Core ARM Cortex-A9 Processor\n8 GB Flash Memory, 1 GB RAM Memory\n11.30-hour battery life, .78 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41oluu0ETJL._SX300_.jpg", "Name": "Toshiba Excite 7c AT7-B8 7-Inch 8 GB Tablet"}}