{"Reviews": [{"Author": "rpv", "ReviewID": "R2RU5FFXA9GYLF", "Overall": "5.0", "Content": "This is my review of non Red version, but it is the same. Red version is even better for those who like the color!There are too many tablets these days, right?! Samsung's third generation of Galaxy Tab series is highly anticipated and for this price point phenomenal. I have been using Galaxy Tab 2 and I will compare and contrast here. I played around with review units of all sizes and I have since returned them. My reviews are unbiased and neutral! First, if you have not had any tablets before, Get THIS! Yes, Get this 7\". It is ideal for plane trips, long journeys. I had used a 7\" Tablet on a long journey to listen to songs and read epub books (Aldiko) and it was a very pleasant experience. 7\" form factor is lightweight, compact and great. If you are a bit experienced and can afford it, I highly recommend the 8\". In my opinion 8\" is the maximum value for the money and features and hence I gave 8\" a 5 star. I gave 7\" a 4 star (but no means undermining it). I gave the 10\" also a 4 star because of some strange spec `limitations'.Samsung has introduced 7\", 8\" and 10.1\" of the Tab 3 series. They are entering all form factors. As I know they have something in 4, 5, 6, 7, 8, 10\" lines. Woo.. All of the 7, 8, 10\" Galaxy Tabs come in white and golden brown color. My preference is white color. Looks pretty!Let's start off with salient points of all of the Galaxy Tab 3 series. I will later compare with the previous Tab 2 model.7-inch tablet: 1024 x 600, Marvell dual-core 1.2GHz processor, 1GB RAM, 8GB built-in storage (ROM), a microSD card slot (up to 64 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 10.58 oz. (300 grams). Android 4.1.28-inch model: 1280 x 800, Exynos 1.5GHz dual-core processor, 1.5GB ram, 16GB of built-in storage (ROM), a microSD slot (up to 64 GB), Camera: 5MP rear-facing, 1.3MP front-facing and weighs 10.9 oz. (309 grams) Android 4.210.1-inch model: 1280 x 800,  Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, a 16GB built-in storage (ROM), a microSD slot (up to 64 GB), Camera: 3.2MP rear-facing, 1.3MP front-facing and weighs 17.99 oz. (510 grams). Android 4.2I am not going into other details like accelerometer etc. as they are all standard these days, Audio support - AAC, AMR, MP3, OGG, WMA/ASF, 3GA/M4A, FLAC, WAV; MP3/MP4/Music Tones; Music Player; Ringtones, Polyphonic. Video support: AVI/DIVX, WMV/ASF, FLV, MKV, MP4/3GP, WEBM; Video Player; Video Streaming. Software is current of release date, and it is expected could be upgraded as next version Android 5 Key Lime Pie. (Currently targeted for Oct 2013). Key Lime Pie's one of the main touting points is compatibility to avoid fragmentation, so I can foresee, all of these models being able to upgrade if Google keeps their promise.The 7\" has a physical home button so are others in the series.  Also has capacitive Back and Menu buttons. Camera is a 1.3-megapixel front-facing camera for skype, and a 3-megapixel rear-facing camera. It is also equipped with an IR blaster so it will work as a universal remote on both your TV and cable box. Camera is only so and so, and I will not rely on it to produce outstanding photos. Weighs only 300 gm. 64 GB SD card is awesome! With prices plummeting for 64 GB cards, it is a great boon. Put all your music, books, photos on the SD card and you have a powerful computer in hand always! I personally use the 64 GB microSD card on my mobile devices. Get this mobileUltra (SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging.Galaxy Tab 2 is 345 grams, so Tab 3 is lighter by 45 grams.  Processors are similar 1.2 GHz dual core in Tab 3 Vs 1 GHz dual core in Tab 2. Resolutions are same with Tab 2 1024 x 600 pixels (~170 ppi pixel density). Tab 3 supports up to 64 GB whereas Tab2 is 32 GB. Not a big deal unless you have tons of video/photo/ebooks/music you want to carry with you all the time. I use a mixture of on device storage + Google Music + box for my data needs.  Battery is also same between Tab 2 and Tab 3 7\" versions - Non-removable Li-Ion 4000 mAh battery.Both have Bluetooth 3.0.  I cannot confirm still if Tab 3 7\" supports OTG.  I know for sure Tab 3 8\" supports as I tested it.  USB Host is one of the most undernoticed features of Androids and is in my opinion one of the best features compared to iPad lines. What this means you get a USB Host cable also otherwise called OTG (On the Go) cables and plug in your USB thumb drive or other USB devices and the device recognizes it. I have used it with Alfa AWUS036H for a wireless project with Android PCAP Capture from reputable Kismet wireless.  Another much ignored feature is the TV-out (via MHL A/V link). Unfortunately the 7\" does not support it whereas 8in and 10.1 in supports it. You can connect Galaxy devices to a TV to make it truly a fantastic computer if the device supports MHL. Throw in a Bluetooth keyboard and it is awesome. Leo Laporte's TwIT TV which is Internet based show has one full episode in Know How on covering this topic. GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up). I personally use Navigon from Garmin and have downloaded several apps.Finally, believe me, don't get mired in the spec game. 7\" is equally capable as a 8in for `most' day to day apps. If you are reading books, browsing, listening to music, looking at photos 7\" is more than enough. Samsung is creating markets for all form factors and I would consider this as an exploratory stage. Just like Ford or Toyota has cars in different shapes, sizes and price range, so are the tablet vendors now. Remember the laptop wars, 10\", 12\" 13\", 15, 17 and even some 19\" if I remember right few years ago. We used to debate endlessly which laptop sizes are better, which has better speakers and so on. The time has come to fight it out for tablets!I tried following apps and they just worked awesome. A tablet is only as good as the apps you have and how productive it makes you. It's almost like the camera/lens analogy in the DSLR space. What good it is to have a great DSLR body if you have no good lens? Same with Tablet body and apps you have.WolframAlpha (I can go on for hours praising this. This is a truly genius app powered by hundreds of supercomputers in the background. Wolfram is a computational genius). Well worth the $3 price.Withings HealthMate. (another remarkable app great UI/UX). I am getting the Pulse device as soon as it hit stores. I have been using Fitbit and just itching to get the Pulse as I like the intergrated weight/track runs in one app)Aldiko Book Reader Premium (absolutely love it)Amazon MobileAndroid StatusAndroid Central app (great and must have for Android users)AndroidifyAngry Birds (Space/Seasons)Asphalt 7Amazon App StoreBattery Monitor Widget Pro (a great app)BeyondPod (excellent for podcasts, I haven't used Pocketcast, some friends say it is very good too)BoxCar Maintenance Reminder ProChromeCloudShark UploadCNET TVDespicable Me Game! And weather widget (cute for kids)Dictionary M-W PremiumDragonvaleNAVIGON (from Garmin - offline maps)Google Navigation/Earth/Maps using a portable MiFi boxGoogle Currents (nice way to read News)Google Keep/Keboard/Drive/Search/Books/Voice/HangoutsDraw SomethingEbayLinkedinGoogle Music (Awesome, I have now upto 10,000 songs halfway through Google's 20K Limit)Tapatalk HD (awesome forum browsing app)OverDrive Media Console: Library eBooks & AudiobooksMicrosoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for AndroidASIN:B007R6PKBY Twit.TvSkypeSphero (Awesome bluetooth ball game)RealCalc Plus (Awesome calculator app)Tweetcaster Pro (again awesomeness)Plenty of WidgetsAsk questions, the reviews cannot do full justice. I will be glad to answer any questions and usually answer within 24 hours to any query.", "Title": "Excellent form factor, and good improvement from previous model", "Date": "February 22, 2014"}, {"Author": "lily", "ReviewID": "RSAKWH7UR9YQM", "Overall": "5.0", "Content": "Love the galaxy 7\"!  Love the Garnet red.  Love the bundle...the very nice book cover and 3 months of Netflix...free!!The tablet itself is good....not as good as the 8\", but good enough.  Great bundle for great price!  Thank you Amazon!", "Title": "Love it!", "Date": "February 13, 2014"}, {"Author": "barouge", "ReviewID": "R37B402KR6XB7I", "Overall": "4.0", "Content": "I like the color, convenient size and weight. the picture quality is good. i have no complaints at all. i bought because of the reviews i read on amazon. i am glad i did.", "Title": "Just what I need", "Date": "February 14, 2014"}, {"Author": "Debe Eckenrode", "ReviewID": "RW8PHY4DUS8XI", "Overall": "5.0", "Content": "purchased for thr grandkids to give their mom for her birthday...they say....mom doesnt yell so much now....she is too busy on her tablet....A big hit..", "Title": "Great gift", "Date": "May 5, 2014"}, {"Author": "Valerie G. Fairchild", "ReviewID": "RSQJK2AR27MUB", "Overall": "5.0", "Content": "Nice color, nice case. Very fast does everything I need it to do and the battery lasts a long time.", "Title": "love this tablet", "Date": "May 6, 2014"}, {"Author": "Connie Dougherty", "ReviewID": "R13HWPHPHHJ0BS", "Overall": "5.0", "Content": "I have a 10.1\" Samsung Galaxy 3 Note that I really like but I have arthritis in my hands so it is heavy to hold. The 7\" version is perfect. Lightweight and easy to use.", "Title": "Love it!", "Date": "May 9, 2014"}, {"Author": "Cheeks Bros", "ReviewID": "R1IO7ERWWT4K2J", "Overall": "5.0", "Content": "The Samsung Galaxy Tab works good!!! I could possibly recommend it to a friend and/or a family member to get one.", "Title": "Awesome", "Date": "May 2, 2014"}, {"Author": "MICHELL FRASER", "ReviewID": "R124M06RB8E7CD", "Overall": "5.0", "Content": "i ordered this for someone. she said she likes it and that it works well. she recommends it to anyone", "Title": "excellent", "Date": "April 25, 2014"}, {"Author": "Rick", "ReviewID": "R31W73O36D8Y9Z", "Overall": "5.0", "Content": "Wife was going to buy on QVC but we found a better price on Amazon than any other sources.  Exceptional screen clarity and easy to use.  Great little device.", "Title": "My wife loves her Tab 3", "Date": "April 24, 2014"}, {"Author": "JD", "ReviewID": "RGWACO94TYVCB", "Overall": "4.0", "Content": "I chose this particular model because I like the color and matching case.  Although the case is not ideal for heavy duty protection, it is not bulky and enough to protect the tablet from scratches in a purse.  The 8 inch Galaxy model may be a better balance between portability and performance, but for my use as a secondary travel tablet, this model saves money and does the job just fine.", "Title": "good secondary tablet", "Date": "April 21, 2014"}, {"Author": "dab57", "ReviewID": "R19JUTX0GVISK7", "Overall": "5.0", "Content": "Its perfect for what i wanted it for. does everything I want when i go away.  It is very compact.", "Title": "Galaxy 3 Tablet", "Date": "April 19, 2014"}, {"Author": "Joan Mickles \"savyshopper\"", "ReviewID": "R3J1EZZS79L0VF", "Overall": "4.0", "Content": "I bought this because it's the color of my Washington Redskins and I have the Samsung S3...luv the samsung product.", "Title": "Absolutely luv it", "Date": "April 2, 2014"}, {"Author": "Jamantijust", "ReviewID": "R3HGFV8BAKQWUY", "Overall": "5.0", "Content": "received item on time. the tablet is of high quality and more that I expected. it was complete with a case for the tablet to match.", "Title": "excellent choice", "Date": "March 31, 2014"}, {"Author": "Rico 627", "ReviewID": "RSQMHWK7HJMEG", "Overall": "5.0", "Content": "This is fun and great way to kill time or watch a movie or even read a book or even go surfing on the web works awesome", "Title": "Awesome", "Date": "March 21, 2014"}, {"Author": "Karielk", "ReviewID": "RLZ2T3Z3TRAAB", "Overall": "4.0", "Content": "My kindle fire was asking up and i wanted to try something away from amazon.  This is a pretty good tablet,  but i felt it lagged going into websites,  facebook,  weatherbug etc.  It has some cool features too,  but one decision was not being able to watch some of the things on prime.  they don't play at all.  Someone told me how good their new kindle fire hdx was,  so i got one of those instead and there is no lag time going into the same sites.  and i enjoy watching some things on prime.  Yes I would recommend this Samsung,  it is a good tablet,  but i do like my kindlefire hdx better", "Title": "Pretty good tablet", "Date": "March 3, 2014"}, {"Author": "TheShopper", "ReviewID": "R1RQS0WP6SHWGU", "Overall": "5.0", "Content": "Was looking for a great little tablet for my wife so she can take everywhere (bible app take to church, fits in her purse). I went through all the 7 inch tabs for sale and none had a combo of WIHat this had. The nexus 7 was a great tab but no expansion of memory, an no rear facing camera. The cheapest Kindle had no camera. Price wise this had everything she was looking for and looks great. She loves the color and I updated it to kitkat 4.4 and she loves it. I Def recommend this tablet for the price.", "Title": "Purchased for my wife", "Date": "May 26, 2014"}, {"Author": "Dennis 215 \"dennis215\"", "ReviewID": "R1R7GWBUZPB1F9", "Overall": "1.0", "Content": "Looks pretty, nice screen and the case is nice. It says that you can install a 64GB card but what they don't tell you is that you can only put photos,movies and music etc you can't move your apps there. I wrote and asked Samsung who confirmed it. Also the charger seemed to be very proprietary at least I could only seem to charge it from the supplied charger, none of my other chargers and or cables would charge it, so it went back.", "Title": "Didn't like it...", "Date": "May 22, 2014"}, {"Author": "Adolphus Boyd", "ReviewID": "RLG1V713F257P", "Overall": "5.0", "Content": "This has been one of my best investments!!!!!!! Go Samsung!!!!!!! I love the color, the casing and it is so easy to handle. I have recommended this product to many of my friends and relatives.", "Title": "AWESOMe!!!!", "Date": "May 12, 2014"}, {"Author": "tobsogs", "ReviewID": "R2ZIKQBO379HRL", "Overall": "4.0", "Content": "I like the way this product looks. It feels good in my hands too. It works exactly like my galaxy phone. I bought this for my 4 year old to play with since he always hogs my phone. It was a good choice. I went through 3 tablets before I finally decided to get this one. I haven't returned it yet and its been a month. It's definitely a keeper. It's a little slower than our phones but that's understandable because it was developed earlier but it just takes getting used to. It does everything I need it to.", "Title": "It looks great!", "Date": "April 22, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2LO5T7J0D27F4", "Overall": "5.0", "Content": "I LOVE IT.IT HAS OPENED UP A NEW WORLD FOR ME. STILL LEARNING ALL THE FEATURESUNABLE TO GET 3 FREE MONTHS NETFLIX WHICH CAME WITH THE BUNDLE THOUGH.", "Title": "REVIEW ON TABLET", "Date": "April 14, 2014"}, {"Author": "DJ Maryland", "ReviewID": "R3TS2ULI7LL9K2", "Overall": "5.0", "Content": "I got this for my husband for his birthday got it in 4 days was very surprised. He loves it can't put it down reads the news paper on it and keeps up with all the ball games. I guess he is hooked. Another great job Amazon thanks.", "Title": "Birthday gift", "Date": "April 13, 2014"}, {"Author": "ENFO", "ReviewID": "R23F69PDSM02RB", "Overall": "5.0", "Content": "Everything works as expected. I received on time even when I ordered late. Great product with no issues. Love that it came with the cover.", "Title": "Great Tablet", "Date": "March 25, 2014"}, {"Author": "Katrina Sinclair", "ReviewID": "R3CXRIZYJTABIH", "Overall": "5.0", "Content": "im still new to the new technology but im learning new this everyday now just have to learn how to get my music from my computer to the tablet but prompt delievery and well packaged and in perfect condition. I love it.", "Title": "love it so far", "Date": "February 23, 2014"}, {"Author": "Donna", "ReviewID": "R18E3KF9NP1ITM", "Overall": "5.0", "Content": "I love the color and the tablet I brought for myself for my 66 Birthday and having a ball with it would recommend to others who want a nice tablet that does everything you can think of but read the instructions I download them and print so I could read and keep on hand when I need them.", "Title": "Love It", "Date": "March 11, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RKLDI1PIX2358", "Overall": "5.0", "Content": "It's the perfect size for our family.  We are very happy with it.  We have teenagers to adults using it and it works just fine with everything.", "Title": "very nice tablet", "Date": "April 14, 2014"}, {"Author": "Marcella Brown", "ReviewID": "R37YEX5FRNWVY8", "Overall": "5.0", "Content": "I just got it but already a big fan Just wish I had a case that actually stands up It gets a little hard to hold up. but its a great tablet would highly recommend especially if you own a Galaxy phone its great if you love your Galaxy phone..", "Title": "love my Tablet", "Date": "March 25, 2014"}, {"Author": "Gregory Schwartzkopf", "ReviewID": "R2MOBA0MYHX2F9", "Overall": "2.0", "Content": "Overall a nice form factor/size with pretty good responsiveness and battery life considering the cost. There are a number of nags though that make this an unlikeable tablet for me.1. The latest supported android firmware is 4.1.2. At this point, pretty far behind 4.4. Missing two major releases from Google. KitKat still not out (though samsung says it's close).2. No official cyanogenmod port, so you're basically stuck with 3-year old Android software with no 3rd party roms3. In-built SD card is useless because 4.1.2 doesn't let you move apps from internal storage to SD card. So if you're planning on loading it up with lots of large games for the kids, you're limited to 8GB.4, Permanant soft buttons and home button have no lighting whatsoever. Really sucks when you're using the tablet at night.5. USB charging is crippled by default if you connect to an actual computer. You can overcome this by doing the insert-slowly-halfway trick with the usb cable, but seriously, not being able to charge a tablet from a PC? That's BS.6. Lots of crapware preloaded. Some people may like this, but I personally like my tablets clean so I can install what I want, not what Samsung wants.7. I have to agree to a bunch of samsung licensing and EULAs to use the tablet-- kind of BS considering Android is open source software.I bought this tablet because the bezel is small and the form factor is nice, plus it came with the nice little case. But this is crippled compared to my phone because of the limitations, and I regret not having done some more research before I bought it. Should have stuck with the nexus tabs-- they're uglier, but at least they're functional and supported by the dev community...Overall I think I'm going to sell this guy on ebay and buy something else. I'm not hopeful that kitkat will solve many of the issues and it may be years before we get a CM build. At the end of the day, there's better ways to spend your $200.", "Title": "Some serious issues for true Android users. For the kids only, and barely at that.", "Date": "March 16, 2014"}, {"Author": "-Srini", "ReviewID": "R2OGS16D24PVN9", "Overall": "4.0", "Content": "Works well and i am using it w/o any issues so far. Great buy for the price. The tab included a cover that can work as a stand too !", "Title": "Nice Tablet", "Date": "June 9, 2014"}, {"Author": "Daphne Reeves", "ReviewID": "RZC6BMS4PM30", "Overall": "5.0", "Content": "I would have love to kept the tablet. But Just got a laptop and Nintendo 3DS console and would have a hard time trying to get rid  of unwanted guest , little kids. so I will get a tablet from you in the new year one that I can reasonable", "Title": "Samsung Galaxy Tab 3 Garnet Red Tablet Bundle (7-inch,8 GB)2013 Model from Amazon.Com", "Date": "June 8, 2014"}, {"Author": "Darrin", "ReviewID": "RI71SNUJYXSDV", "Overall": "4.0", "Content": "I like the tablet but it just runs really slow. There is so much lag in everything. Its decent i guess.", "Title": "slow", "Date": "June 2, 2014"}, {"Author": "Bianka P", "ReviewID": "R2FF22JYUTIJEF", "Overall": "4.0", "Content": "I love my new Samsung Galaxy Tab 3. Its everything I dreamt and then some. The only thing is the middle button is really shaky. I hope it doesn't malfunction because May 1st will make exactly 1 month since I received it. Besides that, delivery was on time, and I loved it since I received it. I can't put it down. Lol thanks for giving me freedom again.", "Title": "I love it only 1 concern", "Date": "April 30, 2014"}, {"Author": "Dee", "ReviewID": "R38TI0YH0ER7QX", "Overall": "5.0", "Content": "Its everything I needed in a tablet. I love they size of it and the features. Very sleek tablet . I am pleased with it", "Title": "Samsung Galaxy tab 3 is great", "Date": "March 4, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RACD1WOMC29UX", "Overall": "5.0", "Content": "I want to say first that I had the Galaxy Tab 2 for a long time. So, after the demise of my beloved tablet (long story but unrelated to the function/longevity of the product itself) I went looking for a new one. I would have ended up with the typical white one, but when you add up the cost of the tablet itself, plus the case that I would have bought with it, it amounted to the exact same price as this limited edition, I chose the Garnet Red one.The color is an AMAZING, true blue-based red and has a shimmer to it. I wouldn't say that it is feminine looking at all but it is beautiful and the case is also a very nice shade of red. I would say for the case, it is slim, it barely adds any bulk to the tablet itself.Otherwise- The garnet red edition is exactly like the white and brown/gold version of this tablet. :)", "Title": "Garnet Red Edition", "Date": "March 3, 2014"}, {"Author": "Jacqueline Nicholson", "ReviewID": "RAG9RM5IOGR13", "Overall": "5.0", "Content": "This is my baby!!! I love the quality in all aspects. The price was decent. Plus I love the free stuff that was included as far as the Netflix  subscription..", "Title": "Can't Complain..", "Date": "March 3, 2014"}, {"Author": "Sharon L. \"Sharon L.\"", "ReviewID": "R3VKWQHHWFY3X", "Overall": "5.0", "Content": "I love this. Using it to enter this review. Quicker than my new Dell laptop. Purchased primarily to read pdf ebooks purchased online for a unbelievable inexpensive price from s korea. New authors, new best seller books. I could not get them to display properly on my ereader. This works great. I am thrilled. Great purchase for me.", "Title": "More than I expected", "Date": "February 5, 2014"}, {"Author": "Anaia Twitchy", "ReviewID": "R2NJXRD9BOSQS4", "Overall": "5.0", "Content": "I absolutely love this color. It is a nice size, it is manageable and nicely weighted. The OS is smooth as always. Runs fast. Plays my apps well. I can now read on something! Very happy about that! Only thing I was bummed about was the lack of Netflix listed. I suppose the 'supplies' ran out? Either way, love the case it came with. Thank you for making an awesome product. I love the Galaxy line!", "Title": "Excellent product, price, and bundle!!", "Date": "February 18, 2014"}, {"Author": "Chevalier Brown", "ReviewID": "R20PUURKYXJ83J", "Overall": "5.0", "Content": "It came at the time it said it will be there and the package was undamaged. I love all the features and cool things I can do with it.", "Title": "love it!", "Date": "April 20, 2014"}, {"Author": "loretta remeder", "ReviewID": "R2WY68674TAE7I", "Overall": "5.0", "Content": "This one i order for my 5 year old daughter and she hasnt put it down since she first got it inHer hand.....i love the color red just beautiful and case fits tight and not to mention the free perks three months of netflix....what child wouldnt love that!!!!!", "Title": "very kid friendly", "Date": "March 15, 2014"}, {"Author": "Heather Jones", "ReviewID": "R2RTB9EX8L55AX", "Overall": "4.0", "Content": "It's a great little tablet, but it's slow and touch isn't very sensitive. But perfect for what I wanted it for which was reading and the use of the calendar. I use the internet a little bit, better to have the larger screen, but for what I do, my phone is just faster and touch is more accurate so I prefer it.", "Title": "Not for the internet junkie", "Date": "March 14, 2014"}, {"Author": "vin", "ReviewID": "RXATG5IFE13CO", "Overall": "5.0", "Content": "I still have the 2 and moved up to the galaxy 3, five months ago. Improvements over the 2 are great. Movies are flawless and smooth with no buffering problems (I stream Netflix). As far as I know, the galaxy 3 is the only tablet at this price point that will accept a 64 gig sd card, if you are so inclined.The speakers are acceptable for their size. Updates and apps will load fast and easy with no problems.(Especially after 8:00 P.M.)I could say much more, but simply, out of the box you will not buy a more simple tablet to use. The reduced footprint of the 3 allows it to fit in any inside suit pocket.", "Title": "Samsung Galaxy Tab 3, Garnet red tablet bundle.", "Date": "March 14, 2014"}, {"Author": "celina", "ReviewID": "R1CN1EUWETX183", "Overall": "5.0", "Content": "I have a samsung galaxy s4, so when I purchased this samsung galaxy tab 3, I knew I wouldn't have any problems. It works great!!! I wouldn't trade it for anything else.", "Title": "I love it!!!", "Date": "February 26, 2014"}, {"Author": "M.Say", "ReviewID": "R133XIINF566T6", "Overall": "5.0", "Content": "I have had the original Samsung Galaxy Tab for over 2 yrs now and my hubby got me this beautiful garnet red S3 tab for V-day and I couldn't be happier. It fits ALL of my business, personal and entertainment needs. I also got the matching flip case. THANKS SAMSUNG!", "Title": "LOVE ♡", "Date": "February 24, 2014"}, {"Author": "Lisa M. Wiey", "ReviewID": "RU3EIX1GXBFNF", "Overall": "5.0", "Content": "Awesome Amazon has done it again. I have been looking for this. And I saw it some where else for too much money. Found it at Amazon for a good price and I was able to buy other stuff to go with it. You cannot go wrong with Samsung. I saw this on tv and the price was all wrong (way too high) found it on Amazon very very good price. Thank you", "Title": "Awesome Amazon meets Awesome Samsung.", "Date": "February 9, 2014"}, {"Author": "george l fancher", "ReviewID": "R2T8RYRJHX054K", "Overall": "2.0", "Content": "I was good till it wouldent turn back on. was not happy it crash alote and then just stoped working at all.", "Title": "good till it wouldent turn back on.", "Date": "May 28, 2014"}, {"Author": "Rob", "ReviewID": "R3CO3J6OJ997O3", "Overall": "2.0", "Content": "I bought this tab on HSN. Its not a bad tab. My only issue is with the onboard memory. Its 8 GB. After all of the preloaded stuff is factored in, its only left with 4GB of internal memory. I added a fed games(not many) and a portion of my music library and ran out of internal memory. I tried to transfer the google apps to the 64GB memory card, NO GO.I contacted samsung, I thought maybe I was doing something wrong. The tech told me that the ability to transfer purchased apps to the memory card is disabled on the version this tab ships with ?????????If I had known this I might have bought something else.Im not really happy with this tab for this fact. I have a sweet (empty) 64gig micro chip and a Tab that has no more memory.", "Title": "Good Tab, poor internal Memory !", "Date": "May 20, 2014"}, {"Author": "colett", "ReviewID": "R2R57S66WFKVGP", "Overall": "3.0", "Content": "It very slow for me and can get  my bible app on it or my daily words so I am very disappointed for that", "Title": "slow", "Date": "May 20, 2014"}, {"Author": "Jay Williams", "ReviewID": "R3HINSNWIBZZC5", "Overall": "3.0", "Content": "Shipped pretty quick,but device isnt so nice; see my full Review on YouTube Jay-Willy Tech.Feels like a regular tablet. Nothing really special. You should purchase Galaxy Tab 4", "Title": "Not so nice", "Date": "May 19, 2014"}, {"Author": "Lorri", "ReviewID": "R6X1ZD2V9EELF", "Overall": "5.0", "Content": "Very nice tablet for my limited use.  Easy to operate and customize.  I am using is mainly for entertainment but with continued use will branch out as needed.  Delivery was very quick even though I did not pay for fastest way.  I'm a happy camper!", "Title": "Garnet Red Tablet bundle", "Date": "May 16, 2014"}, {"Author": "Peggy K.", "ReviewID": "R351VFJVNSAM0W", "Overall": "2.0", "Content": "I do not have the free 3 months Netflex and can not find where to get it from.  This was the selling point for paying as much as I did for the Bundle.  Otherwise I am satisfied witht he product.  I just feel ripped off.", "Title": "Samsung Galaxy Tab 3 Garnet Red Tablet Bundle did not get Bundle", "Date": "May 4, 2014"}, {"Author": "Pennye", "ReviewID": "R2H3BK1C1177V2", "Overall": "3.0", "Content": "Didn't realize it didn't have a flash for the camera, it's wifi only.  Love the Garnet Red. No realcomplaints.  I would rrecommend in to my friends.", "Title": "I like it but.....", "Date": "April 23, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00HKEI3I0", "Features": null, "ImgURL": null, "Name": null}}