{"Reviews": [{"Title": "excellent tab for kids", "Author": "adams", "ReviewID": "R2QPGHQT9WP71L", "Overall": "5.0", "Content": "These tablets were given to my kids as a gift. It's really a great tablet, if you are looking for a low cost tablet. I really love the design of this tablet. It fits nice while holding it with one hand. This tablet is running android 4.2. Web Browsing on this tablet is prefect as well as checking emails. When it comes to watching videos; I wouldn't recommend using the speakers. I would use headphones, the speakers are not the best on this tablet. This tablet comes with lots of preloads kids apps that are beneficial. I like how the tablet comes with a micro SD card slot. The battery life of this tablet is impressive, my kid was able to get 3 days of use out of this tablet. Pros: *Cheap and affordable *A fast tablet dual core processor , HD 1024x 768 display as well. *Great for web browsing. *Easy to travel with. Cons: The momory is only 8GB, but the 32GB expandable MicroSD card slot resolve this. Overall I think this is a great tablet. I recommend this tablet.", "Date": "January 28, 2014"}, {"Title": "my granddaughter is disappointed that happens very often", "Author": "Marcos Manuel Mesa Zerpa", "ReviewID": "RESLLID847MXZ", "Overall": "1.0", "Content": "because the tablet will freeze and does not accept any command. when that happens you have to turn it off and on again. my granddaughter is disappointed that happens very often.", "Date": "May 5, 2014"}], "ProductInfo": {"Price": "$199.00", "Features": "Android 4.2 Jelly Bean, 7 inch HD Display, 1024x600\nCortex A8 RK3168 Dual core 1.6GHZ Processer\n1GB DDR,8GB Storage, Wifi 802.b/g/n\nDual Cameras, front and rear HD video Chat\nWonderful kids interface, Google Play Store preloaded", "Name": "2014 NEW Contixo Kids 7 Inch Android 4.2 Tablet PC - Dual Camera, RK3168 Dual-core 1.6GHz, 1GB RAM, 8GB HDD, HD 1024x600 Display Capactive Touch Screen, WiFi (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/51lJzNcPrLL._SX300_.jpg", "ProductID": "B00HWPTMIM"}}