{"Reviews": [{"Title": "The Best", "Author": "The Handsome Hammer", "ReviewID": "RVLYP7ASCJG12", "Overall": "5.0", "Content": "My wife and I are new to tablets but we always have the latest smart phones. She has the iPhone 5s and I've got the Galaxy Note 3. I bought her the iPad Mini Retina and the Galaxy Tab Pro 8.4 for myself. I only mention this because if you are like me, you are considering the Pro 8.4 and are comparing it vs the iPad Mini Retina.After using both,  I have to say this tablet is amazing. I am a lot more techy than my wife,  and you can tell this thing is built for speed. The multitasking and shortcut features feel natural and there is Zero screen lag after the initial setup. The ipad mini feels a bit more aesthetically polished in it's physical design,  but severely limited in customization for my tastes once you start playing with it. I am also not fond of the 4:3 aspect ratio Apple uses,  especially apparent when watching videos or looking at pics in landscape mode.  The tab pro 8.4 is a beast with an even shaper display,  and movies fill nearly the entirety of it's perfect screen. Also Swiftkey is a major plus for me.  The Samsung keyboard is far superior to apple's, and even offers shift and ctrl keys that function like a pc keyboard where you can hold down shift and hit other keys if you wish.Everything else I can tell you about specs is already written somewhere else.  If you are an android lover,  this is absolutely the best tab out there and is due to be a flagship device for Samsung,  much like the Note 3 is now. Buy it and you will have no regrets.", "Date": "March 2, 2014"}, {"Title": "Beauty of a Resolution - Stunning!", "Author": "rpv", "ReviewID": "R3CZE3U482FGMD", "Overall": "5.0", "Content": "Got this on first day of release from a big box store few days ago. What a stunner resolution! You will be surely blown away.  This has to be the best tablet of 2014 with Android 4.4 and a gorgeous resolution. Before I dive into the details, let me compare the PRO lines from Samsung. I will compare first the TabPROs briefly. I  give a crisp overview of the popular Tablets in market at the end.  I feel this will give a good perspective and enhance your buying decision.  If you have any questions, do ask in the forum and I will respond within a day.The single most fascinating part of the TabPRO lines is the resolution. Astounding 2560 x 1600 on all lines which means on 8.4\" has the maximum ppi and excellent look. In comparison last year's Tabs have much lower resolution. Just go to your local electronics physical store and play with it. The biggest downside of this tablet is the price. It should be $100 cheaper, but you pay the premium for the Samsung brand as well as their experience in this industry. It is like Apple on the iOS world.key_specs: { model: resolution, ppi, CPU, RAM, Flash memory, SD_card, camera spec, weight, OS_type, size, charging/sync port type, GPS:y/n }Samsung Galaxy TabPRO 8.4-Inch {B,W},  WQXGA 2560 x 1600, 359 ppi, 2.3 GHz Qualcomm Snapdragon 800 quad-core processor, 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB,  8MP Rear + 2MP Front, 331 gm, Android 4.4 Kit Kat OS, 8.62 x 5.06 x 0.28 in, microUSB, GPS yes.  4800 mAh battery (BEST RESOLUTION and ppi on a tablet!)Samsung Galaxy TabPRO 10.1 {B, W}, WQXGA  2560x1600, 298 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB,  8MP Rear + 2MP Front, 469 gm, Android 4.4 KitKat, 9.57 x 6.75 x 0.29 in, microUSB, GPS: y, 8,200mAh batterySamsung Galaxy TabPRO 12.2 {B, W}, not in USA Now,  WQXGA  2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32GB/64GB Flash, microSD upto 64 GB, 8MP Rear + 2MP Front, 732 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.31 in, microUSB, GPS: y, 9500mAh batterySamsung Galaxy NotePRO 12.2 {B, W},  WQXGA  2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32/64 GB Flash, microSD card slot up to 64GB, 8MP Rear + 2MP Front, 748 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.33 in, microUSB 3.0 port with backwards compatibility with microUSB 2.0, GPS - y, 9500mAh battery, S-Pen,  NFC, Ethernet connectivity via adapter.A broad range of popular tablets as of now are Kindle Fire HDX 8.9\", Samsung Galaxy Note 10.1\"2014 edition, iPAD Air 9.7\", Samsung Galaxy Tab 3 10.1\", Google Nexus 10\" and Samsung Galaxy Tab 3 8\". If you are planning to buy TabPRO, do look at the comparison of 3 top features you need. This will enhance your buying decision. I have included specs of these at the end if you are interested in comparing your needs.RESOLUTION:Samsung Galaxy TabPRO 8.4-Inch  is in my opinion best tablet out in the market now for the size, resolution and weight. I was a big fan of Galaxy Tab 8\" and still have one. But the 8.4 beat it in the best resolution. weight is same as an iPAD Mini.  Tabpro 8.4\" is a beauty! The resolution of WQXGA 2560 x 1600, 359 ppi is mind boggling on a tablet. The videos were very crisp and text so sharp. The new Magazine UX interface makes the screen really pop. I am able to read ebooks through Aldiko. I have so many epubs that I just imported all into a great library. Magazine interface seems completely stripped out of Flipboard. How similar they look?! You can add newer categories by squeezing the UI and adding categories.PROCESSING POWER:2.3 GHz Qualcomm Snapdragon 800 quad-core processor, 2 GB RAM, Powerful for what it does. I have played games/watched youtube videos and have seen no lag or any latencies.PRO MEANS?I really doubt if this tablet will be used by Pros. The tablet market is more centric to consumers or prosumers. This size is ideal for a home user with its resolution, size and weight. The TabPro series has free subscriptions to popular services such as Hulu Plus, Dropbox, Bloomberg Businessweek+, and Cisco WebEx Premium for varying times. It also has Hancom office suite is  an office suite developer in Korea. Hancom Office consists of Hanword, Hancell (Spreadsheet), and Hanshow (Presentation program). Since there is Google office, I don't know if this will be any sell in the US and other countries.  Remote desktoping to my Windows 7 desktop was a breeze.STORAGE:This model is for 16 GB tablets. Samsung does make 32 GB internationally, and will most likely appear in Amazon later.  Having the expandable memory to 64 GB is awesome feature. Most phones/tablets are ignoring it these days. Well, putting bunch of video/audio/books on the SD card which is so cheap these days, the tablet suddenly has more memory with no lag observed.  With prices plummeting for 64 GB cards, it is a great boon. Put all your music, books, photos on the SD card and you have a powerful computer in hand always! I personally use the 64 GB microSD card on my mobile devices. Get this mobileUltra (SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging.CAMERA:Having a tablet is a plus on smaller tablets, though I hate the feature on 10 or 12\" tablets. The resolution is 8MP Rear + 2MP Front. Video is 1080 p 60 fps. Nowadays there is nothing much to say of cameras, they just work for the required purpose.ERGONOMICS:Of all the tablets I have experienced, 8\" is the perfect size for me. This tablet at 8.4 is a little bigger which is good, and is perfect for me. I cannot keep praising the form factor. Frankly I like the default portrait orientation with capacitive buttons. At 331 gm, this is super!. The size also is ideal for single hand holding as well as reading books. (8.62 x 5.06 x 0.28 in). The battery is 4800 mAh battery and it came for easily couple of days for me at nominal usage. The best part I liked is the beautiful resolution and is the best resolution on a tablet! HD videos are crisp. I don't use a built in cover. I put it in a pouch and use the tablet naked for the best experience and for what it is designed for. The plether skin is good contrary to what many people say. The faux leather with stitched side look is not too cold. If you take a cold electronic device with metal back it is very cold. Once it heats up, it is too warm. This plastic leather look removes those issues.A comment pointed out that the ergonomics is not suitable for viewing in landscape mode. On the bigger tablets 10.1\" people complain it is not suitable for viewing in portrait mode. This could be a reason but for viewing a movie I use a stand such as  TechMatte Multi-Angle Mini Portable Stand Durable Aluminum (Silver/Dark Gray) for Apple iPad Air/Mini, iPhone 5/5s/5c, Samsung Galaxy Tab 2/Note 10.1/S4, Google Nexus 5/4 and most other Tablets, E-readers and Smartphones (with Drawstring Travel Tote/Bag...] which is great.SOUND:Excellent sound system with stereo speakers and microphone. I was able to ask questions to Google Now and get precise answers.MISC:This has USB 2.0 capability not USB 3. I tested OTG capability and it is great to have a external USB support.  USB Host is one of the most undernoticed features of Androids and is in my opinion one of the best features compared to iPad lines. What this means you get a USB Host cable also otherwise called OTG (On the Go) cables and plug in your USB thumb drive or other USB devices and the device recognizes it. I have used it with Alfa AWUS036H for a wireless project with Android PCAP Capture from reputable Kismet wireless.Having a GPS is great for immediate needs and I could get immediate lock on this tablet. Wi-Fi is 802.11 a/b/g/n/ac, dual-band. Also has infrared which cas be used for WatchON as a TV remote control. Worked straightaway on Samsung TV. This is also great for sharing your tablet with family members, multi user mode lets different users log in separately, so you each see only your own apps, backgrounds, and email.APP POWER:I tried following apps and they just worked awesome. Apps CAN BE stored in SD card. Samsung has hacked Android to do it again. A tablet is only as good as the apps you have and how productive it makes you. It's almost like the camera/lens analogy in the DSLR space. What good it is to have a great DSLR body if you have no good lens? Same with Tablet body and apps you have.WolframAlpha (I can go on for hours praising this. This is a truly genius app powered by hundreds of supercomputers in the background. Wolfram is a computational genius). Well worth the $3 price.Withings HealthMate. (another remarkable app great UI/UX). I use Pulse and the integration with it as well as Weight machine is very good.23andMe app (I love their reports)Aldiko Book Reader Premium (absolutely love it, many libraries have magazines for checkout)Amazon MobileAndroid StatusAndroid Central app (great and must have for Android users)Androidify (kids love it)Angry Birds (Space/Seasons)Asphalt Car gameBattery Monitor Widget Pro (a great app)BeyondPod (use it daily!)BoxChromeCNET TVDictionary M-W PremiumNAVIGON (from Garmin - offline maps)TOM TOM app (has some advantages over NAVIGON)Google Navigation/Earth/Maps using a portable MiFi boxGoogle Currents (nice way to read News)Google Keep/Keyboard/Drive/Search/Books/Voice/HangoutsEbayFlipboardLinkedinGoogle Music (Awesome, I have now upto 10,000 songs halfway through Google's 20K Limit)Tapatalk HD (awesome forum browsing app)OverDrive Media Console: Library eBooks & AudiobooksMicrosoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for AndroidTwit.TvSkypeRealCalc Plus (Awesome calculator app)Wolfram AlphaZillowPlenty of WidgetsAPPENDIX: Other Models to compare against if you are on the edge:Kindle Fire HDX 8.9\" model: 2560 x 1600, 339 ppi, Snapdragon 800 2.2 GHz quad-core, 2 GB RAM, 16/32/64 Flash Memory, No microSD card, 8MP rear-facing camera, front-facing 720p HD camera, 374 grams, FireOS 3.0, 9.1 x 6.2 x 0.31 inches, microUSB, GPS:no [cellular versions have GPS]Samsung Galaxy Note 10.1\" 2014 Edition: 2560x1600, 299 ppi, 1.9GHz Samsung Exynos 5420 Quad-Core Processor, 3GB RAM, 16/32 GB Flash Memory, microSD slot:yes(upto 64 GB), 8MP rear camera and 2 MP front-facing camera, 560 grams, Android 4.3 Jelly Bean OS, 9.57 x 6.75 x 0.31 inches, microUSB, GPS:yes. S-Pen (flagship),iPAD Air 9.7\" (2013): 2048 x 1536 resolution, 264 ppi, A7/M7/64 bit processor, Flash Memory: 16/32/64/128 GB, SD Card:no, 5 MP back, 1.2 MP front, 469 grams, iOS 7, 9.4 x 6.6 x 0.29 in, lightning port, GPS:no [cellular versions have GPS]Samsung Galaxy Tab 3 10.1\" model: 1280 x 800, 149 ppi, Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, Flash Memory: 16/32GB, microSD slot: yes upto 64 GB, 3.2MP rear-facing, 1.3MP front-facing, 510 grams, Android 4.2.2, 9.57 x 6.93 x 0.31 in, micoUSB port:yes, GPS:yesGoogle Nexus 10\" model: 2560 x 1600, 300 ppi, CPU: Dual-core A15, 2GB RAM, 16/32 GB, SD:no, rear:5 MP, front:1.9 MP, 603g, 10.4\" x 7\" x 0.35\", mcroUSB, GPS:yesSamsung Galaxy Tab 3 8\" model: 1280 x 800, 189 ppi, Exynos 1.5GHz dual-core processor, 1.5GB RAM, Flash memory: 16/32GB, microSD slot: yes upto 64 GB, 5MP rear-facing, 1.3MP front-facing, 309 grams, Android 4.2, 8.26 x 4.87 x 0.29 in, microUSB port:yes, GPS: yesYou should come up with three top three specs you want and should be able to nail it down with the above spec. Ask questions, the reviews cannot do full justice. I will be glad to answer any questions and usually answer within 24 hours to any query. Overall the Tabpro 8.4\" is a winner outright!", "Date": "February 19, 2014"}, {"Title": "My first 5-star tablet", "Author": "The Bee Bee \"BB\"", "ReviewID": "RX10MS1K8YKFW", "Overall": "5.0", "Content": "At various times over the years, I have owned an iPad, iPad 3, Kindle, Kindle Fire HD, Nook, Galaxy Note 10.1, Microsoft Surface, and a couple of models that were literally forgettable. At this point, I think I have a fairly refined sense of what makes a tablet great, and my bar for a five-star model is set extremely high.What makes the Samsung Galaxy Tab Pro 8.4\" my favorite--and first five-star--tablet?1) It's size. 8.4\" is the perfect size for a tablet. Given the extremely high resolution of the Galaxy Tab Pro, the fact that it's a little smaller than the \"standard\" large tablet (10\" or so) doesn't seem to make any difference in terms of reading or viewing. Where the 8.4\" form factor really shines is portability. Whereas I used to hesitate when deciding whether to carry along my iPad or Galaxy Note 10.1, the Galaxy Tab Pro 8.4\" goes everywhere with me. That kind of \"no brainer\" portability is worth a lot these days.2) The quality of the camera. I have been slow to embrace cell phone and tablet photography because the cameras that are built into these devices are generally crap, no matter what the hipsters and hype machine tells you. I have enough experience with SLRs and DSLRs to appreciate a good camera and a quality lens, and what passes for a camera in many portable devices is a far cry from what you get from a real camera and lens. Having said that, portability is still the critical factor when it comes to tablets, so having a surprisingly good camera in the Galaxy Tab Pro 8.4\" makes me very happy and expands the range of things I want to do with my tablet.3) Android 4.4. In a word, Android 4.4 (Kit Kat) is superb. It's stable, smooth, and reliable. I have access to virtually every app worth having, and I know that my device is not going to become obsolete in a few months.4) Price. Yes, I know the Galaxy Tab Pro 8.4\" costs more than competing models, but when you add up the list of features--along with some mighty nice extras like the $25 Play Store credit and the 2 years of 50Gb Dropbox service, the price seems downright competitive. Factor in the incredible build quality and the overall user experience and you have a home run. I couldn't be more pleased.", "Date": "April 16, 2014"}, {"Title": "Samsung Galaxy Tab Pro 8.4-Inch Tablet (White) (Model SM-T320)", "Author": "Dr. M \"Professor\"", "ReviewID": "RPM7H4ZIAIL4Z", "Overall": "5.0", "Content": "UPDATE 08 Jun 2014 - Added \"Internet Browsers\" review, and minor tweaks.From time to time, as I learn more about this very powerful system, I will add to my review and adjust my comments when I think it is something noteworthy or that may help your decisionMY \"TECHINESS\"I have in my house both Apple and Android mobile devices (iPad - original) , iPod - touch, mini-iPads, iDream Tablet running Android 4.0), PC's running Windows XP, Vista, and 8.1, cell phones running Android 2.3, and feature phones -- so I consider myself tech savvy.  And what I don't know, or can't figure out, my teenagers can.The Samsung Galaxy Tab Pro 8.4 is my latest acquisition and I use it for myself.  As of this update I have had it for a month, playing with constantly.PLACE IN SAMSUNG PRODUCT LINESamsung makes a variety of models, and it is often hard to tell what one model does that another does not, and which model or sub-model is the right one for you.  For Samsung, the two Galaxy Pro lines that overlap are the Tab Pro and the Note Pro.  The difference between the two is that Note has the S-pen stylus handwriting and drawing on the screen, while the Tab Pro 8.4 has no S-pen.  The Note Pro also comes in two screen size (10.1' and 12.2\"), while the Tab Pro comes in three sizes (8.4\", 10.1\", and 12.2\".)  Otherwise, they all have similar top-of-the-line specs.The Samsung Galaxy Tab Pro is at the very top of the Tab line.  The Tab, Tab 2, Tab 3, and Tab 4 are successive budget models, while the Tab Pro is the elite high-end (and expensive) version.  It comes in four flavors: WiFi only, and WiFi plus data (3G/4G), combined with either 16GB or 32GB of internal storage.  It also comes in two colors: black, or white (I guess that would make eight flavors.)COMPETITIONAs I go through the features and specs below, I think it will be increasingly clear that Samsung has targeted the Tab Pro 8.4 to one-up (or more) over the Apple mini-iPad Retina -- and at a significantly better price-point ($350+ versus $600 for a comparable Retina.)  And there are numerous comparisons available in print and on YouTube, most favoring the Tab Pro 8.4.  Just google \"Tab Pro 8.4 versus mini-iPad Retina\" to find the comparisons.CASEThe Galaxy Tab Pro 8.4 is ten percent taller, four percent narrower, and maybe a smidge thinner than the Apple mini-iPad Retina. The two are almost exactly the same weight.  The Tab Pro 8.4 has a pleasing simulated-leather back, which is very realistic in look and feel, including stitching. The mini-iPad retina has a metal back.O/S, RAM & STORAGEThe Tab Pro 8.4 runs on Android 4.4.2 (Kit Kat) which is the latest released version of Android -- seems to be a very stable and a well executed O/S.  I have yet to run into anything funny or alarming with it.  One thing I like very much about Kit Kat is that the O/S manages your memory for you -- you no longer have to worry about where things go.  And it has a massive memory/storage capability -- 2 GB RAM, plus 16 GB of fast internal storage, plus up to 64 GB external micoSDXC storage, for a whopping 80 GB of very fast combined on-board storage capability.In comparison, the Apple min-iPad Retina does not have a user-accessible external storage, so once you purchase your mini-iPad, you can't add more storage later.  Apple does offer sub-models with more internal storage, but at a greatly increased price, for example at 64GB, nearly $600.  Compare that to an 80GB Tab Pro 8.4 at $400 ($350 for the 16 GB Tab Pro + $50 for the 64GB microSDXC card.).USER GUIDEThe 175 page hyper-text user manual (available only on-line) states that some microSD cards may not be compatible, which influenced me to by a Samsung-brand 64 GB microSDXC card.  A very small-format printed Quick-Start guide comes in the package, but you can download the digital User Guide from Samsung's web site (even before you buy), which is more comprehensive.CONNECTIVITY-- WiFi & BluetoothThe Tab Pro 8.4 has the latest versions of Bluetooth (version 4.0), and WiFi (802.11 a/b/g/n/ac),.-- Infra Red BlasterInfra Red Blaster provides an all-device remote control.-- HDMIThe tab Pro 8.4 does NOT have a dedicated HDMI port, though it does support a USB to HDMI adapter, which you can purchase at many outlets, including Amazon.com.-- WiFi DirectWiFi Direct allows you to connect wirelessly with multiple devices (that also have WiFi Direct capability) and share information and files.  WiFi Direct may not be immediately useful to you, but it is a feature you would probably want in all your future devices.-- USB to PCNormally, when you connect a handheld device to a PC by USB cable, the device becomes just an external storage device to your PC (or Mac), and no other features of the device can be used while so connected.  If you do this on the Tab Pro 8.4, you will see two new storage devices on your PC:  \"Card\" and \"Tablet.\"  \"Tablet\" is the internal storage (16 GB) that comes with the device - don't mess with it.  \"Card\" is the external microSD card that you can install, and add files to from your PC. If you go about changing folder and file names you didn't add, you can screw up your device. When you are connected to a PC by USB, the Tab Pro 8.4's battery will not be charged.  So you should have the Tab Pro 8.4 fully charged before attaching it to a PC by USB cable.-- KiesSamsung Kies is software to install on your PC or Mac which enables you to connect safely using a USB cable to update firmware, synchronize files, and transfer data much faster that Bluetooth.  You can also synch with your PC's Windows Media Player (but forget synching with Apple iTunes - Apple just won't cooperate with Samsung or Google in any way.)You download Kies to your PC from Samsung's website. There may be more than one version -- You use the latest version For the Tab Pro 8.4.  After you install Kies, it will ask you to download a Samsung Kies USB driver that will increase the speed of the connection.When you use Samsung's Kies software to connect your PC by USB cable to the Tab Pro 8.4, you won't see the Internal and external storage drives.  Kies will perform firmware upgrades, and while doing so, you can't use the device for anything else.  However, if you are just transmitting folder and file, or synching, you can simultaneously use the Tab Pro 8.4 features and apps. Using Kies makes transfers safe, and it knows where to put your music, pictures, and videos. For those files and folders, Kies will give you a choice whether to store on the internal storage or external microSD card.-- OTGI don't find any information or spec from Samsung about USB OTG (On the Go), which would allow the USB port to host external devices connected by USB (such as an external USB flash drive or an external GPS antenna.)  However, some reviewers report that it does support OTG.  OTG requires a special OTG USB cable/adapter, which is available from Amazon.com and other outlets.To check it for myself I connected my USB flash drive by an OTG USB-to-microUSB cable, and I could see all the files on the flash drive, and the Tab Pro 8.4 could open the files that it had a type for, such as graphics, music, and video files, and some documents.  If it didn't know what file type the file was, it couldn't open it. So OTG (with an OTG USB cable)does work.When you are properly connected to a flash drive, you find the flash drive within the app named \"My Files.\"  Open \"My Files\" and on the left side of the screen will be a list of \"folders\" as follows:- - - Device Storage (that's your internal 16 GB or 32GB storage)- - - SD Memory Card (f you added a microSD card), and- - - USBDriveA (if your flash drive is properly attached)When you are finished with the flash drive, don't just disconnect it - first unmount the flash drive.In comparison, the Apple mini-iPad Retina has the same Bluetooth and Wifi, but not Direct WiFi.  It has USB to its proprietary Lightening connector, which is about the same size as a microUSB connector.  Apple touts its lightening connector as very high speed, but that would only be true if the PC on the other side has USB 3.0.  Leave it to Apple to be as incompatible as possible with any other standard.  The mini-iPad Retina has no IR Blaster, nor capability for additional user-furnished storage. The Apple mini-iPad Retina does not mention OTG, so I can't say whether or not it has it.PROCESSORA Snapdragon 800 2.3 GHz Quad-Core Processor (with 2GB RAM), and on-board GPU powers the Tab Pro 8.4, which is the most advanced and fastest processor used in Android devices.The mini-iPad, by contrast, uses a Apple A7 CPU, which is no slouch, but only 1 GB of RAM on board.  In throughput test comparisons, the edge goes to the Tab Pro 8.4.DISPLAYThe Tab Pro 8.4 has a 5% larger screen area than the min-iPad Retina.The Tab Pro 8.4's also has a higher pixel density -- display resolution is WQXGA (2560 x 1600 pixels) at 359 pixels per inch.  That is better than Apple's retina display (2048 x 1536 pixels) at 326 pixels per inch.The aspect ratio of the Tab Pro 8.4's screen is 16:10, which is the same as my computer monitor - so everything I see on my PC screen can be shown in even higher resolution on the Tab Pro 8.4.A 16:10 aspect ratio is nearly the same as the HDTV aspect ratio of 16:9.  Contrast that to mini-iPad's aspect ratio of 4:3, which causes HDTV content to either be truncated on the sides, or the HDTV image to be very small on the screen.Samsung's default screen settings are a little too dim for my tastes.  The Tab Pro 8.4 really shines with blazing, vivid colors at slightly higher brightness levels.  The downside to increasing the brightness level is that the screen (which is the primary culprit in battery usage) depletes the battery faster.White is the color with the highest battery drain (white requires all color pixels to be on).  So the use of white backgrounds should be eliminated or minimized.  I created a wallpaper that is just a totally black rectangle (stored as a .jpg file).  The black wallpaper allows images on the screen to stand out better, even at reduced brightness levels.  I also set my Kindle app to \"white type on black background\" for the same effect.  Finally, I created a lock-screen which has my logo on it on a black background.Clearly, the Tab Pro 8.4 is positioned to compete aggressively (both feature and price wise) with the Apple Retina mini-iPad.  Excellent, very sharp images on the display (depending on the resolution of the image itself).  This is the type of display that you only want high-definition images on.MULTI-TASKING / MULTI-VIEWINGAll Android devices can multi-task, but you can normally only view one screen at a time for any running app.  The Tab Pro 8.4 allows up to four multi-tasking apps to be displayed simultaneously, and you can pair any two so they always show up together.  This is a great feature for comparing two documents side by side, organizing files into different folders, or displaying a graphic in a separate window while browsing a document.  It is a big step that brings much of the power of the PC display to the Android Tablet.BATTERYHere the edge clearly goes to the mini-iPad Retina with a 6,470 mAh battery to the Tab Pro 8.4's 4,800 mAh battery.  That translates to roughly 10+ hours for the mini-iPad Retina versus 8 hours for the Tab Pro 8.4.  Of course, user time will vary greatly - depending on screen brightness, sound volume, and the number of apps open.  If you need more time between charges, consider purchasing a mobile battery extender, and/or invest in a car charger.BATTERY CHARGER (wall mount)The supplied Samsung USB Battery charger is rated at 2 amps, which is designed to rapidly recharge the device.  Don't use any battery charger with less than a 2-amp capacity (which would include most cell phone charges) - they won't charge rapidly, if at all.The same goes for the included Samsung USB cable - it is designed to handle a 2-amp load on recharging.  Other USB cables may not be able to handle a 2-amp current.ERGONOMICSThe Tab Pro 8.4 is (in my humble opinion) the perfect size for a handheld mobile device.  Any bigger display/device, and you would have trouble holding it with one hand.  Any smaller and you would be sacrificing clarity and resolution.The Tab Pro 8.4 has a higher aspect ratio (16:10 to mini-iPad's 4:3), which is easier to hold in one hand.  And the higher aspect ratio of the Tab Pro 8.4 is better for watching HD movies and video content.That this size tablet is the new norm is testified by the fact that my wife and daughters have pretty much abandoned their larger iPad and smaller iPods for the mini-iPad.  And I have pretty much done the same for Android devices.  While my wife and daughters are designer brand afficionado snobs, and will probably always choose Apple over Android, they were impressed by the Samsung Tab Pro 8.4's display.CAMERATwo Cameras -- 8MP Rear + 2MP Front.  That is better than the mini-iPad Retina's cameras (5MP rear + 1.2MP front.)  Not the highest resolution for professional photographers, but very good for the price range, and excellent for the amateur.  The higher camera resolution allows a wider utility for the digital zoom without undue pixalation.  And the Tab Pro 8.4's rear camera has flash, which the mini-iPad Retina doesn't.  Both have auto-focus.  Neither have an optical zoom.GPSThe Tab Pro 8.4 has a fully functional on-board GPS.  And it is fully compatible with Google Maps and Google Earth.  The Apple mini-iPad Retina does not have GPS.SOUNDThe Tab Pro 8.4 has stereo speakers on the bottom (same as the min-iPad Retina.)  Surprisingly good sound comes out these tiny speakers - no deep bass, but good enough to listen to movies and music without earphones.  Put on some HiFi earphones for the best sound, or plug into some quality big speakers with a woofer for that big bass component.MUSIC PLAYERAt first glance, the included Samsung music player (simply labled \"Music\") appears to be just a plain, simple, featureless music player.  But it is actually a very understated, but feature rich, player.  I mention it here because it would be all too easy to prematurely dismiss it.You access the features from the Music screen by tapping on the small \"Options\" icon (three vertical dots) in the upper right corner of the screen, and then tap \"Settings,\" and then \"Player.\"  It would have been better (and much more noticeable and convenient) to have these in tabbed folders directly from the player screen, but it is what it is.The options under \"Settings > Player\" are:- - Sound AliveThis is a multi-feature that has \"Basic\" and \"Advanced\" tabs.Under the \"Basic\" tab is a graphic square layout that allows you to choose a setting between \"Instrument\" and \"Vocal\" (Karaoke effect) in five levels on the horizontal; scale, and simultaneously a setting between \"Treble\" and Bass\" in five levels on the vertical scale.  Some of the setting possibilities are labeled, such as: Classic, Normal, Pop, Rock, and Jazz.Under the \"Advanced\" tab is a seven-band equalizer, and three special effects choices for \"3D,\" \"Bass,\" and \"Clarity.\"Available under either \"Basic\" or \"Advanced\" is a \"Tube Amp Effect\" that puts a little reverb in the sound.  The \"Tube Amp Effect\" is only available with the earphones plugged in.-- Adapt SoundIt is either on or off.  I'm not sure what it does, but it only works with the earphones plugged in.- - Play SpeedYou can slow the music down, or speed it up -- by quite a bit - using a bar scale.- - Music Auto Off.Turns the Music player off after a time interval you choose.- - LyricsProvides song lyrics.  It is an on/off switch, and I presume you have to be subscribed to Google Music, or some lyrics service, to use it.- - Smart VolumeIt is an on/off switch that adjusts the sound level of all music tracks to level 13.The options under \"Setting\" > \"My Music\" are:- - TabsTabs allow you to choose which attributes you want to be able to sort your music by (Playlists, Tracks, Albums, Artists, Folders, Genres.)  \"Playlist\" and \"Tracks\" are mandatory defaults.  In addition, when you sort, you can choose to sort by where your music is stored (Bluetooth folder, Music (internal storage), external SD card.)- - PlaylistsThese are the default playlist choices (Favorites, Most Played, Recently Played, Recently Added) plus any playlists you created (in another screen.)Other Music options directly on the music player are music \"Shuffle,\" and \"Repeat.\"  \"Repeat\" has the following settings: play all, repeat all continuously, and repeat once.BUILT-IN APPS & APP MARKETSBoth of these devices have a slew of apps to choose from, running in the hundreds of thousands.  The edge in apps probably goes to the Apple mini-iPad Retina because any app for Apple usually runs across all of its product lines, regardless of O/S version.Android apps tend to be more device and O/S specific - many apps created for older Android versions, or a specific manufacturer, or made for cell phones, won't work on the Tab Pro 8.4.  Google Play Store will advise you if you try to buy or install an app that is not compatible with your Android device.  And it asks you to report apps (with a single tap) that stop working, so it can prevent future downloads until the app is fixed.The Samsung Apps store (tap the \"Samsung App\" icon) should be your first resort to look for Apps.  Samsung has produced a line of apps specifically for its Galaxy lines, and new apps are being added all the time.  Samsung is serious about bettering Apple in every way, including apps, many of which are not available on Google Play.  And some apps originally designed for the Galaxy Note also work on the Tab Pro, and are free.- - SAMSUNGThe included Samsung apps for the Tab Pro 8.4 are in a folder named \"Samsung\" while the Samsung App Store icon is named \"Samsung Apps.\"  That is a little confusing, so I thought I would mention it, because the \"Samsung\" folder icon looks just like an app icon rather than a folder.  When you tap on the \"Samsung\" icon, a window opens up with the included apps displayed (Alarm, Calculator, Downloads, Help, KNOX, S Voice, Side Sync, World Clock.)- - KNOXThink of Knox as in Fort Knox - a place of high security.  Knox is the secure (encrypted) part of your Tab Pro 8.4 - password protected.  When you tap on the Knox icon, it prompts you to create a password and creates a secure folder for all your Knox-secured applications and files.  It then opens a table of secure (KNOX) versions of applications, some of which are free, and some you might have to pay for.In addition to the included apps, Samsung includes a $25 voucher for your choice of apps to purchase (from the Samsung App Store, not Google Play.)  Some very powerful business apps in the Samsung store may be free, such as the Hancom Office set (HOffice, Hword, Hcell, Hshow, etc.) which will give you all the power to read, modify, and create Microsoft Office compatible documents.INTERNET BROWSERSTwo internet browsers are included.  Both are mobile versions, and both will look for a mobile version of the website you are visiting, but both will also provide full internet browsing.- - Google Chrome Mobile, just labeled \"Chrome,\" will synch itself with your Google account (if you are signed in.)  And if you have tabs pinned on your PC version of Chrome, they will also be pinned in the mobile version.  What you won't get with the mobile version are the apps and extensions that your PC version of Chrome can have.  But word is out that Google is working on adding the apps and extensions to the mobile version, with a target release of late 2014.  Chrome will allow you to zoom in and out on the web page.- - Samsung mobile browser, just labeled \"Internet,\" has a different tactic - you set the \"small\" print at the level most easily read by your eyes, and the content is sized accordingly.  You can still zoom in and out on the web page.  I had my doubts about this small print-setting tactic, but after using it, I rather like it.CONCLUSIONIt may be debatable exactly what the best hand-held thing on the market is now, but the Samsung Galaxy Tab Pro 8.4 is right up there at the top - feature wise, and price-point.RECOMMENDATIONI, as a rational engineer, would pick the clearly superior Samsung Tab Pro 8.4 over the Apple Mini-iPad Retina. I bought one for myself.  And my wife said she was going to upgrade to the Tab Pro 8.4 and abandon her Apple mini-iPad.And I would definitely recommend the Tab Pro 8.4 to my friends.", "Date": "May 16, 2014"}, {"Title": "Best tablet I've seen", "Author": "Van E. Hodges", "ReviewID": "REQOKCH0LKMTW", "Overall": "5.0", "Content": "I'm an apple product lover but don't really care for the iPad so I decided to try the galaxy tab pro because I've loved my Galaxy S3 phone. In my opinion this tablet is more than superior to the iPad. The new magazine ui is really cool and love having easy access to all kinds of news stories.  Highly customizable and not short on features.  I've been using it for almost a week without any hiccups what so ever. It's been able to handle everything I've wanted.  Videos look amazing and the processor is super fast.  Highly recommend buying this tablet. The 8.4\" is the perfect size for holding and watching videos while still being able to be productive.Update: March 6thAfter using it for a few weeks I've loved being able to multi task with 2 apps at the same time.  There are a limited number of apps you are able to pick from, for example you can't use Netflix with another app but you can use video player with another app. There are about 20 to 25 apps you can use together on the same screen.  Each app can be sized as you wish on the screen and work in both landscape and portrait modes.  If someone finds a way to use other apps then let me know but it seems you are limited to what can be used.  I did install podcast addict and it let me add this app to the side bar for use with this feature. But haven't seen a way to add Netflix or Hulu with out going through the Web browser.Additionally,  the file management on Android is far superior than Apple. I use my tablet for graduate school and I have friends using iPad who can't do simple talks like downloading a word document without using third party apps. Additionally,  having the ability to edit documents with Google Quick office and editing PDFs with Adobe Reader is awesome.", "Date": "February 19, 2014"}, {"Title": "After the update, it's perfect", "Author": "L", "ReviewID": "R18VWJ9D1Z57LL", "Overall": "5.0", "Content": "I upgraded from an Asus transformer Infinity 10.1. I also had a Nexus 7\" 2012 (too small for me). I bought this to see if I could consolidate both sizes into one that would be big enough, but still portable.  I think the 8.4\" does a fine job at this, but I wouldn't say that if the screen resolution was subpar. Samsung's screen is top notch and makes even the smallest text readable.So for me 8.4 is doable, but only if the screen is high end, which the Samsung's is.It's also noticeably faster in general and especially in loading web pages than both my prior tablets.  This is another thing I wanted in my next tablet, and I'm satisfied with the speed.I also like the included IR blaster for controlling my TV. It has become an integral part of my couch potato command center :) No need to take my hands off my tablet to reach for the remote anymore!There is one problem though that knocks a star off for me. As also mentioned by one other reviewer here, the screen is overly sensitive at times. When I try to scroll a webpage in my browser or a pdf document in Mantano reader it will zoom in or out instead. So it's interpreting my scroll movement as a double tap. Scrolling through youtube videos will sometimes result in it playing one when I didn't select it, so it's interpreting my scrolling motion as a tap.Of course this happened on my Asus and Nexus too, but no where near as often as on the Samsung. I bought a stylus, the amPen 3 in 1 Hybrid, thinking it might help, but it is actually worse than my finger. It also skips when trying to write with it. Same with an old Griffin rubber tipped stylus I had. The amPen stylus works perfectly on my old Asus transformer though, better than a finger.I've spent hours trying to come up with a solution to this, and I did find a few things that help. First I noticed that it doesn't happen very often if I use my ring finger to navigate my tablet. My index finger and middle finger are the problem. I examined my fingers to see what could be different and came to the conclusion that my ring finger is smoother/softer than the other too. So I got out some very find sandpaper and sanded my fingertips. That seemed to help.I also did a google search on adjusting touch screen sensitivity. One hint which seems to make a big difference is to adjust the press and hold delay. Go to settings, device, accessibility, press and hold delay. The default is 0.5 seconds. I changed it to 1.0 seconds.The third thing is to clear RAM in the task manager. I notice when I first power up the tablet everything works fine, even the stylus works beautifully and scrolls and writes like a dream. After 10 minutes or so of use though it stops working. Clearing RAM can usually get it working again temporarily.So I think something is loading that affects the screen. I haven't loaded any apps that aren't also on my Asus and as I said, the stylus works fine on the Asus. So I think it's either some Samsung bloatware running in the background or 4.4 Kitkat. Asus hasn't upgraded to Kitkat yet.So if a guy has to sand his fingertips to get his tablet to work and can't use a stylus that works fine on an older tablet then the tablet probably doesn't rate 5 stars. I like the Samsung. I've got it to work with my fingers, but it's not perfect, so I'm giving it a 4.UPDATE 3/17/14:Reviewer Joe C gave some tips on how to improve lag for the Samsung Galaxy Note 10.1 2014 edition tablet. Here they are\"LAG ISSUES CAN BE IMPROVED, READ HERE:Turn on developer options by tapping \"build number\" found in the \"about\" section within options 7 times. Once developer options are turned on, scroll down to window animation transition animation, animator duration and turn each one off. You will notice no more lag for scrolling and exiting apps.To solve the home button issue where there is lag, go to S voice. Once in S voice, hit the menu button which is located left of the home button. Choose the option to \"not initiate S voice by double tapping the home button\". You will notice considerable changes in speed of the home button to wake up the screen, however it won't be snappy until there is an update.In addition, the more apps you have on your device, the more cache data your device will accumulate. Just like your web browser, you should remove your app cache data once a day or every few days to save up space. I suggest AVG memory and cache cleaner, or clean master. Also I highly suggest you install an anti-virus software like AVG on your Note 10.1 2014.\"I did the developer options tips on my Tab Pro 8.4\" and also set my browser to delete cache on exit (I use NB browser pro). These tips helped remove most of the stutter I sometimes see when scrolling webpages. It also helps with the stylus problems I've been having.Turning on developer options comes with the risk that your tablet might not work right in some cases, but I haven't noticed anything bad with changing the above settings.Update: 3/19/14:Installed Clean Master to manage my RAM and cache and I think it made a noticeable improvement in my screen issues. CM also deletes junk files. I had uninstalled a mail app the regular way through the tablet's settings menu. CM found additional files that Samsung's uninstaller left behind and deleted them for me. If you install and uninstall lots of apps, over time you'll probably accumulate a fair number of junk files. CM says it can find most of these. Here's a link to it on Amazon. Clean Master It's also on Google's Play Store. Note: Be mindful of what you are doing. CM will delete your photos, videos, etc too, if you tell it too. It doesn't do this by default, and it takes extra steps to do so, but you do need to pay attention.Also, if you are having touch screen sensitivity issues there is a thread discussing it on XDA Developers you might want to read. You can find it by searching forGalaxy Tab Pro 8.4 screen sensitivity - xda-developersUpdate: 5/13/14My tablet received an update a couple days ago, which seems to have resolved the screen sensitivity. I haven't noticed any of the prior issues with sensitivity since the update. The stylus now works well and I prefer it over using my finger. So I've changed my rating from 4 to 5 stars. If you like this screen size it will be hard to find a better tablet than this one at this time.", "Date": "March 10, 2014"}, {"Title": "Awesome (upgraded from 2013 Nexus 7)", "Author": "Amazon Customer \"Tim\"", "ReviewID": "R2A7CTJOO22ACD", "Overall": "4.0", "Content": "Coming from a 2013 Nexus 7, this this is faster and better at every turn. That can be attributed to the Snapdragon 800 vs the S4 pro. Although the Nexus 7 is no slouch in performance. I really like the 8.4\" screen size and it's why I upgraded it in the first place. I found the Nexus 7 to be just a bit too small for web browsing. The extra screen real estate really makes a difference but the tablet itself is still very small and portable. And the screen resolution is absolutely the best I've seen on ANY device, hands down.It's also extremely thin and light. I'd be hard pressed to tell the difference in weight vs the Nexus 7. Seems thinner too. I assume since there's more space for the internals. The way it's shaped makes it easier to hold one handed, even though it's larger.The addition of an SD card slot is also a nice feature, since 16GB will be eaten up very quickly with Samsung's Touchwiz UI  (some call it bloat, I actually prefer it) and my apps. I am all set up with a good amount of apps and have 7.8GB left. That's enough for one or so HD movie rental, which is enough for me. I'll use the SD card for spotify if I need it. But I stream everything from a tablet. no need for storage unless I'm on a plane without wifi...and those days are coming to an end as well.The only thing I don't really like is the magazine launcher. I prefer the Google launcher with Google Now on the left page. There's no way to disable the magazine pages, so I just don't swipe left on my homescreen. You can also install 3rd party launchers (I like Apex) which solves the issue as well.Price seems fair. Although $350 would have been OK with me. I would have sacrificed the SD card slot for this price. -1 star for that. $400 puts it in iPad mini competition. And I prefer Android so that's an easy decision.Some people dislike Samsung Touchwiz UI. I actually prefer it and find it useful, aside from the Magazine launcher as noted above.Battery life seems to be on par with reviews and what my Nexus 7 got with daily use. I've been on it quite a bit. Wifi is always on and the screen is usually set to around 25% brightness (it's a crazy bright screen). 7-8 hours screen on time seems to be average. It's not seeing my charger until bed time, if at all.It was between this and the LG G Pad 8.3 for me. The LG has a snapdragon 600 (vs this one's 800) and the screen on the LG wasn't good for me at all when I tested it. I had to turn it up to 90-100% to get good brightness and even that seemed dim. The resolution was a lot lower as well. For $250 it seemed like a good value, but this tablet definitely is more premium at every turn, which you obviously pay for.", "Date": "February 21, 2014"}, {"Title": "4 Hundred Dollars !! It Better Be Pro LoL !!", "Author": "Weikuang Wong", "ReviewID": "R1FMQ7KB34K9LU", "Overall": "5.0", "Content": "I read the reviews before buying this tablet. There are a lot of positive and negative reviews so it was kind of hard to tell if this was worth 4 hundred dollars. If you are reading this review, most likely you are also wondering if this is worth the money. I am writing this review to give people a quick list of things I liked and didn't like about this product. Maybe this review can help you decide if the Tab Pro 8.4 is right for you.There are 7 things I didn't like about the Tab Pro but I don't think these things are really that bad...-- The tablet lags a little once in awhile but it's really not a big deal and most people will not notice it.-- Even with really low settings the battery will last only 4 to 5 hours if you are watching YouTube videos nonstop.-- The magazine layout cannot be turned off.  Some people like the look of it but I really don't...-- 16 gigs really equals about 11 gigs for you to use. System software take up a lot of space.-- Even though the tablet has a high resolution screen, some icons for apps still have low resolution and are not very detailed.-- The tablet is good for reading books but not great... That's just my opinion. Other people will disagree...-- The price is FOUR HUNDRED DOLLARS !!!!!  For some people that's cheap and would list this as a positive LoLThere are 7 really good things about the Tab Pro.-- The tablet has a high resolution screen that everyone is talking about-- The tablet allows you to use a mini SD card. It would be great if the ipad mini had that too...-- The tablet has 10 hours of battery life when you turn most of the settings off and the brightness low/medium.-- The battery will last 6.5 to 10 hours if you are using FaceBook nonstop and with low/medium settings.-- The battery will last around 10 hours if you are using Pandora nonstop and with low/medium settings.-- The free games don't have a lot of adds like they do on the ipad...-- Angry Birds still works on this tablet :-)I think nothing is perfect so even with a few negative things, I would still give this 5 stars and recommend this product. This isn't for everyone. Some people like Android and some people like Apple IOS. I personally like them both. In my opinion, If you want a tablet to read books buy the ipad mini with retina display. If you want a tablet for games, movies, and widgets, buy the Tab Pro 8.4I hope this review is helpful to anyone reading this review. If anything in this review is false please let me know so I can make a quick update", "Date": "February 28, 2014"}, {"Title": "Close to just right, but not quite.", "Author": "gauchotodd", "ReviewID": "R3I3JYECCBFLRT", "Overall": "4.0", "Content": "Although I have several years of professional experience using a wide variety of tablets and other consumer mobile devices, this is the first tablet that appeared enticing enough for me to spend my own hard-earned money. I've had this tablet for four days now, which is plenty of time for me to get a good feel for it, given how much I've used it during this time. Please keep in mind while reading this that I am very picky with what I am looking for in this sort of device (which is part of why it took me so long to pull the trigger), and am very perceptive to imperfections, for lack of a better word. I can already tell I'll have a bit of a love-hate relationship with this Tab Pro 8.4, which may ultimately make me replace it with a similar next-generation device sooner than I had desired while considering it. I won't go through all the specs since you can do that yourself, I'll just offer my take on it in hopes that it will help somebody else with their own well-informed decision on making or not making their own purchase.The screen, as is the consensus, is absolutely gorgeous; my lock screen background is the included espresso photo, and it looks real. I mean, it really looks real. The bubbles in the espresso are lifelike enough that it actually looks like there is a two-dimensional latte on my desk. I have really great (20/10) eyesight, too, so it's not a matter of it just having more pixels than the average person would notice. I'm skeptical that cramming 4K resolution into a display this size would make any perceptible difference, even to myself. The backlight is plenty bright, so I generally keep it under 20% brightness unless I'm viewing photos or videos.The form factor is great overall - the display size, in my opinion, is perfect, which is one of the main reasons I bought it. To give a better idea of how its size compares to me, I have slightly larger hands than average - I can palm a basketball, but just barely. The bezels are a bit wider than I would prefer (considering if it were custom designed for me, which of course, it's not), but they're not bad like virtually all tablets used to be. Ideally, I would like to see a tablet this size with bezels about half the size that they are, on all four sides. I really wouldn't expect this to cause any issues with incidental gestures while holding it. It's nice and thin proportional to its length and width, but this too I'd like to see eventually trimmed down as well. I know we're already getting close to the limits of still being able to include things like a 3.5mm headphone jack and a microSD slot, but I'm sure there's still a little more room for improvement before having to change these standards to even smaller or wireless means.It feels nice and durable, but just a touch more dense than I'd like. The glass on front seems nice and tough, scratch and shatter-resistant, and the weight is totally acceptable, but not quite up to the same \"wow, that's so light for how big it is\" standard as the iPad Air, for instance. The only thing I'm not really a fan of with the build quality is the faux leather on the back, not because it doesn't look or feel good, but because it is just too damn slippery. If my hands or fingers are even the tiniest bit damp or sweaty, it becomes a noticeable hassle to hold on to because it will slide between my fingers or down my palm. Not that one should be holding it all the time with wet hands, but it's really touchy in this regard. The glass on front I can totally understand, and again I'm not knocking Samsung's decision on the faux leather; at the very least, it should've had more texture for a better grip.I'm always on top of keeping all of my devices' batteries charged, but this may be the first device that I won't stress over recharging every night. I'm sure sometimes I'll go through the battery in less than a day, but in general I think most people would be fine charging it every other day. The speakers and cameras are fine, not mind-blowing by any means, but not terrible like these devices used to be. Completely acceptable for every day casual use. I do agree with other users that it would have been preferable to have one speaker on the other side for viewing videos in landscape orientation.The speed of the tablet is what disappoints me most. There is so much lag on this device with pretty much anything I do to it that I'm wondering if I happened to get a bad one. I know the processor is plenty powerful enough to handle even the Touchwiz UI that Samsung loads onto it, but it's just not as quick and fluid as I had hoped. Yes, it's far and away faster than most things out there up to this point, but my S4 with CM flies circles around this thing (no, I haven't overclocked it or anything, they're both running stock hardware). I see slight delays with pretty much anything I do to it, even just scrolling between home screens or the app drawer. One of the worst cases is moving from a home screen page to the Samsung Magazine page - there's a solid second delay. Am I being a whiny, spoiled brat complaining about this minor inconvenience? Sure am. Is it warranted given market expectations and its price point? Absolutely.I'll reiterate here that I'm being particularly harsh with my analysis, and I think it would be unlikely for most consumers to have a less positive experience than mine. It really is a fantastic device, and I expect it will be the one I turn to for most activities, over my phone, laptop, and desktop (all of which are wonderful in every regard and less than a year old). I'm going to give it some time to see how it fares as a laptop replacement for most daily activities, and I expect it will step up to the job just fine. But it's not perfect. I suppose there will always be room for improvement, and I would give it a 4.5 out of 5, or a 9 out of 10 rating if the option were there, but I just can't quite convince myself to give it the highest score. I'll update as necessary, and please feel free to send any questions or comments you may have about my opinion and I'll happily answer for you!", "Date": "March 16, 2014"}, {"Title": "Excellent Tablet", "Author": "derek duncan", "ReviewID": "R6RCBL1I10TJO", "Overall": "5.0", "Content": "I picked up the Tab Pro on Thursday. Let me just say, the display on this thing is far and away the best display I have seen on any device I've ever used, included the iPad Retina's!Not only is the resolution very high, but since the tablet is 8.4\", the PPI is very dense as well. I'm not sure the exact number, but it's the best I've seen.The speakers are also surprisingly terrific. They are loud and clarity is good.I really enjoy the extra features on the tablet like the Multi-Window mode where you can view two apps on the screen at the same time. Small apps like the Calendar app and Email app are very good as well.I am happy that Samsung finally ditched the menu button on this tablet. It now adheres to more of the Android guidelines, although still have physical keys instead of on-screen keys. That's ok though, I think people have grown to like the physical home button.I don't use Samsung Voice or some of the other Samsung apps, but it has the full Google Play services which includes the terrific Google Now experience. The apps on the Play Store rival and in many cases, surpass those on the Apple App Store.The only thing average on this tablet is the price. At $399, you can get a great little 7-inch tablet, the Nexus 7, for only $229. However, I feel that the 8-inch form factor is perfect, and the resolution on this Tab Pro 8.4 is nothing short of breathtaking.What a great tablet.", "Date": "February 19, 2014"}, {"Title": "Galaxy Tab Pro 8.4", "Author": "Frank_F", "ReviewID": "R11MNUOMLVGWVL", "Overall": "4.0", "Content": "Pros:ScreenSize/Weight - I'm a fan of the ~8 inch form factor.Touch Wiz - I like touch wiz (Samsung’s addition to Android front-end)No MyMagazine Nuisance (as in the note 3)Built-In Keyboard AppIR blaster included (Infrared Remote control). I won't use that much, but it can be fun at a bar/rest.Cons:No HDMI out - :(No USB 3.0 -Side bezels are thin - a little too thin. My palm gets into the screen sometimes.Speaker Placement - I tend to cover the speakers when watching videos. The Note 10.1 (first gen) has front speakers that work well but make the tablet too wide)I read the reviews and I knew what I was buying. I have used several smart phones and tablets, so I basically know what I like.This is a business oriented tablet pertaining to the built-in apps selection. Still good for personal use. Disable/uninstall any apps that you don't use. Some built in MSOffice-compatible apps called Hancom. Word/Excel/PowerPoint readers come pre-installed. The editing apps can be installed via download for free - Nice.Only disappointments at the price point are the lack of HDMI and USB3.0. I like the 3.0 connector. Seems more solid. Samsung used it on the Note 3, I'm not sure why they chose not to use it here.16gb of storage - eh. Add a Micro SD. I personally have a few laying around, so I grabbed at 32gb and that works for me.Android 4.4.2 with Samsung's add-ons. Snappy and so far stable.I like the built-in keyboard (software) that Samsung chose to include. It has 3 modes: Normal, Floating and Split. The Keyboard includes a ctrl key that can be used for Ctrl-C and Crtl V (copy and paste). It also includes horizontal directional arrows to move the cursor back and forth, DEL key, a perm Number row, and operates like swype. I find these keyboard features very handy.", "Date": "March 20, 2014"}, {"Title": "I am now a true believer of the 8.4\" form factor.", "Author": "Sam Malave", "ReviewID": "RIP1S6AS53TUT", "Overall": "5.0", "Content": "After using intensively this tablet for over a week, I can definitely say that I am a true believer of the 8.4\" form factor.I can't stress enough the difference it makes to have a tablet big enough to fully enjoy any kind of content (movies, games, reading, web browsing) and small enough to be able to hold it with one hand. Having your other hand free to control the tablet comfortably is something that many people overlook and it makes such a big difference when you use it for long periods of time. It is also worth mentioning that the tablet is extremely thin and lightweight. It is very easy and comfortable to carry around.I am impressed with the multi-tasking capabilities of the tablet. Being able to have 2 apps on the screen at the same time increases your productivity and enjoyment of the tablet. You can either have 2 apps on the screen at the same time (full screen) or have 3 apps open as the same time as \"windows\". This is the closest you can get to having a full laptop/desktop experience on a tablet. And even when having 3 apps showing on the screen at the same time, the tab pro doesn't even break a sweat.The Galaxy Tab Pro is snappy, fast, and runs anything I throw at it. The 8.4\" version has a faster processor than its bigger brothers, which may or not make a difference for the average user. But if you want to have the best of the best, this is something that you may want to do a little research before making a final decision.All in all I am very impressed and happy with my purchase. I may update this review down the road. I hope it helps anyone that is looking for their perfect tablet.", "Date": "April 11, 2014"}, {"Title": "Beautiful Screen but with some some significant gotcha's", "Author": "Patrick \"Patrick\"", "ReviewID": "RGK3Q1ME6JSZ", "Overall": "2.0", "Content": "I loved the great display which was offset by how clumsy it was to hold.  Since it's almost the same size as the Galaxy Tab 3 8.0 which we also own, I was surprised.  I think it was poor weight distribution.  When rotating from landscape to portrait or the reverse, it was noticably slower to respond than the GT 3 8.0.  Perhaps there's a price to pay for that high-resolution.  Interestingly, Samsung would not honor the perks offers that came with the purchase.  They weren't that important to me but it was a good indication of the kind of support you can expect.However, the real killer is the reduced support for the external micro-SD card.  You can put files on it with your PC but it's very difficult to do it within Android 4.4.  Google, not Samsung, has disabled most access to the micro-SD card in order to make their programming job easier at the expense of we consumers.  The result was that apps which work on Android 4.2 will not work on 4.4.  We plan to use Open Source Maps on a trip to Europe.  Wi-Fi is not required because they are stored locally.  However they require so much space we can't put them on the internal storage.  While OSM has a simple way to store the data on the external card, Android 4.4 will not let it work that way.  A vast disappointment.  I returned the tablet.  Consider the Galaxy Tab 3 8.0 instead.  It has lower resolution (which you won't notice so much unless side-by-side), similar performance(!), better handling and a far better version of Android.  The GT3 8.0 is about $75 cheaper than the 8.4 Pro depending on what kind of deal you can get.  Amazon was great (of course!) about the return.", "Date": "March 11, 2014"}, {"Title": "Finally found my sweet spot...", "Author": "Taylor", "ReviewID": "R10CWGO60AWJCY", "Overall": "4.0", "Content": "As an owner of the Galaxy Note 10.1 (2012 Edition), I was immediately blown away by the Tab Pro's gorgeous display. It makes the Note's text/pictures look all fuzzy!This tablet meets all of my current needs. I mainly browse the web, watch anime, read manga, play visual novels, and listen to music on it. I'm so happy that it can play 10-bit h.264 MKV videos, which was not possible on the Note. The multi-window feature has also improved, though its app selection is still limited without rooting. The Hancom Office app is great since it is compatible with Microsoft Office. It's not as colorful as Kingsoft Office, but I like it for the simplicity. It will come in handy when I return to college. Lastly, I absolutely love the default on-screen Samsung keyboard. I can type very quickly and accurately with it using the Swype function.I can't believe how much lighter this feels compared to the Galaxy Note 10.1. Despite that I have small hands, it is very comfortable to hold with one hand. It's small enough to take just about everywhere (it always goes with me to the gym). The texture of the back, however, is a little slippery. I'm waiting for a case that will provide good protection and a better grip.I was initially attracted to this tablet because of the new Magazine UX interface. However, I was disappointed to find that it lags when swiping between screens, and I could not customize the news to the extent that I wanted. I installed the Apex Launcher as a workaround solution to not using/seeing Magazine UX. I ended up preferring the Taptu app for my news because that can be customized much more. Other than that, the tablet runs smoothly and launches applications quickly. I have not experienced lag in any other areas.The design isn't perfect. Sometimes, I accidentally hit the capacitive buttons while holding the tablet in landscape mode. The placement of the speakers is only located on one side of the tablet and can easily get covered up by hands. I much prefer the speakers on my Galaxy Note 10.1. However, I usually use headphones, so it's not a big deal to me.The 16GB storage works fine for me. Actually, you start with about 10GB. I don't install a lot of apps or play games, so I'm not worried about  the limited space. I plan to get a Micro SD Card to store videos anyway, so it's all good. However, the RAM does get eaten up fairly quickly. Half of it is already used up from running apps and services when I turn my tablet on for the first time.Battery life is decent. It discharges at the same rate as my Galaxy Note 10.1, which is about 10% per hour after turning the brightness waaaay down, using power saving mode, disabling GPS and Bluetooth, and mainly listening to music/browsing web. I was hoping that it would last longer, but I'm not complaining. On the flip side, the battery charges VERY fast. It only took about 2 hours to get a full charge from 20%, which is twice as fast as the Galaxy Note's charging rate.Overall, this is one fantastic tablet where the pros outweigh the cons for me. It won't be for everyone, but who can deny that beautiful screen? I don't even miss the S-Pen. The 8.4-inch size is my \"sweet spot,\" which is why I chose this over the Galaxy Note 10.1 (2014 Edition).", "Date": "February 27, 2014"}, {"Title": "Clearly the best 8 inch tablet, worth the price premium", "Author": "Snowfall86", "ReviewID": "RBUA5C2XZFY6F", "Overall": "5.0", "Content": "After returning 2 defective Nexus 7's, I decided to take a look at the LG G Pad 8.3 and this Galaxy Pro 8.4. You really should get to a store and play with each before trying. The Galaxy Pro 8.4 is far and away the higher quality device...but it will cost you. It's about $70 more than the LG G Pad, but in my opinion it's worth it. This is not a \"budget\" once a year device. It is future-proofed to own for at least 2 years, with the fastest processors on the market and Android KitKat.PROS- Remember how it used to be fun to open a new computer? Samsung makes you feel good about your purchase - as of April 2014 they throw in $25 of Google Play credit, 2 years of 50GB Dropbox space, 3 months of SiriusXM App and Hulu, 2 years of remote desktop access, 1 year of in flight Wi-Fi...you get the picture. It's nice to be rewarded with a little more than a device and USB cable. Samsung is one of the top players in tablets, and you can tell companies want you to devote screen space to them.- Top tier specs. You will not find a better spec sheet on a tablet for the rest of 2014, unless you REALLY want wireless charging.- Premium feel. The biggest knock on design of previous Galaxy devices is the cheap, plastic-y feel. That's completely changed with the leather back. You don't have to use a case for this, since the back is the kind of material that won't scratch if you leave it on a table.- Obviously, the display. But you have to see it in person to believe. PPI's or brightness stats don't do it justice. Just look at it next to the iPad Mini Retina or G Pad...the Galaxy Pro wins easily.- 2MP front facing camera is a step up from most tablets for video callsCONS- As a Nexus 5 owner, the TouchWiz UI is annoying. It's not terrible (except for that keyboard, yuck! download Google Keyboard and use that), there are some decent features added, but would prefer the option of going stock.- Left side can get a little warm if you are using heavily for a while. I have read the internal temperature of the device is similar to other tablets, however the material on the back does not contain heat very well.So while the Galaxy Pro is about $70 more than most Android tablets in this size range, I believe the perks and quality of the tablet make it worth the extra cost.", "Date": "April 7, 2014"}, {"Title": "great for small business", "Author": "C. Carson \"Loulee&Ellie;\"", "ReviewID": "R2Q4Y33WST25CP", "Overall": "5.0", "Content": "I am a small restaurant owner and this tablet fits my needs perfectly.  I use it to place my foodservice orders,  I can update my excel files and print from my tablet easily every day.  I am finding it much easier to carry around than my laptop.  I have used an ipad, and my laptop is a Mac, but I prefer android when it comes to tablets.  If you need a smaller tablet with programs that allow you to edit office documents, I definitely recommend this one.  It is a very nice tablet that you can use for more than just entertainment and that is exactly what I was looking for at a very reasonable price.", "Date": "February 28, 2014"}, {"Title": "Wonderful tablet", "Author": "H.", "ReviewID": "RA26ZNF94EZMR", "Overall": "5.0", "Content": "I've been looking at this tablet since it came out, reading personal and professional reviews. Two things were really preventing me from buying it, the price and the battery life.  It seemed that comparable tablets are priced the same or higher, but the battery life is better on the some of the other tablets.  I was also reading that Google is rumored to be releasing a new Nexus tab in July, so I really debated waiting, but when Amazon reduced the price by $30 dollars and I decided to take the plunge.I've had it less than a week at this point, but I'm pretty happy with my decision to go ahead and buy it.  This was an upgrade from the ASUS HD Memo pad 7, which was my first tablet.  I was happy with that one but I wanted something a little faster, and better all around, and the Pro seems to be just what I wanted, I also wanted something a little more portable than my aging laptop for when I travel.Its nice and fast, set up was relatively easy once I remembered my Samsung password, Samsung also emailed me the little bonuses that some people said they did not receive, I'm not sure if I'll use them or not though. Locked onto Wifi right away, and have not had any problems with it losing signal, always seems to stay strong, even in parts of the house that my phone loses connection. I had to go into the Play Store and change my settings though, because it defaulted to downloaded ALL of my apps, and I like the option to select what to install without suddenly having X number of applications automatically installing, the only one still giving me issues at this point is Iheartradio, it seems to randomly try and download and install itself, and I'm not techie enough to understand why.I do think the size is perfect, I liked my 7, but now with playing around with this one extra screen is really appreciated.  I'm not sure I would like anything larger, the articles I read on the Nexus 8 were saying it may end up being 8.9 inches and at least for me I think that would have been a little too big.  It is incredibly thin compared to my Asus, and lighter despite being a larger size.The screen is beautiful, my Asus had a HD screen but this one definitely seems crisper, and has more detail in it, I did turn the auto brightness off.  Its very responsive and I haven't really noticed any lag when switching screens.  I have the Galaxy S3 phone so I'm familiar with Samsung's button setup that others haven't liked.  I actually like their setup better than the Asus pad I have, there were countless times I was typing away and would tap a little too low and it would exit out of everything I was doing, with the dedicated home button on the Pro this shouldn't be an issue anymore.  In landscape mode I always tend to hold the tablet by it corners, because the case provides a good gripping point.I know a lot of people don't like the magazine launcher, I have not actually used it for anything, I didn't care for how much screen space it was taking up until I found that you can push it back, and have the typical Android screens for the various apps, I'm a little strange, I like to have my home screen clean, and then have my apps on the two adjacent screens.  As time goes on I may use the magazine launcher more, I was never a fan of flipboard so I may not be much of a fan of this either.Storage is the same as it was in my Asus pad so its about what I'm used to, that being said a device with a larger internal drive would have been nicer, espcially since Samsung is trying to go toe to toe with Apple, you'd think they would release several different sizes, even more so with Google changing what they allow to be moved to SD cards (at least for those of us who aren't technical enough to do more than push a button).  At the moment I'm using the 32 gig micro SD that I had in my Asus pad, so any music or movies I decide to put on will go on there, so the 10 or so gigs of internal memory left aren't a huge problem for me, as I wasn't even close to filling my Asus.Speakers seem decent on the bottom, the current case I have does cover one of them slightly.  Another reviewer mentioned a buzzing coming from the speakers when you turn the volume down, and then play a video, mine does that as well, but since I don't usually watch videos or listen to music with the volume off I don't think its a big deal, I would assume it has something to do with the tablet supplying power to the speakers the same way old radios used to have static with the volume down.  The static sound disappears if you plug headphones in, so again, to me, its not a big deal.Battery life seems to be a little better than I expected, it took about two days of off and on use to run the battery to a point where I decided to plug it in, I'm sure with heavier use it'll drain faster. It does have some built in tips for helping to preserve battery life as well.  I'll be putting it to a better test at the end of April when it will be going on vacation instead of my laptop, and it'll be used for Netflix, emails, etc.Given how much power the HD screen is going to pull for regular usage, movies, etc, I do think that Samsung could have put a better battery in it to provide longer usage since other comparable tablets seem to be able to provide over 10 hours, so I'd take half a star off if possible, price is still a bit of an issue, but again, seems typical for other similar tablets, but overall I'm very happy with my purchase.", "Date": "March 30, 2014"}, {"Title": "Best Sammy Tab", "Author": "DEALHUNTER", "ReviewID": "R2Q0QXJ2ZEVC10", "Overall": "5.0", "Content": "This is definitely the best Sammy tab if not the very best companion size tablet on the market. Better resolution than iPad retina without the crappy IOS!This thing is pricey though at 400$. It's a bit heavier and not THAT much faster (actual user experience) than the tab 3 8.0. So unless you absolutely have to have the best resolution available, I would take a good look at the tab 3, 8.0 for almost have the price on sale.That being said....If you're a Samsung fiend and need the latest and greatest like me, than the tab pro is a must have.I think it's important to point out that you will not always be able to take advantage of the higher resolution of the Pro, e.g. Netflix can only stream 99% of titles at resolution in which again the streaming next to tab 3 8.0 would look almost identical. Though reading and text in general is extremely night and day. The tab 3 8.0 isn't bad, the tab Pro is just extremely great for that purpose.Conclusion:On a budget, go tab 3 8.0, it's a wonderful tab, seriously. If money is not an issue or you have vision problems, grab a tab Pro.", "Date": "February 21, 2014"}, {"Title": "Best Android Tablet Currently On The Market", "Author": "A. Cantero \"Anthony\"", "ReviewID": "R25RSO5G745PTE", "Overall": "5.0", "Content": "How do I start this review? Everything about this tablet is great! The screen is absolutely amazing, stunning is a better word. It blows the competition out of the water. Its lightning fast, it switches between pages without any lag what so ever. Battery life could be better, but after all its powering an amazing and bright display. The good thing is that the display is so bright that you can keep it at about 50-70 percent brightness in all but the brightest ambient conditions. There is a little heft to the device but I think that with the foe leather backing make it feel a little more sturdy/premium in the hand. The biggest downfall for this device is the built in storage, 16GB isn't very much. Especially when about 6GB is used just for the system software. However, you can add a Micro SD card to the built in SD card slot on the tablet. So you can easily expand the storage this way. Over all a very good tablet. Dare I say, its the Android version of the iPad. Meaning its the best of the best.*I bought mine at Best Buy because they had it in stock before amazon even offered it.*", "Date": "February 23, 2014"}, {"Title": "Converted from Kindle Fire HDX 7inch (Wifi) to Galaxy Tab Pro 8.4inch (Wifi)", "Author": "Barbara Prince \"Electronics Pro\"", "ReviewID": "R30OCX4J7DX1TA", "Overall": "5.0", "Content": "I absolutely love this thing. It is so much better than the kindle fire HDX. The kindle Fire through the Kindle Fire HDX were great products when I was in middle school, but now that I am a sophomore in high school, I decided I needed something that would make me look more official. Samsung has named this device a \"Pro\", and as far as I am concerned, it has bypassed my expectations greatly. When I said \"make me look more official\", I meant that I wanted something that I was going to be able to customize my home screen and something a little bigger than the HDX. I am not saying that the HDX is a bad device, but it does make you look a little childish with the home screen and other features that you can look into. The Tab Pro 8.4's screen is absolutely amazing. If you go to any webpage and zoom into the text all the way, you will not be able to see any pixels. I have read and watched many different reviews about this device and some of the main complaints were lagging and Speakers. The reason the Tab Pro might lag is because of the Magazine UX. I don't know how people can complain about lagging because for this device, I have experienced practically no lag. For the speakers, I am a little disappointed in the positioning of the speakers because they are on the bottom of the device and when holding the device horizontally, your hand will muffle the speakers. However, the speakers are very loud and crisp given that your hand is not in the way. One more thing that I have heard a little talk about are the two cameras. If people who are reading this review watched some video reviews, you will have heard that the camera is decent for a tablet. This stays true throughout this device. You cannot expect much from a tablet camera, but I am still impressed at its performance. Other reviews have also said that you cannot take photos with a tablet in public if you don't want to look like an idiot, but to me, there is no problem with this at all. Samsung has been aiming their most recent tablets towards business people, and it has definitely succeeded in being a business product, but it can also be used for many other great features such as games and reading. In the end, I would definitely recommend this product to anyone out there who needs/wants a new tablet and wish them luck in purchasing the tablet of their needs.Okay... this is an update of the previous review. The device is still performing very well. As of now, I still haven't seen any major lags over a 1 second time. I use this device almost everyday and the batter performs for about 6 hours with wifi on. The wifi range on the device is awful. I was able to connect to wifi with my Kindle fire in my room, but with this device I only have 1 bars... I have purchased a wifi extender which does make it much better but I am still disappointed in the device in terms of wifi.", "Date": "May 11, 2014"}, {"Title": "I can't put this tablet down.", "Author": "Ichikoh", "ReviewID": "RL6A99JDJDI3T", "Overall": "5.0", "Content": "I own several tablets, and this one has all the featuers I've always wanted in a tablet.  The obvious feature is the gorgeous screen, even for a LCD.  The resolution is top notch and clear, the size is perfect.  The build quality is better than I expected.  The back cover is soft leather like, which does not scratch or leave fingerprints.  I can easily palm it, and it so thin.  After turning out on, I notice it's blazing fast.  The Touchwiz launcher does lag, but with Android, is not limited to stock.  I changed the launcher and presto, its a totally new tablet.  I don't know why people complain about the software, there are a several ways of changing to your style.  The memory is expandable to 64 GB...which comes handy to store all your apps, music, video, and pictures.  This is probably the biggest difference from other tablets, because they cannot expand, so whatever size hard drive comes with it, that's it.  The battery is great, after heavy use, I still had a fair amount of battery left.  Other features...the speakers are on the bottom, which I like very much, led light on the back, great camera on the back, and home, menu, and back buttons on the bezel instead on the screen.  Overall this tablet is close to perfection.", "Date": "March 1, 2014"}, {"Title": "The tablet makes my phone look like a toy", "Author": "Timothy R. Culp \"tim\"", "ReviewID": "R36KP25QWRL42I", "Overall": "4.0", "Content": "I thought my phone had such a nice display until now. Love the size. 7 is too small and 10 is too large. Screen is beautiful. The only issue I have is the font size can be very small on apps like facebook. I occasionally need reading glasses to use it. Otherwise I would have rated it a 5.", "Date": "April 14, 2014"}, {"Title": "Nice tablet with some quirks.", "Author": "gB", "ReviewID": "R1B0ZEFKMPAHPQ", "Overall": "4.0", "Content": "Overall, the Galaxy Tab Pro 8.4 is a solid tablet with an amazing screen and a very desirable size/format (8-inch range).  There are a few quirks listed below, and at the moment the price seems a bit high (though dropping from its release price), but overall this is a solid device and recommended if you're looking for an Android-based tablet.Pros:*No surprise here, but the screen is really awesome.  Very high pixel resolution and the screen \"pops\" with bright, vibrant colors.  It's very easy to read small text on the screen.*I'm one of the few people, I guess, that actually like Samsung's custom TouchWiz skin over the plain-vanilla Android experience.  That's been my main motivator for purchasing the Galaxy S-series and Note phones over the years.  The GTP UX has been updated significantly to reflect a new direction and be more tablet-centric, but so far I really like it.  A lot of the classic TouchWiz features are still there, just a bit different than previous Tabs or S phones.  If you've used previous Samsung tablets or phones, you'll feel right at home with this model.*Ultra-light and thin.  The 8.4 format is a great size for this tablet.  Big enough to be a worthy addition to my phone, but smaller than the bulkier 10- or 12-inch GTP models.  The tablet is very light and thin, making it very portable and easy to hold.*So far the tablet seems fast and responsive to me.  Others have commented that it can lag, but after a few days of moderate use, I haven't noticed that yet.*A lot of people compare this to the 2013 Nexus 7, which is priced considerably cheaper.  Although, the GTP 8.4 has its quirks, I think the build quality and user experience is better than the Nexus 7.Cons:*The auto-brightness functionality doesn't seem to work too well; perhaps it can be fixed with a software update.  I've had multiple Galaxy-branded devices over the years, including my Note 2, and the auto-brightness feature has always worked pretty well in most cases.  The GTP 8.4 seems to be unusually dim when the auto-brightness feature is turned on.  If you move the tablet to other lit areas in the room, the screen will auto adjust, but this is somewhat of a pain and is inconsistent.  I find myself keeping the auto-brightness setting off in most cases.*Speaker placement.  In fairness, this affects all of Samsung's smaller tablets, going back to the Tab 7.0 and 8.0 models.  The speakers are placed at the bottom of the tablet when held in portrait mode, which is great.  However, if you want to watch a movie or video (landscape mode), then the speakers will be on the right or left, and the sound will obviously be biased to one side of your head.  I realize this is not a huge issue, since most of the time I'll have headphones on when watching movies so close to the screen, but it is still annoying.  As a side note, the iPad Mini has the same design (speakers on bottom in portrait mode).  I believe the Nexus 7 places the speakers at the top and bottom in portrait mode, so that when you hold it in landscape mode and watch movies it is more naturally tuned to your ear.*Price seems a bit high for what it is.  Compared to the iPad Mini Retina, it's priced fairly, I suppose; however, Apple is the king in this space and they can afford to charge more given their customer base.  If you shop around, you'll find it listed below the original MSRP.  However, compared to other smaller Android tablets, including the Nexus 7, this thing seems overpriced.*Only 16gb.  Sure, the microSD slot is great, but Google has heavily restricted Android 4.4 to run or store apps on external space.  As others have noted, some of the offline GPS apps will not work with this tablet, since they cannot be stored on the microSD card.  In this day and age there is no excuse not to offer 32gb+, especially at this price point.*Galaxy Tab 4 coming?  Recent news reports and rumors have it that the Galaxy Tab 4 is coming very soon.  Really, Samsung?  If that's the case why in the world did Samsung release the \"Pro\" line?  Samsung is notorious for releasing far too many similar products in a short window.  Even worse, once they release a new product, they typically abandon the previous version.  So if the GT4 line is around the corner, then I expect future software updates to the GTP line will be minimal, if at all.*No hardware \"menu\" button.  This is probably my biggest pet peeve with the GTP 8.4.  Okay, this is actually not Samsung's fault at all--Google took out the capability for a physical \"menu\" button in Android 4.4.  Per the Android 4.4 specs, the GTP 8.4 has replaced the menu capactive button with a \"recent apps\" button.  However, I've noticed a lot of apps have not been updated to support the \"soft\" menu that Google wants its apps to have.  After years with my other Galaxy phones, I've come to rely on this functionality.  For some apps,  Samsung has added the ability to long-press the \"recent apps\" button, and you'll see the menu appear.  However, I've noticed that it doesn't work for every app out there.  I understand Google's intentions with this removal, but it's up to the app-maker to move the menu into the app screen itself, and many developers have not made this change yet.", "Date": "March 26, 2014"}, {"Title": "Great 8 inch Tablet", "Author": "blackocat", "ReviewID": "R23IG4NHBF8RWW", "Overall": "5.0", "Content": "I bought the Samsung 8.4 TabPro and my girlfriend bought the Apple IPad Mini Retina.  I set up both devices and both took about the same amount time. Both have excellent displays and seem equally fast.  My preference is for the Samsung, but It is completely subjective.  I prefer the KitKat interface and having a back button. The Word processor that comes with the Samsung seems better (more Word like) than the Apple Pages product. I also like the keyboard better on the Samsung because the top row has numbers.  Text editing seems easier on the Samsung too. Both products offer the same popular apps.  The Chrome browser also does a really good job hiding rows and maximizing the viewing area while scrolling.  The speaker are fairly good too.", "Date": "March 3, 2014"}, {"Title": "Pretty good, but some limitations.", "Author": "-TMcN-", "ReviewID": "R1A1HBU66BVF1D", "Overall": "4.0", "Content": "You've read the other reviews.  You know that the 8.4\" has a great processor, great display, decent software, etc.  And those rare horror stories that usually have nothing to do with the product.What's the rest of the story?This is a great tablet, but...1. No USB mass storage mode.  If you have an older Android device you're upgrading from, you may be used to plugging it into your computer and copying files back and forth.  Not so easy on this one.  It supports two modes: Media (MTP) and Camera.  No USB drive mode.If you root the tablet, you can enable mass storage mode, but that invalidates your warranty... and prevents future firmware updates.If you're using the latest (but not so greatest) Windows version, it pretty much works anyhow, a bit more limited (can't reach all the same places) but you can see it.  On the Mac... not so much.  But there's a way around it.  Look for \"Android File Transfer\" for the Mac; it's not quite the same, but closer.2. Still no TAP VPN support in the kernel, which is a big deal for OpenVPN.  Of course, there wasn't before, but you could root and get it.  Fortunately, there is an app that somehow implemented it... search for it.colucciweb.openvpn.  It costs about $5 (most OpenVPN clients are free, because it is an open source project), but it works.3. You may be accustomed to having buttons below your screen for Menu, Home, Back and possibly Search.  The SM-T320 (the 8.4\" Tab Pro tablet) has, instead, \"Task Manager\", Home and Back.  No \"Menu\" button.  I guess they figured all apps have been updated to use the on-screen menu dots at the top, but many haven't. To get the \"Menu\" functionality, HOLD the \"Task Manager\" button instead of tapping it.4. You can't, without installing a different launcher, disable the Magazine page of the launcher.  It's a bit like Metro (Microsoft Windows Phone), though only required on one page.  But if you're a power user, you probably do install your own launcher anyhow, and it actually is decently nice.5. The back is leatherette.  Fake leather.  But guess what... it's actually pretty nice.  No rattling on the table, it is a bit classy.Really, they're easy enough to live with, but keep these limitations in mind.  On the bright side, if you register the device, you get some nice perks including a $25 credit for the Google Play store.  (Ironically, I forgot about that until AFTER I paid for that Open VPN Client software.  Oh well...)6.  No mini-HDMI port.  This may fall into the \"Say what?\" category for you, but most Motorola devices have had them.  With a single cheap cable, you can attach to any HDMI-accepting TV/monitor.  With an iPad, it takes a $40+ \"Lightning\" cable.  You need a special cable for that, an MHL 2.0 HDMI adapter.  Samsung's is the ET-H10FAUW.  And yes, it's $40.  You can get it on Amazon... but it sucks down the battery like Pac-Man eating Pez, and recent versions don't work run through a receiver; you need to go directly to the T.V.7. No USB OTG.  Well, not really at any rate.  USB OTG is a newish standard for allowing phones and tablets to read/write to USB Flash Drives.  (Overly simplified version.)  This requires software support and the ability to send a bit of power to the USB port.  The Galaxy Tab Pro 8.4\" can't do it, not directly.  It requires an adapter.Is this a negative review?  No, not really.  I'd still buy it again.  It's pretty, it's fast and it takes 64GB micro-SD cards.  (Reportedly it does well with the new 128GB ones too, but I haven't tried it.)  But do be aware that not all is violets and roses with Samsung's newest jewel.", "Date": "April 27, 2014"}, {"Title": "Very Good Upgrade!", "Author": "Chris Leach", "ReviewID": "R36MO7V7FYI5BW", "Overall": "5.0", "Content": "Ok, I bought my nephew the Galaxy Tab 8.0 for Christmas and have been using it and enjoyed it so, that I was about to buy the same thing for me.I seen that the GT Pro 8.4 had come out and had a better screen than the GT 8.0, so I thought I would study a little about it, read a few reviews online and then I would decide on which to get.I can say that I definitely chose right.Just some quick Pro's from my use so far :Width wise it seems smaller than the GT 8.0.Screen is heads above the GT 8.0The .4\" screen size is NOT noticeable at all.  My hands hold the GT Pro as well as the GT 8.0.Loads apps/books faster than the GT 8.0.  It should with a quadcore processor.The fake leather backing on the back of the GT Pro is nice, it isn't as likely to slide on any surface that is not flat.Charge seems to be holding up, but I have only been using it recently for reading books.The speaker seem good considering this thing really isn't being advertised as a mp3 player.Some quick Con's:When I slide my finger to go to another screen, it stutters at times. (haven't had time to see if there is a fix or not for this)The fake leather on the back just seems tacky and not right for the GT Pro.  I don't hate it, but it seems something better could be there instead.The speakers and sound aren't what they should be, in my opinion.  Maybe they should invest into Beats audio or some other brand of audio to up the sound quality.  The GT Pro, should have better sound, not just a better screen.This has been a pleasure to use so far, though I clearly have not put it completely through its' paces, I have used it and abused it a bit, and it does very well.I would recommend this over the Galaxy Tab 8.0 in a heartbeat.If you are struggling between the 2, the Pro is the one to get, even at the cost, but you can't go wrong with either really, but the Pro is a step up that you can see and feel.", "Date": "April 10, 2014"}, {"Title": "2.5 month usage review incoming!", "Author": "Cool Spot", "ReviewID": "R10Q8GIJ8NKYJX", "Overall": "5.0", "Content": "I'll put my review in:Purchased this tablet March 21st, 2014 from here for 360. White, 16GB version.I previously owned a Kindle Fire HD 7\" (16GB, 2012 version) and also own a Samsung Galaxy S3, White, 32GB version.I'm familiar with the Samsung build quality, so the Tab Pro 8.4 having all plastic wasn't a big deal to me. I put a case on it that folds into a stand and haven't looked back! Screen is nice, text is on the small side at times, but that's more of the insane resolution than anything else.HDMI out works perfectly. I made a topic and corresponding video about it on AndroidCentral's Galaxy Tap Pro 8.4 pageSound quality is loud but isn't the best, so I purchased a Bluetooth stereo speaker to take care of that. Wifi range seems alright, but it disconnects every so often. Not a big deal as the wifi on/off is very instant. Multi-Window works great, though I wish it would allow Hulu Plus and/or Netflix to work with two apps at once.Memory Capacity seems good. I haven't had any storage or ram issues. The camera takes decent pictures with a flash and auto-focus. More notably fuzzier than on my S3 phone. The screen edge to the bezel is nice, but I found I would sometimes drag the screen when I'm holding or moving my tablet around which would cause undesired functions on the device itself.I don't use Magazine UX so I took most of the widgets present, off, as to reduce the lag. I find that if you don't even swipe in that direction, you have nothing to worry about. Android games play flawlessly. Currently playing Walking Dead Season 1 (bought the  Season Pass with my $25 Google Play Credit).Lastly, the battery life seems good. I keep my device on the charger when I'm at work or out of the house anyway, so it never gets below 30%. The included white Samsung Charger charges the battery up quite fast due to the higher mAh rating. I don't have the brightness on full, maybe 1/3 of the way up and don't use auto-brightness because it's too dim. For viewing at night, I use this program called Easy Eyes that automatically dims the screen at dusk (and brightens again at dawn) to make it easier to see at night. It works great. Same idea as f.lux on Windows/Mac PCs.----------------------------------Overall, for my first \"true\" Android tablet (hated the KFHD), I would rate it a 8.5/10. Not a bad rating by any means. I just have nothing else to compare it to so it's pretty much at the top ceiling for me!", "Date": "June 1, 2014"}, {"Title": "Apple Who? iWhat?", "Author": "Amazon Customer", "ReviewID": "R87XP75LXIIQ2", "Overall": "5.0", "Content": "This tablet is the smallest in Samsung's pro series but it completely blows my wife's iPad Retina out of the water!I swore off Samsung after back to back crappy phones several years ago. This was pre-smart phone and the biggest problem was the batteries they used. However, I am on the Samsung band wagon now! I had a nexus7 that bricked on me 3 months after the warranty was up and I loved it... This blows it out of the water.I dont need near the power this bad boy offers but it sure is fun and at the price how can you go wrong? On a side note 6 days after my purchase Amazon lowered the price $30 and when I called to say something they refunded the difference no questions asked.", "Date": "March 29, 2014"}, {"Title": "Lots to Love About this 8.4 Tablet. Thin, Lightweight & Great Display", "Author": "Carrie", "ReviewID": "RAMK1KUSQ8L84", "Overall": "4.0", "Content": "There is a lot to love about the Samsung Galaxy Tab Pro 8.4 inch tablet.  And, there are a few annoying things too.  All in all, however, the positives outweigh the negatives, and, for non-business use, the Galaxy Tab is a strong contender in the tablet arena.What to Love:1. Bright, clear display2. Easy to set up/intuitive3. Quickly downloaded my contact information (from outlook/hotmail)4. Expansion slot allows for a 64GB microSD card5. Lightweight & thin - hard to notice that you are carrying anything at all6. Decent battery life7. Easy to connect to wifi8. Decent rear/back cameraCould be better:1. Gmail emails are in a different folder/app than other emails (hotmail, roadrunner, etc). It would be nice to have them together.2. The tablet chokes on large/extra-large file downloads/transfers (was transferring pictures from the microSD card to an attached USB flash drive)3. Manipulating non-gallery stored pictures (viewing, deleting, moving using touch rather than a mouse) is cumbersome4. Need to use a USB adapter in order to use a flash drive5. Sometimes had a hard time connecting to wifi (showed connected, but couldn't open internet)I did not try to do document editing or use the tablet as a remote.I travelled overseas with the tablet & loved the fact that it is lightweight & very packable.  I used it daily to connect to the internet for emails & social media.I've used a Sony Experia tablet (10\" Android), a Surface tablet (Windows) & the Samsung Galaxy Tab Pro tablets.  Of the two Android tablets, I think Samsung is a superior tablet.  As compared to the Surface, the Tab Pro is more lightweight, but the Surface can handle larger file downloads and is more functional as a business tablet because Word/Excel/Powerpoint are seamless applications.", "Date": "April 1, 2014"}, {"Title": "Great upgrade from Nexus 7", "Author": "sal \"salby\"", "ReviewID": "R1KB6BGXVXOHZ2", "Overall": "5.0", "Content": "Love the Galaxy Tab's larger screen--crystal clear and beautiful colors. I am  uprading from a Nexus 7 2013 as I read so much and needed a larger screen.  The Tab Pro is very fast, performs without problems, and is easy to hold.  I am a small person,  but with a good case.  the Galaxy Tab Pro is comfortable in my hands and handled easily. A great upgrade and perfect for the many tasks for which I use a tablet.", "Date": "April 12, 2014"}, {"Title": "Best 8-inch Android tablet available", "Author": "Bruno", "ReviewID": "R3SH9Y121VE85", "Overall": "5.0", "Content": "Great tablet! Delivered the goods in all aspectsScreen: Extremely sharp, text, images and games just pop out of the screen. Colors are also very sharp, yet the color accuracy is great, especially the whites. While the iPad produces notably warm whites, the Galaxy Tab Pro 8.4's whites are as accurate as tablet screens go. Contrast is also very good on this tablet. The 8.4 inch size offers a lot of screen real estate, all the while being very portable.Design: While I prefer the iPad's aluminium build, the Tab Pro 8.4's faux leather back doesn't look bad at all. On top of that, the tablet is really, really thin and light, and the screen bezels are very narrow, though the top and bottom bezels are big enough for comfortable landscape mode use. I must point out, however, that if you choose to use this tablet in landscape mode, know that your hands will activate the capacitive back and menu buttons A LOT. It's pretty annoying, and after a while you'll just switch to portrait mode and keep it that way.Software: The included software is generally very useful. Multi-window is a feature I've been enjoying the most. The WatchON app, together with the tablet's IR blaster, makes watching TV much more convenient. Magazine UX is very nice, but it lags down the tablet too much, hence I sideloaded the Google Now Launcher and it's been running VERY smoothly. Hancom Office is also the most complete Office alternative I've ever seen, but I found that it hangs a little too often.Performance: Overall performance of this tablet is great, thanks to the Snapdragon 800 processor. Web browsing is a very smooth and fast experience on Chrome, and the stock web browser is even smoother. Even demanding games like Asphalt 8 run very smoothly. But, again, the stock TouchWiz launcher with Magazine UX will slow things down.Basically, it's an excellent tablet, and the best iPad mini Retina competitor available right now.", "Date": "March 29, 2014"}, {"Title": "Excellent, just a couple of small technical drawbacks", "Author": "Scott W. Larson", "ReviewID": "R29S0XPMB3P4QZ", "Overall": "4.0", "Content": "All the good reviews are true. The screen is beautiful and the CPU is fast. This works great for downloading photos from my DSLR, cropping them, resizing them and even correcting the color (the display can be color-calibrated) before I forward them onto my boss. I've found two small problems that few will care about but here they are.The Wifi isn't very fast. I rarely get transfers faster than 1MB per second and usually get half of that even three feet from the Wifi router. In the same location my laptop regularly transfers 9-10 MB per second. Copying files through MTP transfers at 3-5 MB per second so that's the way to go if you don't mind plugging in a USB cable.Video and audio acceleration in hardware is missing some important codecs. The most surprising is that AC-3 (better known as Dolby Digital) is not supported. This is the most common audio format used on DVDs and the only format used for high definition television in the U.S. The native video player simply says \"Unsupported audio codec\" and you get no sound. There is also no hardware acceleration for MPEG-2 video which is the standard format for DVDs and high definition television -- the default video player says \"Sorry this video cannot be played\".This means that if you want to drop any file on the tablet and expect it to play, you will need another video player which will support these codecs through software (MX Player plays every file I've thrown at it). If you want to maximize the battery life by using hardware acceleration, you'll need to reencode video from DVDs or HD broadcasts into codecs that are supported by the hardware like AVC and MP3. This is a surprising inconvenience since even my phone supports these in hardware.", "Date": "March 28, 2014"}, {"Title": "Replaced iPad mini with this tablet", "Author": "Gary Woods", "ReviewID": "R34LDFRAZWNLD1", "Overall": "4.0", "Content": "I like that this tablet has GPS, quad core processor and a Micro SD slot. High resolution display is excellent.  The only disappointment is that Android 4.4.2 limits using apps from the external SD card to Google apps.  I would recommend this tablet.", "Date": "May 19, 2014"}, {"Title": "Samsung takes bite out of apple! This device is awesome!", "Author": "John Edwards", "ReviewID": "ROCXY3VQEB7TD", "Overall": "5.0", "Content": "This tablet form and size was a little awkward at first. I had been using an iPad with retina display but wanted a smaller device to travel with. I liked the Samsung 8.4 much better, so dumped the iPad.Dislikes:The bezel is too small and sensitive. The capacitative control buttons are in a tough spot for my large hands. To fix this, I purchased the IVSO case. With its hard back and soft front cover, the device is easier for me to grasp. Further, I turn the device upside down so the buttons are on top. So 90% of my problems are solved.Likes:1) I love the keyboard which includes a delete key and backspace key, plus right and left cursor keys. On top of this you can simply touch the text to edit.2) The main controls for brightness, wireless, gps, blue tooth and sound are very easy to access. This is important if you travel by air and land.3) The screen is spectacular. Very bright and no pixelation even up close for night time reading.4) Battery life is very good. Especially if you turn down the brightness and leave bluetooth and gps off.5) Conventional micro USB charging plug is just the right thing to do. Proprietary apple connectors now seem contrived, however profitable they proved for Apple shareholders.6) The sound is darned good for two little  bottom side bezel speakers. I mostly use in-ear head set.7) Apps and Storage: Free 50 Gb Dropbox is nice, though I will like never use it all. Free 3 Audible books is enough to get you hooked! Hancock Office works very well.8) Samsung connectivity is cool. I am dying to use it on my Samsung TV. So far I haven't tapped the video aspect of this device the than Netflix. Nflx works well!9) Kit Kat is very easy to navigate.  Though some icons are not as pretty as Apple equivalent. P10) Play store is on par with the apple app store. I purchase my media from Amazon, so content is not encumbered by Apple proprietary limitations.Summary:Get a case! Tons of inexpensive variety online.Find top 10 app list and play around with this incredible device.Enjoy superior performance!", "Date": "March 25, 2014"}, {"Title": "Best Tablet out there", "Author": "zomgwtfbbq", "ReviewID": "R372Q1SOBCR6JR", "Overall": "5.0", "Content": "Samsung really caught up on the Tablet market. This is the concurrent pendant to the iPad retina mini and the Samsung Tab Pro 8.4 beats every other tablet out there by far, including every product from Apple..10/10 superb screen, superb colors, incredible resolution. Incredible Hardware inside, fast as lightning. Sleek and nice design.If you are looking for a new Tablet, this is the best you can buy currently.", "Date": "March 7, 2014"}, {"Title": "Best tablet out there", "Author": "D. Kean \"D. Kean\"", "ReviewID": "R1I2FNDNQCHUPF", "Overall": "5.0", "Content": "Ok, I've only had it for a few days but I've been checking email, monitoring an eBay sell and its been over 24 hours and still have 100% battery.  Don't know if it will drain quickly at some point but so far so good.  Beautiful screen.  Can't say anything bad about it.  y on response", "Date": "February 27, 2014"}, {"Title": "Amazing!", "Author": "Carlos Costa", "ReviewID": "RBCRDE5TPQQEF", "Overall": "5.0", "Content": "I can't rave enough about this tablet. The size, the speed,  the OS, and of course the screen! I honestly can't think of any negative factor towards this tablet, and I would have to say it blows anything else on the market away in its class. If you have a Samsung smart TV it goes even further. The features are endless even for a person like me who is a technology freak. Strongly recommend it to everyone!", "Date": "February 26, 2014"}, {"Title": "I love my tablet.....Stop it Apple trolls", "Author": "Sean Robinson \"The realist\"", "ReviewID": "R33241UJPDAITH", "Overall": "5.0", "Content": "Im aware of the Apple trolls writting reviews for the tablet......hilarious!!! My tablet goes with me everyday to work or play..... no issues...on wifi..no issues......period. No issues....at all. My only issue is with otterbox..that as of yet has not made a case for this model. If Apple trolls want to drink the koolaid..thats fine...but trolling without pay??? GET A DAMNED LIFE...this Tablet is good...it has more apps than I need but I'll take it. The 25.00 in google money works just fine too.....with Apples you only get seeds ..in your mouth....if youre into that kind of thing....I just saying.", "Date": "April 30, 2014"}, {"Title": "Nice", "Author": "Stan Dov", "ReviewID": "R26YHX7QZ4RXK4", "Overall": "4.0", "Content": "I decided to downsize from my previous 10.1\" tablet of a different brand as I found it to be too awkward to hold during my commute and the tab pro 8.4 has worked out nicely! The tablet is light, easy to hold with one hand, and the screen is big enough. My needs are fairly simple - I don't use the multi window functionality that Samsung has provided - it does work, but I simply have no need for it. Mostly I use it for browsing the web, processing and posting photos (taken with my 36 mp camera) when travelling, and watching movies. The tab pro 8.4 is pretty snappy while performing/switching between these tasks and the screen - 2560 by 1600 - is the sharpest you can get right now. Absolutely no complaints about any of that. The battery is fair and when I fly long haul I make sure to take an external battery pack with me (mostly for a piece of mind - haven't had to use it yet). The biggest con about this tablet is that it's only available as a 16 gig version. Sure, you can store media on the external microSD card, but when it comes to apps - you will have to prioritize the apps (some games run a few gigs!) that you will have installed. Overall I am pleased with the product.", "Date": "May 26, 2014"}, {"Title": "Love It!", "Author": "Mickey 3 Gun \"M3Gn\"", "ReviewID": "REMFRRDBQ751Q", "Overall": "5.0", "Content": "I've used it daily now for about a couple of months.  Other than it having limited accessories because it's so new, I have no complaints", "Date": "May 12, 2014"}, {"Title": "Awesome first tablet", "Author": "chr0nix", "ReviewID": "R2INJ1G4MWJMPT", "Overall": "5.0", "Content": "Amazing tablet. Disable the Samsung touch wiz launcher by installing Nova Launcher or Google Now to make it fly. 8.4 inches is the sweet spot for tablets.", "Date": "February 22, 2014"}, {"Title": "No problems", "Author": "Writ Xavier", "ReviewID": "R3BCVMCFPYIOJI", "Overall": "5.0", "Content": "This tablet is working very well. You know what the specs are; this is a high-end tablet. I was very pleasantly surprised by how long the battery lasts (much longer than the 6 hours it claims here on Amazon). As a quad-core, 2.3GHz processor is massive overkill for most tablet applications, I generally keep it in power saving mode (which limits the CPU frequency), and only put it in full-power mode when I am doing compute-intensive tasks like solving systems of linear equations. I'm a computer scientist, and I have been able to use this tablet as a highly-portable research platform when I'm on-the-go. If you're just a casual user who wants to watch movies and browse the web, the less-expensive Galaxy Tab 4 series (which I also own) is probably a better fit.", "Date": "June 5, 2014"}, {"Title": "Really good", "Author": "Pedja", "ReviewID": "R1N6CHO7OB5XKG", "Overall": "5.0", "Content": "Display is amazing! Colors and resolution are awesome! It`s really fast due to its 2.3 GHZ CPU, and It`s really light which is perfect for gaming and watching videos. Sound is good and it`s pretty loud. Battery life is really good. It can hold up to 8-9 hours if it is heavily used (games for hours + facebook + internet surfing + youtube). Under light use ( a little bit of games, FB, email, youtube) it holds up to 3 days.I disabled most default applications. For example Samsung magazine is boring and annoying. I can browse fun stuff my self using dolphin player and youtube. Also Google chrome does not support flash player (hacked version for kitkat) and its slow. Magazine and other default apps I never use just reduce battery life, slow down tablet and take up space. Rooting the tablet would probably be the best solution.", "Date": "May 27, 2014"}, {"Title": "Awesome", "Author": "Vincent Kruzel", "ReviewID": "R2AVTZYVU9YMXL", "Overall": "5.0", "Content": "Excellent tablet for my needs. I use it every day. I bought a gum drop cover for it to protect it.", "Date": "May 17, 2014"}, {"Title": "Love the galaxy tablet!", "Author": "sherry jacobson", "ReviewID": "R1GUPL7WCI3YO6", "Overall": "5.0", "Content": "Easy to use and so very light for traveling. Great for business and organizing both your personal and professional lives", "Date": "May 4, 2014"}, {"Title": "Tab Pro 8.4", "Author": "Velociphile", "ReviewID": "R2C0B8TQRHW10", "Overall": "4.0", "Content": "The display's, color, clarity/resolution are phenomenal! Combine that with the power of this tablet they are the main reasons I decided to finally purchase my first tablet which I used to replace an aged laptop.I love the size, fits great in my hand, I really enjoy reading and watching videos on this tablet.I do have issues with the WIFI constantly scanning and occasionally dropping off due to some error which is only fixed by turning the tablets wifi off then back on.I wish it had the indicator LEDs for charging or email/messages like my phone does.", "Date": "April 19, 2014"}, {"Title": "amazing", "Author": "Robert Olmsted", "ReviewID": "R16Z6L48GQV591", "Overall": "5.0", "Content": "I have both the 8.4 and 12.2 and i can't say enough about them if your sitting there scratchingYour head about them stop and get either one of them or in my case get both you won't go wrong", "Date": "April 17, 2014"}, {"Title": "Better then all the rest", "Author": "LHoskins", "ReviewID": "RPHV137TI2ZAO", "Overall": "5.0", "Content": "The Samsung Galaxy Tab Pro 8.4 is hands down the best tablet that I've ever owned it's lightning fast has a great display perfect for professional users like myself and those people who just want the best 8.4 tablet around okay one con it's like four hundred dollars but it's 369.00 now every where, do yourself a favor buy it buy it buy it you'll love it love it love it! I'm done!", "Date": "March 30, 2014"}, {"Title": "Great tablet", "Author": "Nick", "ReviewID": "RWL52CRFB3XLD", "Overall": "4.0", "Content": "I love my 8.4 pro. It is a bit pricey compared to other tablets, but it is way faster, the screen is beautiful, runs apps quickly, surfs the net like a pc, and I popped a 64gig card in it and it uses it effectively. So I got a high end tablet with 80 gig for $399. Not easy to do if you are looking at IPADs. And this thing compares well with IPAD. For me the size is perfect too. I fly a lot and watch movies. The 8.4 in screen is big enough to enjoy movies but small enough to fit in my brief case or use in my hands. Sure beats watching the movies on my phone. Yes the battery life maybe only five hours instead of 10 but that is plenty for me and it still goes for one or two days if I am not using it to constantly watch movies. Also the infrared remote and online TV guide is awesome too. I travel between two places and it let me set up seperate rooms so I can use it in NH and FL. One reviewer rejected it altogether becasue of the limited power  and I think (s)/he was an IPAD snob just looking for excuse to put down machine. I did take away one star becasue of the limited power, but am glad I spent the money on a pro instead of the regular tablet. I also have an IPAD 2 for my wife who doesn't mind it being slow but I can tell a big difference. You can even use the usb port to read from flash drives so you really have a lot of storage capability if you need it and with my movies and music I need it.  I installed Amazon mobile app and get free apps of the day which also eat up space but are a lot of fun to try.", "Date": "March 28, 2014"}, {"Title": "the best android tablet available", "Author": "seon", "ReviewID": "R1BJPYRTVV2L8R", "Overall": "5.0", "Content": "Phenomenal screen, fast processing speed, very useful multi-tasking feature , ample battery life, tons of interesting features and perks, highly customizable, good speakers, good weight. Only downside is its price. Overall, my wife and I are very satisfied with this product.Note: In order to receive perks, register your device at the samsung website.  Google \"register galaxy tab pro for perks.\"", "Date": "March 19, 2014"}, {"Title": "Best tablet I've owned yet", "Author": "Jeffrey Olsen", "ReviewID": "RHBE88SKKHOQC", "Overall": "5.0", "Content": "I've had 3 android tablets, Surface RT as well as Pro and the Galaxy 8.4 is exceptional, Samsung continues to impress and exceed my expectations each time I buy one of their devices. This tab is blazing fast, picture quality is next to none. The form factor is perfect which allows you to type with two thumbs. The only downside I see thus far is it gets slightly warm with heavy use but that is expected with something this fast.", "Date": "February 24, 2014"}, {"Title": "Better than my Nexus 7!", "Author": "KingNigel", "ReviewID": "R3N9BCNBX7V8VN", "Overall": "5.0", "Content": "This tablet is awesome. I'll just go ahead and list the pros and cons..Pros:Great screenComes loaded with features to make up for high price. (Dropbox, Google play credit, etc)Good standby timeHaptic feedback/vibration (something the nexus 7 lacks)Feel in the handCons:-Camera. Now I know most people are thinking \"Who cares about camera quality on a tablet?\". Well, taking away the camera completely could have saved $50 on this product and made it competitively priced.-Speaker placement. In landscape mode, your hands will cover the speakers a bit. Although I don't get irritated by itI recommend this tablet for everyone! No matter how simple or big your purpose is. Not usually a big fan of Samsung and Touchwiz, but I'm 100% satisfied with this purchase.", "Date": "April 19, 2014"}, {"Title": "The Good, The Bad, and The Ugly...", "Author": "Anthony", "ReviewID": "R39G03LPPQVJI4", "Overall": "3.0", "Content": "The Good:Screen size, processor speed, and balance/weight distribution. The Battery life is about 5 hours or so which isn't that great but isn't that bad either. A little better than Nexus 7, I think.The Bad:The home button and touchable back and application keys are in the worse possible area as with the sound. Your hand is literally covering up the sound a lot of times (which gets muffled really bad if you don't watch yourself), accidentally hitting the touchable keys, and it wasn't design with landscape in mind even though that is how you would use it a lot of times for games. Also, hate the Magazine UX that you can't disable or uninstall and even if you replace it, it's still integrated so deeply into the system that it uses resources.THE UGLY:You have a 16 gigabyte hard drive but 4 gigs is used by the system and then maybe another gig or so in bloatware, so you are left with about 11 gigs for yourself.What makes me annoyed even more is the SD card slot doesn't transfer all of the apps to it, most of the application size is stored on the internal memory still and only resources seem to be installed on the sd card which is less than 20 percent of the application in games.For example: The Squid 1 game is about 400 MBs but only like 60 MB is actually put onto the card.So your memory gets eaten up just as fast on the internal while your external SD is overflowing with memory. Sigh.What's more annoying is the ram the system/bloatware uses is about a gig and a half out of the 2 gigs: so you are left with about half a gig or about. Most of the time my ram memory is about 80 percent used with just a few apps opened.So, to sum it up, you are left with a device which is really 11 gigs of usable hard drive space, half a gig of usable ram or around 800 megabytes, and has a lot of bloatware which Samsung denies you from removing. You have the keys in the wrong areas, applications can't be installed on the SD completely and most of the application data is on the internal anyways, and you probably are going to have to juggle apps by installing and uninstalling them from google play at some point.I almost want to return it but it's not that bad of a device: just feels like it was made lacking on purpose outside of specs which would get people to buy it but who knows.Take care,", "Date": "February 24, 2014"}, {"Title": "My First Tablet", "Author": "Melody M.", "ReviewID": "R29UBMA6TRX2SD", "Overall": "5.0", "Content": "I don't usually write reviews, I just read them because when I think about buying a product, I really want something worth purchasing, especially for the price, and something that I at least think will last me a while. I am very careful with my electronics because they can be really pricey. I read and watched every single review I could find on youtube, google, amazon, etc. to help my decision about whether to buy an iPad, Nexus, Samsung or a Kindle. I'm sure its pretty obvious that Samsung Galaxy won my vote.  Although, there are some cheaper brands out there, I want a good and solid tablet. Tab Pro has been really good for me so far.  I haven't had any regrets yet and if you ask my husband, I do have regrets from time to time when it comes to my purchases.  I always go to Amazon first when it comes to buying products because they always offer great prices and it arrives fairly quick and in good quality.", "Date": "May 15, 2014"}, {"Title": "LOVE SAMSUNG", "Author": "Vanessa Waller \"book luva\"", "ReviewID": "RNI2QFRCAHU6M", "Overall": "5.0", "Content": "I love this tablet.  It has everything you need to do on the run.  you can't go wrong.  A must buy.", "Date": "May 12, 2014"}, {"Title": "Better than Retina", "Author": "Bill Blackburn", "ReviewID": "R2CJVP0R22RQ5D", "Overall": "5.0", "Content": "Wow, what a bright, sharp & beautiful display!  359dpi; way better/sharper resolution than Apple's best Retina offering on any device they make.  And bright; I can read it outdoors on a sunny day (not that I do that much).  The Tab Pro 8.4 is faster than my wife's older Tab 2 7.0\" & my buddy's iPad 2.  This is especially noticeable when surfing the web.  One complaint that actually applies to all tablets I've looked at, the rear/main camera resolutions are typically lower than current smartphones.  This one has an 8MP main camera, while my Samsung Galaxy Note 3 (bought Oct'13) has a 13MP main camera.  Enjoy . . . :-)", "Date": "May 8, 2014"}, {"Title": "Great Tablet with some quality control issues", "Author": "Kevin T", "ReviewID": "R1ITPE43HSL46C", "Overall": "5.0", "Content": "1st tablet I received from Amazon had speakers that made a low muffled crackling sound while volume was muted.  Replacement tablet from Amazon worked perfectly.This is the best screen you can get on a tablet, and 8.4\" is the perfect size, and weight.The only negative is the Samsung bloatware and Touchwiz/Magazine launcher, which has some noticeable lag.I installed the Google Experience launcher and now the tablet is perfect.  It's like a premium Nexus device with a bigger and better screen.", "Date": "April 25, 2014"}, {"Title": "Fantastic tablet.", "Author": "lily", "ReviewID": "R18UT8B2X2UKNV", "Overall": "5.0", "Content": "I've had this galaxy tab pro 8.4 tablet for a week and it is the best I've ever had!!  The screen is so clear and crisp, it is lightning fast, I like the new magazine format, and the battery life is great.  If you don't want to use the magazine format you don't have to, the home page is the regular android that we are use to.  I just love everything about it.  Samsung has out done itself in my humble opinion.  I have used the the Samsung tab 8, the nexus 7 2013, and the Kindle Fire HDX, and this new Galaxy is by far the best!  The faux leather back is very nice, very soft feeling.  It is very light to hold, no hand cramping.  The price is a bit high, but in mho worth every penny.  I say go for it, you will be amazed!!  As usual ordering it from Amazon was great, it arrived in 2 days with prime, and packaged perfectly.  Enjoy!! Should add one more important point....the battery charges very fast...within about 2 hours!!  WOW!!", "Date": "March 10, 2014"}, {"Title": "Best on the Market", "Author": "Mr. Daniel W. Brennan", "ReviewID": "RZOLEZUY0CZ64", "Overall": "5.0", "Content": "It took me a long time to invest in a tablet but when I did I ask myself why so long. This Galaxy 8.4 is just a good or even better the the computer I have at home. This Pro Tab is very easy to navigate with the touch screen. Great Job.", "Date": "June 9, 2014"}, {"Title": "Pros and Cons", "Author": "James Foldenauer", "ReviewID": "R20OAMGN2MOU5Y", "Overall": "4.0", "Content": "I choose a 4 out of 5 rating because there is some pros and cons to this Samsung Galaxy Tab Pro 8.4. First, I will explain the pros of this tablet. The Samsung Galaxy Tab Pro 8.4 has a nearly 2k with a pixel density of around 350, the highest in the market. The performance is outstanding as I would get a score around 23,000 in Quadrant Standard Benchmarking test (similar score to Galaxy S5). Finally, the tablet is light and thin that makes it more portable. Next, I will explain the cons of this tablet. The cost of this tablet is $399, which is expensive for some people to purchase. The speakers is not the best, it gets the job done but the quality is low comparing to other tablets. Finally, the battery is not the best according to the comparison. The specs on the Samsung's official page shows the internet usage of 10 hours, music for 126 hours, and watching a video for 12 hours. With these pros and cons, I would still recommend this tablet to users that is in interest of getting a tablet.", "Date": "June 9, 2014"}, {"Title": "the best", "Author": "Greg", "ReviewID": "R33M00T83AB4AT", "Overall": "5.0", "Content": "Great display, lots of features need time to process all the features.Was going to purchase a cheaper version but changed my mind. The display is a perfect size for my old eyes!Samsung has always been the best choice for me,never disappointed.", "Date": "June 5, 2014"}, {"Title": "Misleading Product Description", "Author": "Tracie E.", "ReviewID": "R8OE04S4MWUV8", "Overall": "3.0", "Content": "The tablet itself I totally love. I purchased this model as it was a lot like my Galaxy phone, and the controls are about the same. Also comes with KitKat OS which was a plus. Only comes with 16GB of memory, so if that's a big deal for you, you may want to spend the extra $50 to upgrade to the 32GB.My only gripe is that in the product description, Amazon made it sound like a lot of perks came with it. Such as a $25 Google Play Credit, Hulu Plus, and GoGo Inflight Wifi.  This greatly influenced my decision to purchase this model, as it made it sound like an even better deal. Sadly, it did not come with these perks. You could only get them from signing up with Samsung Perks, and even then Samsung did not offer them.So I would say the tablet is great, but don't let the product description fool you or influence your choice.", "Date": "June 5, 2014"}, {"Title": "Not entirely multilanguage", "Author": "Cyrius Almeida", "ReviewID": "R2C3Y3I9CIALM1", "Overall": "4.0", "Content": "i love the tablet and all but i thought it was multilanguage. as i turned it on, i noticed that it didnt have brazilian portuguese as a display language. i hope samsung fixes that in a near future so my wife can be happier with it :)", "Date": "June 4, 2014"}, {"Title": "So far so good!", "Author": "Paige", "ReviewID": "RL18TMN3Z8VJC", "Overall": "5.0", "Content": "This is by far the best tablet I have used! Functions are great and so nice to have. There is an option to take a screenshot by swiping the side of your hand over the screen and other smart screen functions. The find my Galaxy Tab feature is a huge bonus and such a nice feature! It is super fast and responsive. Definitely a quality product!", "Date": "June 1, 2014"}, {"Title": "Great Tab", "Author": "AKK \"AKK\"", "ReviewID": "RA5JQ2TB2FD2G", "Overall": "5.0", "Content": "this is a very very fast tab, impressive response with KitKat.amazing screen.good memory ( 2GB )sound is OKgreat for reading", "Date": "May 31, 2014"}, {"Title": "This is a good tablet", "Author": "Doug Elfman", "ReviewID": "RAPVXC8E133Q8", "Overall": "5.0", "Content": "This is a good tablet. I do most of my work on it, instead of on a PC or Mac. For a while, I preferred the 2013 Nexus 7 to this tablet, actually, but with time, I've come to see the 8.4 is just more amazinger. The best screen. The best multitasking work stuff. Quick. Good battery. The only thing this tablet suffers is lack of support for Android Runtime (ART). I put Android Runtime on my other tablets and it makes them faster than this 8.4. I have asked a Samsung representative online if the company will push out an Android Runtime update, but I was basically told not to hold my breath. Too bad. Because when the Google 8 inch tablet comes out in third or fourth quarter, I'll probably buy it and sell this awesome 8.4, because, I mean, to run Android without ART is shooting yourself in the foot.", "Date": "May 31, 2014"}, {"Title": "LOVE IT!", "Author": "Gina", "ReviewID": "R2JPS0GLBR49S0", "Overall": "4.0", "Content": "This device is great! I originally bought the Kindle Fire HDX 8.9 which I returned for this device. This works perfectly and the operating system is GREAT. IT also syncs up with my phone with NO problems! It's wonderful.Battery lasts much longer than the specs say at 6 hours, at least with casual use. Not sure yet how it runs with continued use for 6 hours.the ONLY reason it didn't get a 5 star is because I wish it was about a .5\" bigger. The Kindle I had was 8.9\" and surprisingly that half inch makes a difference.Either way I love the product and I'm so glad I bought it!  I also love that I can add memory if I ever need it.", "Date": "March 12, 2014"}, {"Title": "Power in a small package", "Author": "Zayeir Bent", "ReviewID": "RXE0OSTR6OIQG", "Overall": "5.0", "Content": "I've been shopping for a tablet for quite some time until i caught wind of this from a friend. Being in the military, this is a great tablet to have while out at sea. Overall, this one of the most powerful tablets in its size on the market. The micro SD slot makes up for the lack storage and the resolution boost is  much appreciated.  This is a great buy for android users or anyone looking to pick up a powerful tablet however, the price point may turn consumers off who are looking at similar sized tablets.Pros: Resolution, Micro SDCons: Price for some, Unnecessary Apps is turn off.", "Date": "March 11, 2014"}, {"Title": "BEAST resolution", "Author": "Kevin Vo", "ReviewID": "R27ED03EFCS4XD", "Overall": "5.0", "Content": "This is the best tablets I have seen so far. I got the ipad mini retina, but the color and the screen is not so great as this tablet is. Performance is fast even though the Touchwiz is still a bit laggy. Try it and enjoy the resolution of the tablet", "Date": "March 11, 2014"}, {"Title": "Samsung Galaxy Tab Pro 8.4", "Author": "Glen", "ReviewID": "RJEW5AR4L59UQ", "Overall": "5.0", "Content": "Number 1  tablet in the world. It has metallic edges now, very nice look and fast performance. So far, I have not encountered any freezing problems at all. This was meant to upgraded and replaced my old Nexus 7, and it did.", "Date": "April 14, 2014"}, {"Title": "Favorite tablet", "Author": "Paul", "ReviewID": "R2SVE2T8Q482KG", "Overall": "5.0", "Content": "I must say this being my first tablet has set the bar very high on the competition because all I can say is this tab pro 8.4 is awesome", "Date": "February 25, 2014"}, {"Title": "Great Buy", "Author": "Sharon", "ReviewID": "RBZP1B77XFXUA", "Overall": "5.0", "Content": "Lots of bells and whistles...Can't wait to do more surfing and get more use...Glad I decided to buy...I'm enjoying my purchase!", "Date": "May 19, 2014"}, {"Title": "Perfect companion to Samsung Galaxy S4 phone", "Author": "James", "ReviewID": "R1OZZF6WHVKBAN", "Overall": "5.0", "Content": "Pros: Good size tablet; fantastic image. Easy to set up, especially if you're comfortable with Android.Perfect companion to Samsung Galaxy S4 phone. Apps purchased through Amazon and Google Play don't have to be bought twice.Cons: WiFi reception is a little weak; dropped connection that was steady on S4. No other complaints.Overall: Highly recommended.", "Date": "May 19, 2014"}, {"Title": "fun", "Author": "Charles Dunnewind", "ReviewID": "R1I59WGL1V04GG", "Overall": "4.0", "Content": "Works well and does what I thought it would do. Size is good. Easy to use and understand. Battery runs out with some use, sooner that a ereader", "Date": "May 18, 2014"}, {"Title": "just plainly love it", "Author": "Snakeyees", "ReviewID": "R1IVTLDV7K16CJ", "Overall": "5.0", "Content": "the screen is so clear it's beautiful, everything I throw at it applications it runs flawlessly no lag very happy just wish I could afford is a bigger screen", "Date": "May 11, 2014"}, {"Title": "excellent device", "Author": "Guillermo Ascanio", "ReviewID": "RZLUD6YSFIEKJ", "Overall": "4.0", "Content": "I thought this tablet had an option for 3g it doesn't but still is a very good device. I fully recommend it.", "Date": "May 4, 2014"}, {"Title": "Tab Pro 8.4", "Author": "c®c_31", "ReviewID": "R4N4K9SI0IHWH", "Overall": "5.0", "Content": "I really loved my Tab Pro 8.4 since the day I got it from our local supplier.Stunning screen display.Highly Recommended buy!", "Date": "May 1, 2014"}, {"Title": "Love it. !!!", "Author": "Mafalda Quinn", "ReviewID": "R3R5YCYMV6QJA0", "Overall": "5.0", "Content": "I have an 8\" galaxy note, and this one is an improved version, fast, glorious screen, decent camera. I only miss the stylus.  Very happy with it.  And i know that if they come with a new Note version  of this Pro, will get it too..", "Date": "April 29, 2014"}, {"Title": "Just Right", "Author": "aqualeo", "ReviewID": "RVFM67N1UCEJV", "Overall": "5.0", "Content": "This has everything I wanted in my new tablet.  Not too big nor too small, the size is perfect for me.  I also like that Samsung has its own store for purchasing apps.  I'm very happy with my purchase.", "Date": "April 27, 2014"}, {"Title": "Amazing Tablet!", "Author": "C. Stence", "ReviewID": "RMV5R1MJATDTC", "Overall": "5.0", "Content": "I did a lot of research before buying a tablet - I settled on this despite the somewhat \"higher\" price compared to what's out there. TOTALLY WORTH IT! The interface is beautiful, intuitive and smooth as silk right out of the box. The Samsung \"skin\" doesn't appear to slow things down at all and is quite helpful. It also doesn't limit usage of standard Android features or access to Google Play. In fact, it seems like all the added perks and bonus that Samsung added are outstanding! I still haven't finished finding all the goodies that Samsung has added to this perfectly sized tablet. Way to go Samsung!", "Date": "April 22, 2014"}, {"Title": "So far so good", "Author": "scott collins", "ReviewID": "RX7PUUROFCKFK", "Overall": "4.0", "Content": "I am pleased with this product so far. The speed is good. The apps work well so far. I love the remote pc app.", "Date": "April 20, 2014"}, {"Title": "Galaxy 8.4 is awesome!", "Author": "Craig Durrell", "ReviewID": "R2YZ6UH4T2NBTM", "Overall": "5.0", "Content": "The screen is amazing!  In the brightest sunlight,  it's beautiful and easily readable.Gaming is pushed to new levels of speed thanks to the Snap Dragon processor.When used in the panoramic mode my right hand covers the two speakers sometimes.  I hope the next new model places them in a front facing location.The 8.4 Galaxy Tab is well made, useful for hours (9+), and I am very pleased overall.The informational booklet is worthless however.  Fortunately Youtube is your friend and that's where I learned most of it's operation.", "Date": "March 30, 2014"}, {"Title": "AWESOME!!!", "Author": "S. Curtis \"Peek lover\"", "ReviewID": "R2QBMMO6H60X2", "Overall": "5.0", "Content": "Samsung never lets me down and hasn't started yet. There is a learning curve, but the display is AWESOME!!! Also can't figure out how to make the weather icon smaller, it's like half the screen but I'll figure it out.", "Date": "March 29, 2014"}, {"Title": "First Impressions", "Author": "Molly", "ReviewID": "R7BSK15D5SGFP", "Overall": "5.0", "Content": "I really like this tablet. The display is bright, and the text is sharp. It is a nice device for older folks, because Samsung software has a user friendly feel. You can customize the setting with ease.I don't want to come out with a list of negatives. I am just wonder where are the good quality cases for this device like the \"Snugg\".", "Date": "March 11, 2014"}, {"Title": "My first tablet", "Author": "Bottleofwhat", "ReviewID": "R1YZKTTDTAGRQ1", "Overall": "5.0", "Content": "And I am satisfied with my purchase. The main factor that decided my purchase was the fact that this is the latest and best in the tablet arena. Although there are obviously lower price points to jump into the tablet game, the Tab 8.4 feels like premium hardware at a time where most other tablets are nearing their end of life cycles.Observations: The multitasking is great although still hiccups at times, hoping a software update or android development smooths it out.Samsung also needs to come out with better protective cases for their premium devices at time of launch, what is currently out there is lackluster.", "Date": "March 11, 2014"}, {"Title": "Great product, but slightly pricey", "Author": "C. Suan", "ReviewID": "R1KIZPSVLPN3IQ", "Overall": "4.0", "Content": "This is my second tablet, 1st one was ASUS TF300t, but spoil by my kid after dropping from staircase.After using for a month, below is my summarize:Battery performance:The full charge battery is sufficient for my daily activity, I average spends 3hrs reading & surfing, while 2hrs for gaming. It usually drop to 20-30% before sleep and i left it charge for overnight. Once I encounter the battery indicator stagnated at 100% after 5hrs usage, but after reset, the indicator back alive. Another incidence was the battery didn't get full charge, it always goes saturated after 61%. After refix my 2 pins power plug from wall, the problem resolved, suspect due to bad contact.WIFI signalThe signal sense is strong. Even i get 1 bar of signal, it still load webpage faster than my old TF300t. But for Splashtop (i use it to remote my desktop), not sure why the display will hang after 30sec but sound still continue, I don't face that issue with my old tablet.Graphic, display, Sound & CameraThe high ppi make the 8.4\" display clearer. It out perform my old 10\" tablet. There is some lagging on Dragon Age game, not sure is that cause by graphic limitation or CPU performance issue. Sound quality is average. The camera quality is below average.", "Date": "May 7, 2014"}, {"Title": "couldn't be happier", "Author": "R. Kaur \"Sheena\"", "ReviewID": "R28C9GRX9NV8GW", "Overall": "5.0", "Content": "My brother got this tab, and he loved it so much that he even changed his iPhone to a samsung galaxy. The tab is very light and much more useful compared to an iPad.", "Date": "May 3, 2014"}, {"Title": "WIFI issues", "Author": "R1", "ReviewID": "R230X9ZDYE15AH", "Overall": "3.0", "Content": "The first thing I noticed is the WIFI seems to have problems staying connected.  We have other Smart Phones and tablets that have no issues staying connected to the same networks.  You can search the net and find others that have also noticed this.  Question is, is this a hardware issue or something that can be fixed by a software push.", "Date": "April 13, 2014"}, {"Title": "Buy It Buy It Buy It!!!!!!", "Author": "Mallory Olsen", "ReviewID": "R2W1E6ZM469XD7", "Overall": "5.0", "Content": "Love it!  Gorgeous piece of tech. Light weight, sturdy, fast response, brilliant screen (even at half brightness).  I'm a musician, I use my tablet for work and play.", "Date": "April 4, 2014"}, {"Title": "Not as small as I thought", "Author": "My Fake Name", "ReviewID": "R2GBQ9CGC2J9ZV", "Overall": "5.0", "Content": "*****I had gotten used to an Android 10.1-inch tablet when this product arrived, the Samsung Galaxy Tab Pro 8.4-Inch Tablet (Black).  I assumed I would be disappointed by the smaller size, which according to my simple math is 16.83% smaller.  Although that's a considerable difference in sheer screen size, it seems to be made up for by the extreme clarity and brightness of the display.There are many times I need to zoom in and back out using the product under review, but that was the case no less often with the 10.1-inch model.The Tab Pro 8.4 can be held portrait-wise in most people's hands.  My 10.1-incher can be so only just barely and then only if you have larger than average sized hands and only then if you take a break every so often.  The 8.4-incher can fit in more places such as pockets in clothing or pockets in a handbag than the 10.1-incher, i.e., it is more portable.For this, compared to my only other tablet, I add one star to five.You will probably want to add a micro SD card, which can range up to 128 gigabytes.  The unit comes with 16 gigabytes of internal memory, of which maybe 11 are free, which isn't a lot.  If you don't intend to add many apps or music or photos or any other space-hogging things, then maybe 11 gigs are enough for you, in which case ignore the first sentence of this paragraph.  You don't have to decide right away; just keep an eye on how much free space you have in internal memory, and if it gets too small then buy an SD card.  If Moore's Law is correct, and it has been for quite some time, the longer you wait to buy storage space such as a micro SD card the cheaper it will be.*****The device does not, repeat not, have a telephone in it.  If you say to it, \"Call work\" or \"Dial work\" or \"Call [ . . . ]\" (not my real work number) it completely and totally ignores you.  I mean 100%.  No flashing light, no confirming beeps, no matter how plainly you speak and no matter how directly into the microphone.  Even if you shout, which disturbs people sleeping nearby, for which I subtract one star from six.  There is no keyboardly way to make an outgoing call either.  I swear.  As to incoming phone calls I have never received any whatsoever that I know of.  Sometimes I think maybe I received one and I shout at the tablet, \"Accept\" or \"Answer\" but nothing ever happens.  Based on this evidence I conclude the Samsung Galaxy Tab Pro 8.4-Inch Tablet (Black) really does not have a telephone in it.  The evolution of some smartphones' getting bigger and some tablets' getting smaller will surely eventually intersect in a perfect size or two, and I think it will be just about around this size.  A fully operational tablet with a telephone in it is what I want.*****The product under review underwent unusual tests at my hand I thought you'd want to know about.  First, it will not survive a drop onto concrete from a height of two smoots; thereafter it did not start.  Second, it will not withstand being left out in my back yard in the rain and snow for a winter; thereafter it did not start.  Third, it will not tolerate being attacked dead center by a .22-caliber rifle round and then by a 20-pound sledge hammer; thereafter it did not start.Still, I find this to be a wholly satisfactory tablet, not as small as I thought it would be, if you remember what I mean.  The sum total after adding and subtracting various stars is five.  The product delivers what it says it will, and if the size is right for you then you should buy it.*****", "Date": "March 22, 2014"}, {"Title": "Galaxy Tab Pro 8.4 a Winner", "Author": "Bill", "ReviewID": "R17XJED3EQ033G", "Overall": "5.0", "Content": "This is a fantastic device and rates 5 stars.  I highly recommend it.  The only thing I can't do with it is make a phone call, which is just fine.  It is light weight and very powerful.  This is a must have device.", "Date": "May 27, 2014"}, {"Title": "tab pro 8.4 is a beast", "Author": "Rob", "ReviewID": "RRB7QLRGQ5ZH1", "Overall": "5.0", "Content": "This is the most amazing tablet I've ever owned. It is fast and it feels great in the hand. The size I think is perfect, portable yet productive. 3 thumbs up.", "Date": "April 23, 2014"}, {"Title": "Love it, Love it, Love it", "Author": "Albert Tuten", "ReviewID": "R2YPA5BELEFAL9", "Overall": "5.0", "Content": "Those were the words my wife said to me as I gave her birthday present a little early.  It does more than she will ever learn to do.  I love it too, when she lets me get my hands on it.  I've held it twice in 45 days.  Great job Samsung!!", "Date": "April 18, 2014"}, {"Title": "Amazing Device", "Author": "Bader alqahtani", "ReviewID": "R36W7UVCJ571Z3", "Overall": "5.0", "Content": "I can said this tab it is the best tab ever i have used itQuality of the material it is excellent", "Date": "April 5, 2014"}, {"Title": "I really wanted to love this, but...", "Author": "J. Robinson", "ReviewID": "R4HV3WFCCA3CO", "Overall": "3.0", "Content": "I can't get over the fact that Google has made it so that Flash no longer works with Kit Kat. I've tried several workarounds, but none seems to consistently work.Maybe it's not fair to lower the rating of the tablet for Google's doings, but...I REALLY wanted to love this over the Kindle Fire HDX 8.9, but I'm finding the HDX more to my liking. I've side-loaded Flash and the Dolphin browser on the HDX and the combination works fast and fine.Update: 04-27-14The tablet has been returned. Having a tablet that won't allow me to access flash just doesn't work for me. If this is the track Google is going to take with Android, then I just will have to stick with my Galaxy Tab 3 8.0 inch tablet for the foreseeable future. I might even consider switching to another platform if flash is available and the battery-life is comparable.", "Date": "April 22, 2014"}, {"Title": "great tablet. great screen size. great performance.", "Author": "Torture", "ReviewID": "R18XNMY26HWAZI", "Overall": "5.0", "Content": "Amazing tablet.The screen resolution is just out of this world.You just need to use a loader to get rid of samsung's customizations. They kill the performance.", "Date": "April 28, 2014"}, {"Title": "Great tablet", "Author": "Amazon Customer", "ReviewID": "R9OUGTTU8UJIU", "Overall": "5.0", "Content": "Has met or exceeded all my expectations about form, function, design, performance, you name it.Have used it extensively for several days and have yet to find a weakness. Love it!", "Date": "March 17, 2014"}, {"Title": "Great Device, but...", "Author": "Tim Oien", "ReviewID": "R2K6E9TR110AG0", "Overall": "4.0", "Content": "For $400 I thought there would be NOTHING wrong with the tablet. The screen is GREAT!!!! Like the size right between a 10 inch and 7 inch. But for $400 the screen is a little unreceptive and the device is hard to hold by itself without a case. Just got my case today so over the weekend was a little pain to use.", "Date": "March 11, 2014"}, {"Title": "Crippled by a simple missing feature", "Author": "rich campoamor", "ReviewID": "R10ZMX0KVJ3DAP", "Overall": "1.0", "Content": "I bought this as a replacement for my Nexus 7.  I quickly found out that Samsung has crippled the device by not implementing the feature to automatically update the date and time from the network.  This feature is on every other KitKat-based Android device.  Not implementing this feature causes problems with some apps (like Twitter) and also means that the user has to manually update the date and time on the device when they travel.  This seems like a curious decision on a device that Samsung is pitching as a 'Pro' or business oriented device.I have contacted Samsung support via their web site, Twitter, Google+, Facebook and other channels and they refuse to even acknowledge that there is a problem.  They have no answer when I point out that the missing feature is referenced in the product documentation, but doesn't exist in the Settings section of the device.Not allowing users to disable the ugly 'Magazine' interface is also a big negative.  This is easy to 'fix' by downloading Nova Launcher.  Nova allows you to avoid the ugly TouchWiz interface and Magazine but still use the multi-app functionality of the device - well worth the couple of dollars Nova costs in the play store.I find I continue to use my Nexus 7 rather than the Samsung because it doesn't support the software and features that I need.  I wish I could return it as it has turned out to be a VERY EXPENSIVE mistake.  Samsung's lazy/ineffective support has moved me from a strong advocate of Samsung tablets to a vocal advocate of alternatives.", "Date": "April 5, 2014"}, {"Title": "love it", "Author": "C. Layburn", "ReviewID": "R1GQX5APXC2L54", "Overall": "4.0", "Content": "Convenient and easy to use. Good price. Only wish on/off and volume button were easier to access while in case.", "Date": "April 21, 2014"}, {"Title": "Tab pro 8.4", "Author": "Richard", "ReviewID": "R1W3OOMH4YCSG2", "Overall": "3.0", "Content": "I like my kindle fire hdx 7 much much better. Better speakers and better picture. Go with kindle. Very confusing and it's filled with a bunch of bloat ware.", "Date": "May 21, 2014"}, {"Title": "Horrible speakers", "Author": "Fozborn", "ReviewID": "R2ZRN0JW8NPMUA", "Overall": "1.0", "Content": "Great tablet but horrible speakers.As others have said the speakers crackle when the volume is muted and using an app that would normally play audio. It could be as simple as the unlock swipe if it is muted.To check, turn media volume down, open YouTube or something that would play audio like a game, and listen. If you don't hear it you are either lucky or try it in a quiet room, ghold the speakers up to your ears.I have had this problem with 4 separate tablets all the 8.4. Some white, one black. They all have the problem. I have reported it to Samsung each time and I know from forums that others have as well. However, Samsung denies that there is a problem, or that it has been reported.Fix the issue Samsung!", "Date": "March 19, 2014"}, {"Title": "Best tablet yet..", "Author": "BigDan", "ReviewID": "R3QNK5H5TJYYNP", "Overall": "3.0", "Content": "The tablet was wonderful very easy to read bright screen and super fast. The only problem I had was it went from 99% to 75% off in 7h and that was everything off nothing running in the background. I then tried to test a youtube video that just after 17min it drained 11%. The worst I had was after a 2h movie it would drain maybe at the most 25%.So since they don't have any instock I have to wait till maybe late March to try again.", "Date": "February 21, 2014"}, {"Title": "Far from the best", "Author": "Amazon Customer", "ReviewID": "RIM1ZDTQIP8PE", "Overall": "4.0", "Content": "Ok. Samsung makes great products we already know that. But why keep the capacitive and big physical buttons on the bottom of the tablet.  What a major headache holding this thing.  Im always hitting one of the 3 buttons and closing the screen, etc. And its even twice as bad using it in landscape.  I returned mine for this reason.  I then purchased the lg gpad. They did the buttons right.  Virtual on the screen.  And you can change the order of these because it is done in software.  So much better than the samsung.  Before you purchase this unit try the gpad.  Its so much better to hold. And feels better in the hand.", "Date": "May 3, 2014"}, {"Title": "Not Recommended to buy", "Author": "satishchandrakolli", "ReviewID": "R1GCGDWPB7QFEF", "Overall": "2.0", "Content": "Display and performance are really GoodBattery is the worst ...Android and Samsung need to improve how to maintain long battery", "Date": "April 29, 2014"}, {"Title": "Not what I expected given what was promised", "Author": "B Klemz", "ReviewID": "R3TNWHTGKYVJ4Y", "Overall": "2.0", "Content": "I bought this expecting a lot and that may have been the problem. It is an Android tablet with lots of upgrades and Samsung promised all sorts of things that it just didn't deliver. Based on their website and write-up on Amazon, I expected...I expected a super screen, I got a clear but unexciting screen (really no better than the normal resolution screens on other tablets and NOT better that the Retina display on the Apples). I expected super high performance, I got a slow or no better than the normal Android tablet performance (games were a misery). I expected easy setup, but it took 7 hours and was repetitive (it asked for my email 8 times before I stopped counting). I expected all the included apps to work as described, they did not (their Cloud is a real monster to set up and if you have an Apple device you will be really angry at how poorly it works). I expected solid linkage with my iTunes music library and I got nothing of the sort, I could not get my music on this device in any usable format. I expected seamless function with streaming video sources like Netflix and I could not for the life of me get the included Netflix app to work and I could not delete it and download the newest version directly from Netflix (I have no idea how well Hulu works, I gave up after all of this).On the plus side it is well made, it boots quickly and surfs the web easily. Their onscreen \"keyboard\" is wonderful and the default browser is Google's Chrome and I like that, but for well over $360 (tablet and 32GB micro SD) I was really disappointed. So, I called Amazon and they took it back.I really like Amazon's policies in this regard. If you buy something and it 1) doesn't work or 2) it doesn't work as described, they take it back no hassles. Once I mailed it back I bought another tablet, an ASUS MeMo for around $140 (with case no less). The kids have one already and I have to say theirs works as well as the Samsung Tab Pro 8.4 for 1/3 the price.Oh well, you don't always get what you pay for. Lesson learned (yet again).", "Date": "April 27, 2014"}, {"Title": "Caveat Emptor", "Author": "Amazon Customer", "ReviewID": "R2CNBKFTCYPYHL", "Overall": "1.0", "Content": "Love the tablet but not Amazon.  I will admit it is my fault for not doing more research or research in the right direction.Amazon has not released an app to play Prime videos on Android devices.  How hard can it be to program one since their FireOS is a subset of the Android OS?  And no, I should not have purchased a Fire as we already have one.  The Samsung fits other needs/requirements.  Prime at $99 a year is no longer worth it.", "Date": "May 3, 2014"}, {"Title": "i cant connect to internet( problem resolved)", "Author": "allan", "ReviewID": "R1GJVW0VJNP860", "Overall": "4.0", "Content": "I got the device yesterday it was delayed it supposed to arrive two daysBut it takes 8 days. It looks like it was an open box it doesnt arrive with a sumsung seal it was tape on both end. and now i cant somehow connect to the internet if i cant fix this ill return it. Its disappointing.UpdateIm loving this device now the only problemIs the device storage 16gb is never enoughIf your a heavy user like downloading apps. Even though it has a mmc expansion sometimes appsDoes not store on it.", "Date": "March 18, 2014"}, {"Title": "NOT SATISFIED", "Author": "VENKATA UDAYAGIRI", "ReviewID": "R2318XHOVEVZXK", "Overall": "1.0", "Content": "HANGS OUT OFTEN, MY DOCUMENTS ARE NOT OPENING, CAMERA IN THE NIGHT IS NOT GOOD, IRRITATES A LOT, MAY BECAUSE I AM USED TO APPLE PRODUCTS I FEEL SO.", "Date": "April 15, 2014"}, {"Title": "For some this might be just fine. For me this is useless. I'm spoiled by my Note 2.", "Author": "S. McAllister", "ReviewID": "R7R3PNDJP5N5A", "Overall": "1.0", "Content": "This is a vary powerful device that has been locked down so hard that compared to a laptop or a smartphone it is a good door stop.What I recommend is to get the best and largest screen smartphone that you are happy with. The smartphone is 100 time more useful than this tablet.", "Date": "March 23, 2014"}], "ProductInfo": {"Price": "$399.99", "Features": "Android 4.4 Kit Kat OS, 2.3 GHz Qualcomm Snapdragon 800 quad-core processor\n16 GB Flash Memory, 2 GB RAM Memory\nCamera: 8MP Rear + 2MP Front\nDisplay Resolution: WQXGA (2560 x 1600)\nEnjoy over $800 of premium apps and services.  $25 Google Play credit, 1 year of Gogo In-flight Wi-Fi® (up to 36  flights), 50GB Dropbox space for 2 years, and much more", "Name": "Samsung Galaxy Tab Pro 8.4-Inch Tablet (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41mZxllIVdL._SY300_.jpg", "ProductID": "B00HWMPRKM"}}