{"Reviews": [{"Title": "Not a true yoga (updated 1/30/2014)", "Author": "E. Swope", "ReviewID": "R2JWLPCKVKN2GQ", "Overall": "4.0", "Content": "I bought this tablet for a few reasons:1: Size  I was having difficulty reading text on my 7\" kindle HD (on home screen where it can not be adjusted).I have several tablets (an Archos 5, Archos 70b Internet 7-Inch Tablet (8GB) and Archos 101 G9 16GB - Turbo. The batteries on the 5 & 70 died the same week :( and need to be shipped to France to fix.  The 101 is working, and I LOVE it, but it is huge and weighty, not good for carrying (in my purse) for day to day use.  I use that one at home, and when we travel (great for watching videos on a plane).2: Form factorLong story short, I decided my next tablet would be an 8 inch.. but there are currently not a lot to choose from.. When Amazon sold out of the Archos 80 Titanium HD 8\" Capacitive Multitouch Android Tablet I looked at the other (few) 8\" tablets available: The Archos, this, the Samsung Samsung Galaxy Tab 3 (8-Inch, White) one or 2 others... (more are being introduced or are out now).I did not like the form factor on the Samsung and thought it a little expensive for what it gave you. I had seen the yoga 10 (or 11?) at best buy, and really did like the form factor, thought the aluminum screen cover was a great solution, protecting it enough that I could put it in a purse or briefcase and not worry about damage.*The Yoga 8 does not have this. It does not look like any of the other Yogas, and I did not know that when I purchased it.  The pictures and animated promotional videos are somewhat deceptive.  It has a small fold out kick stand, but no cover.3: technical specs.  I wanted a better screen and faster processor (why buy a tablet when I have 4 if I am not upgrading?)The yoga gets middling reviews for both (in the multitude of reviews I read off site).My experience with the tablet is that it was faster than I was led to believe from the reviews I saw, definitely an upgrade. (not as fast as the Kindle Fire HDX 7\", HDX Display, Wi-Fi, 16 GB - Includes Special Offers which I returned (in part) because of screen size- and sadly the 8.9 is out of my budget.The Yoga is a responsive tablet, good and fast.. not the best of the current crop, but more than sufficient. (I did not notice any lag or flicker..it just is not instant like the hdx).  It does have a quad core processor and so is faster than much of what you will find in this price range (the Kindle fire hdx and Lexus 7 being notable exceptions, but those are both 7\" tablets and I am looking for a larger display).Display is where it falls down a bit more. It is not a high res, screen. Pictures... were not as crisp or colors as true as on any of my other tablets (to include the one 4 generations back from Archos! (1240 x 800 is about the lowest resolution you will find on current tablets in this price range.  It is fine for text, less desirable for media.)I actually thought I could live with the compromise, sacrifice some power and resolution for expandability (sd card slot) and the unique form factor which made it easier to carry, *BUT* this \"yoga\" does not have that.The screen is very thin, backed with aluminum, nice build quality.The weird looking bulge does make it easier to hold, and stores a bank of long life batteries (the reason most people buy this tablet... the 18 hour battery life).  That *is* nice, and singular to this tablet, but is not one of my priorities.*It also does something really strange, which I have not seen anyone comment on yet in reviews: It vibrates like a joy buzzer when you turn it in it off.  I did not like that, at all. (It is like the vibration ring or alarm on a cell phone).5: Access. You can buy/ download apps from any of a number of sites, including Amazon and the Google play store.For myself, given that I did not get what I was expecting to from the tablet (the Yoga form factor) there was no reason to accept a trade off in processor speed or screen resolution.  I was happy enough with the speed, but would like a better display.I am still on the hunt as it were, have tried/ tested several tablets and am now looking at some of the larger (9-10\") to see if there is one light and thin enough that I am wiling to carry it on a day to day basis.I think I need to look at the ASUS MeMO Pad 8 16GB Tablet (ME180A-A1-WH) White and Toshiba Encore WT8-A32 8-Inch 32 GB Tablet as well.SummaryThis one is packed up to be returned because1: The form factor is not what I thought, no screen cover, just a kick stand.2: The display is not as nice as many current tablets in this price range.3: The processor is not as fast as some of the newer tablets.While I was happy enough with the speed. In the $200-250 range there are faster tablets with better displays.battery life:  It is unique among all the tablets I have looked at (more or less everything on the market) in that it has an 18 hour battery life.If that is high on your priority list this is the one to get. No one else comes anywhere near that. But, you are trading off weight, a slim form factor, both speed and display resolution to get it.Sound: This is an area where  it gets good reviews, but my personal experience is that it is pretty average (note; I put a premium on sound so my other tablets have been selected with that as a priority.) The sound actually is not as good as my Kindle, or any of the Archos tablets (but then, Archos started life as a media player, and Amazon has optimized the Kindle for same). It also does not offer as many codecs as Archos. This will not be limiting for many people, but will for some . (I am married to a recording artist who likes uncompressed files and I have come to appreciate the improved sound quality vs. mp3).Software/ android skin:  This is not something a lot of people think about when purchasing hardware but is a critical issue for me, and why I returned several tablets.  As a medical provider I can not carry a tablet which pulls my calendar and contact information or which does not allow the installation of secure programs.  This tablet is better than many in that regard, but again, not the best.  (Note, this a big issue I have with Google branded tabets. They are so bad with respect to privacy that it is absolutely out of the question for me to look at a Nexus, and why I returned the Nook HD+.)  There is not a lot of bloatware and you can edit to remove programs you don't want but it does not add a lot of functionality. It does not impose restrictions on the android environment or limit what you can install. It is not as open as Archo's environment (which allows you to install virtually any OS or partition and multi-boot on their larger tablets, like the 5/ 500G).In sum, it is a well built tablet with a fast processor. The display is middling and the sound better than average (but not as good as  some).You can expand via sd card slot, and it offers the option to encrypt your tablet as a security feature (and I nice one, which I will look for on other tablets as I continue my search).I'd rate it5 stars for build3 for display4 for processor speed5+ for battery life4 for sound4 for software/ android skin.2-3 for form factor (not what I thought it was, *or* like any of the other yoga or flex tablets.Bonuses include expandability, control, open access.Apologies for all the parenthetical remarks and perhaps a somewhat longer than ideal review. I edited to include information that I consider when I shop, realizing that everyone has different priorities.  Some people might be OK with things I nixed a tablet for or  conversely not be able to live with compromises I am willing to make.Hopefully the added information is more of a benefit than hindrance.", "Date": "January 16, 2014"}, {"Title": "Good value for money with few trade offs", "Author": "space case", "ReviewID": "R31GKIWQVY0343", "Overall": "5.0", "Content": "I had to exchange the first one I got because it seemed the firmware got corrupted for some reason and wouldn’t boot up after using a few days. I give this 5 stars because of value. I own mini ipad retina and Nexus 7. The display is sharp enough for anything and not sure what all the complaints are about and yes, Nexus and Apple retina might be sharper but that is where it ends for them. The Apple does not have the apps that Android has due to the restricted nature and Apple control over everything you can install on its devices, basically it censors everything except what it wants to be on the device. Battery life ok on mini ipad and it is thin. The Nexus 7 display may be sharper but every time I pick it up the battery is dead and the battery runs down fast if looking at videos or doing anything on it that uses blu tooth and wifi. So a sharper screen is worthless if  the device is always dead. I run wifi blu tooth and watch videos a lot and the Yoga 8 beats all of them and I can stream audio and video for hours and battery life still good. After owning several devices I conclude that power is the most important to me because without power nothing else matters. Its been days since I plugged it in and whenever I pick it up it still has most of the charge left. If not using it then it might lose 1-2% a day which is substantially better than Nexus or Apple. It runs all the Android applications without problem. It supports lots of video and audio formats. Of course the built in stand is a valuable addition as I can stand it up in bed or desk and watch movies or listen to music and is the only tablet I know of with speakers in front, at least for 7-8” devices. I also like the fact that is super thin and light and the bulge for the battery and stand doesn’t bother me and a Brookstone case for $10 fits the Yoga 8 perfectly. I can also read the fine print on web pages which I couldn’t do on the first gen Apple ipad mini. The device accepts micro sim cards up to 32 gig which I already had so I essentially got a 48 gig tablet for $200. For Nexus there is no memory card slot, same with Apple of course. Adding pictures and video is easy and I can do wireless transfer or wired to computer and you can just copy the video and photos over, unlike Apple in which you have to use itunes and then it converts it to their format then backs up the photos to your hard drive in a format you can’t look at. To conclude there is no one tablet that is perfect in everything so the best one is whatever the user finds to have priority over and there could be lots would rather have a little sharper display or slightly faster processor with the sacrifice of battery life, not me though.", "Date": "February 3, 2014"}, {"Title": "Unique Tablet", "Author": "nuismer", "ReviewID": "RIV6380QWCYN", "Overall": "5.0", "Content": "This tablet is unique. It's form factor sets it apart from any other tablet I have, and it has the best battery life of any of them.  It's light, fast, and well made.  The more you use it, the better you like it.  It has lots of little features that I really like.  In my opinion the Lenovo overlay on top of Android 4.2.2 is better than the stock Android.  There is no  “ All Apps icon”.  Only unlimited Home Screens and the lowest row is persistent.  You have the freedom to move any App icon anywhere without duplication.  What I can’t find is any way to sort the icons.PROS:Outstanding Battery Life - Almost 17 hours for Web browsing and Video Playback.Construction - Good, feels solid. Nice aluminum frame and kickstand.Screen - Bright and high resolution.Cameras - Front and back with lots of features.Speakers - Front facing with good quality and volume (for a tablet)Documentation - It has a good Feature Guide and User Guide built-in.Handling - Lenovo makes a lot about this but I don't feel that it is easier to hold.  I find it better to hold in portrait mode and harder in landscape mode.Expandability - This is the only tablet that I know of that will actually store and run Apps from the External SD card.  Settings - Storage - Default WRITE DISK gives you the choice of \"Internal Storage or SD Card\".  And \"Move to SD Card\" actually does move the App to the External SD Card.  With 16GB of Internal Memory I don't know why you would need this, but it is there.Nice Touches - The white LED on the ON/Off switch is on during charge and off when charged.  And flashes when in sleep mode and a Notification happens.CONS:Price - High for a 8\" tablet.Ports - No HDMI or Miracast settings.Android - It has 4.2.2 but no settings for Multiple Users.Here are the battery run times from the calibration with \"Battery HD\" App:Music Playback - 33 hrs, 32 min. (average - would not calibrate)Video Playback - 16 hrs, 40 min.Internet Browsing - 16 hrs, 40 min.Talk Time (VoIP) - 12 hrs, 31 min.Overall, I like this tablet and recommend it.", "Date": "February 26, 2014"}, {"Title": "Awesome tablet", "Author": "CIO2011", "ReviewID": "R3W1C7BIBKSWXB", "Overall": "5.0", "Content": "This is one of the best tablets beside my apple iPad. If I were to compare my Apple iPad to the Lenovo Yoga I would give the Yoga a extra star for the following reasons: it has the SD external slot for external memory which gives me virtually unlimited memory (not too many tablets have this feature), extra long battery life that can go on for days without charging, the screen resolution is excellent (just a good as my Apple iPad), very very easy to setup (unlike my iPad which requires me to log on to my iTune and go through a series of steps just to set it up), the price is very reasonable if you don't pay the retail price which I didn't and finally, the O/S is simple to use and didn't require me to read any manuals. I'm thinking about getting the Yoga Tablet 10 just to carry that around on my vacation. I would recommend this tablet to my friends.", "Date": "May 13, 2014"}, {"Title": "Great while it lasted, TWICE!", "Author": "Merv", "ReviewID": "R1IYZOVC5QJES0", "Overall": "1.0", "Content": "I love the Yoga 8 tablet while it lasted.  I received it as a Christmas present in 2013. First week of February, 2014, the battery started to drain quickly and would randomly boot up by itself. By February 15th, it did not work at all.  My wife bought the Yoga Tablet from Bestbuy with an extended warranty. So I traded it in for a new Yoga 8 tablet. One for one swap. Once again I was happy until the first week of June 2014. The new yoga started to have short battery life again. Then on the 4th of June, it would not charge up. When plugged in to the charger, it would only boot to the Lenovo screen then freeze there.  I once again returned it to Bestbuy where they could not even fix it. I took my money and bought a Nexus 7 because a friend loves his Nexus 7 and it has lasted so far over 6 months.I want to let everyone know while Yoga Tablet was working, it was the best damn Android Tablet I have ever owned. I just wished it was reliable and did not break down after a few months.", "Date": "June 8, 2014"}, {"Title": "I Love This Tablet - Long Battery Life - Supplemental Memory Chip Capable", "Author": "Patrick", "ReviewID": "RUSS8D50LVZAK", "Overall": "5.0", "Content": "I have tried to love my previous Samsung tablets (plural because I have purchased 2 of the same model 7 inch tablets that both have significant battery issues - I have written this up under a review of the Samsung).I was in Best Buy and liked the way the Yoga felt with what I call \"the side grip\" which is actually the battery pack and kickstand.I read the Amazon reviews and decided to dive in. A primary driver for me was the ability to use a mini chip to upgrade my memory. Other manufacturers charge so much for such a cheap upgrade.I love my Lenovo Yoga Tablet. One of the really amazing things about it is the battery life. I travel a lot and can leave the house on a Monday, use the tablet for regular things like reading, pulling down current news, listening to music, playing games and not have to charge it again until I get home on a Thursday or Friday. Crazy! I left for a trip two days ago and it is still at 96% battery. Don't ask me, I think it is some magic battery and am just happy it is in my device.I highly recommend this tablet.", "Date": "June 5, 2014"}, {"Title": "Best tablet for reading period!", "Author": "Bigburito", "ReviewID": "R19LJX7GMX5WV9", "Overall": "5.0", "Content": "this tablet is absolutely outstanding!first off the form factor, all the weight is shifted towards the round  section that houses the stand, this makes reading a breeze on the tablet as all the weight is in your hand so it doesn't tire out as quickly no matter my position I feel comfortable reading with this.second is the stand, it does just what it advertises, gives you a solid stand and can be used in a variety of ways which is quite nice.the battery life is just as advertised if not better! I have run 6+hour marathons of HD video streaming and it still had 45% battery remaining! (the only issue is the bluetooth adapter devours battery power like an angry snake god but is easily disabled/enabled)the screen is 1200*800 which is a 16:10 ratio it allows many apps to run video in a 16:9 while keeping menu buttons available and at the price is quite nice.the processor speed is solid and the graphics processor handles most of what I have thrown at it with only minor hiccupsand finally the speakers, OH THE SPEAKERS! these are the best speakers I have ever had on a tablet and they make the product above and beyond what a tablet normally requires making this the ultimate multimedia tablet!first off the stereo speakers are FRONT FACING, meaning that no longer will you need to cup your hand around the edges of the tablet to hear the sound in a noisy room! (this appears to be due to the fact that the large round section gives them enough depth to be able to place the speakers front facing which isn't possible on other tablets)second they are LOUD these speakers can hit impressively loud volumes and yet remain clear (no tinny sound!) which might be credited to the Dolby home theater software that comes pre-bundled (and pre-configured) to work with the tablet.with these speakers and stand this tablet can easily function as a portable (and enjoyable) television while also being extremely useful for reading.all in all this tablet is FANTASTIC! it hits all of my needs while also being quite cheap.", "Date": "May 26, 2014"}, {"Title": "Good for what it's good for", "Author": "I am the \"mindfunker\"", "ReviewID": "R1MIT1UNJ76433", "Overall": "5.0", "Content": "Make sure you know why you are buying this device. The stand built into the tablet makes this the most convenient media consumption device on the market, hands down. It is incredibly easy to adjust the tablet to the viewing angle you desire. You don't need to mess with a kickstand, or put it in a folio case to get the thing to stand securely in landscape mode for watching video, or in \"keyboard\" mode for email and other text intensive tasks. The design is awesome. In addition, the battery life is epic. It lasts forever. I've dispensed with any kind of battery saving settings on the tablet because these are never necessary. I have a very long inactivity time-out, and I keep the screen at max brightness. I never turn off Bluetooth or WiFi or any other battery sucking component. There's no need. The battery on this thing is peerless. So, if you're looking for a media consumption device for watching movies, playing music, reading, surfing, light gaming, etc., then pull the trigger now. This is the best device at the best price for those kinds of activities. Some people have criticized the 1280x800 resolution on this tablet because it isn't full 1080p. I don't have any problem with the screen. I think it looks terrific and the resolution is plenty high for a tablet this size. Viewing angles and colors are very good. It is bright and sharp.Others have griped about the processor, which admittedly isn't state of the art. However, it does a fine job streaming hi-res video, which is the reason you want to buy this device. If you want to play the most demanding games, you'll need something with the latest and greatest processor. Of course, you'll be paying for that.Nevertheless, there are cons. While the battery lasts forever, it also takes forever to charge. But the worst thing is the HORRIBLE Android skin that Lenovo is using for this thing. It does not use an app drawer, and instead icons are lined up \"iPad\" style in a grid on the various home screens. Organizing them around is a pain in the butt and if you have a lot of apps, prepare to do a lot of hunting for the ones you need. I'm pretty sure the idea here was to mimic the iPad, but it is easily the worst Android launcher I've ever seen. Yuck.Still ... I'm glad I bought it and I would buy it again. Just keep in mind, if the battery life and stand aren't the reasons you're looking into this device, then buy something else.", "Date": "May 25, 2014"}, {"Title": "Lenova Yoga 8 Tablet is AWESOME", "Author": "Jim R. Watkins", "ReviewID": "R33SQ88LPJ0394", "Overall": "4.0", "Content": "You know a product is good when you are anxious to write a great review about it and share your excitement with others, as that is how I feel about the Lenovo Yoga 8 tablet I purchased.When I went on my hunt for a smaller and lighter Tablet to replace my Motorola Xoom (which has been a great tablet for many years), I specifically looked for four things I wanted the most I could get for as little cost as possible. I am not a huge iPad fan because of the non-inclusive nature of Apple, but I do appreciate the quality of their products. I like Samsung and even bought the Tablet 4 and tried it out, but after only a few hours, the 7 incher didn’t feel right in my hand and I was highly irritated by the fact that it had only one little speaker – and it was in the back of the unit facing away from me!I do not understand why Tablet makers insist on putting the speakers on the bottom or the back of their tablets. It makes no sense to have audio moving away from you, and since I use my tablet a lot for listening to music, talk programs and audio production, sound is just as important as visuals.I noticed the Yoga 8 from Lenovo while at best Buy and it was going for $200 bucks. I thought, well, it must be cheap. I bought a Lenovo Think Pad a few years ago and it stopped working after a year, so my expectations of Lenovo were already low. Still, the first thing I notice with the Yoga Tablet was it has a rotating kick stand. It’s easy to use and incredibly convenient. To my knowledge, it is the only tablet with this kind of stand, a great innovation. Secondly, I noticed the 12800x800 display was very crisp on this eight inch tablet. The visuals were as good, if not better, than my ten inch Motorola.Then, to my wonderment, I see that the Yoga has two front-facing stereo speakers, add to this it is loaded with Dolby software. The designer of this tablet should be commended. Instead of trying to duplicate the stereotypical tablet, they went with a slightly different design that not only allows you to watch video hands free (without the need to buy a case so that the tablet can be setup with having to hold it); the designers understood that great audio delivery is equally as important as the visuals.Holding the Yoga Tablet feels as good as any mini tablet out there, in fact, the larger battery encasing allows you to hold this tablet almost like a book. It kind of reminds me of how it used to feel holding and reading a TV guide or paperback. In my hands the grip is better, lighter, and unlike the Samsung which has its buttons in exactly the wrong spots if you are holding your tablet horizontally, making it easy to accidently shut off the screen, the Yoga places its volume buttons near the base; easy to hit with your finger, but not in a place where you would put your fingers holding the unit. And boy, the sound is so crisp.I like to read and this tablet makes it easy to read for hours without getting tired arm syndrome.The battery life is incredible. And it comes with a pre-installed batter source regulator so you can choose power conservation settings based on your lifestyle and usage of the tablet.The response time on uploads and downloads on my home Wi-Fi is as fast as any. No lag time or sputtering when downloading apps, or when viewing HD Video.The 5MP front facing, 1.8MP camera is also impressive and comes with a nice pre-installed photo app with plenty of functionality.The headphone jack is also conveniently placed on the lower end of the unit so you don’t have a cord across the screen issue as I used to have with my Xoom.It is very hard for me to understand why the unit is so inexpensive, and one of the reasons I didn’t buy it at first was because I suspected the price meant it was a good value. Only after trying out several other min-tablets like the Kindle HD, the Nexus 7, The Samsung 4 Tablet and my wife’s iPad mini, did I come to the conclusion that for half the price, the Lenovo Yoga 8 is a tablet that, is actually designed better, looks better, performs as well as anything else out there, sounds better, and was only $179.Most of the time you get what you pay for, but this time, you find a real deal loaded with goodness. Lenovo could easily charge $329 for this unit, and once others start discovering how good the Yoga tablet is, I suspect they will drive up the price as demand goes up.One final note on set up, it’s a breeze. The Yoga took less than five minutes of me entering a few pieces of personal info and I was up and running in no time.My only complaint is the power button should be on the right (because I am right handed), but that is such a small thing, I mentioned it because there wasn’t hardly anything else I could complain about.I am pretty picky, and this one impressed me.", "Date": "May 25, 2014"}, {"Title": "Surprisingly good", "Author": "Geno", "ReviewID": "R3WCBN2OT3XQD", "Overall": "4.0", "Content": "I bought this tablet primarily for the battery life.  So far, I'm very impressed.  I had a Dell Venue 8 that should have been faster, but at so far I don't see any significant difference in performance, but a huge improvement in battery life.  The microSD card slot is a must for me, and more than makes up for the lack of built-in memory.  Performance has been more snappy than I thought it would be.  I have a 9\" Lenovo tablet that is significantly slower than this device.I was not sure if I'd like the form of this tablet, with the big battery along one side.  Turns out that I like it a lot; most of the weight is in that battery, so it is very comfortable to hold by the battery.  I've done some reading in the Kindle app and it was more comfortable than I had anticipated.Wifi picks up well, I just downloaded a map in a room that is a long way from my office router, so far that a lot of devices barely pick up a signal.", "Date": "May 22, 2014"}, {"Title": "Excellent Super Tablet !!!", "Author": "JuanCe ArFo", "ReviewID": "R2N732ZQM4GP7M", "Overall": "5.0", "Content": "Great Lenovo Yoga 8\" Tablet, Android JellyBeam, very vivid display; good dual cameras; good speakers, style, design, battery power, graphics, weight, ....I love this Super Yoga Tablet.I bought 2 more for family.", "Date": "May 16, 2014"}, {"Title": "A design that is beatiful and functional", "Author": "Tim", "ReviewID": "RSJTG2JCI872R", "Overall": "5.0", "Content": "I am many times disappointed in lack of quality. The Yoga tablets thoughtful design that reminds me of a cross between the Sonly Clie' and Steve Job's secretly developed Android tablet:). Just as snappy in performance as my iPad 3 and a huge battery combined in a package that allows you to tosss this on your tray table and have room for a drink on your next flight.Great job Lenovo!", "Date": "April 15, 2014"}, {"Title": "Really great battery", "Author": "Oscar", "ReviewID": "R1NVEC6BYBD5DS", "Overall": "5.0", "Content": "All my androids including samsungs have the battery issue, I can't even work a full day without rehanging and when on standby in a week they simply go flat. This Lenovo is truly surprising on both fronts. Enough juice for working during the day and when on standby it lasts and lasts.The battery hump is surprisingly good thing, works as mini bezel when on table and makes it very easy to hold like a book.The display, I heard some bad comments but that is so much overreacting. This is a quality display, it is maybe not as juiced up as the samsungs, but it does feel like a good, sharp display with all the right colors.The only unrealized potential is that despite the nice hump, the camera is still positioned such way on that hump that when you put it on the table it still touches the table and can get dirty or maybe even scratched - like every other android. If they put the camera on the main body below the hump, the problem would be solved and the camera would be protected. Right now I have to be careful where I am putting it - like with every other tablet that has camera on back.", "Date": "March 26, 2014"}, {"Title": "Awesome yoga 8 tablet", "Author": "Subbu", "ReviewID": "R2257KZS0QURJH", "Overall": "4.0", "Content": "Awesome Tabet when compared to my iPad 2. The picture quality and the sound is amazing. The price is less compared to similar products and it's performance is pretty good.", "Date": "March 17, 2014"}, {"Title": "excellent", "Author": "PhilNoel", "ReviewID": "R4JT190HMUXRW", "Overall": "5.0", "Content": "fantastic product. also fast delivery. it's really worth the money you paid for. i would definitely recommend it to friends.", "Date": "April 13, 2014"}, {"Title": "Great Tablet!", "Author": "Steve N.", "ReviewID": "RGJHTHMRAMUN", "Overall": "5.0", "Content": "My laptop took a dump and needed to be replaced. I did some looking and found the Yoga. It has memory, speed, pixels and operates on Android. I am not a big fan of \"Apple\" products because once you start with an \"I\" product you are stuck with their choice as to what you are \"allowed\" to do with it.I don't often brag about a product but, I am very happy with this purchase and have began to look for more Lenovo products to replace more of my outdated devices!", "Date": "March 23, 2014"}, {"Title": "bad wifi signal low memory", "Author": "Abdulrahman A.", "ReviewID": "R3DPXQ1EQ5X6U0", "Overall": "2.0", "Content": "bad wifi signal low memoryjust nice desigen  onlygood battryno sim card slot as we read in neta.rhman alossaimi", "Date": "April 27, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HHKZFTM"}}