{"Reviews": [{"Title": "One hell of a tablet", "Author": "C. Carmona", "ReviewID": "R3M37E07KXEPVP", "Overall": "5.0", "Content": "*** Updated 5/8/2014 - if you're using Dolphin Browser with Adobe Flash player do yourself a favor and do NOT update Dolphin Browser if prompted to in the Google PlayStore. It seems like every time they update Dolphin there's a chance for Flash to no longer work without jumping through more hoops ***I come from a Windows OS background and I'm an ex-Apple iPhone (now Galaxy Note 2) and iPad user. I've been waiting a long time for a tablet like this to be released: a large screen, expandable memory and the freedom of Android. Thanks to my Note 2 I have a little over a years of experience with Android OS but I knew what to expect from the Note Pro 12.2. Originally I had my eyes set on the Samsung Galaxy Note 10.1 2014 Edition (32GB, Black), after months of waiting and playing I decided to bite the bullet and buy it. Just before doing so I read of a possible 12\" model coming out in the following year so I figured another 6 weeks of waiting can't hurt and patience definitely paid off.Comparing the Note 10.1 2014 Edition and the Note Pro 12.2:One big issue that annoyed me with the Note 10.1 2014 Edition (\"14E\") was the ridiculous My Magazine app that never goes away. It constantly hogs system resources as it runs in the background even after forcing shut downs of the app, and disabling the Home button link to this app didn't help as it would just keep running in the background. I noticed that the 14E was constantly using 1.5-1.7GB of its 3GB RAM total at all times even after factory resets, disabling apps and reboots. Thankfully the Note Pro 12.2 (\"NP12\") doesn't have this issue as it hovers around 1.2GB of memory used after a reboot. Even having pages of the magazine feeds and widgets running it still allocates memory usage better and best of all: no pesky My Magazine app!Luckily I was able to compare both tablets side by side at the local Best Buy. This was a large factor in my decision to go with the NP12 over the 14E. Both tablets are about the same when it comes to hardware but there are other major differences between the two. Let's go over some of the features that the NP12 has over the 14E...1. Over 2 extra inches of real estate on the screen. This means writing on the NP12 with the stylus while in portrait mode is very much like writing on a real piece of 8.5 by 11 inch piece of paper, aka standard notebook paper. The palm rejection does a great job of making sure only the stylus gets recognized for input (if you want that on). I find that a 10 inch screen is too cramped to comfortably write notes on. Do your research, this is a 12 inch tablet so don't be surprised and don't consider it a downside.2. Larger, longer lasting battery rated at 13 hours (9,500 mAh) versus the 14E's 9 hours (8,220 mAh). My mixed use gets me anywhere from 8 to 12 hours before plugging it in for a charge, depending on what apps I'm using and what the brightness/volume is set at. Lots of gaming/graphic intensive apps will exhaust the battery quickly whereas reading PDFs, E-books, etc. is where the battery really stretches its legs. There are numerous settings and options for the tablet to use minimum energy which I will go over later.3. Multitasking on the NP12 is fantastic. Multi Window allows you to run 2, 3 or 4 apps on screen at once (the 14E supports up to 2 apps side by side). There are many apps compatible with Multi Window. You can also resize the windows depending on where you need the most room on the screen. Chatting with friends on Hangouts, surfing on Dolphin Browser, watching your favorite movie and checking/writing Emails all on the same screen is productivity at it's finest. You can save Multi Window templates too for quick access so that you don't need to drag the apps one by one every time you want to multitask. Just select your template and all the apps open up automatically. I usually have 3 apps going at once: Video (or Music) at the top left, AquaMail at the bottom left and Dolphin Browser taking up the entire right side of the screen.Bonus feature: there is a trick that allows more than 4 apps open at once on the NP12, up to 9 apps total. First use Multi Window to load up whatever 4 apps you want on the screen, then hold the S-pen above the screen and press the pen's button which bring up Air View. On the Air View pop-up select Pen Window. Now use the S-pen to draw a box and then choose an app to launch in that box. The app loads up in the box you drew. It comes up as a floating window that can be resized, moved around on the screen and also minimized to a floating \"bubble\" that you can move around anywhere you want. You can do this 5 times total. So 4 apps via Multi Window and 5 apps via pen window. The Multi Window apps are all joined on the main screen while the 5 pen window apps are solo floating windows and can be minimized to a bubble to have them out of the way. Pretty cool!4. KitKat 4.4: the new \"Magazine Home\" user interface (UI) is a little like Windows 8 but at the same time its different. After playing with it for a little while you'll actually want to use it and set up multiple pages filled with your news subscriptions, feeds, widgets, etc. I did not think I would like the dashboard/widget style UI but on a screen this size it works well and looks great. Basically you can set up different pages filled with all sorts of widgets ranging from:Application widgets (Email, Calendar, Music, Video etc.)Social widgets (Twitter, Flickr, YouTube etc.)News widgets (Art & Culture, Science & Technology, News, Style, Sports, Business, etc.)Each news category has dozens and dozens of publications to subscribe to and I find myself spending more time reading articles than I ever thought I would. If you're not a fan of the new UI the familiar Android desktop is still there with your standard icons and widgets. If you'd rather customize the tablet completely I highly recommend Nova Launcher.Those are the main differences to me. Now onto some general information about the tablet as well as apps I use and features worth checking out:Like every other phone, tablet and computer out there the NP12 does come with some bloatware. There are different types of bloatware so I'll cover each one:1. Some preloaded apps can be uninstalled completely giving you back some minor storage space. This is a good thing.2. Some preloaded apps cannot be uninstalled and instead can have \"most\" of their data cleared and then \"turned off\" - these apps remain installed on the tablet but are disabled. Some of the preloaded apps that can only be \"turned off\" are Chrome, e-Meeting, DropBox, Gmail, Google+, Twitter, Cisco WebEx and others. These are just some that I do not use myself so I turned them off. Even when turned off/disabled, these apps still take up some room but its very little, 5MB or less per app.3. Some apps cannot be uninstalled nor can they be turned off. They can have most of their data cleared though. Either way this is just plain stupid. I can only think of two off the top of my head: Evernote and RemotePC. I don't use these particular apps at all so why can't I at least disable them so they don't show up in my apps list? Both of these apps use about 9MB of space combined. Again it's not a deal breaker for me but Samsung y u do dis?!I bought the 32GB model. The tablet needs about 6-6.5GB for the operating system and preloaded software/apps. Out of the box you have around 25.5GB of space to play with, this of course depends on what preloaded apps you choose to keep/update or disable/uninstall so your free space will vary. A great investment would be a SanDisk Ultra 64 GB microSDXC Class 10 UHS-1 Memory Card 30MB/s with Adapter SDSDQUA-064G-U46A, which gives you another 60GB~ of extra space for apps, movies, music, pictures, whatever you want to put on it. This SD card plus the tablet's free space adds up around 85GB which for me was more than enough. It's very easy adding your media files to the SD card, just plug the card into your PC with the supplied adapter and create folders like Music, Movies, etc. then copy/paste or drag and drop Artists folders into the Music folder, and videos into the Movies folder. I loaded music, movies and pictures on the SD card and I leave the tablet's internal storage for apps since applications seem to run faster off of the internal storage as opposed to off the SD card. If you think you need more space you can go big with SanDisk's newest 128GB card also found on Amazon.The screen is beautiful. High quality photographs and wallpapers at the native resolution (2560x1600 or bigger) look really, really good. If you're looking for some stunning wallpaper for your tablet check out:interfacelift.com/wallpaper/downloads/date/widescreen_16:10/2560x1600/This model is WiFi ONLY! There is NO slot for a SIM card. The WiFi model also works with your MiFi device and can also connect to the internet via a mobile hotspot such as your iPhone or Galaxy smartphones. I use my Note 2 smartphone as a mobile hotspot and it works great.If you are looking for the 4G/LTE version you'll need to check out the model that Verizon offers. It's available through Verizon or here on Amazon, just search \"note pro 12.2 verizon\"GPS - yes the tablet has GPS built in, you do not need to be connected to the internet for GPS to work (such as the Google Maps app).Hancom Office is included with the NP12. This is Microsoft Office for Android, simple as that. You get full versions of word processing (Word), spreadsheets (Excel), and slideshow (PowerPoint). It all works very well with the large 12.2\" screen and I find it very familiar after using MS Office for so long. You can even open existing word, excel and powerpoint documents with Hancom Office and continue editing and creating. Hancom Office is fantastic, however I must admit it was a little involved to get it up and running, so I will explain as best I can: After the initial setup of your NP12, go to your apps (bottom right, little white squares) and launch the \"Samsung Apps\" app, it will require an update so go ahead and download then install the update. After that is done, go back to your apps and launch Hancom Viewer (there is also a Hancom widget in one of the two default Magazine Home screens if you want to launch it that way). When you launch it a small white box should come up and it will say installing fonts and files, etc. so let it do that and when its done the Hancom Viewer app should open completely. On the left side select Office Download, then OK. This should open the Hancom Office Update Manager. When you do this there's a good chance the Update Manager will prompt you to update it so go ahead and do that. After its updated you can launch it again, the Hancom Office Update Manager is where all the Hancom apps are downloaded/updated/installed. You'll see 12 rows of Hancom apps such as Hcell, Hshow, Hwp, etc. Update and/or install all the ones that need to be done by pressing the rectangular button at the far right of each row. Each time you press the install or update button on the far right it will take you to Samsung Apps where you can press the Update button. Go ahead and update all 12 apps if needed, some may already be updated but will need to be installed (or vice versa). Once every button on all 12 rows is greyed out in Hancom Office Update Manager, then you know you're done! Now just go to your apps and launch whichever one you like. Hcell is excel, Hshow is powerpoint, and Hword is word processor.Hangouts is a cool app and it comes with the tablet. It lets you text/message anyone with an email address or phone number. If you are familiar with iMessage then you know what this is.*** UPDATED BELOWDolphin Browser is a must for surfing the web. It is fast, supports tabs, and has a cool feature named speed dial. A speed dial is a bookmark placed on the Dolphin home screen for easy, one-tap access to the webpage. You can have pages of speed dials, its very useful and beats going down a list of bookmarks looking for a particular site.Perhaps the best feature of Dolphin Browser is that it supports Adobe Flash and Java. I bet your iPad can't do that! What is Adobe Flash? Many of the websites you visit require flash to display the content properly, some websites even have flash animation and to play those you will need the flash player. One example of flash required content is Youtube videos, and Youtube videos that are embedded in other websites. Here is how to enable Flash on the NP12:cultofandroid.com/49840/install-flash-player-android-4-4-kitkat/*** NOTE: the link to download the Flash Player Installer on the website above is broken. Here is an updated working link for the Flash Player installer: downloadandroidfiles.org/Files/Apps%20%28APK%29/KitKat.Adobe.Flash.Player.11.1.apkWhen you're all done installing Flash player you should head over to the official Adobe Flash website to test the flash player so that you know it works. On the website you should see a bouncing red box. If not just refresh the page and you should see it the second time around. The Adobe page to test your flash player is:adobe.com/software/flash/about/PROTIP: ONCE YOU GET DOLPHIN BROWSER AND FLASH PLAYER UP AND RUNNING, DO NOT UPDATE DOLPHIN BROWSER IN THE PLAYSTORE UNLESS ABSOLUTELY NECESSARY. It's not worth taking the chance of the update messing up Flash Player.Amazon Instant Videos - yes, you can watch them on this tablet. Yes, you'll need Dolphin Browser and Adobe Flash installed and correctly configured. If you followed the aforementioned links you should be all set by now. Here is another link specifically dealing with streaming Amazon Instant Videos on KitKat 4.4, which is the tablet's operating system. This worked for me and it should work for you!:the-digital-reader.com/nates-reviews/stream-amazon-instant-videos-android-tablet/*** UPDATED ABOVESplashtop 2 Remote Desktop is a remote desktop app that you can download for free and in my opinion works better than the RemotePC app that comes preloaded on the tablet. This app allows you to access your PC or Mac's desktop environment so that you basically have your entire PC/Mac on your tablet. It takes advantage of the 12.2\" screen by filling it entirely with your computer's desktop. This is useful since you can run all your PC/Mac programs right on your tablet. It works really well and is probably my favorite app that I have come across. There is an optional paid upgrade to the app that let's you remote into your PC/Mac from anywhere. For now I am just using the free version to access my Windows PC, very cool and worth the download.If you want to connect this tablet to your HDTV, a projector or anything with an HDMI input, you'll need a Samsung MHL HDMI adapter. This adapter allows you to mirror your tablet's screen onto your HDTV or other source. I also noticed that you can play a movie on the tablet (which also displays on your TV) and still use the tablet for other apps while the movie plays uninterrupted in the background of the tablet but still in full view on the TV. In other words you can play your movies or shows on the big screen while surfing the net or whatever apps you want to use on the tablet. This adapter is available here on Amazon but I chose to buy mine off of ebay. If the one sold on Amazon does not say \"shipped and sold by Amazon\" there is a good chance you will get a cheap knockoff adapter that will not work, just read the reviews from other buyers for yourself. If you want to try your luck the adapter can be found here: Samsung ET-H10FAUWESTA Micro USB to HDMI 1080P HDTV Adapter Cable for Samsung Galaxy S3/S4 and Note 2 - Retail Packaging - White. The seller I found on ebay is selling the legitimate Samsung adapters that have the hologram sticker and QR Code on the box indicating that it is a genuine Samsung product. Mine arrived promptly and works great. Save yourself the headache and get a genuine one here: ebay.com/itm/350958988570Bluetooth is available so you can connect a BT mouse and keyboard if you like. Samsung makes an S Action mouse especially for the Note Pro and Tab Pro line of tablets and it works very well. The mouse buttons are specifically linked to actions such as Recent apps, Multi Window, Back, Menu, etc. I got to play with this mouse recently and it's fun although I opted not to buy it as I don't see me using the mouse enough. If you are interested its available at Best Buy (search ET-MP900DBEGUJ) and here on amazon: Samsung S Mouse for Tablets (ET-MP900DBEGUJ)You can also connect USB peripherals to the tablet using a USB OTG cable like this: Black Color Micro USB 3.0 9pin OTG Host Flash Disk Cable for Samsung Galaxy Note3 N900 N9000 10cm. This allows you to connect a number of USB devices such as a mouse, keyboard, flash drive, external hard drive, even a PlayStation 3 controller to the tablet with the ability to access them - If you have a lot of movies on your external hard drive you can use the OTG cable to connect it to the tablet to watch movies. Another example is if you have a thumb drive on your keys, you can connect it to the tablet to access all your files. You can connect more than one USB device at a time by using a USB hub along with the OTG cable mentioned before. I don't recommend connecting more than two devices at the same time in the USB hub, especially if its a device that sucks up a lot of power like an external hard drive.Netflix, Vudu, Amazon Kindle, Google Earth all work great, no issues. If you want to stream video from the tablet to your Smart TV (like Apple AirPlay) check out the AllCast application made for Android devices.Extending battery life is simple: disable the vibration/haptic feedback and keyboard/stylus sounds as it really isn't necessary. Keep the brightness on Auto and the volume at half or less. When you're done using it for a while make sure you close all your apps and clear your RAM before putting it to sleep. This will greatly increase the standby time of the tablet so that when you pick it up again later it will still have lots of juice left in it. This is the procedure I do:Swipe down the top of the screenClear your notifications by pressing the X under the sound barSwipe down the top of the screen againTurn OFF WiFi (important)Press the \"Recent apps\" soft button (to the left of the Home button)Select Close allPress the Recent apps button again (no apps should be running now)Select Task ManagerSelect RAM manager on the leftPress \"clear memory\" - do this AFTER closing your appsPress Home buttonPress Recent apps button a third timeSelect Close all (this closes Task Manager)Press Power button to put it in Sleep/Standby modeDoing the above every time sounds tedious but after a few times its second nature and you will notice the battery percentage stays where you left it (or it only drops only 1 or 2%) even after an entire 24 hours in standby.If you notice when opening/closing apps and switching between apps there is a slight visual delay, this is normal. It is meant to make the transition between apps look \"pretty\" - Microsoft OS and Apple iOS have something similar. This will eliminate the windows animation and transition effects which in a nutshell will make the tablet run much quicker and smoother:Swipe down and go to SettingsGo to the General tabScroll down to About DevicePress the greyed out Build Number section continuously, 5-7 timesDeveloper Options is now enabled right above About DeviceUnder Developer Options, scroll down to the Drawing sectionSet all three of these settings to OFF:\"Window animation scale\"\"Transition animation scale\"\"Animator duration scale\"You'll notice how snappy it runs after doing that.Another available on/off toggle is the double-press Home button to bring up S-Voice. When you press the Home button twice quickly it will launch S-Voice. If you'd rather have this feature disabled read on:Launch S-Voice by pressing the Home button twice (or via apps > Samsung folder > S-voice)At the top right press the 3 small squares then select SettingsOn the next window the second row down is the \"Open via the Home key\" on/off toggle.Some apps that my girlfriend has recommended for drawing/painting/art. She is a graphic designer and bought her own Note Pro 12.2 soon after playing with mine so I will take her word for it. I have seen some of the pieces capable with this tablet and it is impressive. Also note that the files you create and save in some of these apps can be opened and worked on in Adobe Illustrator and Photoshop:ArtflowInfinite PainterSketchbook ProSketchbook for Galaxy (included with the tablet)Fresco Paint ProPaperlessOnto the accessories:I am using the Samsung 12.2\" Book Cover with my NP12. It is well made, very sleek looking and does protect the back and corners well. The stand works well in both positions. Don't plan on taking too many pictures with this cover though because when opened the cover wraps around the back and blocks the camera lens. That is OK though because you should never be using a tablet to take pictures. Ever. Stop. No.... don't do it. You look ridiculous. I'm pretty sure there is a law against this - ipadisnotacamera.com - I rest my case.Anyway, I bought mine at the local Best Buy and you can find it on bestbuy.com - search for \"samsung book cover 12.2\"The IVSO Slim Smart Cover Case is nice too and protects the tablet a little better than the Samsung Book Cover but I find the IVSO's stand to be a little more flimsy and I don't like that it makes the tablet sit upside down (home button on top) when using it in your lap. On the plus side the camera lens isn't covered with this cover and there's a thin magnet that holds the cover to the tablet so it doesn't flop around. IVSO Samsung Galaxy Note Pro 12.2/Tab pro 12.2 Ultra Lightweight Slim Smart Cover Case with Auto Sleep/Wake Function-will only fit Samsung Galaxy Note Pro 12.2/Tab pro 12.2 Tablet (Black)I picked up this Galaxy Note Genuine Wacom Touch Pen 8pi Stylus (ET-S200EBEG) - Black. It is about the same thickness as a regular pen so its easier on your hand and it has an eraser on the end, too. Here's a tip: go to settings > controls > S-pen and at the top make sure \"Turn off pen detection\" is not checked, now you can use a second stylus without needing to remove the factory stylus from the tablet. If you're going to be using the S-pen a lot this is a very good investment.If you're looking for a great sleeve, check out the Merkury Innovations 12-Inch Solid Zipper Sleeve, Black/Blue (M-LL1090). It fits this tablet perfectly, even with the Samsung book cover on it and the quality is top notch. I love the fit and finish of this sleeve and how well it fits this particular tablet, the side pocket for the charge cable/external HDD is a bonus.Need a longer USB 3.0 charge cable? I bought one of these here on Amazon: Cable Matters SuperSpeed USB 3.0 Type A to Micro-B Cable in Blue 10 Feet. It works just as well as the factory cable for charging and is available in 6, 10 and 15 feet - useful if the nearest wall plug is too far away.I like choices so I bought another sleeve, this one has a handle though: Evecase 10.6~12 inch Tablet, Netbooks Ultraportable Neoprene Zipper Carrying Case with Dual Hidden Pocket & Handle - Black/ Red. This sleeve is great because of the handles so I can throw in the tablet and carry it around just like that. If using my backpack I'll use the other sleeve mentioned above inside my bag. This sleeve is just as nice as the other and also has a side pocket. The black/red color looks sharp.Last but not least: the User Manual. This has TONS of useful information about the tablet. Definitely worth it to look through this, in fact most questions that people keep asking about the tablet can be answered just by looking in the manual. The direct link to the PDF is:downloadcenter.samsung.com/content/UM/201403/20140312030602240/GEN_SM-P900_Galaxy_Tab_PRO_KK_English_User_Manual_NAE_F5.pdfIf you have any questions just post a comment and I'll get back to you.", "Date": "February 24, 2014"}, {"Title": "Not too big. great functionality for someone on the road or just at home", "Author": "GumbyR1", "ReviewID": "RU6XKJQEKQ6ZB", "Overall": "5.0", "Content": "First let me say that I am an ex-apple customer that demanded more options and over time have switched from the iPhone to Note 3 and from an ipad to the Surface Pro and now to the Galaxy Note Pro 12.2. For those that have a Galaxy note phone, the Note Pro tablet is more than just a larger version of the same. The functionality is greater, the multitasking is excellent, and from both a personal and business use, it has met my every expectation. I will address a few areas of concern I had before purchase to try and help anyone that may be feeling the way I was.SIZE - my job has me on the road marketing every day. This tablet, to me, is portable enough to not be a problem or feel like I am lugging around something uncomfortable. I carry a clip board with a few forms and the note pro 12.2  in a slip cover case (until I can get my hands on the book cover case which is back ordered). When I read the initial reviews I was terrified to buy this thing sight unseen as many talked about it being too big or too heavy. It is not too big and the weight feels light next to the surface pro. If you are looking for a large tablet screen...This is for you.  Also the large screen allows for the full size keyboard which is nice (this review is being typed on the screen)MAGAZINE UX - the difference in the updated interface had me scared. Is it like the new windows tiles? Is it completely different than what I am used to on the Galaxy Note 3 phone? Here is the deal. The Magazine UX is not bad. I am not a fan of the new Microsoft Windows tiles which i had on the Surface Pro. The UI is different and better in my opinion. You can set up your tablet to look almost identical to your Samsung Note phone if that is what you want. There has to be at least one screen of the magazine but to be honest, I have it set up to where I really like it. When I hit the button to go to the home screen it takes me to the same setup I have on my phone which is folders with different apps, time and weather, etc.32 or 64 GB - Being an early adpoter, the 64gb model was not available on release. It is unlikely that you will be using this tablet to shoot a ton of HD video (which is the biggest storage hog) and with an addition of a 64GB sd card that you can swap out if needed, 32gb device memory works just fine.WiFi or 4G - that depends on your needs but if you can use your phone as a hotspot, why pay extra for a cell radio in the device plus pay more to add it to a cell plan? The answer for my needs was WiFi works perfect and tethers with my phone on the road.I can't say much about the battery life yet as I have only charged it once. It had about 50% charge when I pulled it out of the box after purchase.CONCLUSION - I was disappointed in the info updates on this device before the US release. All of the videos and reports were all from CES and there were no new hands on reports. I can tell you that this device has a premium price but also carries premium capabilities. If you just want to update a status on Facebook and play candycrush...This isn't for you unless you want to spend the money for the screen size. If you want a nice big screen to multitask and you are either familiar with Android or are willing to educate yourself on the possibilities. You will be impressed.", "Date": "February 14, 2014"}, {"Title": "Great Tablet! Well worth the price! w/ Bonus Zagg keyboard review!", "Author": "Olaf Johnson", "ReviewID": "R17NYA6EFL1HHZ", "Overall": "5.0", "Content": "April 2014 Update:It has been over a month of usage with the 12.2 and I have to admit myexperience has become more and more positive.Things I am liking is the the stellar battery life, the way appsupdate to work better with 4.4os, the physical durability, the screensharpness/brightness, and the internet browsing experience.I love the multi-day battery power you get. I realize even with thescreen up at 80% brightness watching Netflix all day the battery stilltakes forever to drain. The only App that seemed to cause Batterydrain and slow recharging issue was Word-With-Friends, Blurb Checkoutand HP Printer Services. Once you delete those and make use of TaskManager to curb background activity everything improves.  Also keepingGPS Antenna off helps.Apps seem to be updating regularly to work smoother on 4.4os and toalso support the multi window display. So now more apps  can be swipedinto new windows when in multi window mode. By contrast I have somepopular apps on my iPhone that are only now updating to work betterwith last year's iOS 7.I'm finding the feel of the tablet is great for daily use. I love thefaux leather back and aluminum trim. You don't necessarily need a caselike you would on a scratch prone-metallic iPad. The faux leather issoft to the touch and easy to grip, yet handles dailycommuting bangs and scrapes well without any signs of wear and tear.One thing I didn't expect though is the faux leather to be a bit of afingerprint magnet.I tried using other tablets since and I now realize how great thescreen is. Apart from the slight fuzziness you get when importing lowres pics (or browsing the Facebook/eBay app) hi res images, websites,eBook/Adobe Reader text and colors always look sharp and bright. Ieven take back what I said about the 10.1 Note Pro's screen beingpossibly better. The 12.2 has a greater overall screen. As long as youstay away from your Grandma's 1 MP pictures and don't expect extrasharp images on the Facebook and eBay app then this tablet will makeyou happy. Actually if you use Chrome or Internet to browse Facebookand eBay then the images will look sharper and will scaled upproperly.This brings me to my final impressions for the 12.2:  the web browsingexperience is second to none! I'm very impressed with the consistentspeed and page layout of the Chrome and Google web apps. This is thefirst tablet where I can say anyone's  dependence on a full desktop PCor laptop PC for internet service will be greatly diminished. The onlythorn  in this positive is that Adobe Flash material may or may notload on certain websites but there is an Android Flash Player Patch(not found in the Play Store/Samsung Apps) that you can install thruyour web browser  to work around this.Positives aside there have been some hiccups with the 12.2. There is aslight interface delay when using the S pen on certain Apps. It worksperfectly in S pen native apps.  I don't find myself using S pen forwhat I normally do on my 12.2 so it is no bother to me but still worthmentioning.Also the Android/Samsung Gallery and File Management system can getcluttered if you tend to store a lot of documents and media. Add inthe automatic Facebook/Dropbox media file import and you may findyourself lost in a sea of tricky to remove pictures that you never puton the tablet. However, coming from an iOs iPhone background whereApple manipulates your media and files for you I am actually enjoyingthe freedom of organizing my images and files the way I want.I don't really use the Magazine but, unlike widgets, the Magazinetiles do not auto update. [Yeah I checked with Samsung and] there is'currently' no method for selecting them to automatically refresh withnew stories and content. It has to be manually done for each tileevery time you open Magazine. This actually defeats the purpose of whatthe feature is about-quickly exposing users to new and newsworthyinformation. On the flip side I'm curious how battery life will fareonce Samsung allows background auto update of all those tiles.Over all I think anyone who chose this tablet will be happy. I stilldon't know why haters still rate the 12.2 low because Samsung wants$750 for a 12.2 tablet when in the same stores Samsung smart phones, iPads and iPhonessell for $799+.---------------------------------------------------------------------------I originally wanted the Note 2014 10.1 for the holidays but decided to wait when the 12.2 appeared at CES. After seeing a some early online gadget reviews and videos I went into Best Buy held both the 10.1 and 12.2 and in under 3 minutes I was sold on the Pro 12.2.What I realized after looking at the 32GB 10.1 at $549 versus the 32GB 12.2 at $749 that for $200 more you get a lot more than just a bigger screen.After a month of daily use with my 12.2 did I make a good choice? Let's find out.PROS: The battery life is very good. I usually go all day with usage (bluetooth, wifi, apps running, screen brightness at 60%-auto brightness set to OFF) and never go below 70%. Some applications (words with friends) and widgets will drain battery quicker even if you are not directly using them so it is best to use the task and application manager in settings to see what is using your battery the most. Also GPS antenna being on all the time will kill the battery life.The first thing you will notice is that the 12.2 handles multiple tasks VERY quickly. It is not as quick as my iPhone 5S when opening heavy apps quickly like Facebook but because 99% of the time I am doing more than one thing at a time on my 12.2 any lag (minute as it maybe) is completely forgivable. In fact other than Facebook I have not notice anything to be slow on this tablet. YouTube, GPS-Google Earth/Maps, Web Browsing, Hancom Office, etc... can all run at 100% at the same time on the same screen.I had absolutely no issues with stuttering, slowing down or freezing up like some review videos have griped about. The software has updated since I took it out the box so that maybe the trick. Make sure to update your software and all the apps to get the most up to date performance.This tablet also doesn't get hot in my lap at all when doing heavy work. Netflix, YouTube, streaming Video playback is smooth, crystal clear Hi-Def and looks amazing! Images and text on Mazagine, web browsing apps, FlipBoard,  emails, Adobe Reader, games, ebooks, etc... all look crisp, bright and vividly sharp.The Chrome and Internet web browsing apps are blazing fast! I never liked web browsing apps on tablets and mobile phones because it was never as quick and natural as internet on a PC or notebook but here it feels natural and fast. Pages are full pages and not scaled down versions of websites. I also found the Android web browsing experience MUCH BETTER than Safari on the iOS iPads.Contrary to some early YouTube reviews I did NOT find this tablet to be too big or heavy for one handed use. The average adult should be able to hold and use it in one hand while standing. The Note Pro 12.2 is the around the same weight as my fiancé's pre-iPadAir iPad3.At  8\"+ by 11\"+ inches the 12.2 Note Pro shares the same footprint as a standard sheet of paper (Go to your printer or office desk and pick up a standard sheet of paper it is the same size as this 12.2 tablet)If you are coming from an older 8\" or 10\" tablet then the Note Pro 12.2 will 'feel' much bigger but not much heavier. However if you are like me and never owned a tablet before while coming from a Laptop/Desktop background then the 12.2. will feel portable enough.In fact this tablet paired with the Zagg keyboard has already completely replaced my premium Lenovo Thinkpad for on the go Laptop duties.Speaking of Laptop PC Windows duties the Productivity Software that comes with the 12.2 is not the usual bloatware you would expect. In fact apps like Hancom and WebEx puts Windows Office to shame.These productivity apps put the practicality of Microsoft Office onto a tablet environment where everything runs smoothly (especially with S pen) without the costs, drama and high maintenance that you get with Microsoft Office products.I mainly use Hancom Word for writing (novels) and in this regard I recommend an external keyboard (like the Zagg) since the touch screen keyboard can hog some screen real estate.Other obvious positives to a 12.2 screen is that you can do way more stuff at the same time and this tablet does the job of multi windows smoothly. My only prior tablet experience was my fiance's iPad3 which interfaces only one app at a time. Having the 12.2 do more than one thing at once took some getting used to. It is fun and most practical.CONS:The 12.2 screen carries over the resolution from the Note 10.1's screen (why?). This means in apps like Gallery, Facebook and eBay some lower resolution photos do not scale up properly to fill out the bigger screen.  Instead the Note Pro 12.2 tablet stretches out and enlarges images in these apps which results in slight fuzziness on those pictures. So if you are importing old school throw back pictures that you scanned back in 1999 then don't expect those pictures to look good here.On the Note 10.1 the same images would come out sharper on the smaller screen space. Lisa Gade at MobileTech has a brilliant side by side 10.1 vs 12.2 video on YouTube that shows this effect better than I can describe here.In fact isn't a big issue and most people who use hi-res pictures won't notice it at all. That said the camera on this tablet like all current tablets is quite crap compared to most high end cell phones or digital cameras. The camera app does have all the latest and greatest features but dont expect wallpaper quality pics. Use your samsung cell phone instead and import pics.Regarding the screen resolution I will add other apps like Adobe, Chrome/Internet, NYTimes and Magazine/FlipBoard have very crisp and clear images that are on par or better than iPad Retina's images so don't let that turn you away.My next gripe is in the box this tablet comes with nothing.  You get the usb cord/charger combo, a quick start leaflet, and replacement nibs for the S pen.For $800 spent here I would have at least wanted headphones and a proper manual booklet (you have to search Samsung's website for the 178 page SM-P905 pdf file).  Funny enough the SM-P905 manual when you download it has A LOT of important information regarding how to use this tablet properly. For one it warns \"do not use a screen protector on the Note Tablets\" which is the first thing we all buy for it. I use one anyway and it works fine with the S pen and touch controls.Be careful with where you buy your MicroSD card from. I went thru two eBay-bought SanDisk and Samsung 64gb cards, most likely fakes, that didn't work, died and almost damaged my Pro 12.2. I finally purchased the genuine Samsung 64gb card at my local Best Buy and it worked. Funny enough the eBay cards worked perfectly on my PC laptop and BlackBerry smartphone so that means the MicroSD card drive on this 12.2 tablet is very picky.One of my early concerns was out the box it took this tablet about 5 hours to charge from 70% to 100% and much longer to charge from near empty. To improve charging time I went to Application Manager->Running and deleted hidden background Bloatware like HP printer services, Blurb Checkout, etc... On kitkat 4.4 these sneaky apps remain running even after you sleep the tablet suckling away at your battery. With bloatware gone I now go from 30% to a full 100% charge in 4 to 5 hours. If that is too long for you then the LTE note pro 12.2 tablets will have batteries that charge much quicker but the downside is they will also die quicker than non-LTE models.Price was not a con for me but Samsung releases so many similarly priced tablets with a range of features that it makes me wonder if the Tab Pro 12.2 didn't come out at the same time would the retail for the Note Pro 12.2 be cheaper.Other than these minor gripes this is a perfect tablet for everyday useBONUS!ZAGG KEYBOARD REVIEW: I love that this keyboard works flawlessly, protects the screen when closed has great battery life. Also with its own leather stitched back matching the 12.2 perfectly BUT the Zagg is not a good case holder. The 12.2 lays facedown into the Zagg and clips on but the connection is loose and the tablet moves up and down inside the clips. Also removal of the tablet (as per the instructions) requires you to yank it up snapping back the holding clips open to release the tablet. The issue here is those clips are springy but still plastic and look like they will eventually break (I assume) from continued removal of the tablet. Furthermore you can easily pry or yank the wrong way and send the tablet flying across the room since it requires a bit of force.Also at $99.99 it is an overpriced keyboard accessory that isn't backlit and looks like it will wear out in a year or two of use. Already my spacebar key needs to be pressed really hard and in the center to work.I only purchased it at the time I picked my 12.2 because I needed a case right away and the only other case in Best Buy was $59.99. So I did the math and figured $40 bucks more got me a keyboard and stand for the 12.2. It does make a great stand.In retrospect I probably would not have bought the Zagg for more than $50 but I didn't really have a choice.It does its job with minimal features for the most part but do not expect a drop-proof case/holder or stellar desktop keyboard performance out of this product.", "Date": "March 8, 2014"}, {"Title": "Simply Amazing!!", "Author": "Cody Bawden \"MrFlankster\"", "ReviewID": "R1T5127OGNXDR9", "Overall": "5.0", "Content": "For those who've rated this low because of the size, do your research. Duh! It's a 12.2 inch tablet.I'm a cartoonist and really wasn't excited about spending $2K on a Wacom Cintiq Companion. I spent all of yesterday using this Samsung for drawing, web browsing, and calendar use. This is the best tablet I've ever owned and will use it daily. Yes, it's a bit on the expensive side, but for me, with how much I will be using it, and what I'll be using it for, I can more than justify the cost.", "Date": "February 14, 2014"}, {"Title": "5 now 8 now 13 things you'll want to know", "Author": "Fairfieldwizard", "ReviewID": "RN2BDTCIJWI5W", "Overall": "3.0", "Content": "1. OS and app BugsWhile the tablet is beautiful after using it for almost two months, I find it shockingly buggy. Apparently there's a battery drain problem in sleep mode. My Note Pro goes from 100% to dead in 18 hours of no use. It drops about 5% every 30 minutes. Many apps I expected to be mature and debugged like NYTimes, Wall Street Journal are laggy and crash frequently. Moving from an iPad to the Galaxy Note Pro, I have to say that there's something to be said about the benefits of how Apple manages expectations downward. While there is no multitasking on the iPad as there is on the Galaxy, there's a lot of lag and failed swipes on the Galaxy. Never on the Apple.2. Many apps haven't been updated for this larger screenLots of apps appear in the wrong orientation and/or won't rotate, or appear in one quadrant of the screen.3. Chrome won't work the way you think it will workIf you were expecting a more desktop (or at least laptop)-like Chrome experience, forget it. The version of Chrome that installs on this tablet is designed for smartphones. No plug-ins allowed, no bookmark bar, bookmarks appear in a tab window instead of a drop-down/slide-out.4. BIG problems when using a ChromecastExpect your Note Pro to crash when attempting the seemingly simple task of streaming music from Google Play to your Chromecast device. Easy-to-reproduce and requires a tablet reboot only to happen again when you try streaming music.5. Nobody knows anything about this thingNot Samsung, Not Verizon (I have the LTE version). Other than the basics, at least as of two weeks in, nobody knows anything about the Galaxy Note Pro.6. BloatwareOh my goodness, they're redefined the phrase. I appreciate some of the freebies, but wouldn't it have been possible to remove the ones I don't use? Google+, Hangouts, Knox, (and of course Knox store, whatever that is), e-meeting, etc., etc7. A mouse!Ok, so I was amazed. Yes, with a Bluetooth mouse connected, an arrow icon actually appears on the screen and you can use it pretty much like any mouse on a conventional PC. I'm using the Microsoft Sculpt Touch mouse but any Bluetooth one will work. You can also connect a keyboard at the same time.8. Limited amount of accessories and ridiculous prices thereofBecause of its newness, there are a limited number of accessories and cases for this tablet. Furthermore, I guess because companies like Zagg and Logitech believe you're willing to overpay for the tablet, they can charge you a premium for accessories. $129 for a keyboard/case? You must be kidding.9. Amazon video/Flash player:Streaming video from your Amazon account is almost impossible. I was accustomed to using Amazon's streaming video app on the iPad to watch tv shows and movies I get from Amazon. There is no such app for Android devices.  This is very unlike Amazon and Google (but less so for Adobe) and I wish they would get over themselves and help their customers. BTW, there are no problems watching Netflix, YouTube or Hulu using their respective apps.10. The guys at Adobe (or someplace) will make sure you can't use this as a notebook replacementGetting Flash installed on this tablet is an exercise in contortion. It can be done via the installation of an obscure \"Dolphin\" browser, an older version of Adobe Flash and then jimmying with settings to put it all together, but it's complicated especially with this tablet running KitKat. I was successful, but it took a while. I understand this is because of a disagreement between Google (Android's developer), Amazon and Adobe.11. Amazon (or someone) doesn't want you streaming your library on the Note Pro:There is no Amazon streaming app as there is for the iPad (see #10 above).  This is very unlike Amazon and Google (but less so for Adobe) and I wish they would get over themselves and help their customers. BTW, there are no problems watching Netflix, YouTube or Hulu using their respective apps.12. New Charging / sync connector on cordThe Note Pro uses a new Micro USB 3.0 connector. It's wider than the one that THE ENTIRE REST OF THE PLANET USES. You can use an old-style Micro USB charger, but it takes much longer to charge it than if you use the cord that comes with it. Also, there are no USB 3.0 car chargers (that I've been able to find, anyways). ALSO ALl those zillions of USB chargers you own? Many of them won't charge the Galaxy Note Pro.13. Pricing and obsolescenceThe \"professional\" reviews of this tablet are lukewarm- mostly revolving around the reviewer's opinion of its high price and \"who would want a tablet with this large of a screen?\" These reviews can slow sales and drive the price down. The price of this tablet may decline at a faster rate than usual. What's weird is that even the reviews that start like that, often end up with a conclusion that it's a terrific product. I don't get it.UPDATE: Other thoughts:I've been using this device intensively for almost two months now as a replacement for an aging iPad and hopefully a replacement for an infrequently used notebook. If you're used to holding an iPad, this tablet will take some getting used to. Once you've had it for a few days, you won't want to take your hands off of it. For me, it is a near-notebook replacement, especially if you add a keyboard and a mouse. The Hancom office software is shockingly close in appearance and functionality to Microsoft Office.", "Date": "March 17, 2014"}, {"Title": "So far so good!", "Author": "Ibrahim Hafeez", "ReviewID": "R2ENI5PETK18LD", "Overall": "5.0", "Content": "Let's be honest. The only reason someone would pick up this tablet is for the sheer size of the beast. Since the Pro line of tablets have extremely similar internal specs the 12.2 in. screen does (somewhat) justify the added cost.With only a few hours of use, I found the device to be snappy and responsive. The new magazine UX is a nice touch although Samsung definitely needs to add support for more apps to be displayed (you can't add Gmail to the magazine UX!). Furthermore, small things like when you tap the calendar widget in the magazine UX it won't open the calendar app. Instead, you have to select an event displayed on the widget and then you'll be taken to that specific event (basically you can't go to \"month view\" or something similar just from the Samsung calendar widget).The S-pen is a delight as usual- even though I found that I didn't use it as much as I thought I would be. With a huge screen (and battery) the Galaxy Note Pro 12.2 is definitely a two handed device. Holding it with one hand gets tiresome very quickly and quite honestly feels a little awkward. If you're going to be moving around then this may prove too heavy of a device although it's certainly doable.The display is gorgeous. Nothing else needs to be said here.Overall, if you're looking for a tablet that mimics the power and productivity of a laptop then this is a great buy. The added screen space and multi window capabilities help set the tablet apart from the competition. There are a few software issues I have but this is a brand new device and I'm sure they'll be corrected in the near future. Certainly no regrets here.", "Date": "February 14, 2014"}, {"Title": "Well done Samsung, well done!", "Author": "Terra", "ReviewID": "R1EC4U7TMQMPQQ", "Overall": "5.0", "Content": "I had very high hopes for the Note Pro. I have been in the market for a new device that could meet both my business and personal needs. In my research I was left feeling like I was having to sacrifice one or the other. Then the Note Pro was announced... so I waited... and I am so glad that I did! It has exceeded all of my expectations. I have yet to find myself longing for anything. I haven't found a single task that I can't do on this thing. It's fast. I have yet to see any lag. No stuttering. The multitasking abilities are worth the cost alone. I'm so glad that I waited for this device.", "Date": "February 15, 2014"}, {"Title": "Brings tablets to a new level", "Author": "JK in LA \"JK\"", "ReviewID": "RSPZGFBNKHBZ5", "Overall": "4.0", "Content": "I own this tablet along with a \"smart cover\" and Android BT keyboard. I also own the 10\" version and Surface Pro 2. The Note 12.2 gives the tablet form new, and much needed, purpose. The screen size is now just the right size to do true multi-windowed multitasking. When used with the smart case, it easily rests in my lap or on a table. Combined with a BT keyboard, the tablet shows its real strength---working with documents, emails...anything requiring more attention than finger poking.I ditched the Magazine UI and went with Nova Launcher, but Magazine is headed in a good direction. I really wish Samsung would get rid of the bezel buttons. Additionally, charge time is too slow. I've read that the LTE version of this tablet will have faster charging due to its Snapdragon processor so maybe it's a limitation of the Samsung processor on the Wifi version.  Due to the buttons and charging, I have to give 4 instead of 5 stars.Overall, this tablet seems best suited to those who prefer using a BT keyboard. Even if you don't use a wireless keyboard the onscreen keyboard is excellent. With the increased screen size the keyboard is now big enough that I can touch type at speeds close to using a real keyboard, and that's a first for any tablet I've used. It even has the control c and v shortcuts for copy paste!", "Date": "February 17, 2014"}, {"Title": "The best tablet on the market", "Author": "chris olic", "ReviewID": "R1ATOKX1HM2WU9", "Overall": "5.0", "Content": "I have learned to ignore certain reviews on amazon, especially the ones who go into so much detail it just becomes anal at the things they dislike.i owned the tab, i owned the 10.1 note, the s4 and note 3, and now i have the pro12.2, there is no lag, its fast as hell, does everything better, the pen is mind numblingly better then before. evertying is blazingly fast, connects to everything perfectly, the free apps are ok, drop box and skydrive and remote play and free wifi in flight are the best of the bunch, the rest are not for me but you guys might like them , things like new york times mag etc. The ui is changed slightly and for the better, here is a tip, go to settings, about device, click on build number 5 times fasts to unlock developer tools and then scroll to windows,transition and animator scale and set them to .5 or to 0, this will remove the built in lag which is a transition samsung built in, this removes that and makes the system faster, apps open faster, also double click the button on the tablet and go into svoice, click settings and remove the double click to acitvate svoice, this way you you can use svoice through  the app and free that double click for something else. i have not 1 complaint, its light, thin and bigger screen are perfect in every way.", "Date": "March 23, 2014"}, {"Title": "My 6th tablet - and I like it", "Author": "Zed", "ReviewID": "ROH0P4CHU2VFG", "Overall": "4.0", "Content": "I'm not going to reiterate what many people have already said, just to get down to some highlights.  Also, just to give you some perspective - I buy a lot of tech and upgrade pretty frequently.  Have owned 7\", 10\" and (now) 12\" tablets - including Samsung, Nexus (Google), ASUS and Toshiba.  I almost didn't buy this one because of the price tag, but glad I did.What I really like...* Screen size (obviously), big difference over the 10\" screen (had the Nexus 10 previously)* The pen is great, this and screen size were my main two reasons for me getting this tablet* SD Card - great added bonus but with a catch (see below)My issues...* The SD Card, thanks to Google's new OS (4.4.2) apps no longer get full access to the SD Card.  Many apps cannot write to the SD card.  This means you have to download to the internal and then manually move things to the SD Card.  You also have to use the built in File Manager (for the same reason - limited permissions for SD access) which means you can't use some of the cool split screen File Mangers like Total Commander.* Same issue I had with Samsung's 10.1 (2014) tablet - button placement is not ideal.  You will occasionally hit the button while holding it and unlike the Nexus they don't relocate when you go to portrait mode.  This is a minor issue - will probably just take some getting used to.Other comments...* I don't mind the weight.  Probably because how I use it.  I'm sure if I was holding it in front of me for 30min it would get annoying (the 10.1 feels like you're holding nothing).* Charging time is pretty good, faster would be nice but it charges reasonably quickly.* There is a long stream of comments on another persons post about the Manual for this tab - you cannot (as of writing this) get a full manual.  Every location and method seems to get a different corrupted manual.  The best one I found was missing like 20 pages int he middle of it.  I pretty much never read these things but figured I would point it out.  Come on Samsung - you can make this tablet but you can't put an uncorrupted pdf online?????* TouchWiz and the new Magazine interface are okay but I replace the hoe screen with NOVA Prime.I'm still looking for the perfect note taking app for use with the stylus - currently using Papyrus.  If anyone has a better suggestion feel free to let me know in the comments here.Overall I'm happy with my purchase (though the price tag hurt a bit for sure).", "Date": "March 2, 2014"}, {"Title": "Wow.. Giant Tablet, Laptop replacement.", "Author": "rpv", "ReviewID": "R1NQ4BX08PQPO7", "Overall": "4.0", "Content": "A 12.2\" tablet! Really. The first expression will be of gasp. Wide open mouth. But this is reality. Let us compare the PRO lines from Samsung. I will first compare the TabPROs briefly, and then give a crisp overview of the popular Tablets in market now. Then I will do in depth into the current tablet itself. This will give a good perspective and enhance your buying decision. I am sure you are looking at multiple tablets to determine which suits you. If you have any questions, do ask in the forum and I will respond within a day. The three Galaxy TabPROs and the single Galaxy NotePRO differ only in size, and little bit in specs; they are functionally identical in all respects.The single most fascinating part of the TabPRO and NotePRO lines is the resolution. Astounding 2560 x 1600 on all lines which means on 8.4\" has the maximum ppi and excellent look. In comparison last year's Tabs have much lower resolution. I personally think this 12.2\" is heavy for personal purposes. Weight+Cost was the primary reason for my rating at 4 stars. For this price you can get a full blown laptop. I got it for work purpose, using with bluetooth keyboard and for personal purpose I will suggest the super gorgeous 10\" or 8.4\" tablet.COMPARISONS GALORE:key_specs: { model: resolution, ppi, CPU, RAM, Flash memory, SD_card, camera spec, weight, OS_type, size, charging/sync port type, GPS:y/n }Samsung Galaxy TabPRO 8.4-Inch {B,W},  WQXGA 2560 x 1600, 359 ppi, 2.3 GHz Qualcomm Snapdragon 800 quad-core processor, 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB,  8MP Rear + 2MP Front, 331 gm, Android 4.4 Kit Kat OS, 8.62 x 5.06 x 0.28 in, microUSB, GPS yes.  4800 mAh battery (the very best resolution on a tablet!)Samsung Galaxy TabPRO 10.1 {B, W}, WQXGA  2560x1600, 298 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB,  8MP Rear + 2MP Front, 469 gm, Android 4.4 KitKat, 9.57 x 6.75 x 0.29 in, microUSB, GPS: y, 8,200mAh batteryWow, a 12.2\" tablet now! This is just like a laptop with no physical keyboard built in.Samsung Galaxy TabPRO 12.2 {B, W}, not in USA Now,  WQXGA  2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32GB/64GB Flash, microSD upto 64 GB, 8MP Rear + 2MP Front, 732 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.31 in, microUSB, GPS: y, 9500mAh batterySamsung Galaxy NotePRO 12.2 {B, W},  WQXGA  2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32/64 GB Flash, microSD card slot up to 64GB, 8MP Rear + 2MP Front, 748 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.33 in, microUSB 3.0 port with backwards compatibility with microUSB 2.0, GPS - yes, 9500mAh battery, S-Pen,  NFC, Ethernet connectivity via adapter.A broad range of popular tablets as of 2014 Feb are Kindle Fire HDX 8.9\", Samsung Galaxy Note 10.1\"2014 edition, iPAD Air 9.7\", Samsung Galaxy Tab 3 10.1\", Google Nexus 10\" and Samsung Galaxy Tab 3 8\". If you are planning to buy TabPRO, do look at the comparison of 3 top features you need and pick one that suits you. This will enhance your buying decision.Kindle Fire HDX 8.9\" model: 2560 x 1600, 339 ppi, Snapdragon 800 2.2 GHz quad-core, 2 GB RAM, 16/32/64 Flash Memory, No microSD card, 8MP rear-facing camera, front-facing 720p HD camera, 374 grams, FireOS 3.0, 9.1 x 6.2 x 0.31 inches, microUSB, GPS:no [cellular versions have GPS]Samsung Galaxy Note 10.1\" 2014 Edition: 2560x1600, 299 ppi, 1.9GHz Samsung Exynos 5420 Quad-Core Processor, 3GB RAM, 16/32 GB Flash Memory, microSD slot:yes(upto 64 GB), 8MP rear camera and 2 MP front-facing camera, 560 grams, Android 4.3 Jelly Bean OS, 9.57 x 6.75 x 0.31 inches, microUSB, GPS:yes. S-Pen,iPAD Air 9.7\" (2013): 2048 x 1536 resolution, 264 ppi, A7/M7/64 bit processor, Flash Memory: 16/32/64/128 GB, SD Card:no, 5 MP back, 1.2 MP front, 469 grams, iOS 7, 9.4 x 6.6 x 0.29 in, lightning port, GPS:no [cellular versions have GPS]Samsung Galaxy Tab 3 10.1\" model: 1280 x 800, 149 ppi, Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, Flash Memory: 16/32GB, microSD slot: yes upto 64 GB, 3.2MP rear-facing, 1.3MP front-facing, 510 grams, Android 4.2.2, 9.57 x 6.93 x 0.31 in, micoUSB port:yes, GPS:yesGoogle Nexus 10\" model: 2560 x 1600, 300 ppi, CPU: Dual-core A15, 2GB RAM, 16/32 GB, SD:no, rear:5 MP, front:1.9 MP, 603g, 10.4\" x 7\" x 0.35\", mcroUSB, GPS:yesSamsung Galaxy Tab 3 8\" model: 1280 x 800, 189 ppi, Exynos 1.5GHz dual-core processor, 1.5GB RAM, Flash memory: 16/32GB, microSD slot: yes upto 64 GB, 5MP rear-facing, 1.3MP front-facing, 309 grams, Android 4.2, 8.26 x 4.87 x 0.29 in, microUSB port:yes, GPS: yesYou should come up with three top three specs you want and should be able to nail it down with the above spec. If you have doubts shoot me a comment, I can help, I have used several tablets over years!RESOLUTION:Good to see tablets coming straight out with Android v4.4 (KitKat). The resolution of WQXGA 2560 x 1600, and has a pixel density of 247 ppi. The videos were very crisp and text so sharp. The new Magazine UX interface makes the screen really pop. I was able to read text very easily. Aldiko and many libraries have teamed up and magazines can be checked out through the app, and they are super sharp. Resolution will blow you away.  This new Multi-Window UI that now supports up to four apps running simultaneously, each in its dedicated window. 12.2\" is great for pdf, books and magazines.PROCESSING POWER:Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM. Very powerful indeed! I have played games/watched youtube videos and have seen no lag or any latencies. Though the chip is octa core, do bear in mind only 4 cores are active at a time. This is done for minimizing heat.PRO MEANS?Tablet is certainly is a productivity tool. Notepro is truly professional in nature.  This tablet is touted as Enterprise-Ready and has Corporate E-mail/Calendar/Contact; Microsoft® Office-compatible; Mobile Device Management; On-Device Encryption (ODE); Preloaded WebEX; Remote PC and E-Meeting Apps; Virtual Private Network.  It also has Hancom office suite which is an office suite developer in Korea. Hancom Office consists of Hanword, Hancell (Spreadsheet), and Hanshow (Presentation program). Since there is Google office, I don't know if this will be any market in the US and other countries. All these apps are available in your other device. Yes, you have it in your laptop!STORAGE:Notepro comes in 32/64 GB configurations.  Having the expandable memory to 64 GB is the greatest invention since sliced bread. Well, putting bunch of video/audio/books on the SD card which is so cheap these days, the tablet suddenly has more memory with no lag observed.  With prices plummeting for 64 GB cards, it is a great boon. Put all your music, books, photos on the SD card and you have a powerful computer in hand always! I personally use the 64 GB microSD card on my mobile devices. Get this mobileUltra (SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging.CAMERA:Having a camera is a plus on smaller tablets, though I hate the feature on 10 or 12\" tablets.  I personally don't use back cameras as much on 10\"+. If you use publicly, it is like having a big magazine in front of you. Imagine the guy in the sports stand using in front of you! The resolution is 8MP Rear + 2MP Front. Video is 1080p 60 fps. Nowadays there is nothing much to say of cameras, they just work for the required purpose. Front camera is good for skype and business meetings.ERGONOMICS:I personally like 8\" for home uses, but  at 12\"+ this is truly a laptop replacement. I really wonder if this will have a market, but it is an experiment from Samsung. At 748 gm, the weight is definitely not single hand holdable.  This is 1.65 pounds. Still less weight than laptops. For example, 11\" MacBook Air weighs 2.38 pounds. Size of this tablet is 11.64 x 8.03 x 0.33 in. The battery is 9500mAh and should come  for easily couple of days for me at nominal usage. The best part I liked is the beautiful resolution and is the best resolution on a tablet! HD videos are crisp. Being a geek, I love this form factor.SOUND:Excellent sound system with stereo speakers and microphone. I was able to ask questions to Google Now and get precise answers.MISC:This is the only tablet I could see in Samsung's lineup with microUSB 3.0 port with backwards compatibility with microUSB 2.0. I tested OTG capability and it is great to have a external USB support.  USB Host is one of the most undernoticed features of Androids and is in my opinion one of the best features compared to iPad lines. What this means you get a USB Host cable also otherwise called OTG (On the Go) cables and plug in your USB thumb drive or other USB devices and the device recognizes it. I have used it with Alfa AWUS036H for a wireless project with Android PCAP Capture from reputable Kismet wireless.  Wi-Fi 802.11 a/b/g/n/ac, dual-band is really state of the art. 802.11ac is blazing fast!Having a GPS is great for immediate needs and I could get immediate lock on this tablet. Also has infrared which can be used for WatchON as a TV remote control. Worked straightaway on Samsung TV. This is also great for sharing your tablet with family members, multi user mode lets different users log in separately, so you each see only your own apps, backgrounds, and email.Obviously the S-Pen is the one that differentiates this Notepro from others. S Note docs, S Planner makes it so easy to organize with S-Pen. Also this has NFC  as well as Ethernet connectivity via adapter.  I really doubt if people will use ethernet connectivity when wifi is used everywhere. I really wonder what is the use case.APP POWER:I tried following apps and they just worked awesome. A tablet is only as good as the apps you have and how productive it makes you. It's almost like the camera/lens analogy in the DSLR space. What good it is to have a great DSLR body if you have no good lens? Same with Tablet body and apps you have.WolframAlpha (I can go on for hours praising this. This is a truly genius app powered by hundreds of supercomputers in the background. Wolfram is a computational genius). Well worth the $3 price.Withings HealthMate. (another remarkable app great UI/UX). I use Pulse and the integration with it as well as Weight machine is very good.23andMe app (I love their reports)Aldiko Book Reader Premium (absolutely love it, many libraries have magazines for checkout)Amazon MobileAndroid StatusAndroid Central app (great and must have for Android users)Androidify (kids love it)Angry Birds (Space/Seasons)Asphalt Car gameBattery Monitor Widget Pro (a great app)BeyondPod (use it daily!)BoxChromeCNET TVDictionary M-W PremiumNAVIGON (from Garmin - offline maps)TOM TOM app (has some advantages over NAVIGON)Google Navigation/Earth/Maps using a portable MiFi boxGoogle Currents (nice way to read News)Google Keep/Keyboard/Drive/Search/Books/Voice/HangoutsEbayFlipboardLinkedinGoogle Music (Awesome, I have now upto 10,000 songs halfway through Google's 20K Limit)Tapatalk HD (awesome forum browsing app)OverDrive Media Console: Library eBooks & AudiobooksMicrosoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for AndroidTwit.TvSkypeRealCalc Plus (Awesome calculator app)Wolfram AlphaZillowPlenty of WidgetsAsk questions, the reviews cannot do full justice. I will be glad to answer any questions and usually answer within 24 hours to any query.", "Date": "February 13, 2014"}, {"Title": "Lovin' my BAT", "Author": "L", "ReviewID": "R1WWQDXQOZ5LER", "Overall": "5.0", "Content": "Samsung proves what the ladies already know, bigger is better. The 12.2 Note Pro has received a high percentage of positive reviews on Amazon and other sites. Most professional reviewers, on the other hand, seem to think it's just too big, too heavy, too expensive, or it's just not an Ipad. Fortunately for me I've learned to take professional reviewers with a huge grain of salt. Thanks to reviews from real users on Amazon and balanced reviewers like Lisa Gade from Mobile Tech  Review I was able to take the plunge when the Note Pro went on sale.And I love my Big Ass Tablet (BAT)! I wasn't sure I could use that word in my review, but I did a search on Amazon and found out they sell this Liquid Ass So I guess it's okay.I've owned two 7\" tablets, two 10.1\" tablets, and I recently bought the Samsung Tab Pro 8.4\". The 7\" were good for portability outside the home, while the 10.1\" were good for couch surfing. I thought the 8.4\" would be a good compromise between the two that I could use for both, and consolidate down to one size. However, after using the 8.4\" for about a month I discovered my eyes aren't up to looking at a small screen for several hours at a time (reading/web surfing on the couch is my favorite past-time). The 8.4\" has great resolution, but text is still small and zooming in just means you have to scroll a lot. However, it is great for portability outside the home, and I will keep it for that.The 12.2\" offers no compromise web browsing and document reading. Rarely do I feel the need to zoom in. I'm also addicted to the S-pen. Love to use it for navigating my tablet, and I also prefer to write with the pen then use the onscreen keyboard. I guess it's Samsung tablets for me, until the competition catches up and produces something better.Some people might complain that the tablet is too heavy for couch surfing. I've solved this problem by modifying the Aerb case I got for the tablet Aerb® X Pro Series Samsung Galaxy Note Pro 12.2 Leather Case Cover Stand W Sleep Wake Function (for Galaxy Note Pro 12.2, Black Style A) By folding the cover of the case and securing it with four small binding clips I can use the case to prop up the tablet while lying on the couch or in bed. Weight becomes a non-issue and I only need to lightly grasp the tablet with one hand to keep it from tipping over. I've included some pictures to show you how I modified the case, for those that are interested (see the user supplied picture area of this product's web page).So far I'm completely satisfied with this tablet. My only complaint is the price. Wish it was more like $600.Even so, I'm livin' large and lovin' it! I hope Samsung keeps making this size tablet. It's ideal for my use.", "Date": "April 9, 2014"}, {"Title": "Hello Android And Samsung Goodbye IOS and Apple", "Author": "Honest Abe", "ReviewID": "RD4VYQM7K6H5F", "Overall": "5.0", "Content": "As an early tablet adopter Using the first generation iPad I have been waiting for Apple to get its act together and improve the IPad. This has not happened, Oh sure they made it thinner, weigh less,upgraded the hardware, gave it a bells screen, they even made it smaller.SO what??? Apple failed to make the Ipad better in all the ways that Count. Apple also has foiled to make the Ipad in the size needed most 12 inches.Sounds like I am Apple bashing right?Wrong! I have been patiently waiting for Apple to make the Ipad everything this tablet is. Apple has been stubbornly doing whatever it pleases with the attitude that the Customer Can take it or leave it.I agree with Apple so I have left them.While Apple has been busy being Cheaper on there products and Charging more for them while becoming even more restrictive if that were possible, others have been improving their Operating Systems & Hardware.Microsoft has proven Abjectly Clueless when it comes to mobile operating systems and did not offer me a real choice regardless of which manufactures were loading there hardware with Microsoft terrible offerings.Reluctantly as I began to suspect I had only one option left and that was to look at the Android Operating System.Make no mistake I detest Googles desire to destroy privacy, and this is the one thing that prevented me from looking at Android offerings to begin with. Then I thought about it some more and decided who really knows what Microsoft and Apple Are really collecting anyway?There is allot of crapware that comes loaded on this tablet trying to get you to give up give up your privacy for the right to use their application. Some of it also in addition to compromising your privacy wants you to Pay to use it.Unfortunately these are also in addition to compromising your privacy wanting you to Pay to use it.Unfortunately these are Apps touted to make the tablet more appealing.My solution was simple I uninstalled them!When setting up the tablet I also did not Use my Google Account.Oh I did the first time And realized they were following the heck out of everything and there was no way to turn it off.I just about contacted Amazon for a refund until it came to me to restore the device factory settings in settings.After I did that I discovered I could set up the tablet without using my Google account and getting it so embedded into everything.Now I could pick and Choose my privacy options with apps and yes even Google.At the end of the day though it is more about retaining the right to privacy than tinfoil hat reasoning.This tablet is remarkable it is fast, it is responsive, it is the perfect size for viewing magazines, web pages, Video, and working with spreadsheets, documents,reading PDF's or books even Via my kindle library.The screen is chez easy to read text on.By the way this entire review was written YES WRITTEN Using the included pen. Trust me no one writes this long yen review this way unless it works really well. Due to lock of use my penmanship has suffered yet this tablet translates perfectly and I see my penmanship actually improving as I write.A feature lacking in other brands of tablets is the ability to clear the Clipboard Samsung as Android has added this feature to the keyboard first hold down the button that symbolizes the Choices of input to sets it.Samsungs free office suite is just like working with Microsoft office.Extra memory can he added using inexpensive Mico SD Cards .USB Flash drives can be attached with a cable to read and transfer too, These are a huge features cheap, overpriced stubborn Apple has foiled to include.Yes I am dissapointed and over it with Apple.There are more features of course but this review is getting to long.Bottom time it is a perfect device or at least as close as we can get to one as of now.Im glad I bought this and do not think anyone will regret the purchase if they get one.", "Date": "March 6, 2014"}, {"Title": "Excellent", "Author": "Will", "ReviewID": "R2FTIWXBHORN36", "Overall": "5.0", "Content": "This is my second tablet I have owned after the Kindle fire hd. The screen is beautiful, tablet feels light for the size, is super fast, and very customizable. I get around 10 hours of screen time at medium brightness. It is great for comics, magazines, flipboard, Web browsing, and I like drawing with the sketchbook app and included s pen. I am looking for a good full size stylus if anyone has any recommendations.Overall I am very pleased with this device and am glad I went with this instead of a  10 inch model.", "Date": "May 23, 2014"}, {"Title": "I love it", "Author": "Piyush Tripathi", "ReviewID": "R1I7QYM3KQYYP8", "Overall": "5.0", "Content": "Pros: a big screen, colours are really vivid and s-pen is great for writing, taking notes, drawing etc. I have had this tab for a month now and Battery life is awesome. I use it almost an hour daily and in this entire month I have had to recharge it ony three times. Plus samsung gives goodies worth almost 800$ with this tab (gogo passes, google play credit etc).Cons: A bit on the heavy side. This tab is not something you can hold in your hand for an hour and feel nothing. No comparison with the lighter tabs (ipad air) in terms of weight. If you are holding something in hands for almost an hour, a difference of even a few ounces in weigh seems perceptible.", "Date": "May 12, 2014"}, {"Title": "Amazing world", "Author": "R. Singer", "ReviewID": "RWNA0YPGP4AR0", "Overall": "5.0", "Content": "This is stunning and even better than my highest expectations.  I also use a 10\" Asus and this isn't much heavier or harder to hold.Video: Stunning for watching movies in bed or in a car.  The best bedroom tv is a tablet.Business: Perfect size for a laptop replacement.  This is all I'm bringing for business on trips.Entertainment: mainly for my kids but this is a dream for them.  Quality is ridiculous.Samsung has the best Android interface.Build is very nice and well-done.  Buttons nicely placed.  Great hi-quality speakers.Not sure if the pen is worth it vs the regular galaxy.  I wanted it for sketching but the pressure sensitivity seems hard to control - maybe just a matter of getting used ot it.  I plan on using this a lot for a couple of years so the extra $ was a worthwhile gamble.Bought a Sony 64GB sd card.  Works great.  My only complaint is that Android treats the internal flash mem as special and many apps won't make use of the extra card (Google Music is a big culprit).", "Date": "April 16, 2014"}, {"Title": "A must have", "Author": "cmae", "ReviewID": "R2DKL9TPX2BOLR", "Overall": "5.0", "Content": "this is definitely a must have, I thought the price was going to be too expensive but it is actually worth it, tablet works flawlessly, the S pen is great, it has a lot of great futures, I definitely recommend it", "Date": "April 4, 2014"}, {"Title": "Almost perfect", "Author": "Amazon Customer", "ReviewID": "R1K34ERF3YPN51", "Overall": "5.0", "Content": "If you want to read technical books or go paperless, there is nothing better on the market right now. I remember two years ago, the first time I bought a 10'' tablet, I was disappointed at how small it was. I always wanted something a bit bigger so I can read my technical books without zooming in and replace my old laptop with. This tablet fit the bill. I don't understand people saying this is too bulky. I carry my 10'' tablet in a bag most of the times so it doesn't bother me at all to instead carry a 12''. Plus, I used to bring a 7 pounds laptop with me so it's definetly not an issue to me.In fact, this is much lighter than a laptop but yet at the same time it's more flexible. Want to read a book? No problem, this is a tablet after all and you can read in the confort of your couch. Want to type a text on the go? You can pair a bluetooth keyboard and a mouse and use your tablet as a laptop. Want to write something? Use the Spen. I really like to be able to choose my input method based on what I want to do.On the downside, there are three things that I would change. First the physical button. I mean when you are holding the tablet in portrait mode, it's really annoying to have a button on the side of your tablet. It's so easy to press it by mistake. I don't know why Samsung is not putting virtual buttons on its tablets instead. This is a no brainer to me. It's not a deal breaker though. You get used to it but this is something that should be corrected.I also don't like the fact that not a lot of applications support the multi windows mode. I know for a fact that if you root the tablet, you can enable all the applications to be windowed so it's not a technical problem. I don't understand why Samsung made this choice. It's really annoying to not be able to use all applications side by side.Third, I wish this tablet was wider. This is a 16:10 device so the device is very narrow compared to its height. I wish it was one inch larger. This way it would be closer to a legal letter dimensions. Better, why not having the possibility to remove the bezels when you put your tablet on a table. This would add much more space to write without adding weight or increasing the size of the tablet.", "Date": "March 18, 2014"}, {"Title": "TOTALLY AWESOME", "Author": "Isa Love", "ReviewID": "R196KG44LRM6Z5", "Overall": "5.0", "Content": "I have 'em all and there is no question that this is the best tablet anyone has made so far.  As long as the size appeals to you and you don't mind Android you will most probably agree.", "Date": "March 23, 2014"}, {"Title": "Pure Awesome", "Author": "Ryan Kessler", "ReviewID": "R17ASLNCFUISV3", "Overall": "5.0", "Content": "First tablet, and LOVE IT. External SD, full size keyboard, high resolution, kitkat, light for the size, and great for school/business. Using this at my tech school after boot camp!", "Date": "February 28, 2014"}, {"Title": "Awesome Tablet..", "Author": "Gunnar", "ReviewID": "RJL1V4PLTHDDO", "Overall": "5.0", "Content": "Even though I'm probably using this for more personal than professional use, it's worth it's price tag.  It's fast, has a ton of options, the S-Pen is pretty awesome even though I'm still getting the hang of it.  Since the Tablet is huge, the keyboard is perfect for me.  I've always had a problem with tablet keyboards prior, just because keys were always just a little too small, so I'd have the occasional typo..  The only downside is using it while laying in bed, I have to actually rest it on my chest because of it's size, and then hold it up to hit the backup button..  But honestly that's more of a user defect than a product defect.. =)  All in all I'm great with this purchase.. Hope this helps..", "Date": "February 17, 2014"}, {"Title": "Was This Tablet Created by Mere Humans?", "Author": "Toand Fro \"stumbling about\"", "ReviewID": "R2B7C1LT0QW1M7", "Overall": "5.0", "Content": "I needed a laptop replacement and started with the Asus TF701. The more I used the docked TF701, the more disappointed I was with both dock and tablet. It is fast, faster than my old Windows 7 laptop, but I was eventually dealing with crashes as well as the dock not responding and at one time it quit working altogether. Some tech savvy folk have returned their dock more than 5 times only to get another lemon. I was specifically looking at the TF701/dock as a laptop replacement for Windows, but most people who had replaced their Windows laptops with Android told me: \"Go get a Galaxy Note.\" I didn't want to go down that road because Samsung seems to be dominating the Android hardware market. I felt we needed a more level playing field as there was during the old PC-era with Dell, HP, Compaq, and the other companies which built hardware for Windows. I tried an $850 Windows 8 substitute for my old Windows 7 laptop, but it was rife with so many issues that I finally decided to stick with Android and eventually caved in and bought the Galaxy Tab 12.2 with the Zagg keyboard/dock (yes, I looked at the iPad as well and realized this was not a point in my life for re-entering the Mac-world). Boy, was I surprised...What a machine! Samsung has nailed the first generation of windowing on Android (and we can all hope there will be many generations to follow), the SM-P900 brings up a very complex Excel spreadsheet in less than 5 seconds (one which took my old Windows laptop nearly a minute to open), and it is just overall a phenomenal experience to use this, well, what can I call it? I feel like something from the future which has fortuitously landed in my hands . You can write on the screen and then send the notes to email or wherever and so far the translation has been nearly always right. The capabilities just go on and on...it is a laptop replacement and much, much more. This product showcases why Samsung dominates Android hardware, though their software wrap on their tablet is a lot of bloat-ware stuff which just gets in the way; because of that and the fact that the new leader of Android at Google has disabled external SD-access in Kitkat 4.4.2, I had to root it, as it looks like all of us will with any device which has an SD card in the future which we want to use as a disc drive unless standard access to external SD memory is reinstated, but rooting was an easy 15 minute process in my case (though one which voided the tablet's warranty if not unrooted before making a claim). I installed the Nova launcher as well.  Anyway, all said, when I look up from interacting with this Galaxy 12.2 Tab while writing this review by speaking/handwriting/and a bit of typing, I fully expected to see myself floating between solar systems in an advanced anti-gravity machine which is destined to take everyone who understands the power of the machine on an unprecedented adventure...it's the type of advance which makes one feel that way. And it's a good feeling. What a machine!", "Date": "April 4, 2014"}, {"Title": "Great size for those needing larger font for reading", "Author": "Thorough Review", "ReviewID": "R1ADUIC7LHN8E5", "Overall": "5.0", "Content": "I really like it. Screen is still sharp, though not as sharp as the same pixel dimensions in the two smaller versions, but every bit as good as an iPad, only bigger. I really like reading the Zinio magazines on it. Lots of folks have written way more, so I'm going to keep this short. I bought mine as used, not new to save about ten percent. Wrong idea. No complaints about the unit or accessories. The box was a bit crushed, but I got the version \"in original packaging\" thinking it would be new, just a defect in the packaging. Well, the unit was apparently registered by someone else and, upon trying to register it, I was told I was out of luck on claiming any of the perks -- like a $25 Google Play credit and multi-year free access to several services. I'd have to login using the original credentials, which, of course, I don't have. Not only that, if I want to use the Google \"find my device\" service, I can't because it's not registered in my account. I'm a bit concerned that whomever did register it could also activate the \"erase all data\" option and wipe me out. So I'm not too sure about buying things like tablets through the warehouse. It's a great device and an OK discounted price (although too high overall, but it is 12.2 inches), but the loss of other benefits may not be worth it.", "Date": "March 12, 2014"}, {"Title": "Just what I've been waiting for!", "Author": "Brad M. Cassagne \"Computer Buff\"", "ReviewID": "RGVOEWK7S75NO", "Overall": "5.0", "Content": "I've been waiting for a bigger tablet to come out for months now at least.  I really liked the Yoga 2 laptops except the windows tablet apps don't handle the resolution well and the screen is too narrow in portrait mode.  The Note 12.2 fits what I needed exactly.The feel and look of it is top notch.  The size is perfect for reading magazines, which is my primary use for it.  It's also just right for web pages and the bigger keyboard is easier to type on like you would a traditional keyboard.  Although it's not always as buttery smooth as my wife's iPad, the performance is quite good.  Far better performance than my Nexus 10.I love all the 140 lb nerds that say this thing will break your wrist.  True the size isn't for everyone, some people actually exercise and don't mind lifting 1.9 lbs.  I'm pretty sure my hand weighs more than that.  And it will effortlessly fit in any backpack with your laptop. I'd write more but all the other strong points have been thoroughly covered already.I bought the Wawo case for it on Amazon and I'm thoroughly impressed with it also.  It has a great expensive soft feel to it and fits extremely well for a good price.", "Date": "February 23, 2014"}, {"Title": "Worth every penny. Love this tablet!", "Author": "LuvLethalWhiteAussies", "ReviewID": "R1GFPKENTO71E5", "Overall": "5.0", "Content": "this is my third Samsung tablet, and I love it! For a tablet it is fast -- faster than some laptops I've owned. The larger screen size makes it so much easier to use the multi windows and any apps. One thing I really love is that the keyboard has arrow keys so the cursor can be moved around. How many times have you tried to tap the cursor in the correct spot to fix a typo only to end up backspacing and retyping the entire word because you can't seem to hit the mark? Of course that's not a good reason to spend the extra money for the tablet, but it's a nice addition to have.", "Date": "May 25, 2014"}, {"Title": "We love it!", "Author": "R. Mikolon", "ReviewID": "R6XJG2RWQ0MFE", "Overall": "5.0", "Content": "The first tablet we have tried that works for business. Looking at it from a productive business prospective this is the best tablet on the market in our opinion and we have tried almost all of them. Actually ended up with sixteen of these. Hancon is amazing, Evernote Pro is amazing(make sure you do your free upgrade the standard is just okay actually kind of worthless for business), voice recognition is flawless, ability to direct contact all other Note Pro tabs over our wireless network works great for supervisors and maintenance, and the list goes on but I have work to do. Don't write many reviews but this is a great tool. Not a fan boy of anything but this thing works.If you buy it make sure everyone is doing their updates. I think Hancon is kind of new so best to keep it updated.", "Date": "April 16, 2014"}, {"Title": "Very happy I bought it", "Author": "Andrew J Howard", "ReviewID": "R3U90I5M6TR1B6", "Overall": "5.0", "Content": "I have had 3 tablets previously, including an air currently.  I have had this device for about a month now, and I love the Galaxy Note 12.2.  For business purposes, it has enough screen real estate to actually get real work done.  This, combined with the precision available with the stylus make this the most used tablet I have ever had.  On top of that it's big enough to enjoy magazines and the NY Times and the SF Chronicle, something I've never cared for previously on smaller screens.", "Date": "March 31, 2014"}, {"Title": "Great for work", "Author": "D. Russell", "ReviewID": "R2LJMO3ZAY4H8L", "Overall": "5.0", "Content": "I purchased this for work use and find that it is excellent in that regard. The size makes it very easy to work on. The landscape keys include tab, arrow and other \"normal\" keys.  The s - pen and handwriting recognition work very well.  The screen is very clear.  Overall, a great addition to the Note line of tablets.  One other bit of information,  however.  The installed version of Android does not allow the user to write to the SD card in the slot; only apps can do so for their operating use.  Thus, I would not suggest purchasing a large SD card for your document storage. A smaller one is fine.  Documents added by a computer can be read, but not changed and re-stored on the card.  They have to be saved on the internal card.  This limit may change in future.", "Date": "March 31, 2014"}, {"Title": "A good tablet with some problems", "Author": "Amazon Customer", "ReviewID": "R1GOEOOG2QZZII", "Overall": "3.0", "Content": "I do agree with many of the positive reviews about the tablet however I would like to concentrate on the cons:1- The screen is too elongated in portrait mode which makes reading pdf files strange and not normal and reading pdf is the main reason I bought the tablet2- The battery life is around 8-9 hours and Samsung claimed 13 hours3- i have a strange problem Occasionally my screen/tablet will go into lock mode, the home button does not work (screen goes dim and I have to press the power button to wake it up and then enter my unlock info). When this happens and I unlock the tablet, the home button works as it normally does.I do love the tablet and hope Samsung can at least solve the last two points with a future software update and consider point 1 in their next note pro.", "Date": "April 30, 2014"}, {"Title": "A WORK OF ART", "Author": "BartGoldNYC", "ReviewID": "R389091OI8OJNX", "Overall": "5.0", "Content": "This tablet truly is a beautiful piece of technology that could be on display at MOMA. The screen is beautiful, the processor is lightning speed, the speakers are powerful and once you learn all the ins and outs of the s pen and android you'll wonder why you ever thought apple and the iPad were tops. IOS has nothing on android and the iPad is a play toy compared to samsung's line of note tablets, the note 8, the note 10.1 2014 edition and now the note pro 12.2.", "Date": "April 4, 2014"}, {"Title": "Wow! Just wow!", "Author": "CameraGuy", "ReviewID": "R1P46GLVPF2835", "Overall": "5.0", "Content": "I had the chance to use this tablet recently and let me just say from first impressions it is amazing!Screen was fluid with no lag or freezes, I tried out 4 apps at one time and still no freezes!I absolutely love the Flibboard integration into touchwiz, It's simply brilliant!Screen was absolutely gorgeous, Best I've ever seen, no other Tablet compares!Games play smoothly without any frame drops as well.Movies are gorgeous! It will melt your eyes, and you will fall in love as I have!All I can say is wow! this is what I've been waiting for in a tablet!", "Date": "February 28, 2014"}, {"Title": "Exactly what I expected.", "Author": "Ben Fischer", "ReviewID": "RY9ABRRJMJY1C", "Overall": "5.0", "Content": "As a previous reviewer had stated,  I purchased this tablet primarily to do artwork.  Both Sketchbook Pro and Artflow are easier to use than they are with my note 10.1.  The increase in processor speed and screen resolution, hence more real estate in between ui tabs allow me to pin palettes while working.  The only complaint I have is that the Spen's cursor seems to be a millimeter off of where I expect it , but it is acceptable.  I have been able  to figure out how to calibrate it but even if I can't it's easy to work with.  All in all this my 4'th Samsung device S3 phone Note 2 Note 10.1 and now this.  It is everything my other devices can do but it's a Cintiq as well.  I had bought EP 121 windows 7 slate to but i could never get used to using the small screen with painter or photoshop.  If you're looking for a pressure sensitive tablet for art, and you can make do with androids selection of art apps, get this.  One day art rage will come...", "Date": "February 23, 2014"}, {"Title": "Major Upgrade", "Author": "Tim D. Hendon", "ReviewID": "R1VRM2VCB6KHB3", "Overall": "5.0", "Content": "Pros:1.  Beautiful screen2.  Kitkat less burdensome than Jelly Bean UI3.  Much better keyboard4.  Samsung book fold is excellent.  Much better than previous ones (much stiffer).5.  Much easier control over apps to SD card6.  S pen works much better.7.  25% better battery life than 10.18.  Google and Samsung saucers are very convenient.9.  Magazine UX is very useful to have.  (see cons).10. Conversion from 1080 to 1600 is spot on perfect.Cons:1.  A premium product should have top of the line audio like the Kindle Fire.2.  Magazine UX needs independent refresh rates.3.  Menu button x 3 should be screen capture,  not palm swipe or menu/power depress.4.  Touch whiz can be laggey.Well worth the upgrade from previous notes!", "Date": "March 1, 2014"}, {"Title": "An excellent, high-performance tablet", "Author": "Ron Kropp", "ReviewID": "R2H1WJAMCK3EK8", "Overall": "5.0", "Content": "So far, this tablet is surpassing my expectations. The quality of the display is excellent. This tablet is very fast, especially when loading and navigating web sites in the browser. The touch screen is very responsive. The Magazine UX Screen is quite useful, for reading news, and for managing my calendar and email. I have never used a stylus before, but the stylus is proving to be very useful, especially in multi window mode. You can also use the stylus to \"hover\" in the browser, on websites like Netflix.com, to view, and interact-with popup windows.", "Date": "February 22, 2014"}, {"Title": "A Great Tablet", "Author": "Jeff C - Texas", "ReviewID": "R1NH0JFAGAKUDT", "Overall": "5.0", "Content": "I have had the unit for a while now and I am still using it daily.  I have fallen in love with Evernote.  The battery is lasting me several days between charges unless I am playing games. I can't says anything bad about this unit.Revised -My first Android tablet was the Motorola Xoom.  It has served me well and prepared me for the Samsung Note 12.2.  The heavy build of the Xoom allowed me to strengthen my muscles so that the Samsung Note 12.2\" table is not a problem.  So you will not hear me complaining that it is too big or heavy.  I can proudly say that I am man enough to handle the 1.5lbs. weight.Its a great tablet and the price is in-line with the value.  I did not expect the pen to be so cool.I did get a really good deal on a case here at Amazon.  At $5.88 each, I bought a spare.http://www.amazon.com/gp/product/B00HZFN2EE/ref=oh_details_o00_s00_i00?ie=UTF8&psc;=1", "Date": "February 19, 2014"}, {"Title": "Upgraded to this beast!", "Author": "Barbara Bermudes", "ReviewID": "R1E3FA4RBJ8V9B", "Overall": "5.0", "Content": "Very satisfied and definitely a Samsung returning customer!  It does everything it promises and so much more!  The capabilities are amazing!", "Date": "May 30, 2014"}, {"Title": "Amazon Stepped up and hit a home run!", "Author": "Peggy D. Wirtjes", "ReviewID": "R2YIGTK9E1CX17", "Overall": "5.0", "Content": "I like Samsung tablets but was a little up set when this one started having little problems right out of the box. I called Samsung technical for first problem and they were great and easy to understand.  Then the second problem happened and the charger or port went out.  I thought about sending it back to Samsung but realized it probably would be faster to send it back to Amazon since it was only a little over a week since I purchased it.  Boy, was I wright!  I received a ticket to return in minutes then was given instructions on what to do. Ups picked it up and the next day I received my new one.  Hooray for Amazon!", "Date": "May 29, 2014"}, {"Title": "I like this device", "Author": "bBozo", "ReviewID": "R14BYMWACF4WFC", "Overall": "5.0", "Content": "I find the Note very useful for me. Instead of carrying a laptop I use it. In my opinion it is not too heavy and worth it because of the screen size. The multi user option is great, since I share it with my GF. All the apps are installed completely separately.", "Date": "May 29, 2014"}, {"Title": "It does everything I want it to do!!", "Author": "John H Lang", "ReviewID": "R1RZ3DMODDGJP5", "Overall": "4.0", "Content": "I needed a lightweight (as in features, not weight) device to do quick note taking, doc updates, watch a video or full-on movies.  This guy/gal does it!  Love reading my email in the 12 inch format.  Looks normal.  Screen is good, you get Samsung Microsoft Office compatible office suite which so far has done a good job for me, have not run into any issues.  Using the pen to take notes has been excellent for me.  If I have to find a negative, it's that if you have to stand with it in your hands for a while, the weight may become an issue.", "Date": "May 27, 2014"}, {"Title": "better than expected", "Author": "Lee", "ReviewID": "RE1U0VK3KP2YL", "Overall": "5.0", "Content": "this tablet is even better than I expected.  I have the note III phone and they both work so well together.  This is definitely great for work and meetings.", "Date": "May 24, 2014"}, {"Title": "Good product", "Author": "laretha avant", "ReviewID": "R2E2F3D96MC8LY", "Overall": "5.0", "Content": "I love the tablet because it fits my lifestyle. The stylus with the tablet works beautifully. I would recommend this product to friends.", "Date": "June 3, 2014"}, {"Title": "Great 12\" tablet", "Author": "George Kulczewski", "ReviewID": "R3Q55HAGO6IO1F", "Overall": "5.0", "Content": "I wanted a big tablet with great speed and this fit the bill. Yes it was a bit expensive but I think it is wonderful! Battery life is good but I find it drains a little quicker than I anticipated so I charge it throughout the day especially if I use it quite a bit.", "Date": "June 3, 2014"}, {"Title": "Three weeks of use", "Author": "Tom Walker", "ReviewID": "R1S34QL67M6SAN", "Overall": "4.0", "Content": "So far the note pro is meeting my expectation and i have not used all the features that originally came with it. However, I am using it for my business. I especially like the spen features (still under used by me).", "Date": "June 3, 2014"}, {"Title": "Great purchase", "Author": "Athena Graves", "ReviewID": "R3SPJA191VFEO8", "Overall": "5.0", "Content": "It is everything I needed I luv my windows 8 touch screen laptop but having something more portable is just what I needed", "Date": "May 28, 2014"}, {"Title": "one thing missing", "Author": "Barry Solomon", "ReviewID": "R1WIOKS9TDQBCC", "Overall": "4.0", "Content": "I do enjoy my new Note Pro however waste alot of time trying to figure out how to use. No user manual except on line which doesn't help when trying to use on plane or other area where no wi fi.", "Date": "May 25, 2014"}, {"Title": "Great tablet for everything.", "Author": "Jane", "ReviewID": "R2UDSBV0ODWYNR", "Overall": "5.0", "Content": "I updated the tablet from the first Galaxy note tablet to this one. I am so surprised that the Samsung provided a lot of their technologies to make tablets much  better. Now, I am using this tablet instead of using my Window 8 laptop. I am a graphic designer and illustrator, thus I am drawing ideas often. And, this tablet has all what I was looking for.This one comes with the free Sketchbook Pro for galaxy. You do not have to buy any of apps to draw. It is enough to draw and colorings.If you are so concering about the touch sensitivities, I recommend the Ipad. Because this tablet does not seem that the sensitivities are so great.If you are making a lot of notes, this tablet is going to be your favorite. The S Note does not read your hand sensitivity, but only the pen. Thus, you can simply draw or write with your hand laying on the screen as if Wacom tablets.", "Date": "May 21, 2014"}, {"Title": "AMAZING, AMAZING, AMAZING...The Size is Just Right..!", "Author": "Amazon Customer", "ReviewID": "R2WKWGY0I0P9J7", "Overall": "5.0", "Content": "What a beautiful tablet. I cannot say enough about it. The screen resolution is amazing. The tablet is built very well. This Note 12.2 has better specs than the Tab 12.2. You cannot compare any tablet on the market to this Samsung Monster! If you are looking for a 12\" Tablet, you found one! Buy it...You will love the tablet..! I paid around $725.00, this is the lowest I could find one. If you can buy one for around $650, grab it because this tablet is worth every penny!!! Great Job Samsung...!", "Date": "May 21, 2014"}, {"Title": "Like the large screan", "Author": "Elizabeth A. Louzon", "ReviewID": "R3BC4H4BVD4ZD0", "Overall": "5.0", "Content": "This tablet has more features then I will ever use. I use it every day and am still learning more about it and its capabilities.", "Date": "May 21, 2014"}, {"Title": "absolutely good", "Author": "ptecsaba", "ReviewID": "R3H7OCG145FPU1", "Overall": "5.0", "Content": "Nice tablet just what I thought it would be. As musician I perfectly read PDF music sheets and easy to use. I also use it for lots of meetings and on the ho stuff and the battery life is amazing. Yes it takes to charge but it is a 10000mah battery not a 4000mah as most laptops. Overnight charge is perfect. With all the application at hand it is a windows laptop comparison. Of course android has to polish a lot to be smoothy all the time and take office tasks 100% hopefully it will come soon. For the price and performance it is a 100% review. Slimmer than most of my uni books why not then a notepro?", "Date": "May 21, 2014"}, {"Title": "A movie lovers dream tablet", "Author": "Amazon Customer", "ReviewID": "RRD3T5JQBJ4QY", "Overall": "5.0", "Content": "I wanted to upgrade my Toshiba Thrive to something newer and this is about as new as I could get. I am a fan of watching hbo go and youtube and wanted a good size screen. The 12 inch is marvelous and beutuful. For those saying it is too big, I say you are weenies. I can hold it just fine in one hand and it is super thin for its size. I love this tablet.  You will too if you enjoy watching movies like me.", "Date": "May 19, 2014"}, {"Title": "Love this Tablet", "Author": "eman", "ReviewID": "R28I3WPY4DR79I", "Overall": "5.0", "Content": "Love this Tablet.  Will never use Laptop except when I might need to see a CD. Bought USB adapter to use my Thumb drives.", "Date": "March 20, 2014"}, {"Title": "Awesome!!!", "Author": "zt696 \"zt696\"", "ReviewID": "R3SC22W48VNFXZ", "Overall": "5.0", "Content": "What a great tablet. I was looking for something this size for a long time. If you want a larger screen go for it. Do not listen to the people that say it is too heavy. For a screen of this size it is really not heavy at all. Time to retire the old ipad 3. I am now sold on Samsung yet again. They really do make outstanding products.", "Date": "March 8, 2014"}, {"Title": "Just what I've been waiting for!", "Author": "Kunal Dhar", "ReviewID": "R2JKNABF7KIKET", "Overall": "5.0", "Content": "I'm a big guy that reads a lot. Hands down this tablet provides best the reading and web browsing experience on it gorgeous 12 inch screen. The note taking apps and stylus work perfectly for jotting stuff down in and between meetings.", "Date": "May 12, 2014"}, {"Title": "Love the size!", "Author": "grizzly 24", "ReviewID": "R188DDGFRKN8FS", "Overall": "4.0", "Content": "This is a brand new tablet so you have to expect a few issues. Overall I love it! The size is great. The ability to have four screens pulled up at once is awesome. Just a couple of issues that I think samsung cleared up this week with a new firmware download. The battery does seem to drain a bit quick and takes awhile to recharge. Also the sensitivity of the touch screen was poor but that has been corrected. Overall I would highly recommend it. I've got an iPad 2 that I use as well as a kindle fire HDX. This tablet puts them to shame. No comparison in speed or display quality and the 12.2 simply has many more capabilities.", "Date": "April 13, 2014"}, {"Title": "great for class", "Author": "Alexandria", "ReviewID": "R17ZL7RFA02FW8", "Overall": "5.0", "Content": "Great for taking notes in class, and performs well in every other aspect as well. Love it, and highly recommend it for any college student.", "Date": "March 31, 2014"}, {"Title": "I am so in LOVE!!!!!!!!!!", "Author": "magun1975", "ReviewID": "RHAXU3VM7G28F", "Overall": "5.0", "Content": "I have waited diligently for this tablet to come out and I must say that Samsung made no mistakes with this tablet!! It's amazing hands down, the size, the features.I also love the color.  I had to get white to match my iphone and it just brings out the beauty in it. This really was a great investment and semi substitute for my computer when I don't have it with me.BTW:Make sure you get accessories.You wouldn't want a device like this to not be protected!!This is the \"Bentley\" of all Tablets\" right now...", "Date": "March 14, 2014"}, {"Title": "A little Disappointed", "Author": "J. DeBusk \"Zombie Lover\"", "ReviewID": "R1RZ4QU2KRTP6T", "Overall": "4.0", "Content": "When the Asus Transformer Infinity first came out, it was supposed to be the greatest Android tablet so I purchased it and was very unhappy.  It was slow and buggy.  I hated the Asus tablet so much, I've been using an iPad for everything.  I was excited to get this tablet, I don't like Apple and wanted a decent Android tablet.  I have to admit I'm a little disappointed.  From the specs, I thought this thing would fly.  However it still is laggy and I've found myself still using an old iPad 2 because some games and apps I regularly use just work better on it.  I love how open and configurable the Android OS is, just wish it worked a little better.  Something I don't understand is my phone is the Note 3 and it works great.  This tablet basically is a big version of my phone but it has lag I don't have with my phone.**Edit - I'm changing my review from 3 to 4 stars.  Changing some settings suggested in the comments and using Nova Launcher has made the tablet quicker.  The few frustrations that I still have are probably more to do with Android and not this tablet.  Overall I'm very happy with the tablet, especially since my previous Android tablet was the Asus.", "Date": "April 16, 2014"}, {"Title": "I love it!!!", "Author": "Jacqui Daley \"Old School Mom\"", "ReviewID": "RTTH0CFS92FPQ", "Overall": "4.0", "Content": "I absolutely love my Note Pro. I love the large screen that I am able to see my better now. When typing my fingers don't accidently hit the wrong keys. I love reading my books that have been synced with the tablet. It is everything that I wanted in a tablet and I use this more than my Toshiba Satellite laptop.", "Date": "March 4, 2014"}, {"Title": "Nice Concept, Far from Perfect.", "Author": "Eric", "ReviewID": "R2HNP81VG3XQKY", "Overall": "2.0", "Content": "I recently purchase this tablet and decided to return it.  The display was nice, very nice.  The screen eye sensor didn't work very well and the screen sleep mode kept activating.  The reviews and stats claimed this device to have all sorts of processing power but I have to say it was VERY laggy.  Even swiping between screens there was noticeable lag.  This was with no programs running in the background.  Sound from the device was nice.  The value just didn't add up for me.  For the money, this should have been a more polished offering from Samsung...  Battery life was pretty good but nothing a high level tablet shouldn't have...", "Date": "June 11, 2014"}, {"Title": "battery is the short board.", "Author": "john d", "ReviewID": "R27692UVG7IS93", "Overall": "3.0", "Content": "Pro:90% of why choosing this pad is the big screen. Have seen the high resolution  photos on it, I would not go back to the ipad.The other 10% is for multi-tasking. very useful feature.Con:Battery, for web browsing, a 100% charged battery can hold about 7 hour. Up to 13 hours of battery life per charge is a joke! Even when the machine is sleeping, the android system still consume a lot of power. I need to charge it every other day.sofware:  Be prepared that many  apps will not run as smooth as on ipad.", "Date": "May 20, 2014"}, {"Title": "Can't watch amazon prime", "Author": "Derdwin A.", "ReviewID": "R2E1C2JGO0TDY0", "Overall": "3.0", "Content": "Excellent but I can't watch amazon prime on it says device not supported other wise is great.... For my photos the resolution is excellent", "Date": "May 19, 2014"}, {"Title": "Be warned", "Author": "NoTuba", "ReviewID": "R35AR9AWJ4Y4LB", "Overall": "3.0", "Content": "Using Chromecast with this tablet can cause the UI to loop crash. While casting to Chromecast, swiping down on notification bar will cause com.android.systemui to loop crash until you restart the tablet. This is a quite common issue with Samsung's TouchWiz, called Magazine UX on this tablet. There are many reports in online Android forums concerning this issue. @SamsungSupport refuses to acknowledge that this is a problem.CPU is a tad slow for such an expensive, and high end, product. The screen is a beautiful and bright LCD. The free Hancom office suite is nice. Battery life is wonderful for such a large high resolution screen.", "Date": "May 16, 2014"}, {"Title": "great tablet", "Author": "Caleb Jones", "ReviewID": "R3FY364VHX97KG", "Overall": "5.0", "Content": "Great tablet.  Plenty of power on an android platform.  Rhe s pen works great as well.  I would recommend this tablet.", "Date": "April 29, 2014"}, {"Title": "Great product", "Author": "Roger", "ReviewID": "R3AP7W13Q5NG5N", "Overall": "5.0", "Content": "The best tablet that I have ever owned.  It is a great device and makes it easy to be productive on the go.", "Date": "April 24, 2014"}, {"Title": "It's pretty cool", "Author": "Amazon Customer", "ReviewID": "R346G8XR6C30YH", "Overall": "3.0", "Content": "Rewriting this review to keep it short and sweet. I think this table is the best tablet for writing. It's got a higher resolution, larger screen, and longer battery life than anything else. The tip of the stylus also has texture so it doesn't slide across the glass like the surface pro 2 stylus.It is lackluster in many ways though.-glossy screen - terrible for a screen where you have to view what's on the screen when lights are on, like somewhere you might be taking notes (meeting or classroom).-operating system - Android is wonderful, for phones. This operating was not designed for tablets. It was made for phones and modified for tablets. So a lot of basic computer functionality that has been around since the early 90s is not here. No folders in folders, you can't place icons wherever you want on the screen, most programs don't open in popup mode (windows). If you are looking for productivity, don't look here. You will spend time fighting with your system. What would take you 10 seconds on your pc can take several minutes on android, because of the various steps you have to take and not the limitations of the hardware.-no flash support - or rather semi useful flash support, when modded with Dolphin. You will have to look up how to install that. It is buggy and slow compared to other systems with similar or slower hardware.-the total lack of a tablet-based store - you want to find apps made or optimized for tablets? You'll have to google it. Many of the applications that are touted as being designed for tablets are just phone apps that run in landscape mode and look very poor. The vast majority of apps are of low quality compared to what they could be. A quick look over at what applications are available on ipad shows the potential that is being missed here. You can say there are good reasons for this problem, but reasons don't stop this problem from existing. You need to understand how bad the android app store is for tablets. We shouldn't have to sift through piece of garbage after piece of garbage to find software that is decent. The android store needs to have a tablet section and it needs to be curated. A base minimum of specs need to be established and developed for. There are a few wonderful gems out there that really showcase what could be possible on android. Just a few though. I don't have the time to do android's job for them. Some people like to customize and search and test for hours on end. I don't have the time for that.I returned the tablet and I will not be purchasing android again until they've resolved these issues.", "Date": "April 8, 2014"}, {"Title": "Would be a great tablet, but external SD card writing capability is crippled", "Author": "Ken L.", "ReviewID": "RPS5RQK57M6OK", "Overall": "3.0", "Content": "Very happy with the graphics and speed of this tablet. With power saving mode on and using thmenu system is easy to use and chock Full of Features too. I misht be bold to say, this Suite turnse tablet moderately, with a variety of apps, I was able to get more than 10 hours out of the battery. I was mainly inside, so I was able to use the tablet with a lot lower screen brightness than I would if I had been outside. This will make a difference, and in this case the tablet will not yield 10 hours.The main disappointment, of this tablet, and my , main reason of giving the tablet 3 stars, is the fact that external SD card storage capability is greatly diminished due to its use of Android 4.4. The only apps that will be able to save our modify data on the external  SD card are pre installed applications.  So the stock camera, Hancom Office Suite, etc., will work. If you install a custom camera,  or any thing else from Google play,  at the time of this writing, you cannot save data,  or move the apps to SD card.  You can however,  still read from the SD card.  Any modified files will have to be saved to the internal storage.  I don't like this restriction,  and I can't possible see any good coming out of it. If you rely heavily on SD card usage,  do not buy this tablet.  If however,  you can get by with the roughly 22GB of storage you have left after installing Hancom Office,  then it shouldn't be a problem. People might say to blame Google, and not let this affect the product rating,  but this limitation affects my experience, and Samsung and other manufacturers should pressure Google into fixing this!Speaking of Hancom Office, when you get your new tablet, it comes with the Hancom viewer pre-installed,  but you must install the applications to be able to edit and create documents. I can't speak for everyone,  but the download,  install,  and updates took a very long time;  several hours. I was not on a slow connection,  my home router is an AC one which this tablet utilizes very well.  Although you must manually download the application,  you are still able to save and modify files on the SD card. One last note on this is that you may manage the Hancom updates through the included Hancom Office Updater, but it is not managed through Google play or Samsung Apps.Hancom Office is the best Android MS Office replacement I've tried.  Beats all the others, hands down.  I don't want to do a full review on this application as you can go to YouTube and watch hands on videos of it, but I will tell you it has many of the features Word,  Excel,  and PowerPoint have, and by default, saves files in these formats. I'm a heavy user of Excel,  and it was hard to find an Excel formula that wasn't recognized. With word, you have access to shapes, etc. which the other office replacements don't even come close to having.have access to shapes, pictures, fonts, Formatting, etc. which the other office replacements don't even come close to having. The menu system is easy to use and chock Full of Features too. I might be bold to say, this suite turns this tablet into a productive mobile office. It might not have all the features You need, but it's real close.As with all Galaxy Note products, this tablet comes with the S-Pen which works very well.  The integrated handwriting to text application is very accurate too.  I have sloppy handwriting and it recognizes my handwriting better than Swype does.  Of course, Swype is much faster,  but for those who like to write \"Old School\", you will be fascinated.  I only wish you could control the pause delay time,  because I wind up making mistakes when I pause for a second,  because the text moves to the left side of the screen before I'm done writing.  It's not a big deal,  but I'd like more control over that. What's really cool is that when you install an additional language,  the handwriting to text engine recognizes the words of the currently selected language,  not just English.The Sketchbook Pro  app included pre-installed is very awesome if you are an artist.  Checkout Youtube, and search for \" Galaxy Note 12.2 Sketchbook Pro\". Even if you're not an artist it's still awesome anyway.0verall, I would recommend this tablet to anyone without the need of saving data to the external from user installed applications, or attempting to move apps to ext. SD card.", "Date": "April 23, 2014"}, {"Title": "It's everything it should be", "Author": "Mike S. \"mikescr\"", "ReviewID": "R28W59OQFKXI7Q", "Overall": "4.0", "Content": "I got this because I wanted a tablet with a big screen to run the Kindle app in portrait (had to be Android or iOS - the Windows Kindle app doesn't load \"personal documents\" from the cloud), and this was the biggest one commonly available.  I also wanted a bigger screen to connect to my home computer when I'm out.I had recently gotten a Galaxy Note phone and was happy with that, so I took the plunge, and the Galaxy Note Pro delivers on its promises.  The Kindle app is one of the most difficult for an Android device to run in my experience, and the app (and all apps) runs very smoothly, with none of the glitches and lagginess found on less powerful Android tablets.If you're considering this tablet, it's because you're willing to pay a premium for a honking huge screen and a strong processor.  I'd say it's worth the price on that basis.  I've found little to complain about.  I'm using the ZAGG keyboard cover - an external keyboard makes this an excellent laptop replacement.  The RemotePC app that comes with the tablet has not worked well, but I already use LogMeIn.  If you're counting on RemotePC, you should look into people's experiences with that app.", "Date": "April 8, 2014"}, {"Title": "Galaxy Note Pro 12.2 awesomeness", "Author": "Auto-topia", "ReviewID": "R6Q4JBOPCXC9M", "Overall": "5.0", "Content": "Samsung has hit another one out of the Park. Blows my note 10.1away. A must have. Been using for a month,  10 hours a day for work and play.  Screen is incredible,  go with the bigger screen, no regrets. This was the best deal ever,  SAVED OVER $200 on Amazon. There is never a reason to ever shop best buy. AMOZON excels in everyway.  Delivered in 2 days.", "Date": "May 30, 2014"}, {"Title": "Beautiful, Big, a Bit Slow", "Author": "Amazon Customer \"pcorning\"", "ReviewID": "R1O0HT9L48B9C1", "Overall": "3.0", "Content": "This was intended to be an upgrade to a Nexus 10 which is losing battery life and becoming unstable.  I have decided to return it after 3 days of trying to make it work.  It's beautiful, well polished, just not right for me.Pros:*  The screen is gorgeous.  2 more inches makes a huge difference, and the colors are as vivid as you'd expect from Samsung.*  Pen software is well done, nicely integrated with Evernote or other services.  The pen itself is well-designed, and it stores unobtrusively.*  Samsung's garish TouchWiz skin really doesn't detract too much, and it even improves Android's settings menus.Cons:*  It's slow, even after giving it a day to get through all its various downloads and upgrades.  Even with only the browser open, it stutters and lags as you navigate or open new pages.  I didn't expect this from a new device.*  It's really too heavy to hold comfortably, even with two hands, and yet it strangely doesn't include an integrated kickstand.*  If you're used to the stock Android email client you may not like Samsung's email, and you may not find it easy to find an alternative you like.If you want a larger screen to hold for browsing, reading and some data entry, this is probably too heavy and slow to make you happy.If you're going to prop this on a desk in front of you with case or some sort of mount, why not just buy a laptop and get a whole lot more for your money?", "Date": "February 25, 2014"}, {"Title": "Not so bad not so good.", "Author": "MLogician", "ReviewID": "R1PLRIZSH61YGN", "Overall": "3.0", "Content": "Samsung Galaxy Note PRO 12.2 is a monster of tablets. It has amazingly sharp and bright display. The S-Pen is superb. The processing power is OK but the Samsung UI just sucks. It is ugly, boring, slow, inconsistent, and not optimized for tablets. The notification shade is simply stupid. I had been using Nexus 10 before this and stock Android UI on that is awesome. Separate notification and setting toggles at different parts of the screen make sense, look good, and very very useful. I wish there was a GPE version of this tablet.", "Date": "March 26, 2014"}, {"Title": "Software Not Ready", "Author": "sam02135", "ReviewID": "RFXN9QII12009", "Overall": "2.0", "Content": "There were so many things wrong with this device; mostly with the software (Android and Applications).  I'll list them and then edit my comments as I recall them in the nesr future.Pros:  Nice \"portable\" screen size for viewing and drawing.  Screen resolution was good.Cons:  No software updates were available; I had the latest release.  Software problems: 1 -  Chrome browser had a serious bug; browser tabs can't be accessed.  Once you draw down the window shade to expose the browser tabs to be accessed,  the window shade quickly went back up preventing me from selecting the tabs.  I would think the Chrome browser would be at a working standard that is integrated with Android by now.  Do I download the latest Chrome browser?  All I asked was a working base version that came with the device.2 - I was looking  for the screen capture icon like my first (I believe) generation Note 10.1 but I couldn't find it so I took a photo if tge screen with my S4.  I should have video taped it instead.3 - I used the other browser included with the pre loaded applications to overcome the Chrome browser woes.4 - The browser screen became \"blank\"; I took a photo of the screen with my S4.5 - OS layout changes required relearning the OS.6 - WIFI connections were unstable, the tablet states it is connected to my router...but no data flow.7 - ? ...", "Date": "April 4, 2014"}, {"Title": "Fuzzy Screen Shots", "Author": "Linda Reed", "ReviewID": "R1UGKUTUWS7MVA", "Overall": "1.0", "Content": "I loved this tablet, but there is one glaring issue; when I use the S-pen to do a screen write, the resultant picture is very blurry.  I posted an inquiry about this, and also contacted Samsung customer service, where 20 minutes in, I realized they weren't going to be much help.  As the other poster mentioned, I will be returning this and most likely going with another vendor -", "Date": "March 5, 2014"}, {"Title": "Screen is unusually fragile.", "Author": "StepbyStep \"StepByStep\"", "ReviewID": "R2UF440XPSBR7K", "Overall": "1.0", "Content": "The screen on this tablet is extremely fragile. Speak with an actual person -that YOU know (who is using one) BEFORE you buy this tablet. You can damage the screen with just normal use. Like picking it up by the corner with one hand. I was told by their rep that because of the screen size, the screen can \"flex\" and create an internal crack. So even if you don't drop it or put it down carelessly, you can still destroy your tablet with normal use.Wonder why there are no \"defender\" cases for this tablet? If you buy this tablet, you may know very quickly.I was trying to replace my ipad 2 which is still great after more than 2 years of use, -wanted a larger screen.  Back to the drawing board :-(", "Date": "April 21, 2014"}, {"Title": "Glamorous piece of junk.", "Author": "Krishnamurthy Rajagopal", "ReviewID": "RABRLF5Q2UDAF", "Overall": "1.0", "Content": "Major issue with file transfer from USB to Micro SD cardWanted to transfer files from USB Hard drive (128 GB FAT 32) to Micro SD card (64 GB). It worked fine for few files and then transfer failed. I copied HD movie file and mp4 video files, transfer worked for few files then stopped.  The tablet recognizes the SD card and USB drive and I can view data and play files from the USB Drive and also shows SD card.. so nothing  wrong with  USB or micro SD card . But the transfer of the files failed after the transfer of few files. I formatted the SD disk and again try to copy from USB to Micro SD card and it failed again.  I took my system to best buy Samsung Re. They also tried and could not transfer the files from the USB to micro SD card. They called the Samsung technical consultant who gave a ridiculous answer that the system cannot be used for file transfers. So what I am supposed to do with this tablet ? Just browse net and download games ...? I wanted to store video files and photo albums on SD card by transfer from USB drive and watch them when I am in a place where I do not have internet access and also use this for my video presentation. But,  could not make this work.  I spent hours to resolve and even best buy Samsung representative tried their best but failed.In a nutshell FILE TRANSFER FROM USB TO MICRO SD CARD DOES NOT WORK.  I have not tested the display ability on large screen as I do not have the connector. For me this tablet is glamorous piece of junk. I would call Samsung tech support myself and see if this get resolved.I talked to Samsung Tech support and they concluded my SD card to be defective( which I purchased from Costco a day ago). It is weird that micro SD worked for few hours then gets screwed for some reasons. I went to best buy purchased another SD card and tested. For now I am able to copy from the USB drive to Micro SD card. Let me see how this goes and would update my review.", "Date": "May 26, 2014"}, {"Title": "What a Nightmare", "Author": "Lance D. Walker", "ReviewID": "R3D6UKL16WUJZD", "Overall": "1.0", "Content": "It feels odd giving a completely negative review of an item that some many people have fallen in love with, but this has been my experience with the Galaxy Note Pro 64 gig.When I first received my Note Pro everything seemed great, I could even get a free book from Amazon once a month if I used the Samsung Kindle app.  But within a couple of days the tablet was turning off whenever I would move it, even if I moved it just slightly.  After that the menu button and other exterior controls frequently wouldn’t work.  This made it impossible to exit a program (or settings).  It went as far as the on/restart button not working either.  I have to force a reboot in order to get out of the program I'm in most of the time.I thought it must be the tablet so I exchanged it.  The problem returned almost immediately, so I contacted Samsung.  The person I talked to said they’d never heard of anyone having this problem so they suggested a reset/reinstall, because they have to say something.  The idea seemed pointless to me since I had just gotten a newer tablet a couple of days previous, but I tried it anyway.  Everything was exactly the same in just a few hours.So I exchanged the tablet a second time, this time paying special attention to every detail of the set up process.  The problem was back almost immediately.  I’ve tried different things, like resetting the tablet without installing the programs I have saved, but it’s as if the tablet is infected with a virus that won’t let it perform as it should anymore.  So I’m just about done.  I’m going to give it a couple of more days to see if I can learn anything that might turn this tablet into the great tablet that everyone else seems to have gotten, otherwise I’m out.", "Date": "April 30, 2014"}, {"Title": "Worlds worse support?", "Author": "Marie", "ReviewID": "R2BNPEMKBP7E7N", "Overall": "2.0", "Content": "Just received this tablet and was trying to learn to use it.  Wanted to download the users manual.  It would not open with multiple browsers on multiple computers.  Adobe acrobat says the file is damaged when I try to open it.I wanted to let Samsung know and have them send me one I could open.Here is the exchange:\"Chat InformationPlease wait for a Samsung Agent to respond.Chat InformationAll Samsung Agents are currently assisting others. Thanks for your patience. A Samsung Agent will be with you shortly.Chat InformationYou are now chatting with 'Sammy'. There will be a brief survey at the end of our chat to share feedback on my performance today.Chat InformationYour Issue ID for this chat is LTK112560314268XSammy: Hi, thank you for reaching out to Samsung technical support. How may I assist you?ct: Just received my Galaxy Note PRO 12 inch today.ct: Went to the website and the pdf of the users manual is damaged and wont openSammy: I understand that the pdf user manual is not opening.ct: correct. tried chrome, ie, and firefox on multiple computers and the galaxy itselfSammy: I will be right with you.Sammy: I am checking the information about this.Sammy: I have checked the information.Sammy: As you have tried with multiple browsers and still unable to download a user manual, I am forwarding this to the appropriate department and they will look into this issue.Sammy: Please provide me with the following details.Sammy:Full Name : Home phone number: Cell or mobile number: Email ID: Street address (cannot be a post office box): City, state and zip code: Model Number of the product: Serial Number of the product:ct: Sammy. that is crazy. you can check the website to see if it opens yourself. It won't and then you can just tell whoever you need to tell. What you should be offering is to send your new customer a good pdf of the manual to his email at XXXXXX@XXXX.XXX so he won't send his new tablet back because of poor support.Sammy: I understand your concern.Sammy: I need to forward this to the appropriate department so that they will check the exact issue with downloading the user manual.ct: Please pass this exchange along to your boss and your marketing department. Tell them they can also view this exchange on the Amazon website as to why a customer returned his new TabletSammy: I relate to what you have said as a consumer.Sammy: There could be an issue with the link for downloading the manual.Sammy: The appropriate department will check what could be the exact issue.Sammy: Please provide me with the details so that I can forward it to the appropriate department.ct: if someone sends a users manual to my email address in the next 30 mins, I will continue to try to learn the product. if not I will send it back. A users manual should not be a lot of trouble for the customerSammy: I understand your requirement; however, I am afraid to say that we do not have an option to send you a manual through an email.", "Date": "February 26, 2014"}, {"Title": "Never trust Amazon again. Make sure your product's seal is unbroken!!", "Author": "Matti Nazeeh", "ReviewID": "R27DDOX4H3P5DR", "Overall": "1.0", "Content": "I was so excited to get the Samsung Galaxy Note pro 12.2. I ordered the product from Amazon and when i received the product i was very disappointed with it. First of all, the seal was broken (opened), and Amazon has covered the broken seal with another seal of their own. I can clearly say that there were two seals one on top of the other. But they've put the other seal on top of the original broken seal so that it would appear that the product was new and unopened. The second thing is that there was an obvious fingerprint on the device when i opened it, And also some dust inside. The third thing is that the original stickers ( that cover the sides and the back and the screen ) were replaced by a cheap replica and i could tell the difference for they were not placed perfectly onto the product and there were bubbles appearing on the screen sticker. Anyhow, i always doubted amazon selling used product and i said i'll try this time maybe i'm wrong. But i was right. I returned the product and will never trust Amazon again. Always buy from the original company, even if you have to pay a little money on the taxes. It's better than getting a used product.", "Date": "March 19, 2014"}, {"Title": "Love it, but as a tablet, the size is too much to handle", "Author": "Big Willie \"Big Willie\"", "ReviewID": "R580MGSFV22EL", "Overall": "3.0", "Content": "First, I bought this today at noon.  Black.  Also, I have an S4, and the gear watch...also an iPad 2 32g.  It is time to change out the iPad while support is still to be had.  I was geeked about this, the size all the extras..and I truly love it.  I travel often, so this considered a nice option for the flights, both for work and leisure.  But once I got it in my hands, was able to sit with it, move around, try both landscape and portrait, I realized how large this ting truly is.  I started to doubt it's practicality in my working environment, one not far off from many others.  That being said, I have come to the solid conclusion that it is just simply too large as a true tablet.  I am 6'4\"...a big guy...big hands.  It is just too large to use as a natural tablet.  With a keyboard, or less frequent mobile use...it likely is a gem.  But when I consider traveling, flying, pulling this sled out in a meeting, you may as well grab your lap top...NOT A TABLET....I just can't do it...plus the price does not make it any easier to overlook the uncomfortably large size.As in all things, especially tablets, how one uses it defines how good it is...to each person.  To me, The size, as a tablet replacing an ipad2 for business and personal use, it was overbearingly large. I really, really wanted to love this and have it work out....but it is going back.  I have since purchased a 32GB 10.1 Note 2014 edition, I believe it is a better, natural, tablet.  I love the Stylus...so the TabPro may not be an option.", "Date": "February 13, 2014"}, {"Title": "It's absolutely beautiful, but it's Android....made for Aliens, not unique Humans", "Author": "Henry Cunningham", "ReviewID": "R35K9GZVVNGD8U", "Overall": "3.0", "Content": "I haven't bought this Tablet, but since I picked it up at Costco,I really fell for it. It is just so cool. The feel, the faux leather aluminum combination; it has a great quality feel to it. But I'll be sticking with Apple. I regretfully bought the Galaxy 4S Active. My first and last Android device. My IPad is 95% me! personalized! self chosen apps. My Android aggravates me every time I turn it on with all the crap apps that I don't want, will never use, and get tired of looking at. I wish this was the newest Ipad, I would buy it and love it", "Date": "May 22, 2014"}, {"Title": "Good but not good enough for me to keep it.", "Author": "Ali Tran", "ReviewID": "R2XW2K570R0NU9", "Overall": "3.0", "Content": "very nice works well, but for some reasons i still like my ipad air better. maybe it cost too much i guess. i returned it.", "Date": "April 14, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HWMPSK6"}}