{"Reviews": [{"Title": "Excellent Value/Budget Tablet", "Author": "rpv", "ReviewID": "R2TSBQE97IN576", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moW8J1MZUC4YFRembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moW8J1MZUC4YFRrefresh_preplay() {\n\ndocument.getElementById(\"cv_moW8J1MZUC4YFRchiDiv\").innerHTML = document.getElementById(\"cv_moW8J1MZUC4YFRhiddenPre\").innerHTML;\n};\ncv_moW8J1MZUC4YFRrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moW8J1MZUC4YFRso;\t   \n\n\nfunction cv_moW8J1MZUC4YFRloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moW8J1MZUC4YFRso = new SWFObject(swfLocation, \"cv_moW8J1MZUC4YFRAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moW8J1MZUC4YFRso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moW8J1MZUC4YFRso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moW8J1MZUC4YFRso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moW8J1MZUC4YFRso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moW8J1MZUC4YFRso.setAttribute(\"height\", swfHeight);\n          cv_moW8J1MZUC4YFRso.setAttribute(\"width\", swfWidth);\n          cv_moW8J1MZUC4YFRso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moW8J1MZUC4YFRso.write(\"cv_moW8J1MZUC4YFRflashcontent\")) {\n          fp_resizePlayerSpace('cv_moW8J1MZUC4YFR', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moW8J1MZUC4YFR';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moW8J1MZUC4YFR', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moW8J1MZUC4YFRloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moW8J1MZUC4YFR\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mANNQEKAHA32Q\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mANNQEKAHA32Q\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2TSBQE97IN576\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mANNQEKAHA32Q/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moW8J1MZUC4YFRduration')) {\n      document.getElementById('cv_moW8J1MZUC4YFRduration').style.display='none';\n    }\n    cv_moW8J1MZUC4YFRloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moW8J1MZUC4YFRloadSwf(movieID, playerVersion) {\n   return _cv_moW8J1MZUC4YFRloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moW8J1MZUC4YFRnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moW8J1MZUC4YFR', 0, h);\n}\n\nfunction cv_moW8J1MZUC4YFRresetPlayer(w,h,bw,cc) {\n  cv_moW8J1MZUC4YFRnewHeight(h);\n\n  cv_moW8J1MZUC4YFRso.addVariable(\"resetBandwidth\", bw);\n  cv_moW8J1MZUC4YFRso.addVariable(\"cacheCode\", cc);\n  cv_moW8J1MZUC4YFRso.setAttribute(\"height\", h);\n  cv_moW8J1MZUC4YFRso.setAttribute(\"width\", w);\n  cv_moW8J1MZUC4YFRso.write(\"cv_moW8J1MZUC4YFRflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moW8J1MZUC4YFRRollOverImg = new Image();\ncv_moW8J1MZUC4YFRRollOverImg.src = \"http://ecx.images-amazon.com/images/I/818IOoLrM9S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moW8J1MZUC4YFRpreplay = document.getElementById('cv_moW8J1MZUC4YFRpreplayImageId');\nif (cv_moW8J1MZUC4YFRpreplay) {\n  cv_moW8J1MZUC4YFRpreplay.onmouseover = function() {\n    cv_moW8J1MZUC4YFRpreplay.src = \"http://ecx.images-amazon.com/images/I/818IOoLrM9S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moW8J1MZUC4YFRpreplay.onmouseout = function() {\n    cv_moW8J1MZUC4YFRpreplay.src = \"http://ecx.images-amazon.com/images/I/818IOoLrM9S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moW8J1MZUC4YFRpreplay.parentNode;\n\n  var cv_moW8J1MZUC4YFRcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moW8J1MZUC4YFRcurrentClick) {\n      return cv_moW8J1MZUC4YFRcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:44 MinsProntoTec Q8 7 inch Dual Core Tablet is a very good value in price per performance. It has 4 GB SDRAM. After installing bunch of applications, I still had available 2 GB. This runs Android 4.2.2. Android. Unlike other reviewers I did not face any issue at all out of the box and have been using for 3 days with no issues. Obviously you should know the feature set and use within the limit. I will go into the specifications and review based on my user experience.Most of tablets have ARM based processors.  This makes sure all of the Apps in Google Play ecosystem is available.  This has Cortex A8 Dual Core 1.2 GHz. If you look at my video review, I have screenshots showing the CPU speed and other kernel details.  The screen is 800 x 480 Pixels and has a RAM of 512MB. This supports a wireless and cellular with Wi-Fi (802.11 BGN) and Support for 3G Dongles. Settings page has a IMEI number already assigned.  Tablet has 2 cameras - Front 0.3M/Rear 2M.  There is a built-in 2800mAh Rechargeable Lithium Battery. Battery came for a good 5 hours with moderate usage. Battery usage really depends on how heavy you use the system. Overnight it drained very less. Mobile Networking was on by default. I switched off as I was using only Wi-Fi mode.  I suggest you go to Settings and tweak things which are not required. Developer Mode was enabled by default. I turned it off. The capacitive touch screen was really good, some occasions I had to press little harder and at right locations, but pinch-zoom, highlight, Copy-Paste all worked very well.It is great the tablet has HDMI interface along with micro USB Port, 3.5-mm stereo Headphone Jack, built-in speaker, microphone, micro SD card slot and a DC Input Jack. Note that for powering through wall adapter you need to use the provided DC input jack. I was surprised with the HDMI port inclusion and I can connect this to a HDMI capable monitor or any HDTV.  Speaker was loud enough. IN a room, once I keep the tablet in a stand it was good. Speaker is on the backside, so you don't want to lie this down on back as it will hamper the audio coming out. This is a designAndroid tablets are really customizable to your heart's content. It is here where ProntoTec shines. Using a native Android 4.2.2, they have achieved something at a low cost. This can have a very wide reaching audience. In many countries, where affordability is key, having a tablet like this with Wi-Fi is a big boon. Imagine having entire Wikipedia at your fingertips for a child. I tried few educational applications on this. I consider this as a big hit with educators than gamers.I tried Google Voice Search and asked \"what is capital of United States\". The voice recognition part was great and it was able to recognize and dictate the answer. I also tried Wolfram Alpha and asked bunch of questions. E.g., what is world population, what is population of China etc? The microphone picked up correctly and answered through Wolfram Alpha.  Apps like Calculator, Gmail performed flawlessly.I watched multiple video through few applications. Obvious first choice was YouTube. Was able to search and watch videos. I used TwIT.TV app and watched some segments of a podcast (video streaming through wifi). Again smooth playback. Handholding is really easy given the weight of it. It was a colorful blue; no heat observed handholding the tablet. It is plastic, and buttons are made of plastic. For a kid, this is perfect also though the feature set is equally appealing to an adult. I was so enamored with low cost computers in late 90s and it seems I am reliving them with tablet. If you want to listen to podcasts/watch video then this is perfect. Just keep it in a stand and connect to power. See my video review to get an idea of what I am referring to. For a computer geek, it is a challenge to design something with minimal resources - screen resolution, RAM, storage, chipset. ProntoTec has designed a tablet with budget conscious customer in mind. Out of the box, it worked to my satisfaction given the specification and price. Once powered on, it directly came to a working condition. No need to setup account prior to using. I signed with wifi, the wifi router was in one bedroom. I configured in another room separated by two rooms. There was no issue with wifi signal. Once connected, I created a Google account as well. I generated a Application Specific password as I had 2 factor authentication. Once signed on, I updated applications like YouTube, Google Keyboard etc. I also downloaded few applications like TwitT.TV, Tetris from EA, etc. I downloaded Chrome and browsed few websites. Listened to Audio / Watched Video. Out of the box battery needed a full charge. Initially without charge, I did a video stream and wanted to see how device shutdown. Sure enough it shut down as battery drained. Powered on after charging and everything was fine.I am impressed enough at the engineering for the price/value/budget it delivers. Cortex-A8 Processor is an ARM Cortex(tm)-A8 processor, based on the ARMv7 architecture, has the ability to scale in speed from 600MHz to greater than 1GHz. The Cortex-A8 processor can meet the requirements for power-optimized mobile devices needing operation in less than 300mW; and performance-optimized consumer applications requiring 2000 Dhrystone MIPS. This is from ARM specification. ProntoTec has pulled in many off the shelf components and assembled at a terrific value. I was particularly interested how it performs to streaming video. That is the golden test and it performed beautifully!", "Date": "March 4, 2014"}, {"Title": "great tablet", "Author": "Brina", "ReviewID": "R31H8RNO48OG79", "Overall": "5.0", "Content": "i got this for my aunt and she loves it its kinda smaller than i thought it was gonna be but shes happy with it great tablet for  the  price", "Date": "March 25, 2014"}, {"Title": "yay", "Author": "Amazon Customer", "ReviewID": "R2VJT83H4NNQW4", "Overall": "5.0", "Content": "Perfect for my son who is 5yrs old. He loves it completely nothing seen to be wrong with it so far", "Date": "April 15, 2014"}, {"Title": "tablet is good size but letter are much to small", "Author": "johanna", "ReviewID": "RYNNL9ZRJTBFW", "Overall": "2.0", "Content": "my cellphone has much bigger lettering and is smaller screen so this was a big disapointment love that it had google play but also the tablet has distortions in many angles very limited to clear screen shot. the responce is slow aswell. SORRY NOT FOR ME.", "Date": "May 13, 2014"}, {"Title": "Does not meet my already low expectations", "Author": "E. Kraley", "ReviewID": "R2KQ6F0EVM1Y3K", "Overall": "1.0", "Content": "The tablet screen resolution is very poor and it does not respond well to the touch. The casing feels hollow and within 30 minutes of careful, regular use by an adult there is a long scratch across the screen. The camera quality is so poor they should have just gone without. And it is SLOW. Forget about doing anything else while you are downloading an app or updating.I have noticed that most of the positive reviews seem to be \"decoys\", if you click on other reviews by the reviewer they all seem to be multiple reviews for the same tablet.Also, when we received the tablet it had an application error message that we could not get rid of until we researched it in Google and managed to get it to disappear long enough to do a factory reset.I bought the black pleather case to go with this tablet and it does not match up to the tablet, the camera and buttons are in different places than the holes for them.All in all, I paid very little money and had low expectations. It is worse than I had imagined. HOWEVER, I bought it for my three year old and he likes it just fine. I don't expect that it will last until the snow melts but he'll have fun with it until it breaks.I do not recommend this tablet.", "Date": "February 25, 2014"}, {"Title": "perfect for a teenager", "Author": "Sheri S.", "ReviewID": "R8VQ3801V785N", "Overall": "4.0", "Content": "my niece loves her tablet. does what she loves to do. and the array of colors makes it more personal for them. she loves her blue tablet. she has had no issues with it and she has been on it non stop for a month.", "Date": "May 24, 2014"}, {"Title": "Tablet PC", "Author": "Cheri Farbo", "ReviewID": "RIEUOPKE92A0G", "Overall": "1.0", "Content": "did not like it returned it, it would not stay charged and turned it self off and would reset back to Chinese and would loose everything stored on it. NOT WORTH it..", "Date": "May 20, 2014"}, {"Title": "It's ok", "Author": "skye", "ReviewID": "R1SP2299YJUFGG", "Overall": "4.0", "Content": "It's ok . It's useful I can say. But very cheap material. My camera has no color, only black and white.", "Date": "April 22, 2014"}, {"Title": "Thank you !!!!", "Author": "mariah cook", "ReviewID": "R1T1HWYRNI9YJN", "Overall": "5.0", "Content": "I loved it . It came right on time ! I have no problems with it & it's brand new ! The camera quality could be better but I think it's nice", "Date": "June 9, 2014"}, {"Title": "GREAT", "Author": "CARMEN", "ReviewID": "R2GEA0O6GHYG4B", "Overall": "5.0", "Content": "This is great for the price. I bought this for my son for his promotion to 2nd grade he loves it.", "Date": "June 6, 2014"}, {"Title": "Its okay", "Author": "josh kolacz", "ReviewID": "R12XQTD86E9PW4", "Overall": "3.0", "Content": "It is sort of touch unresponsive and things tend to stop working, it displays a message saying \"Unfortunatley (Whatever) has stopped working\"", "Date": "May 10, 2014"}, {"Title": "Quality isn't the best, but....", "Author": "The Jay", "ReviewID": "R2NUFPC67E48XE", "Overall": "3.0", "Content": "I've been spoiled with great tablets, I even gave my 2 year old granddaughter a 'hand me down' Kindle Fire, which she operates like a champ. But alas the charging port on the kindle broke and I HAD to get a replacement tablet. Since a two year old doesn't need much, I went with this tablet.  First, the screen clarity is pretty lousy. It's not crisp at all.  The thing is pretty slow, but acceptable. If you're used to a kindle or a nexus, then you'll have to learn a little patience.  The touch response is a bit off on the x/y coordinates; if you need to pinpoint a small touch area like a tiny link in the web browser, it can be a real chore to hit the exact spot... but for most larger things like icons or the games a two year old likes it's acceptable.  On the geek side, this thing comes pre rooted so if that's your thing then more power to you.  Like I said, I'm used to quality tablets so I might be a bit demanding. This tablet gets an \"It's Okay\" because overall it's acceptable and very inexpensive.  Now if the two year old doesn't like it after i give it two her this weekend (and trust me, she is very vocal and opinionated like her grandma :), then I'll come back and update this review....", "Date": "May 7, 2014"}, {"Title": "Blue Prontotec tablet", "Author": "Valescia", "ReviewID": "R1EWRYM231Q6KS", "Overall": "3.0", "Content": "Not too high tech but will do..its for the kids...just the right price for something of such quality!!! Color not the best.", "Date": "May 3, 2014"}, {"Title": "tablet", "Author": "kary garbutt", "ReviewID": "RHG3NX5ODZY5D", "Overall": "5.0", "Content": "the tablet is great and my grandson love it the only problem is that the charger broke an i contact amazon an was told that they too would contact the company to sold the th tablet an get back to me but as of to day i haven't herd anything and the tablet don't hold charge longer than one hour the tablet is for my two year old grandson and he love it", "Date": "May 3, 2014"}, {"Title": "Can't charge power button doesn't work", "Author": "Terri L. Flament \"Terri\"", "ReviewID": "R1PMI5TSRBQQ8C", "Overall": "3.0", "Content": "The charger that came with it won't go all the way in and falls off. The power button works off and on. I have to keeps pushing and keep pushing it until it finally powers on. When it does come on it's ok so far. I mostly use it as an e reader and for Netflix. The colors are not that bright and the icons are too tiny for me. But I guess you get what you pay for.", "Date": "April 27, 2014"}, {"Title": "Needs a better user manual", "Author": "susan", "ReviewID": "R1NBECBMUHJJ26", "Overall": "3.0", "Content": "I just got mine today. I wish it had a better user manual. Having problems charging it. The icon says its charging for about  2-3 minutes and it goes off. The user manual included doesn't not cover anything about charging. Otherwise, it's ok I guess. Will add more to this review after I figure how to use it. I've been searching on line for a better manual but can't find one.", "Date": "April 3, 2014"}, {"Title": "Horrible tablet", "Author": "Trisha", "ReviewID": "R1ALWBJ844XV7D", "Overall": "1.0", "Content": "Ordered this tablet last Saturday for my daughter and just received it today and already returning it. Turned it on and had a message that wouldn't get off the screen even after you pressed the \"okay\" button. Well be dropping it off Monday morning for a refund. Don't waste your time.", "Date": "February 28, 2014"}, {"Title": "Affordable!", "Author": "KPAk", "ReviewID": "RDYML9PI18EJ3", "Overall": "5.0", "Content": "I bought seven of these based on the ratings. I feel this product should have a higher rating for these reasons:FIRST: PRICE is affordable. You cant walk into best buy or any store and buy a tablet for this price. You just can't.2nd: I bought these products as gifts to some friends who are just beginning to learn the tablet world and what apps are. This is great for the basic internet use and games.Third: I would recommend this product to anyone who just wants a tablet to surf the net, facebook, skype, watch netflix.. I mean thats what we do on our apple products anyways so why pay sooooo much when you can get the same thing for a cheaper price??", "Date": "April 25, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HXB5H8Y"}}