{"Reviews": [{"Author": "Bron \"Bron\"", "ReviewID": "R1IYO3FMPRLXHN", "Overall": "5.0", "Content": "The Asus VivoTab Note 8 is neat new entry in the Window 8.1 tablet market. It has a lot to offer at a very compelling price.  It comes boxed with a charger, micro-USB power cable, some printed doc, a quick start guide, warranty, support info and a license for MS Office Home & Student 2013 edition. It also features a stylus and Wacom digitizer built-in, a nice 8 inch IPS display, and very decent battery life and performance from the Intel Atom Z3740 Quad-Core 1.3 GHz CPU.  All of this comes at a very aggressive price point (a year ago tablets of this nature were selling for 2-3 times current pricing!). If you are in the market for a Windows 8 tablet, this unit is definitely worth consideration!The 1200x800 8 inch IPS display has a tall vertical (portrait) or wide screen format, depending on how you position the tablet (3:2 aspect ratio).  It's plenty bright, nice for videos, and the text is sharp. The resolution is a pretty good match for the display size, keeping text large enough to be readable. The built-in Wacom digitizer features 1024 levels of pressure sensitivity. The stylus will activate the screen from as far away as an inch or so and the palm rejection is very good. The stylus really is useful, works well, and is a definite plus for this tablet. (And it stores conveniently in the tablet itself as with Samsung's earlier models, which is definitely the right design choice.)The included license for Office is a big plus for those who need it, especially at this price point. The included One Note also seems to work very well and might even be more useful to many. In my early tests, I was very impressed with the hand-writing recognition (conversion to text) functionality. Much better than I expected.The tablet looks good to me (not snazzy, but fine) and the back has a nice soft feel to it. The front is pretty much the same as most others - black, shiny bezel and screen. The power button and volume buttons are also pretty typical, but did have a nice feel. One odd note is that the Windows \"Start\" button is on the edge of the tablet rather than the front. I'm not too sure about this design choice.  I might get used to it, but I really liked, for example, the B&N; Nook's HD+ tablet's easy to use front button. (So I mostly \"swipe-in\" from right to left to get the Start screen rather than using the button).The tablet is fairly light and easy to hold, though the 7 inch size tablets are a little easier to use with one hand, the larger 8 is better for video and productive work, I think. It's the \"sweet spot\" for me, anyway, (I loved the Toshiba Excite 7.7\" which also worked well for me). The 8.9 inch models are better for watching videos, but harder to hold and use for any lengthy period of time.The display is very nice to my eyes, having good contrast and bright colors (and being plenty bright as mentioned earlier). I'm not obsessed with resolution and the resolution seems perfectly fine to me for this size display. Certainly, everything appears sharp and clear.The Intel Atom Z3740 CPU performs very well and in use the tablet feels quick and snappy nearly all the time. The 2 GB of RAM seems sufficient for most purposes, more would be better, but I did not notice any major problems in normal use. You will experience some slow down if you try to do too many things at once. This is a tablet, not an ultra-book, after all. One area to note is that the included 32 GB of internal storage is almost completely consumed by the Windows OS and apps, so you will need to add a 32 or 64 GB micro-SD card for storage if you plan to do any real work on this thing. [Update: I installed a 64 GB microSD card. In PC Devices I then configured this as the default storage location for Music, Pictures, and Videos.]So far, battery life seems right at the claimed 8 hours (Update: I think there's a mistake in the highlights listed on Amazon for this product where it indicates 6 hours, I believe 8 is correct as is shown in Asus info later in the listing.) or even better. I think you might easily get more if you are conservative. I can easily go all day without worry. For occasional use, you might go a week. At any rate, 8 hours or better is very good. Most tests I could find online seemed to confirm this. The included charger is a powerful 2 amps and the unit charges using a standard micro-USB cable which is nice. Thumbs up for no proprietary charging cable needed! (Charging time seems to be around 3-4 hours, even though they recommended an 8 hour initial charge before use in the quick start guide.)I have not tested the cameras extensively yet. I don't use tablet cameras that much myself, these seem to be about average in my cursory use.Initial set-up was a breeze, much easier than earlier Windows tablets I've tried, due to the fact that numerous post-setup updates were not needed to get everything working correctly. In this case, things worked properly out of the box, as they should. I was up and running in just a few minutes. Finally, windows tablets are now competitive with Android tablets, in this aspect.  (I love both Android and Windows tablets, but this tablet changes the game, as you can now have a tablet running the full Windows 8.1 OS at the same price as an Android tablet. Yes, there are pluses and minuses to that, but the case remains that, before this, Windows tablets came at a high cost premium by comparison. Now the \"cost\" playing field has been leveled.)I will be updating this review over the next week or two, as I gain more experience with this tablet, but based on my tests so far and my initial impressions, I am rating the Asus VivoTab 8 at 5 stars based on the exceptional value, features, and the included Wacom digitizer stylus.  This tablet packs a lot into a nice package for the price asked.I will continue to test to make sure there are no significant problems or glitches, as yet undiscovered, and will update if needed.Hardware Notes:- Includes dual-band 802.11n Wi-Fi and Bluetooth 4.- Includes a microSD card with OS recovery software. (Remove and keep in a safe place!)- Ports: One micro-USB, one 3.5 mm Headphone, one microSD card. No HDMI.- GPS hardware on-board is Broadcom GNSS.Usage notes:- Making handwritten notes with MS One Note on this tablet is actually easy and useful. - Drawing diagrams and annotating them works fairly well (for simple things, anyway).- Included Home Office means you have some serious app power on-board out of box for productive work.- Not impressed by the \"cameras,\" but as an avid photographer, I never am.- As you would expect, \"desktop mode\" is not the preferred mode, however, thanks to the digitizer stylus, it is actually usable. Still, as a tablet, the metro/modern interface is much easier to use.- As with most tablets, speakers are OK, not great. Use headphones or external speakers for best sound.- Some nice security features like secure boot, disk/data encryption, and so forth available.- Can use an OTG USB cable (not included) to connect USB devices.- Has Miracast capability, but I have no compatible displays, so unable to test this feature.- Includes 1,000 GB of Web Storage free for one year. Plus some free SkyDrive (MS) cloud storage as well.2014/03/26 Note: I purchased a MS Surface Pro Pen/Stylus (here: Microsoft Surface Pro Pen) as man reported it's better than the included stylus.  While the included stylus seems fine, it is very thin, the button is hard to find and activate, though it does have the advantage of storing in the tablet itself.  The surface pro pen is thicker, more comfortable, the button is very easy to locate and activate, and, to my surprise, it seems to actually work a bit better. I find it takes less pressure to activate (click) things with the surface pro stylus.  It's not a huge deal, but if you will be using the pen a lot, then might be worth it. I, myself, like it much better. Oh, and it also has an active eraser on the top end which the included pen does not, which can be handy.2014/03/29 - Everything is working fine. The surface pro stylus is definitely better and easier to use. I now think of the stylus that came with the tablet as my \"backup\" stylus, safely stored in the tablet in case I forget my pro stylus.** See comments for info on a possible pen issue some have reported. Mine is working fine so far.  Will update here if I learn any more about it. **2014/04/11 -- Everything continues to go well with my Asus Vivo Tab Note 8. No issues.2014/04/21 -- Continues to work fine and has recently had some good reviews elsewhere.  Low battery drain and overall good battery life is very enjoyable. Stylus continues to be a big plus, as is the nice display screen.-", "Title": "An exciting new entry in the race! Excellent value and freatures", "Date": "March 23, 2014"}, {"Author": "Fermata \"D.S. al FINE\"", "ReviewID": "R1UZZE6892XJ7V", "Overall": "4.0", "Content": "I have used both Android and iPad  tablets and this is my first  Windows tablet. I didn't expect to  like it since prefer Apple at this  point. But after just a few hours  I am becoming a fan. This tablet actually is more of a small PC. A tablet generally  lacks full-featured programs that you  use on your laptop. This tablet runs  the same Office programs that you run on a  regular computer. So you don't have to  compromise on functionality for portability. That is a HUGE advantage  over regular tablets to me-especially  Android since that is not a mainstream  desktop os at this point. Though both Android and iPad have Apps that can approximate Office applications,  Neither works as seamlessly as an  actual PC /macbook.The thing that makes this tablet truly  amazing is the Wacom stylus and the  ability to write naturally AND  have that handwriting  converted to text with a high degree  of reliability. In fact, this entire  review is written in my hybrid  script/cursive handwriting. And it has translated every word flawlessly.  This means for the first time, the tablet can be used for natural and fast note taking at work or school.the hardware on this tablet is very limited. Applications run slowly compared to a full sized PC  so this won't replace your PC.  But you will love being able to just pull this out and jot  down a few notes and have  full access to your email  and software you use everyday. I wish it had -wireless LTE  capability. Then it would truly be the perfect mobile  device. However it is pretty close as  it is. Be sure to spring for the 64 Gb  if you can since with the full 0S,  you only have about 12 Gb  left for your data.  You can expand the capacity with an SD  card but if you like to Carry  lots of music etc, you will  constantly be shuffling data  and files around. I love my Ipad. But this may make  me switch -- particularly since I have to use  Windows for work.  The windows app store is still lacking  compared to Apple or Android. But  again, since you can run real  PC applications you don't really  need Apps to the same extent. This tablet is definitely worth a look if you truly want a device  that marries the best features of  a pc and a tablet.[NCJVR]", "Title": "Definite advantages over ipad and preferable to android", "Date": "March 24, 2014"}, {"Author": "Matthew Buckley-Golder \"amazon_womble\"", "ReviewID": "R1AXA0U09UNAS1", "Overall": "4.0", "Content": "This has to now be one of the better Windows 8 tablets, all things considered. Surface 2 is the benchmark, but there is no smaller version of that tablet (yet) and the Surface 2 is a bit too big to be portable in all situations. This is a great commuter tablet.Given a few days of one or two hours of daily commuter use, battery life in connected standby is decent, and basic tasks like e-mail, calendar, e-reading (PDF, Kindle) have appropriate apps available and work well. It gracefully handles transitions between having WiFi and not having WiFi.I initially had mixed feelings about the stylus, which was one of the main selling points of this device to me (though I have come to appreciate the device overall in general). It initially required me to press quite hard to register and I was thinking that it wouldn't be workable, but this was improved considerably by calibrating the stylus input. I don't think it would be very good for anything other than rudimentary drawing, but it is easily usable for handwriting-instead-of-typing input, as well as in OneNote use. It still requires a little more pressure than I would like after calibrating, but it's easily usable (note that I prefer pencil note-taking, which generally requires less pressure than ballpoint pens do).The included stylus is not that great (it's very thin), but is functional and stores in a built-in compartment within the tablet body, which you'd think the Surface 2 Pro would do by now (but doesn't).Comparing this to a Microsoft Surface 2 (non-Pro), the VivoTab Note 8 is clearly not in the same quality league and not as well-refined. The VTN8 picks up fingerprints very easily, and looks greasy after a few days of use. The screen is not as good, and the lack of a front-panel Windows button is a negative. The sound is also not as good on the VTN8. However, the VTN8 feels as fast as the Surface 2 and can additionally run traditional Windows applications, which the Surface 2 can't (though I'm not sure I will ever do that on such a small device). And, obviously, the Surface 2 does not have a pen.Something that might not be obvious is that this tablet has GPS hardware, which the Surface 2 does not.Like the Surface 2, this tablet is very \"wide\" and still looks a bit awkward in portrait mode (as does the Surface 2 - its proportions make it seem too \"tall\"). I have mostly been using this tablet in landscape mode (but it works perfectly in this mode).Note that some reviews mention the VivoTab Note 8 tablet comes with an SD card containing Windows recovery data to free up space on the device. While this is true, it does not apply to the 64GB version - the SD card only comes with the 32GB model.I also carry an iPod Touch for listening to music on the go. Could this replace it for that? Maybe - not sure. I haven't really looked into it, but I other than being much bigger physically, I suspect it'd be lacking in three key areas that the iPod handles well: management of a non-cloud based music library, the ability to go an entire week without needing a charge, and podcast handling.Overall, it's recommended. The Windows 8 eco-system is still not as mature as Apple's or Google's, but the basics work very well, and in many cases this is a tablet that's easier to use to get real work done (especially given that MS Office is included).", "Title": "Very well-rounded Windows 8.1 mini-tablet", "Date": "March 29, 2014"}, {"Author": "Jim Besso", "ReviewID": "R30G4D4D642KIH", "Overall": "5.0", "Content": "Bottom line up front: this is an incredible tablet.I've had this tablet for a few days now, and here are my impressions.  I'm coming to this tablet from an ASUS transformer, which was a 10.1 Android tablet that I used every day for several years.  I also regularly use a Samsung Slate, which is a 10.5 Windows tablet that I upgraded to Windows 8/8.1.  I also use a Kindle Fire fairly consistently.  My hope is that I could find a tablet that could blend the strengths of these devices (and ultimately replace my transformer, which was growing increasingly crash-happy).  I needed something that I could use to take notes (both hand written and typed), do school work on, read books on, and have fun with from time to time.  It seems that I've found what I needed.I purchased this device with a ISVO bluetooth keyboard cover, and I would recommend you do that.  I got the 64GB version of the tablet, which leaves about ~40GB or so free, and I purchased a 64GB Sandisk Ultra SD Card, which worked perfectly.  I relocated my \"user\" folders (Documents, Pictures, Music, Downloads, Desktop, etc) to the SD card, so that future installs do not get in the way of any documents I put on the device. I have a 250GB \"OneDrive\" account from Microsoft (used to be called SkyDrive, which I liked better), which integrates well with Windows 8.1.  Amazon, Dropbox, Google, and even ASUS offer cloud drives, and ASUS will give you 1TB (1000GB) for free for a year when you buy this thing.  Storing files shouldn't be an issue, but with more memory locally on the device, you have more flexibility when you're not connected, so having the extra SD card is handy.Set up was fairly easy... but I suppose that's more Windows than ASUS.  I'm not a big fan of Windows 8, but it does do well on a tablet, and thankfully, it hasn't been much of a detractor up to this point.  Its very stable, and it runs very fluidly.  Thankfully, there's not a lot of \"bloatware\" included on the base install of Windows.  There's a couple of camera-related apps, but except for Office (which does not include Outlook), you're left to install your own stuff, rather than spend forever uninstalling stuff you won't ever use.  ASUS has an array of apps that are available to only ASUS devices on the Microsoft Marketplace.  I haven't, but I suppose some of them would be useful to take a look at.  I already used Windows 8 on my Slate, so I just had Windows import the settings from there, and I was up and running in a few minutes.The WiFi works very well.  It picks up signals better than my phone does (Samsung Galaxy Note 2), about the same as my Kindle, and better than my Transformer did.  The connections it makes are very stable, and the speeds seem to be very quick.  I transferred some pretty beefy files (7GB) as quickly as they transferred on my laptop.  The ultra SD card seems to not have slowed things down... or if it did, I haven't noticed.The screen is very bright, and quite crisp.  The colors seem very rich and deep, with very black blacks.  I'm not one to go on and on about resolution, but it seems at least as crisp as, and maybe better than, my Kindle Fire HD, which touts its video capabilities quite loudly.  It also has better color than my Galaxy Note 2, and running MLB.TV on it produced a surprisingly clear image that looked far better than the rendering offered by the same app on my Kindle and my phone.  Side by side by side comparisons of Netflix seemed to yield similar results... it was as good, or better, especially in terms of smoothness.  If I want a clear, crisp image, I'll watch it on my TV from a DVD, but the video from Netflix is pretty impressive.  Another pleasant surprise.  My Kindle has direct access to Amazon Movies, and happily, the Vivo is able to stream them over a browser, so I'm not going to have to give that up.The screen's shape is a bit odd.  Its a bit wider and narrower than my Kindle (which is a 7\" model).  In \"landscape\", you don't notice very much, but in \"portrait\", the view looks a bit too narrow at first.  it has about the same dimensions as my phone (which has a 5.5\" screen), so its not way out of line, but it does look different than what my Kindle conditioned me for.  Now that I've been using it, I don't notice so much, except when I'm running OneNote, where my note space seems a bit more like a shopping list than I'd like.  Its not too much of a detractor, but it is something I noticed right away, but I'm sure I will get used to it.I didn't expect to find anything that was as strong as a desktop could be, or even anything that could fully keep up with a full-sized lap top.  I wanted something small, and it was expected that that comes with a price.  After using this thing for a few days, I'm pretty impressed with how well it holds up under duress, and I've installed applications that I never expected to be able to install.  Windows is very responsive, and apps fire up quite quickly, and the over all experience feels much like it would on a laptop.  I'm a database developer, and use some beefy programs from time to time.  Using VPN, I am able to access my company's network just fine, and surprisingly Microsoft's SQL Management Studio runs well enough on this thing, which is something I did not expect. I installed Visual Studio 2012, and while I'm not going to break any speed records, it works quite well, another pleasant surprise.  I never anticipated that I would be able to run these types of applications well enough to use it.I'm in school - Seminary, to be more specific - and I needed a device that could edit Word documents and do footnotes.  Android has some very capable options, but footnoting is beyond anything that I was able to find on that platform.  Word runs fantastically on this thing!  The small screen isn't really a problem, and with the document zoomed to the margins at 12pt font, the screen is VERY readable.  Coupled with the bluetooth keyboard in the cover I bought with this the tablet, I'm able to do everything I need to, which is what I ultimately was hoping for.  I haven't turned on my laptop since buying this tablet... it does everything i'd need my laptop for.I installed the desktop version of Logos ([...]) on my tablet, an app I didn't expect to be able to install because its so resource-intensive.  It runs very well, and if its slower than it is on my laptop, I haven't really noticed yet.  I'm pleasantly surprised.  The windows 8 reader app for Logos works perfectly also, but having the full program available lets me untie another string from my laptop, making this Vivo Tab even more useful to me.  7GB of space is a big price, but the functionality is worth it to me.Multi-touch works great.  The on-screen keyboard responds well, and the screen seems pretty accurate despite my fat-fingering (which causes problems from time to time on my phone and kindle - it seems more accurate to me).  The Pen is fantastic.  Using One Note, it works very well.  My handwriting ends up as clear as it did on my Slate, and the transition is complete as far as my Slate goes (it will be retired).  Clicking takes a bit more of a click than I'm used to - my Galaxy Note 2 also uses a pen, but I'm already used to that.  My Galaxy's pen works perfectly, by the way... and the pen on the ASUS works perfectly on my phone, which probably makes sense because they're using the same technology, but I figured I'd mention it anyway.  I didn't experience the \"corner\" or \"edge\" problem mentioned by others... but since I've used a Slate, which also uses a pen, maybe I'm already used to it, and wouldn't notice.I'm getting pretty good battery life.  I use this thing all the time.  I bring it with me to meetings, take notes on it, check my email, stream music or radio a lot... its always with me.  I'm averaging 6 to 6.5 hours of steady on, and that takes me through the day most of the time.  I watched two complete games on MLB.tv with it when on battery, and at the end, windows was letting me know that I had about 10% left.Ultimately, I think I've done pretty well.  I've replaced my Transformer (which I do miss - I loved that thing!), my Slate (which at this point has a battery that lasts maybe a half hour, but it would cost too much - more than this device - to replace), and my Kindle (which is a great size for reading, and I enjoy the Prime Movies quite a bit - This tab is good for reading, and I can stream movies using the browser on this device).  It increasingly seems that I will be able to replace the functionality I gain from my laptop with this much smaller and lighter tablet.  This thing is small, light and nimble, but I have been most impressed with its ability to keep up with what I've tried to tax it with.I'll update this after a month or two, and provide more information then... but for now, I absolutely recommend this device (ASUS Vivo Tab Note 8, 64GB) without reservation.", "Title": "Very Pleasantly Surprised", "Date": "April 23, 2014"}, {"Author": "IneffableMF", "ReviewID": "R24ZEMSTO7J5TN", "Overall": "4.0", "Content": "I had been looking forward to a 8\" Wacom enabled tablet running the newer Atom chips.  After being disappointed by Lenovo's decision not to include a stylus in their newest 8 inch and Dell's inferior pen in the Venue, I picked this up in March shortly after release (not from Amazon).I have been fairly happy with it, but have concerns over how long the (kind of) cheap build will last (something Asus is a little infamous for in their less expensive tablets)PROS:Wacom stylus -  I use this for taking notes and some infrequent illustration work.  The included stylus fits inside the case like a Samsung Note so it's always on-hand.  I bought a Wacom Bamboo Feel and it is even better to use with the device.Full Windows - So much versatility!  I can run browsers with all of the plugins/flash I am used to, I have full Office Suite, Adobe software - whatever you want as long as it doesn't require tons of CPU power, but really most everything 'normal' can be done with no problem.  I have no trouble with Windows 8.1; it's good on a tablet, although I can see how mouse users might be frustrated at times.SDXC Card expansion slot - A must with full windows and the productivity aim of this device (at least for me).Inexpensive - for what you get it is pretty awesome.OK:Screen - It is bright 'enough' and viewing angles are OK, but resolution is lacking when compared to iPad mini 2 or any other high res device.  This does make windows usable (scaling in Windows still not very good) and increases battery life.  I would trade it for twice the resolution with a $100 price increase in a heartbeat though.Battery Life - Gets around 8 hrs usually I would say, I do have to plug it in more often than an iPad (then Again I don't use them as much anymore since I got this)Build quality - I actually like the soft touch plastic back.  The sides are a OK.  The screen doesn't have a proper oleo-phobic coating to reduce fingerprints, it also doesn't seem like it is super scratch resistant, I got a small one from who knows what.  The back (from research) is able to be popped off to access inside which is appreciated by me -just in case I need/want to replace battery after warranty is up.Sound - One speaker is louder than the other, but I rarely use the tablet like this anyway.  Headphone sound is alright - I occasionally hear some noise artifacts (something so subtle most will never, never notice it) so I don't think the audio DSP is top notch.  On the plus side, It can drive fairly large headphones with no problem (I use Sony MDR-V6)  Aside from the occasional artifact it sounds really clean and does not have distortion at high volume (kinda dangerous to your hearing as it can fool you if you don't pay attention and are used to distortion being an indicator of loudness).  Their have been several driver updates so they are improving the sound somewhat (I presume).CONS:Wacom Digitizer Layer has stopped working - This is apparently the case for a number of devices after return window is up.  I am in the middle of doing a RMA and will update when done.  It is almost certainly a hardware issue and is probably going to be relatively expensive for ASUS to fix - probably will have to replace to entire mainboard if I had to guess.  So I feel a little bad for them, but seeing how quickly this happened in this device, it is something they should have caught.  I just hope they fix it properly and the problem does not return.Not really the devices fault - but Windows 8.1 is still not quite a seamless fluid experience like iOS or even Android, but it more than makes up for it in versatility.  See PROS.No HDMI or other video out - doubtless on condition from Intel's contra-revenue agreement (where they basically pay manufacturers to use their chips in tablets) so that Atom sale don't cannibalize their main bread and butter i-series.  I have wanted to do this a couple of times for tv output.  If I were a normal person (if only) I could probably use this as my only computer as well... if it had video out for a larger monitor.  I know you can use usb adapters, but then you can't charge the tablet at the same time (suspicious as well).  MiraCast from what I have heard is just going to be a frustrating experience for any actual user interaction due to a display delay - should be OK(ish) for displaying media though.Some 'bad' spots in digitizer layer - caused mainly by (unshielded) speaker magnet interference and poorly compensated for in drivers.  What I mean by this is the pressure sensitivity is decreased and the path of lines is somewhat distorted.  This happens at the top near the camera mainly, but also at the other (less loud) speaker at the bottom.  Side of screen issues are like other devices in that accuracy is decreased - this is 'more' of the screen percentage-wise since it is a 8\" screen though.Doubts on lifespan of device - The above digitizer problem coupled with reports about the use of cheap memory that failed in the first Nexus tablet, make me worried about what corners were cut elsewhere and how long this device will last.  I will continue to update if other issues arise.It seems like I found a lot of flaws (the digitizer one could be a killer, we'll see) but the pros are so strong that I still rate it four stars and it definitely surpasses the criteria of just OK.  Sorry to be so long, but I hope this has been informative.", "Title": "What I was waiting for... but worried about longterm durability", "Date": "April 23, 2014"}, {"Author": "Sleepy", "ReviewID": "R1VYBSKJBSN2T9", "Overall": "4.0", "Content": "Update: ASUS considers this to be a notebook computer. If you Google ASUS ADP, it will tell you how to register your tablet within 60 days of purchase for free one year ADP. I just got an email from ASUS saying it was registered and I could make one accidental damage claim within the next year. Amazon is considered to be an authorized reseller.  I thought this was great!!!Old Review: A little about me. I own an iPad 3, iPad mini, Nexus 7, a gaming PC, and a Macbook air. Obviously I am an Apple fan. However, lately I've been really annoyed by them. They are charging the \"Apple Tax\" for an operating system that is locked in. So let's talk about the Asus Vivotab 8. In the short time I've owned this, I've done more work on this than either iPad I've owned for years. We are talking full Windows 8.1. If it runs on a PC, theoretically it will work on this tablet.Gaming:Remember, this is not a gaming PC or tablet. It does not have an independent graphics card like the Razer  Edge. However, I've installed Steam. Luckily I buy \"classic games\" during Steam sales. I fired up Commandos 2, Age of Empires 2 HD, and Stronghold Crusader. They are a little buggy but they work. Definitely playable. The stylus allows for easy point and clicking. The 64gb is definitely needed. Even older games take up 1-2 gb. After all the updates you are left with about 34gb free. On the 32gb from what I read you are left with 6gb after unloading the backup to the micro SD card.Photography:Adobe just released Lightroom 5 for the iPad. However you cannot truly edit RAW files with it. It gets synchronized with the \"creative cloud.\" This is why the Vivotab is so much better. I was able to install full Lightroom and continue my workflow completely on the go. I also installed Photoshop. The stylus helps with menu navigation, slider bars, and editing the fine detail. It works and it's not a pain. It's actually more fun than using a mouse. Again, get the 64gb if you plan on editing RAW files.Work:One note is very easy to use. Helps with organization, quick notes, or ideas. It also comes with full Microsoft Word, Excel, and Power Point. Great for presentations! Once again, Windows 8.1 has a huge advantage over iOS. It allows me to connect remotely to my job. SSL, JavaScript, and all. The 32gb will work just fine for this purpose as you can use the microSD card if you need to carry more files.The downside:The edges of the screen do not respond to light touch from the stylus. You just have to remember to press harder. I've tried calibrating the screen & it doesn't help. It's not a game changer because of this problem. I had the exact same problem with one of my old Lenovo laptops that had a digitizer. It takes a little getting used to. That's why I am only giving it 4 stars.", "Title": "FREE Accidental Damage Protection! Also...Gaming, photography, work.", "Date": "April 16, 2014"}, {"Author": "KLK", "ReviewID": "R2B3HQVFCTNG7E", "Overall": "1.0", "Content": "Nice idea in theory.  The stylus helps navigate the Desktop Windows OS.Not long after I purchased it, the front camera, ambient light sensor, microphone, and headphone all went out.  I spent hours trying to figure out why until it seemed to be obviously a hardware issue.  Went back and forth with ASUS phone and online support, was first told to reset the device (which they seem always to suggest as the first step)-which I'd already done.  Then an RMA (ship back for repair) was suggested; I had to take it to UPS and ship it across the country at my own expense.  For days, until I wrote to ask them where it was, there was no online acknowledgment that the device had been received.Eventually, it was sent back to me with the hardware issues fixed but Windows reinstalled.  I had to call Microsoft to activate Office, having previously had to reset the device so many times.  Then I discovered that Windows was not activated, so I got back in touch with tech support, and was told to reset the device yet again.  Can't understand why this wasn't done during the RMA.If you're used to high-resolution phones/tablets, the 1280x800 relatively dim screen is also a striking downgrade. Many stylus taps are also not recognized, and you also have to push hard enough with the stylus at times that you worry you're damaging the screen.Wish I had not purchased this or that I'd returned it via Amazon.  This has been a waste of my time and money.", "Title": "Stylus integrtaion good.  Poor execution, poor customer service", "Date": "May 6, 2014"}, {"Author": "Terrance S.", "ReviewID": "R2FH12CD0IK6I7", "Overall": "4.0", "Content": "Pros: Great value, digitizer, x86 Windows 8, GPS, Miracast, Microsoft Office Home & StudentCons: Button feel, digitizer doesn't work well around screen edges, glass not scratch resistant, sometimes unresponsive.I see traditional laptop and desktop PCs like the original Ford model T ~ they were one-size-fits-all solutions for an era where the choice was whether to own a computer or not. Today, we have a great variety of choices, and the ASUS Vivo Tab Note 8 is one of the new breed of x86 computing devices that merges desktop PC functionality with the portability of the tablet. I think this combination works best for someone who needs the flexibility to run desktop-class applications while on the go, such as road warriors and tech-savvy students. I used the ASUS Vivo Tab Note 8 extensively over the last four weeks, regularly using it during meetings and presentations for work, and content consumption and light gaming while at home. Overall, I think it's a good supplementary computing device ~ some jobs are best left to full-powered laptops or desktops with keyboard/mouse and complete I/O connectivity. Compared to other tablets, the key features that set the ASUS Vivo Tab Note 8 apart are the integrated Wacom digitizer, GPS receiver, ability to run desktop class applications such as Microsoft Office, and support for wireless display using Miracast.In terms of build, the ASUS Vivo Tab Note 8 does not use any exotic materials and instead relies on a plastic chassis. Although it might not feel like it, this tablet has proven to be quite sturdy and durable ~ I've carried in my backpack daily and it survived three international business trips without a protective case. While the chassis has held up well, I seem to have scratched the screen during my travels ~ the screen is very clearly not gorilla glass and it accumulates fingerprints very easily. My biggest complaint about the build is actually the button feel. I think button placement is fine, with the power and volume buttons on the right and the Windows key and micro SD card on the left side. The problem is, the power button is so mushy and unresponsive that I frequently can't tell whether my attempt was registered or not ~ sometimes, instead of resuming from suspend, Windows will ask whether or not I want to shut down the PC. This is caused by overly long button presses and it's an easy mistake to make.The digitizer is superior to a traditional touchscreen in the sense that it detects levels of pressure (I think this model supports 256 levels), allows for hovering (you can see the pointer on the screen as you move the pen around), and allows for more accurate drawing and writing. The palm rejection feature works great ~ while taking notes, you can put your hand on the tablet as if it were a piece of paper. I have two complaints about the digitizer and pen implementation: I have large hands and I feel that the pen is too skinny to comfortably hold for long periods of time, and the placement of the right-click button and lack of an eraser is plainly annoying. The other issue is the accuracy of the digitizer around the edges ~ while everything is fine in the middle, as you get to ~2 cm from the edge, there could be up to a 1 cm discrepancy between the pen tip and where it is detected. As an experiment, I purchased the Microsoft Surface Pro Pen, and that immensely improved my experience. (It's bigger, has a better button, and has an eraser)In terms of external connectivity, the ASUS Vivo Tab Note 8 relies mostly on wireless and thus has a variety of connectivity options including wireless A/B/G/N and Bluetooth 4.0 LE. Miracast is also supported, and since Windows 8 is multi-display aware, instead of just mirroring, the second display can be set up as an extended desktop eg. enabling presenter view in PowerPoint, etc. (Miracast has high latency however, in the ballpark of 200-500ms, so I wouldn't try doing anything other than consuming content or maybe typing. I tested Miracast using this Belkin Miracast Video Adapter.) The USB charging port is of the micro A/B variety, so in addition to charging, if you attach a USB OTG cable, the Vivo Tab will work as a USB 2.0 host. I haven't tried high power consumption devices such as external hard drive, but I wouldn't be surprised if it didn't work. I successfully tried a variety of low-power devices such as a USB keyboard, mouse, ethernet adapter, and a USB soundcard. I also tried a USB docking station which includes a USB hub and USB to video-out function, and that worked great after installing the driver.I also own a first-generation Nexus 7 (running Android 4.4), an iPad 2 3G (running iOS 7), and a Dell XPS 12 Convertible 2 in 1 Ultrabook (running Windows 8.1). It's difficult to directly compare these devices, though from a productivity standpoint, Windows 8 is superior to both iOS and Android since it can natively process Office documents and work with company templates etc. I found web browsing to be better on Windows 8 as well, since it supports the full range of Internet plug-ins such as flash, Java, Silverlight, and others. The App Store ecosystem of iOS and Android are far superior to Windows 8, and Google's lack of support for a good maps application hinders the otherwise useful GPS functionality. (It's worth noting, that while many apps might not be available in the Windows App Store, there might be a desktop PC version available.) At the end of the day, I'm really happy with the ASUS Vivo Tab Note 8 and several of my colleagues who saw me using it are also considering buying one for themselves. It really is a very versatile productivity tool in the office and on the road. If the materials were better and the digitizer was improved, I think it'd be just about perfect. This type of device has a lot of potential, and all it needs is more polish.Notes:1) The recovery partition is stored on a microSD card in order to save space. Out-of-the-box, the 32 GB version has between 12 to 13 GB available.2) From the get-go, I set this device up as a secondary machine. I have it linked to my cloud storage accounts and have been doing my work that way.3) The headphone output is nothing to write home about. It's basically adequate for typical 16-32 Ohm headphones and earbuds. On the other hand, I thought the speaker configuration and output was pretty decent given the size.4) The overall platform feels snappy with minimal lag, though there are occasional hangups. The actual CPU performance is best described as adequate ~ an entry-level laptop CPU such as the Pentium 2117U gets double the single-threaded performance, though for multi-threaded tasks, the Atom's 4 cores help it match the Pentium.5) Battery life is decent ~ enough to get through a full day with light to moderate use. Ultrabooks based on 4th-generation Intel core processors can get similar or better battery life.", "Title": "x86 Windows 8.1 + Office + Digitizer + 8\" Tablet Form Factor = A Very Good Productivity Tool", "Date": "April 25, 2014"}, {"Author": "BW", "ReviewID": "R2TTFWPKGDKE5H", "Overall": "4.0", "Content": "If somebody focuses on the opportunity of note taking, doing some sketches and having the full Windows productivity on their tablet without breaking a bank, this is it. It even handles my entire Microsoft Office Suite 2007 including Outlook flawlessly.  Of course, such complex programs like Photoshop show the limits of this small processor, but Photoshop Elements, Drawboard pdf or Sketchbook Pro work just fine. The positive tradeoff with this small, but otherwise snappy processor is a great battery life and a quiet, fan-less operation on a light-weight device - not to mention the price.  The Wacom digitizer pen input is a great improvement compared to the ASUS T100 and a must for accurately handling desktop programs and system applications with their tiny buttons on a small tablet screen.Since Windows 8.1 is still a hybrid between its predecessors for desktop use and the new metro function, it takes quite a while for tablet-only users to get around without a keyboard, especially with an on-board keyboard that takes half the size of the desktop and still covers up critical input areas despite moving it around.  The only solution for that is Window's easy access keyboard which is re-sizable and also has the otherwise missing esc and F-keys.  But then you really need a stylus for typing without the option for handwriting recognition. I guess, it will still take a while before Microsoft has improved their Windows 8 to a 100% tablet user friendly operation system like other providers already have.  But I happily accept those imperfections for the advantage of having the capability to run full fledged programs.For more important and demanding work I can always go back to my desktop which luckily still runs Windows 7 so that I and not Microsoft decide how to operate my computer and where I save or share my work with.I look at the ASUS Note 8 as an intermediate, price conscious purchase for putting a Windows tablet at work right now and wait for further improvement to a friendlier and less intrusive OS before investing in a more expensive Windows device.I am giving the tablet only 4 stars not because of its quality but because it is lacking the possibility to order it with 4G.  The size of the hard drive with only 64GB is based on the concept of preferably working with a cloud.  But this is only accessible over the internet.  If you need access to your files out in the field, you are doomed.", "Title": "Little Power House", "Date": "May 25, 2014"}, {"Author": "ravenous", "ReviewID": "R27IOLN97N1FOX", "Overall": "5.0", "Content": "I owned the Dell Venue, was overly responsive and got quirky fast! If you try to type 1 characters about 80 characters would come up instead. Got real irritating quick! So I traded to an Encore, very robust and fast tablet; however, it just quit working and starting freezing up. Traded,it in, same issue. Tried the Lenovo Thinkpad 8, which is a very excellent tablet but NOT worth $400.00 when it does the same as the other tablets. The extra .3 inches ain't worth it, you can't really tell, the processor makes no difference. Now the Asus, durable and thicker with a slightly longer battery life. I've had no issue with the digitizer and the pen works perfectly. So if your looking for a great lower price windows 8 inch tablet, this is it. Just remember to avoid windows 8 RT systems. They will only run windows apps and NO legacy programs. If looking for a strong full windows larger tablet look at the HP or ASUS T100. Thanks for all your reviews, I always read them to help me figure out what I want. Thanks,", "Title": "Best \"Windows\" 8 inch tab available, to me anyway!", "Date": "June 1, 2014"}, {"Author": "Giorgi Alkhazishvili", "ReviewID": "RA6MY307C1CDF", "Overall": "4.0", "Content": "As a whole, I like it.The pen is not working properly on the edges of the screen.What I understand, after using my note, that I need bigger screen :-)", "Title": "I like it", "Date": "May 31, 2014"}, {"Author": "david preiser", "ReviewID": "R1QXIEBGQLBBBF", "Overall": "5.0", "Content": "Good value. Works great, nice screen, responsive and stable. Friendly and helpful customer support, too. Battery life is very respectable. Slightly odd size is an obstacle if you want to buy anything other than the proprietary cover. 10\" tablets starting to seem bulky and heavy now!", "Title": "Solid tablet", "Date": "May 23, 2014"}, {"Author": "T. Vymola", "ReviewID": "R1UCHQUJ5UQJ39", "Overall": "5.0", "Content": "I have been looking for the perfect size windows tablet and finally found it. The stylus is nice bonus. It is so much lighter than my iPad that I find it more portable. I recommend  this tablet to anyone in the market looking for a tablet.", "Title": "Love my Vivo Tab!", "Date": "May 18, 2014"}, {"Author": "siva", "ReviewID": "RRZVOX8FM2LOK", "Overall": "5.0", "Content": "I have used this tablet for a while now. I think for the price of this product it offers a lot of functionality and add to that the built in nicely integrated stylus. Impressed.", "Title": "Nice tablet with reasonable functionality for the price", "Date": "May 14, 2014"}, {"Author": "hdpei", "ReviewID": "R287H5VRHURN5X", "Overall": "4.0", "Content": "problem: The screen has two white spots(the spots looks  brighter from the side) .so I took the tablet apart to repair it.I got it only one week.I thought it was assembly problem and it's true,the ribbon cable pressed the screen.I bought the tablet from Amazon to China,though ASUS has two years warranty,in most of cases and in China ASUS can say it's your own problem,so I do it myself.", "Title": "Pen is great but some problem", "Date": "May 13, 2014"}, {"Author": "K. Faison \"Faazon\"", "ReviewID": "R336PP70INFZD", "Overall": "5.0", "Content": "Awesome Tablet... with the Wacom S-Pen support it Completely replaces my work computer & laptop. Battery Life is pretty good as well. it is BY FAR, Miles ahead of the Dell Venue 8 Pro ((Which was plagued with touch screen sensitivity problems and a sub-par stylus))", "Title": "Awesome Full Windows Tablet !!! 100 times BETTER than the Venue 8 pro", "Date": "May 12, 2014"}, {"Author": "clownlord \"clown22\"", "ReviewID": "R338OSKEYQ3U43", "Overall": "5.0", "Content": "I owned this about 2 months.  I am quite impressed.  I also purchased a case with detachable Bluetooth keyboard.  This tablet has replaced my laptop and Ipad.  It's performance is fast.  It not only boots fast, but also runs multiple windows 8 applications smoothly.  When I don't use it as a laptop, I simply remove the keyboard and use it to surf the web, watch TV shows and Netflix.  I am quite impressed with this setup that I put up my laptop and Ipad on E-bay.  I am also quite happy with the stylus and I mainly used MS One Note.  It writes quite smoothly, like writing it on normal paper.I would highly recommend this tablet.  it serves many purpose for me, and I finally have the portability I dreamed of for many years.", "Title": "Awesome tablet, highly recommended", "Date": "May 11, 2014"}, {"Author": "Andrew Lo", "ReviewID": "R3HXATYARKBND", "Overall": "4.0", "Content": "I love this tablet and can't wait to start using it for school. It's basically a little laptop because it has full Windows 8. I do however need to get used to Windows 8 and often forget that this is basically a laptop so I can do anything on it. The tablet is a little slower than I was expecting however. With opening applications and registering that I want it to wake up it takes a couple tries sometimes. Other than it being a little slow it is great.", "Title": "Great tablet, but a little slow", "Date": "May 8, 2014"}, {"Author": "William Bolton", "ReviewID": "R21EMZHNLCNIIL", "Overall": "5.0", "Content": "I like tablets. I have the original Kindle Fire, the second generation Nexus 7, a Nexus 10, and now this Windows tablet from ASUS. ASUS is a great company in my estimation. They make well-manufactured products with excellent features at a very reasonable price. This tablet is a further indication of that. It has a 1.3GHz quad-core Intel processor with 2GB of RAM and 32 or 64GB of onboard storage, a microSD expansion port, a Wacom digitizer and pen, Windows 8.1 and a full retail edition of Windows Office and all for less than $400. When I set it up, it recognized that I had Windows 8.1 on another computer and copied the personalization I had set on that computer. I was able to download and install \"Alpha Centauri\" and \"Alien Crossfire\" from GOG. One can't expect to play very demanding PC games on this device but at the same time it's more powerful than the first computer I bought in 2000. (\"Alpha Centauri\" was game of the year in 1998.) I can also run Tune Up and the PC version of my antivirus on it. What can be improved? It could be made in a 10\" size with a better display, a  more powerful processor and more RAM, but at this price and with the features it has, it's a great bargain. Thank you again, ASUS!", "Title": "Powerful, versatile, great value.", "Date": "April 19, 2014"}, {"Author": "S. Lewis", "ReviewID": "R3N2UQ30T46TBF", "Overall": "4.0", "Content": "1 star deducted for things others have noted, namely:1) The screen is good, not great2) The digitizer isn't as accurate in the cornersThe plusses:1) It's SHOCKINGLY speedy. The latest Atom quad core and 2gb of RAM actually combines for a very speedy Windows 8.1 experience.2) 64gb of RAM plus a 64gb MicroSD card is plenty of storage space.3) For $350 it comes with a Wacom digitizer and a full blown copy of Office Home and Student. You're basically getting a tablet for free, if you think about what those two are worth.4) Great battery life. It's not Apple-esque life, but little is, but I'm getting 7-8 hours per charge, nothing to complain about.I bought this 100% for OneNote. Sounds crazy, but I sit in a lot of meetings and take a lot of notes. Compared to $200 for LiveScribe, it's not that expensive. I've tried two different Bluetooth stylii for iPad. The software is lacking, and only one of them was accurate in tracking. I've tried a Galaxy Note 8, but S-Note really just didn't work for me, since it's Evernote support was minimal (no sync, just export as image), and I couldn't access my notes in an editable fashion outside of the tablet itself. I had a Surface Pro (not the 2, the original), but too expensive, too poor battery life and too large and heavy. This is the best option out there so far. A small, light, good battery life tablet that I can handwrite notes in, but also convert quickly to text as needed.", "Title": "In a league of it's own.", "Date": "May 14, 2014"}, {"Author": "Hippie2MARS \"Hippie2MARS\"", "ReviewID": "RHFRGFF35LO5L", "Overall": "3.0", "Content": "I am NOT a Windows 8 fan. I have it on my laptop, so I'm getting more and more used to it, but I still do not enjoy using. The buttons are oddly placed on this tablet. It too me way too long to figure out how to turn the darn thing off! I love the slim profile. Very light and fits comfortably in one's hand. The screen is easy to read without being super bright. The clever built-in space for the stylus is handy, and I'm loving how reactive the screen is to the stylus. Nice touch. Overall though, I'd probably love this device without Windows 8. As it is, especially with the strangely placed buttons, I'm happy with it, but would only give it a resounding \"meh\".", "Title": "Love the Stylus, but....", "Date": "May 14, 2014"}, {"Author": "Dr.", "ReviewID": "R2DWKLNRFUCV7Q", "Overall": "1.0", "Content": "Regrettably, Asus has manufactured a very poor quality 8\" tablet. I returned it, due to continuous problems with the power/wake button and digital pen.", "Title": "Poor", "Date": "May 25, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00HWHQKFI", "Features": null, "ImgURL": null, "Name": null}}