{"Reviews": [{"Author": "Dorothy D.", "ReviewID": "RLF3A7OGCSEWV", "Overall": "4.0", "Content": "I bought this for my grand daughters ages 3 and 5.  Almost all programs and e-books will play on this tablet, they love the Ocean house and Wanderful, Inc. interactive books.", "Title": "Great Tablet.", "Date": "May 22, 2014"}, {"Author": "A. Lee \"Techy Librarian\"", "ReviewID": "R2INVKUQWHJ2DT", "Overall": "4.0", "Content": "I love the sleek design of this tablet.  While I purchased one from GameStop without knowing I could have purchased it for a lot less here on Amazon, I have to say I really enjoy this tablet.  While finding a case is tricky, I love the sleek and slim design that makes it easier to hold in my hands!I love playing my games (Zombies vs Plants, Angry Birds, Candy Crush), checking Facebook, streaming videos (Netflix and Hulu Plus), and general web browsing.  Helps pass the time and at a great price I am not as worried about it being stolen or breaking.  Much better than a $300-$500 tablet being stolen or broken.I also might add that my two God-Sons (5 and 9) LOVE this tablet.  They are always fighting for a turn to play a game using the tablet and it is light weight and easy for their little hands as well!  I recommend to anyone who wants a BUDGET Tablet.  If you want a replacement for an iPad - just buy an iPad.  A great Android tablet for the price!", "Title": "Great Budget Tablet!", "Date": "April 29, 2014"}, {"Author": "lottabug", "ReviewID": "R2YI87HEWYD0G", "Overall": "5.0", "Content": "Love tablet and fact has expendable memory and a hdmi port runs great would recommend this tablet to friends and family can not tell its not a name brand tablet", "Title": "great tablet for great price", "Date": "March 18, 2014"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B00HSXYNV4", "Features": "Check your E-mail or surf the internet!\nDownload multi-media APPS such as games, books, movies or music from the APP Store.\nPlay Angry Birds, Fruit Ninja, Temple Run and many more FUN, downloadable games!\nTake pictures or use Skype to video chat with family or friends!\nListen to your music or watch videos on YouTube or Netflix anytime & anywhere you want!", "ImgURL": "http://ecx.images-amazon.com/images/I/41uwrK%2BeJyL._SX300_.jpg", "Name": "Sophix TAB-740G - 7'' Dual Core Android Tablet"}}