{"Reviews": [{"Author": "James P. Scott \"I commute 125 miles each way ...", "ReviewID": "R2R4KLMWRAESZX", "Overall": "5.0", "Content": "I bought this to have a cheap experience with Android.  My black tablet was also white, but I am not sure why I should care about that.Everything works.  It burns up battery pretty fast, but I have not run out of power doing anything.  It does not do Bluetooth, but it did not say it would.  All of the functions seem to be just fine.I have a brother who is looking for a cheap tablet for his young step son.  This one would be a bad choice for a little kid, I think.  I have not tried dropping it.  (I drop lots of things.  My first Chromebook bounced off the floor before I powered it up the first time.)  This looks like it would be in a thousand pieces after a drop.In short, if you are not a tablet abuser, and you want something cheap that works, this is a good choice.", "Title": "Cheap Tablet", "Date": "March 22, 2014"}, {"Author": "nicholas e.", "ReviewID": "R3356WXYQUYCAX", "Overall": "3.0", "Content": "is Android build tablet is just like my galaxy s3 so as soon as I got it for my daughter how to navigate around and set it up for her liking the problem is it does not come with very much memory so I heard you too bye backup mini SD card I got the 16 gig I think it holds up to it 32 gig", "Title": "awesome for the price", "Date": "March 30, 2014"}, {"Author": "GaryS", "ReviewID": "R4FK1C34J7OH7", "Overall": "5.0", "Content": "Very good tablet. Offers great value at such a reasonable price. Tablet is fast and responsive. I might buy one or two more as gifts for family at these prices.", "Title": "Great Value!", "Date": "March 10, 2014"}, {"Author": "Matthew", "ReviewID": "R28O6YT781YW32", "Overall": "5.0", "Content": "Pros:  Crazy cheap, moderately fast, clean look, light weight, hold good charge, sound is better than expected and overall feels nice in handCons:  Screen is not HD, small internal memory but it is expandable with micro sd.My biggest issue is the resolution on the screen.  Its just not anything like Kindle or IPad but then again its not claiming to be that.  So for the price you just cant beat it.  It is great for reading news, kids playing games and storing music.", "Title": "Detailed review", "Date": "March 27, 2014"}, {"Author": "REGINA S BENNETT", "ReviewID": "R1HX2AULD8ROTH", "Overall": "1.0", "Content": "Let me start off by telling you,1. It doesn't come with a manual2. Mine, once booted up was set for CHINESE3. The screen is set in military time4. The screen is EXTRA sensitive or defective5. It's a SUPER slow processor6. It took me 37 minutes to login to my amazon account7. My nephew got so frustrated with it he gave it to the kid next door8. I took it back and out of frustration, gave it to the dog9. The dog got frustrated and gave it back to the kid next door10. The kid next door got so frustrated, he tossed it over the fence into my back yard11. The dog took it back to him12. His mom brought it back and said, \"Thanks but no one has the time nor the patience to TRY and operate this expensive, irritating, beverage coaster. Tell your dog to stop putting it on my PORCH!\"13.Don't even think about doing anything with this piece of garbage longer than 1 1/2 hours. It's not going to happen for you, not even on a full charge.14. The colors are clean, clear, and bright. That's the only good thing about this piece of junk.15. I did get a chance to load 18 apps and watch a YouTube movie for about 55 minutes before it drained the battery.16. I was able to play solitaire for about 69 minutes before the battery was drained.TRY AND BUY AT YOUR OWN RISK! YOU'VE BEEN WARNED!In short, do not waste your money!!!I had this piece of junk for three days before I gave up and threw it in the garbage!!! I am ticked off beyond belief!!!I emailed the seller about the Chinese language and the missing manual. He/she answered me back with instructions on how to change the language to English. The answer being, \"We try to check them before they get shipped to customers but a few do manage to get past us.\"BULL!!!!!!Maybe I just look this stupid!DON'T WASTE YOUR MONEY!!!DON'T WASTE YOUR TIME!!!The screen is terrible to say the LEAST and that's putting it mildly.Don't make a mistake trying to login to anything. Here's the catch, you have to touch the screen VERY, VERY, VERY lightly or it'll repeat a character  6 or 7 times. If you touch it too lightly, it'll give you a French or German character, no character AT ALL, or repeat it 8 or 9 times.When, after about 20 to 30 ( literally ) attempts to login to ANY account you have, you may fracture a knuckle or other digit to get the screen to respond at all.I'm warning you...DON'T DO THIS TO YOURSELF!", "Title": "DON'T WASTE YOUR MONEY, TIME, AND ENERGY", "Date": "April 25, 2014"}, {"Author": "Lina", "ReviewID": "RFXPEF4GQK40L", "Overall": "1.0", "Content": "Well I got my tablet last week and I just sent the same tablet back for a refund on Tuesday. When I first got it everything was in the package the charger, and a usb cord. When I turn my tablet on and started to use the web well the page was not in english, the apps on the tablet was already installed and I'm not talking about Facebook or twitter it was a lot of games up there took a lot of space, the tablet is 4GB which is okay if you not trying to put a lot of apps up there and the battery drain so fast even when I charge it all day battery life only last for 1 to 2 hours. Sometimes the touch screen don't respond it freeze a lot, watching youtube videos was okay it's not in HD. But luckily I got a refund back which I was very happy, I thought I was getting a good tablet because I look at the reviews and everyone say it was a pretty good tablet.I would not recommended to get this tablet.", "Title": "Waste of money.", "Date": "April 18, 2014"}, {"Author": "Peterson", "ReviewID": "R39ZHHYMHEUS0K", "Overall": "5.0", "Content": "Seems like a nice tablet and even though the owners manual was not readable the owner of the store stated he would personally make a new manual that can be read and mail it to me--I appreciate that effort. I would do business with this company again.Good Product and Good Company to deal with.", "Title": "This is an upgrade from what I wrote previously.", "Date": "March 14, 2014"}, {"Author": "BOE28", "ReviewID": "R2D6QXYJW6QKV7", "Overall": "5.0", "Content": "perfect for my three year old nephew and the arriving date was awesome and just right for these far from the state the arriving date was great.", "Title": "awesome", "Date": "June 2, 2014"}, {"Author": "Chic Kelty", "ReviewID": "R37NKAI7EZJL7W", "Overall": "1.0", "Content": "Probably the worst product I ever bought from Amazon.It wouldn't power up !!The power supply was very cheaply made.It never worked.I returned it the next day", "Title": "A piece of junk", "Date": "May 23, 2014"}, {"Author": "Anthony Dunn \"le Revenant\"", "ReviewID": "R19HRL7P06EL3S", "Overall": "4.0", "Content": "The overall best low-priced entry level 7 inch tablet I've seen. The battery life isn't as long as higher priced tablets, and the screen has a narrower viewing angle, but definitely a lot of \"bang for the buck\".", "Title": "Deerbrook 7\" Tablet", "Date": "May 17, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00IJB851S", "Features": null, "ImgURL": null, "Name": null}}