{"Reviews": [{"Title": "Works great!!!!", "Author": "Brian Jacobson", "ReviewID": "R1O2FOVUOMN3GQ", "Overall": "5.0", "Content": "I utilize the iPad tripod mount to take video and needed a better way to keep it steady than just holding the iPad tight.  The mount holds the iPad securely yet allows for easy removal.", "Date": "March 10, 2014"}, {"Title": "Solid product. Reasonable price. Great customer service.", "Author": "James", "ReviewID": "RQQBJX5MQDRME", "Overall": "4.0", "Content": "Overall, the design is good. It¹s easy to make adjustments and the rubber sleeves do a nice job of securing my iPad Air to the mount. The ball and socket concept is great too. It¹s easy, but not too easy, to move between horizontal and vertical orientations and the slots do their job in securing the mount so that it doesn¹t accidentally rotate. The base worked with my tripod adapter perfectly.The only gripe I have is the choice of screws and/or the material used for the \"fingers\" (pieces that hold the iPad in place). A low depth thread (machine thread) is utilized. Consequently, one of the fingers got stripped when I went to adjust it. I didn't put a lot of pressure on it either. As I was securing it, I was waiting for it to get \"snug\" (not tight) and before I knew it, it lost all tension. I did my best to secure it, but after using it the other day, I noticed that the stripped finger was missing.The fact that the finger stripped may be an anomaly, but I would still highly recommend that they consider revising either the type of screw that was used and/or the type of material that's use for the finger. Plastic makes sense as I'm sure its more economical and less likely to damage an iPad, but my experience as a QA technician for an engineering firm many years ago tells me that those two don't play well together.I also liked the fact that they contacted me directly shortly after I received the product to get feedback. I wrote back immediately and they acknowledged my follow-up email the next day. They were also helpful in getting me a replacement part right away. Good customer service...gotta love that.All in all, I like the product. The design makes a lot of sense and it does exactly what I need it to do. It's better than some of the other products I researched.Solid product. Reasonable price. Great customer service. If they used a different type of screw to secure the fingers, this would be a five star rating.", "Date": "March 28, 2014"}, {"Title": "Not very well thought out!", "Author": "Lynn H. Davis", "ReviewID": "R8WEAHU2IQVL2", "Overall": "1.0", "Content": "Not very well thought out!  The stand is sold separately for an additional price. We searched the site and couldn't find the stand that goes with the tripod for the ipad. Only had one for the iPhone. We gave up and sent it back.", "Date": "March 8, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00I9JDTPC"}}