{"Reviews": [{"Title": "Awesome!", "Author": "Joe Petro", "ReviewID": "R1RJ9J4VALZ2LD", "Overall": "5.0", "Content": "Axis is a great tablet - this cover makes it better!Perfect item, love my new 7\" Axis from quantum suppliers! Thank you so much!", "Date": "December 3, 2013"}, {"Title": "It works well for the money", "Author": "Joe \"Joe\"", "ReviewID": "R3EQ4DL2WFBV6D", "Overall": "3.0", "Content": "I bought this to try something at work.  It's smaller than I thought.  It's 7\" on one side, and I think 4 or 4.5\" on the other side.  The AC adapter has trouble fitting in.  I can't take out the foreign home page on the default browser, regardless of what I do.  I won't play Amazon prime or Hulu movies, but I didn't really get it for that.  I think this might be helpful for someone using Wifi that needs basic browser functionality (e.g. with a remote HMI).", "Date": "June 7, 2014"}, {"Title": "Nice but audio too low", "Author": "Tannecia J.", "ReviewID": "R1VPXACNOTM2WD", "Overall": "3.0", "Content": "I bought the tablet for my toddler but the audio is way too low to make sense. Otherwise, its a good buy.", "Date": "May 27, 2014"}, {"Title": "Sluggish, when it finally works", "Author": "Theresa Maynard", "ReviewID": "R1MSCCQKJU9NDC", "Overall": "2.0", "Content": "I chose this rating in part because of the problems I encountered just trying to boot it up the first time! I had to reset it a few times to get it to allow me beyond the initial screen. It won't allow me to save my change to the internet home page, so my initial search is never in English. It will not sync to my Google account and it does not play well with my Facebook account. This is my second one, the first I returned because it was DOA. This one will be tossed back into it's box and never used again. \"You get what you pay for\" and it's not even worth returning for a third try. It is advertised as new and not refurbished, but I wonder if these were re-packaged returns to the manufacturer or a reseller.", "Date": "May 20, 2014"}, {"Title": "Love the Quantum Axis", "Author": "tim scott", "ReviewID": "R49BDQV3HBUOO", "Overall": "4.0", "Content": "My son has had his tablet for over a month. We love the fact that it is supported by Google play. It holds a lot of games both learning and playful. Charging port is a little loose but not enough to matter.  A great value for the money", "Date": "May 18, 2014"}, {"Title": "good buy", "Author": "Maximiliano Garcia", "ReviewID": "R3IJKLUD9G9I70", "Overall": "4.0", "Content": "Got it for my mom who wanted something she could take with her to play games and read books on and she loves ot", "Date": "May 18, 2014"}, {"Title": "Great for Kids", "Author": "Debbie", "ReviewID": "R3MRI1GJJ25M39", "Overall": "4.0", "Content": "Our 8 year old was thrilled to find a tablet that she could afford. She says, \"It works super well and I'm glad that I was able to buy it.\"  She loves being able to download free apps and uses it mostly for playing games. The battery does not last as long as some, but it's plenty good enough. At times it drops wifi, but It hasn't been a huge deal. It's certainly not an iPad, but it's a great starter tablet and certainly a great deal.", "Date": "May 14, 2014"}, {"Title": "Good one, recommended", "Author": "may jabori", "ReviewID": "R1B7Q0024DBO7M", "Overall": "5.0", "Content": "Very cool and durable for my 2 yrs baby boy, he loves it, easy to use, i recommended to everyone.", "Date": "May 14, 2014"}, {"Title": "Hi", "Author": "Lisa", "ReviewID": "R3QZFCCWUAG773", "Overall": "4.0", "Content": "I like the tablet so far I hadn't have any problems with yet.......I hope it last longer then the other one I had for 2 months and it's batter just died and wouldn't turn on. Sooo I hoping this is better. So far, so good.^^", "Date": "May 14, 2014"}, {"Title": "okay tablet but definitely not a Samsung", "Author": "allen dunbar", "ReviewID": "R3DOCFQ81FL896", "Overall": "3.0", "Content": "The tablet works however it freezes on games consistently and the volume is very low. When it does act right, the games play great and the processing is pretty cool for the price. If I could do it over, I would spend the extra money to get the Samsung though. Also, the app Tango doesn't work on it", "Date": "May 13, 2014"}, {"Title": "Frustrating", "Author": "Sara DeSotel", "ReviewID": "R3SLVA7H9NXXCG", "Overall": "1.0", "Content": "Tablet is very frustrating. Takes several tries to download apps from Google Play Store due to errors. Gives an error number, but no where does it explain what that error number means. Also the keyboard won't come up (or stay up long enough to finish typing) in several apps when trying to connect with Facebook or write a post. Writing this review on my phone- couldn't do it with the tablet. The quality isn't great (compared to my Kindle Fire HD- not very loud, screen size is 7\" long but not as high, and screen only viewable at certain angle), but I would give this 4 stars if it would just work.", "Date": "May 12, 2014"}, {"Title": "one week with case and broken", "Author": "jacob", "ReviewID": "R3BU14R9UWWAGA", "Overall": "1.0", "Content": "I have had this product for a week, the first couple days it was fine. I have not dropped it or anything but for no reason the screen went negative and fuzzy, then when I was using it the screen cracked all I did was touch it a bit harsher nothing that other tablets couldn't handle and it broke. I dont know if this was a faulty or product or if they are usually like this.", "Date": "May 9, 2014"}, {"Title": "Nice tablet, GREAT price", "Author": "Rene Vallieres", "ReviewID": "RNW9UB2L8QQAB", "Overall": "5.0", "Content": "I bought two of these to replace a Samsung Galaxy 3 that my daughter somehow forgot she left it on the bumper of my Caravan.  Needless to say, tablets are not meant to be speed bumps.  Anyway, I read the reviews of a lot of tablets in this price range and this one had mostly good ones, so I thought I should take a chance.I bought 2 of them, one for each kid and to be honest, I dont know why I spent so much money on the Galaxy when I basically got two of these for 1/2 of what I paid for the Galaxy.  The display is awesome, the WIFI works great, tons of apps available and the kids absolutely love them.A few of the reviews said the battery did not last long but we have not had that issue yet.  To be on the safe side I downloaded X2 Battery Saver from the app store and still have had no real issues with battery life.I would highly recommend these over a much more expensive tablet.", "Date": "May 3, 2014"}, {"Title": "Great Item, Great Price!", "Author": "Levenia Kaelin", "ReviewID": "R1EQ2R5DSF4YOE", "Overall": "5.0", "Content": "I bought this as a gift for a friend.  She said she loves it!  Works great!  Highly recommend this tablet.  I like that it has a built in camera, and a place to put a micro sd card.  Great item, with an even better price.", "Date": "May 2, 2014"}, {"Title": "Great deal!", "Author": "David Dunn", "ReviewID": "R8I88ISLS026Q", "Overall": "5.0", "Content": "This tablet was purchased to replace a previous Axis tablet we got our 8yo son for his birthday. So far we have been very pleased with it. Very lightweight, easy to navigate, and overall a great tablet for the price. Quantum Suppliers have been very friendly, and helpful in resolving any and all other issues. I will definitely do business with them again!", "Date": "April 10, 2014"}, {"Title": "Great Buy!!", "Author": "Devlin R. Idell", "ReviewID": "RRXTG6O576YN4", "Overall": "5.0", "Content": "Awesome!! Great Buy. My daughter loves the new pink for her tablet. Shipment was fast considering that it was coming from China as well. Nicely put together too. Thank you so much!!", "Date": "March 14, 2014"}, {"Title": "best thing ever", "Author": "CANDIS ROBINSON", "ReviewID": "R3IS3VVM00OLDH", "Overall": "5.0", "Content": "the shipping took a long time but once i got it i was very happy with my product. i dont think it will mess up any time soon", "Date": "February 7, 2014"}, {"Title": "It fits Great!! my daughter likes it too", "Author": "PBrady", "ReviewID": "R1GD8POS9KOZN", "Overall": "4.0", "Content": "it was a Christmas gift with the Axis tablet it's sturdy and material makes it an easy cleanup too. Delivery was real fast also", "Date": "December 28, 2013"}, {"Title": "Nice Product, I ordered wrong size.", "Author": "News", "ReviewID": "R1LRZ7QK4FEUDS", "Overall": "4.0", "Content": "Use care, there are 2 versions of the dragon touch 7in tablet, check your model number and dont be a dummy like me.", "Date": "December 26, 2013"}, {"Title": "thnx", "Author": "john j.", "ReviewID": "R3CU6B88U6C8OC", "Overall": "4.0", "Content": "It is Not a top of the line product but it is good quality for areally good price. I am overall satisfied,", "Date": "February 8, 2014"}], "ProductInfo": {"Price": "$99.99", "Features": "The Quantum Axis A23 tablet features an x23 ARM Dual Core 1.5GHz CPU coupled with the Mali-400 GPU, doubles the power of its predecessors, making gaming and web browsing more fluid, while maintaining affordability.\nDual cameras allow for high quality images and video in various file formats. Use the front-facing camera for Google Hangouts or Skype chats.\nA multi-touch 7\" display with 1024x600 resolution provides higher quality video. It also comes with a FREE installed screen protector!\n802.11 b/g/n integrated wireless connects you to the web. Browse the web, play online games, stream music and video off your home network using apps installed from Google Play or side-loaded from your SD card running Android 4.2 Jelly Bean OS.\nFull LIFETIME defect warranty on any manufacturing defects! Drop and spill coverage available through SquareTrade at a small fee to ensure your investment is 100% protected.", "Name": "Axis A23 7\" Dual Core, Dual Camera, 1024*600 Capacitive Screen Android 4.2 Tablet Pc (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/512T6cEehjL._SY300_.jpg", "ProductID": "B00IFFQZZ6"}}