{"Reviews": [], "ProductInfo": {"Price": "$139.99", "Features": "Look no further for a budget tablet with more features and value for less. As the only tablet having both Bluetooth and HDMI in its price range, it is a good buy for kids and first-time tablet buyers. While this is NOT a lighting fast tablet, it WILL get the job done.\nValuePad For Kids VP111-K comes with a pink premium silicone protector. Protector color may be slight different than that in the picture due to variations in monitor settings. Pre-installed screen protector matches perfectly. You have to look hard to find it! Use pre-installed non-invasive Screen Time Parental Control app to monitor and manage the time spent on your children's tablets making ValuePad for Kids ideally suited for older children and teenagers, as well as younger children.\n2800mAh battery ensures 3+ hours (Wi-Fi off, low volume & 35% brightness; Expect shorter run time with Wi-Fi and higher volume/brightness settings) of smooth 1080P video with the latest Android 4.2.2, Dual Core CPU and same series graphic processors as in iPad. Keep all your movies in expandable storage up to 8GB + 32GB Micro SD + 64GB USB flash drive. Front and rear 0.3MP cameras for convenient Skype commuinications (Low resolution cameras for video calls and fun only).\nCapacitive Multi-Touch 800x480 display. Endless fun with the freedom to connect external keyboards, mouse, joysticks, flash drives and Ethernet adapters. Online chatting using the dual front and rear cameras. Real English instruction manuals - no more broken English! Lower prices and a Quick Start Guide with battery and charging instrutions available at valuechainusa. Adult version VP-111 available in Black color (item B00I09YPYU).\nWe strive to make Affordable & Reliable tablets. Customer satisfaction is our top priority. Please contact our Texas service center for any ordering, quality and performance issues because we provide faster services than most marketplace customer services. Google Play Store is available on all ValuePad tablets. 100% Satisfaction guaranteed with US real person support and 30-days Amazon return policy. Allow us the opportunity to fix any issues for you!", "Name": "ValuePad for Kids VP111-K 7\" Tablet 8GB HDMI Bluetooth, Silicone Prot, Scr Prot, Parent Control, Google Play 3D Game Android 4.2.2 Dual Core 1.3GHz 1080P MicroSD Dual Camera Improved Sound (Pink Prot.)", "ImgURL": "http://ecx.images-amazon.com/images/I/31oR2y20O-L._SX300_.jpg", "ProductID": "B00I09WN7Q"}}