{"Reviews": [{"Title": "One Works One Went Back", "Author": "Amazon Customer", "ReviewID": "R1RJC2U77CZU8C", "Overall": "3.0", "Content": "I bought 2 of these for my 7 and 9 year olds.  They are as expected with reasonable speed and screen performance for the 55.00 price.  I also bought the tabsuit gel covers that are really nice for protecting them against the inevitable drops.So they both booted up and we got connected and signed in but then one of them started downloading really slowly and after a while trouble shooting  the WiFi completely quit working.  Back to Amazon for a refund and I ordered a replacement.  The one that does work is great - my daughter loves it.It seems that these are not tested very well so if you happen to get a defect be prepared to send it back to Amazon for a refund.  They are probably not good for gifts for this reason.  I always buy Amazon fulfilled items because I can count on a replacement or refund.", "Date": "June 7, 2014"}, {"Title": "Very good", "Author": "Mr. Epic", "ReviewID": "RPE2QFVN3QM40", "Overall": "5.0", "Content": "OUT OF THE BOX:It comes with the:*tablet*male micro-usb to female usb*wall charger*male micro-usb to male usbGAMING:I tried several games and the overall performance is very good.Minecraft- With the fancy graphics enabled, it lagged a little bit. When I turned off fancy graphics and lowered the view distance; it performed as smooth as an iPad.Subway Surfers- Smooth gameplay.Clash of Clans- Ran VERY well, 0 lagDead Trigger 2- This is a very 3d intensive game, even the Galaxy S5 can't run it with 0 lag. It ran the game at around 15~20 FPS. I expected 5, it ran better than expected. Though still unplayable.Camera:The camera is .3 MP on both sides, nothing impressive, it can scan QR codes well. Though the camera isn't anything to show off.Durability:I have dropped this tablet, with a case (Finite case), and there isn't a single crack on the tablet or even a scratch. Though if you push on the corners of the tablet. You can hear creaking. It makes me question the durability, but so far, so good.Battery:Around 3 hours.Troubles:Browser Problem- Right when I got the tablet the homepage for the default browser is kszz.com; I tried to change tit, but it just resets itself back. I found some other people on the android forums who also had the problem with their tablets. As of right now, there is no fix; what I did is I installed an alternative browser.Dissapearing keyboard- Every 1 or 2 days, the keyboard randomly dissapears while typing, To fix it, go to settings, apps, then swipe until you get to the \"all\" tab. Then find Android keyboard, scroll down until you see \"Clear cache\", and it will be temporarily fixed for around 2 days.VERDICT:For $55 this tablet is amazing.This is for people who:-Play casual games- Watching YouTube-Browsing the InternetI would've given it 3 or 4 stars with the problems it has, if it was $100. For $55 this is a bargain.", "Date": "May 19, 2014"}, {"Title": "after 3 weeks of using broken", "Author": "kcbutterfly", "ReviewID": "RT0WI7MVHDOD3", "Overall": "1.0", "Content": "bought two of the axis a23, one for my son (blue) and one for my daughter (pink). they have been using it only 3 weeks and after that time the problems started. One had \"only\" a white line, but the other one was a disaster. It was flickering, fluttering and you could not see nothing on the display. The kids were disappointed!!!!!!!!!!!", "Date": "May 7, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IFF8LLC"}}