{"Reviews": [{"Title": "Great Tablet for the Price!!", "Author": "janice s.", "ReviewID": "R240SJQ9XLDI9A", "Overall": "5.0", "Content": "My DeerBrook tablet powered right up out of the box, as it came partially charged as described. I charged it fully before using it, so I would have plenty of time to learn about it. The charger fit snugly and worked fine. This tablet is faster and more responsive than I thought it would be, as is the sound, and colors are bright. The resolution, while of course not HD etc, is better than I expected at this price and is fine for what I want.  I am a first time Android user and was a little nervous, but after a little exploring and looking at the very good User Manual online, I was off and running! The online Manual had color pictures and diagrams of the screens, settings, and the FAQs are right up front (eg, how do I set the clock?)  It is very light, nice size to tuck in purse etc or for child to handle. It seems sturdy to me.  I bought this in \"white\" although it is also available in black and other colors. The back of the tablet is white, and there is a very small white frame around the screen.  I really like the effect and it is easier for me to find than black :-)  I am giving it 5 Stars due to its quality, features and value for the price! Bear in mind that is not an IPad, but it doesn't pretend to be. If that's what you want, go pay the price :-)", "Date": "May 30, 2014"}, {"Title": "POS - Lied to by company, will never purchase again.", "Author": "Jonathan Orlofsky", "ReviewID": "R3FDD14C4LWFZE", "Overall": "1.0", "Content": "I chose this product, because the identical listing on here (which sold out) had over 4 stars. I'm not sure how, because here is what happened with my order:Firstly, I wrote to the company before ordering - \"What size is the headphone jack? Does the Square Inc reader register using your tablet? I would appreciate someone actually plugging one in and testing it. I have other tablets that the reader fits into, but cannot be read by the device. Please call if you can: ###.###.###\"They replied: \"Hey there- This tablet has a 3.5mm headphone output. Square Inc is designed to work with any Android or Apple device with the standard size output. It will work with this device as well. The DeerBrook has a newer version of Android (4.2), and should not be a problem. Your trouble may be with the card reader itself. I would contact customer support through Square Inc, as their reader is specifically designed to work with all Android devices.\"After receiving that email, I ordered 4 tablets right away - very excited to have found one so cheap that could process credit for me.I have THREE Square Readers, which all work in other devices (like my 3+ year old Samsung Nexus smart phone), and 1 Square Reader is brand new - as it arrived the same day as these tablets.NONE of the tablets could read a single one of my Square Readers! WTF, Deerbrook?!? In fact, one of the tablets was dead-on-arrival, 2 of the power cords don't work to charge the devices with, and the audio outputs transmit music SO LOW that it can barely be heard with the sound output to max.These things suck.Look somewhere else - I'm returning mine immediately.", "Date": "April 15, 2014"}, {"Title": "How does it charge", "Author": "liza", "ReviewID": "R3PMTJJUNPDOQ2", "Overall": "4.0", "Content": "First of all I didn't think it could be very small, cuz it looks big on here. Second, the adapter that came with it shuts it off every time I plug it. Charging it with my pc takes forever and doesn't last a minute. I'm so frustrated.", "Date": "March 12, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IQWNOZW"}}