{"Reviews": [{"Author": "michael skinner", "ReviewID": "R152LNTB533HIK", "Overall": "5.0", "Content": "So far so good. The graphics could be a tad-bit better but everything else is going well.  The Antutu Benchmark score is not 20042 but is 19413 which is very good. Netflix,  HuluPlus, the NCAA tournament and Comcast run smoothly. My daughter loves it.  Oh, it did score above the Nexus on the benchmark test. It's very responsive and it is HD and I said the graphics could be a little better because the viewing angles are good, but could be better.  Overall a solid device and I gotta buy another one for my other daughter.  It's close to the size of my Samsung Galaxy Tab 2 and just as fast as my Tab 2 and Galaxy S4.", "Title": "Very good tablet....solid construction", "Date": "March 21, 2014"}, {"Author": "Larry Henry \"—Larry\"", "ReviewID": "R3C89RH5EYQT1", "Overall": "4.0", "Content": "The performance of this tablet is great. I threw lots of stuff at it and it never staggered or paused. The processor and the graphics handling makes everything you do smooth. The capacitive screen worked great for me, no issues at all. I tested Skype, Netflix, plying videos and music, Chrome, Drawing applications and e-mail; everything worked very well. The battery life is proving to be very good.What I wasn't overly happy about was the placement of the front camera; it's awkward at times during video conferencing. The speaker volume isn't that great, but a Bluetooth sound cannon or headsets worked great. Also, I noticed the stylus that was included with the unit didn't work very well at all. I contacted iRulu about it and they're working on a resolution.I did a full review on it on my website:[...]I hope this helps...", "Title": "This is/was a confident purchase; perfect for a gift.", "Date": "April 13, 2014"}, {"Author": "Lubomira Sieradzka", "ReviewID": "RBH8BMA7KYWIW", "Overall": "4.0", "Content": "I mostly bought this to convert it to a small laptop for the purpose of writing. I went to get some advice from my boyfriend since he was a techy and knows much more about things associated with the computer. He was very much against me getting a generic device over a brand name. Against his wishes, I ordered this one and I am happy to say I did! I am no professional and I just wanted something that I could take to the library or cafe to do some writing. This little tab does that and more. I am very pleased.Positives:The quality is very good. It doesn't feel cheapTouch sensitivity is very good and can easily compete with the name brand tab my bf has.Images and graphics come out sharpResponse well to add ons life a keyboardHas different ports for chargingBattery life is goodGoogle App games function without a problem (yes, you can play Candy Crush Saga or Farm Hero Saga)Negative:It's heavier (but at the same time it does seem solid)", "Title": "Just what I needed and at a fraction of the cost", "Date": "May 17, 2014"}, {"Author": "Pen Name", "ReviewID": "R3AUE220B6PIYN", "Overall": "1.0", "Content": "I received the tablet quickly from the supplier, after charging the first time I was able to download some apps and used the tablet for about one hour.  Then I tried the tablet a few days later, and the pad would not turn on, so I plugged it in to charge and it would not charge.  Now I have to contact the seller.", "Title": "Tablet will not charge", "Date": "April 30, 2014"}, {"Author": "Debbie Cannady \"Deb\"", "ReviewID": "R20MDRT4M8GGUF", "Overall": "2.0", "Content": "I received tablet quickly but it had a flawed screen.  Product must have had a heavy object laying on it and caused it to have a white mark on the top right corner of the screen.  I spoke with the head honcho and he sent me a return postage slip and sent money back to me as soon as they received it. Very good business relationship.  Tablet was fantastic otherwise and worth the money.", "Title": "Great Product", "Date": "April 24, 2014"}], "ProductInfo": {"Price": "$134.99", "ProductID": "B00IZA53AE", "Features": "Latest Google Android 4.2.2 Jelly Bean OS, Allwinner A20 Dual Core CPU (1.2GHz) with Quad core Mali-400 MP GPU, offer unprecedented fast surfing online, video playing and 3D games playing experience\n9.7 inch secren display, 5 point capacitive touch screen,1024*768 resolution.\nWith front & back dual cameras (0.3MP & 5MP), be adequate for skype video chat and taking general picturesdroid tablet\nNew update to 16GB storage capacity, built-in micro sd card slots, can be expanded to 32GB\nBuilt-in 3.7V 6000mAh Li-Polymer rechargeable battery, enjoy longer running time (8 hours running time)", "ImgURL": "http://ecx.images-amazon.com/images/I/51sSJqozoLL._SY300_.jpg", "Name": "Father's Day Gift! iRulu® 9.7\" Quad-Core 4X1.2GHz Android Tablet PC (AZ942), 1024*768 HD Touch Screen, 1GB Fastest RAM, 4.2.2 Jelly Bean OS, Dual Camera (5 mega pixel), Bluetooth, Wifi, HDMI, Updated to 16GB"}}