{"Reviews": [{"Author": "Kai Hansen", "ReviewID": "R163CSWJJAUKEC", "Overall": "5.0", "Content": "I got mine bout eight weeks ago. It does everything that I want it to do and more. It came with a \"manual\" that is about 3 x 3 inches and covers four pages(...). But that's all you need. You just turn it on and use it. It's that simple.The tablet is lightning fast and scrolls through thousands of pictures without hesitation. The battery charge lasts all day long, no matter what you do or look at.I still have a laptop at home. Once that one had it, this tablet will replace it. I doubt that you'll find a better tablet at any price!", "Title": "You can't buy a better tablet", "Date": "April 11, 2014"}, {"Author": "S. Ivie", "ReviewID": "R15UR2KUODAKW0", "Overall": "3.0", "Content": "Purchased on May 9, 2014, it arrived on May 12, 2014, today is Sunday, May 18, 2014.  So I've had the tablet in my possession for a whopping 6 days.  I followed the instructions an charged it for a full 8 hours when I got it.... and happily set about finding games and apps.  Last night I plugged it in to charge at about midnight and at 7:30 this morning it had only charged half way.  I waited a couple more hours and it finally said it was fully charged.  Went to power it on and WTF?  it said to plug in the charger and that the battery only had 10%.  GRRR.Apparently charging issues are common with all tablets.  Some have had success by resetting to factory settings (which I will try) Others have sent theirs in on warranty only to find they have to wait 30-90days.  I'm going to try the reset, if that doesn't work... back this goes.Prior to this issue I was pretty happy.  It's pretty responsive and the screen is ok and it did most what I wanted it to do. (Hey Amazon...why in the HELL would you limit your Prime customers to your Kindle devices for streaming video?... idiots!)*** EDIT ***Ok.  So...  I think I fixed the problem at least temporarily.  here is what I did.**At this point I want to let you know that I feel your pain.1.  Go to settings>> Backup and reset>>Back up your apps/photos/software to an SD CARD. (not  required but recommended so you don't loose your stuff.2. Charge with usb cable to your Computer.  If you see progress like it going from 10% to 18% after an hour or so... YAY!!  Leave it go until you are over 20-35%3. With it still plugged in.  Go to Settings>>Backup and Reset>>press factory data reset.  It will warn you that every bit of YOUR data will be deleted... proceed.4. Now.. at this point I turned off ASUS' UI. (leave it plugged into your pc) Go to settings>>Asus Customized Settings>>UNCHECK Use Asus Quick Setting. Restart the tablet.At this point the 35% miraculously became 49% for me.:-| what the?5.  I plugged it into the USB/AC \"wall wart\" charger and Android told me it was charging.  I came back about 30-45 mins later and it was up to 70%  It finished charging pretty quickly.So what does this tell us?  Asus has a glitch in their software/user interface overlay that they need to fix.. or put out a software fix.****EDIT after fix day 2****Ok so last night I drew the battery down to about 15%... plugged it in and hoped for the best.  This morning I turned the tablet on... Fully charged!  wooo hoo!  This further makes me believe that there definitely is a glitch in the UI software Asus puts on them.BTW... I am not an android expert.  Have only owned android devices since April when I got a prepaid tracfone with android. I would call myself an advanced computer user with some programming experience.  This \"glitch\" is inexcusable.  I will continue to update until I feel I've informed as much as I can on these... I still like this tablet but what a bummer it had such problems right off like that.***Edit June 03, 2014***It's been a couple weeks since I did the fix and without the Asus UI overlay, the tablet works fine, charges fine and I've been having no issues what-so-ever.Note:  It is interesting that Asus' personnel is monitoring Amazon for bad reviews and offering suggestions.  The problem is that the \"fix\" instructions were completely incorrect for this tablet.  He kept telling me to go to do the following.\"To do a hardware reset, please follow the procedure.Tap Settings > Privacy > Factory data reset. Doing so will erase all your data on your Eee Pad. Ensure to backup yourimportant data before resetting your Eee Pad. If the problem persists, please try to a hardware reset by doing the following:-Hold down the power button until the system completely shutdown-Remove any SD card in the tablet if one is inserted-Press and hold down \" Volume Down\" button then press and hold down the \" Power\" button until screen below appears-Do not press any button until the screen below appears:There's a line, press \"Volume Down\" to execute or \"Volume Down\" to cancel wiping data.-Press \"Volume Up\" to wipe data, unit will automatically reboot after wipe data process completed, system should be able to boot up or enter system successfully.\"It should be noted that NO photos he referred to came through and he could not provide me with a link to the photo.  But regardless... in my Memo, there was no such \"settings>>privacy>>Factory reset\" he kept referring to... so clearly the online support on this is misinformed and or poorly trained. I also tried the \"hold down the volume down and power buttons and never saw the screens, to which he was referring.Anyway, this will be my last update.  I hope my solutions help some of you.  The tablet is NOT a bad tablet but this glitch could be problematic for those let technically inclined.  Make an informed decision.  Good luck.", "Title": "First tablet a possible Dud :-(", "Date": "May 18, 2014"}, {"Author": "Markalea  Wagoner", "ReviewID": "R20UQKGIWTP3SU", "Overall": "5.0", "Content": "I have only had this for a few days now but so far I love it.  This is my first Memo pad of any kind so I don't have anything to compare it with.  It was easy to set up and get started.", "Title": "So far so good.", "Date": "May 9, 2014"}, {"Author": "Jon", "ReviewID": "R1VGRMFRWK77F8", "Overall": "4.0", "Content": "MeMO pads are out for a while, but this particular model seem to be a new design from Asus with a new processor. I bought 2 of these to replace partially broken Acer iconia A100 and Asus Transformer TF101.  Compare to those two, the MemMO pad havepros:+ better screen, the ips screen is sharp and have good colors even it's not a high res screen+ the 1.6GHz Rockchip quad core processor (see image) made the MeMO pretty fast, more responsive+ lighter and smaller due to smaller black bordercons:- Have not run the battery all the way down to zero, but battery life seem to be a bit worse than the other 2 by look a the percentage left after an hour of use- only have pink color. I bought kmbuy cases to cover most of the pink- no HDMI outsame:= the camera for all 3 about the same => not that greatOverall a very good  tablet for the price.  The price for two is still less than most the tablet out there.", "Title": "Good value for a perfectly usable tablet", "Date": "May 14, 2014"}, {"Author": "Julie T.", "ReviewID": "R2JCTCEG69481U", "Overall": "5.0", "Content": "We bought this for my Mother-in-law for Mother's Day.  She is 89 years old and not very computer literate.  She just wants to read the news, email, and play her games.  She absolutely LOVES this tablet and says that it is very user friendly.", "Title": "Bought as a gift - She loves it!", "Date": "May 16, 2014"}, {"Author": "elsie", "ReviewID": "R2EMG6M3WFN3WU", "Overall": "4.0", "Content": "Up. In the air. Dont know whether to return it or not.  great tablet but awful battery life. Can't get more than 5 hours of straight use and that is just reading a book . It'll hold a charge for days if you just use it on and off. Have the return label and been ready to send it back several days now but every time I get it ready, I weigh everything else that's good and I unpack it again  . But discounting the battery life, you can't get a better tablet for the price. I f I keep it, I'll just keep a battery charger handy.  I have an Acer 8\" and a Nook and an iPod as well and I use all of them mostly for reading and email. Wanted a long battery life to get through hurricane seasons and power outages.", "Title": "great tablet-short battery life", "Date": "May 31, 2014"}, {"Author": "IEA", "ReviewID": "R2QMTQRQ0ASK68", "Overall": "5.0", "Content": "LOVE MY ASUS MeMO 10' TABLET.  IT HOLDS A CHARGE FOR AT LEAST 9 HOURS.  THE SCREEN IS CLEAR AND BRIGHT,THE MeMO TABLET IS FAST.  IT'S A GREAT TABLET FOR THE PRICE.", "Title": "ASUS MeMO 10' TABLET", "Date": "May 26, 2014"}, {"Author": "J. F. Buckley \"buckstar58\"", "ReviewID": "RFB7BCJ2NC87Y", "Overall": "5.0", "Content": "I have used this 10\" Asus for a couple weeks and I love it. When we needed a new computer we bought a Asus. Love that also. It makes sence Asus is so good they are the company that makes the mother boards for most of the computer company's computers. I strongly recommend Asus.", "Title": "Love my Asus.", "Date": "June 8, 2014"}, {"Author": "Sean Lawrence", "ReviewID": "R1XV8HYHAEEZ1U", "Overall": "5.0", "Content": "Bought it for my wife for Mother's Day, she has a sad little iphone, but now she really loves her tablet and the andriod system. Expandable memory and the speed are great. She won't put it down! Great tablet for the price, very happy!", "Title": "Great tablet at a reasonable price.", "Date": "June 8, 2014"}, {"Author": "Andrea", "ReviewID": "R3HVE4F03OQB03", "Overall": "5.0", "Content": "I love my new tablet!! Had an Asus T101 and it was starting to die on me...so I wanted a tablet I was use to...but this tablet it better then my 1st...Glad I purchased this", "Title": "Excellent!!!", "Date": "June 6, 2014"}, {"Author": "MMR", "ReviewID": "RL6Z49QS5205I", "Overall": "5.0", "Content": "Excellent screen and sound ...fast processor ...everything you need you'll find on it. If looking for something by this price it's the best.", "Title": "It's very good!", "Date": "June 6, 2014"}, {"Author": "thomas emory", "ReviewID": "R38I2WHMDDCASP", "Overall": "4.0", "Content": "I don't like It because I can't put Google play cards in it because they don't work. I had five cards and I have to let all my cards go to some of my family. Because it would not let me play on this tablet and I don't like it one little bit please help me . Because it just don't let me in it,I can play so game but I can't buy anything so I lose the money that I pay for the cards with and am so mad but I love,the tablet.but just don't like tablet because of that.", "Title": "table is crazy", "Date": "June 4, 2014"}, {"Author": "Mindy", "ReviewID": "R1ZEFVN20SU30C", "Overall": "1.0", "Content": "This tablet is very slow. The wifi is horrible on this while my sons apple product gets the wifi perfectly fine. It does not hold a charge at all! Dont waste you money on this tablet", "Title": "dont buy", "Date": "May 30, 2014"}, {"Author": "K. Oliver", "ReviewID": "R3VMDX5Z79DDV7", "Overall": "5.0", "Content": "I've never owned a touch-screen anything, so I'm slowly learning to use my new device.  I like it a lot.  I've probably tapped about 1% of its potential.  I had reservations about the color, cherry pink, but at $40 less than black, no problem!  When it arrived, I was delighted with the color!", "Title": "Still learning to use it", "Date": "May 29, 2014"}, {"Author": "Robert Cline", "ReviewID": "R2C9LT99SEV2PN", "Overall": "5.0", "Content": "bought this for my daughters 6th birthday. its durable and fast. easy to use as well. def worth the money. ive seen chinese knock off that boast big processing stats but then run slow as heck.", "Title": "great beginner tablet", "Date": "May 28, 2014"}, {"Author": "Robert Haines", "ReviewID": "RN9JQPWTU0M2", "Overall": "4.0", "Content": "Could have a better camera but I knew it was a low megapixel at time of purchase.  It works well for email, web surfing and apps.  The battery could last a little longer.  We mainly only use it at home so it is consistently connected to Wifi.  Good price for what you get!  Yes I would buy it again", "Title": "Decent Pad for the price", "Date": "May 21, 2014"}, {"Author": "Byron Diaz", "ReviewID": "RRAWSIV5U7ZU5", "Overall": "5.0", "Content": "I love this tablet, super fast super easy to use.  My 3years old daughter loves it too much better than my ipad.", "Title": "Love it", "Date": "May 19, 2014"}, {"Author": "Steven Cowart", "ReviewID": "R3RK6N1IW46OMY", "Overall": "4.0", "Content": "She says she likes it but will not let her play the games she likes on her computer. She 's having trouble figuring everything out.", "Title": "Gift for my wife", "Date": "May 22, 2014"}, {"Author": "Jo Gamache", "ReviewID": "R37ASRMYL5XNFO", "Overall": "5.0", "Content": "just wanted something to have around the house to quickly check my email, or the news, or look at our security cameras. nothing super advanced and just what i needed. put a 32g sd card in it an now have tons of music on it too.. would work well for guests wanting to watch a movie on netflix or prime in the guest room..", "Title": "exactly what i needed", "Date": "May 19, 2014"}, {"Author": "S. Herrera", "ReviewID": "R2JZYMGQJAQIG1", "Overall": "5.0", "Content": "Got this as a gift for my brother who had a Samsung 8 inch Tablet - and loved it. This tablet is a 10.1 inch quad core with stereo speakers. He loves the bright screen and not having to always plug in his ear buds to watch a video - sound is great. Can check his email quickly without using up battery on phone or turning on his laptop. Can't beat the price.", "Title": "GREAT TABLET FOR THE PRICE", "Date": "May 31, 2014"}, {"Author": "hey", "ReviewID": "R1KVQK1X133ID", "Overall": "4.0", "Content": "Like them cheap and useable, tho do not drop it it gets broking fast. Make sure u have screen and case for its safety", "Title": "nice", "Date": "May 4, 2014"}, {"Author": "Ross Ghanim", "ReviewID": "R2C06W800NOCAK", "Overall": "1.0", "Content": "If you live and work in an APO area such as a US camps in Afghanistan or Iraq I recommend not to buy this or any ASUS products.  I buy for many users here at this camp and I refuse to buy any of ASUS and I keep telling people not to buy from this company.  First of all if you buy from them and you have any issues and need to return it to them for RMA then they will not send it back to you since they will tell you that they do not ship to you so you must have an address in the US that someone from there will send it to you.  This is what happen to me and I have been waiting over a month and nothing.  Of course thanks God I bought it through Amazon otherwise their customer service department will keep playing games with you.", "Title": "not good customer service department and very bad RMA system", "Date": "May 16, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3FMANWUEKY5T3", "Overall": "2.0", "Content": "I bought this for my son's birthday. After trying it and having such fun getting it to \"speak\" English and not Chinese, we decided it was not at all what we wanted. It is being returned.", "Title": "OK, but really small", "Date": "May 23, 2014"}], "ProductInfo": {"Price": "$229.00", "ProductID": "B00IAA2EY2", "Features": "Camera: 2MP rear, 1.2MP front\n10.1 inches HD Display (1280 x 800)\nQuad-Core 1.6 GHz CPU, Android 4.2 (Jelly Bean)\n16 GB Flash Memory, 1 GB RAM Memory\n9.5-hour battery life, 1.2 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/4199mgI2u1L._SX300_.jpg", "Name": "ASUS MeMO Pad 10 ME102A-A1-PK 10.1-Inch 16 GB Tablet (Cherry Pink)"}}