{"Reviews": [{"Author": "Iamwally", "ReviewID": "R1EJHHF40K4FES", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moE8S8WWNIVDXYembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moE8S8WWNIVDXYrefresh_preplay() {\n\ndocument.getElementById(\"cv_moE8S8WWNIVDXYchiDiv\").innerHTML = document.getElementById(\"cv_moE8S8WWNIVDXYhiddenPre\").innerHTML;\n};\ncv_moE8S8WWNIVDXYrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moE8S8WWNIVDXYso;\t   \n\n\nfunction cv_moE8S8WWNIVDXYloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moE8S8WWNIVDXYso = new SWFObject(swfLocation, \"cv_moE8S8WWNIVDXYAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moE8S8WWNIVDXYso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moE8S8WWNIVDXYso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moE8S8WWNIVDXYso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moE8S8WWNIVDXYso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moE8S8WWNIVDXYso.setAttribute(\"height\", swfHeight);\n          cv_moE8S8WWNIVDXYso.setAttribute(\"width\", swfWidth);\n          cv_moE8S8WWNIVDXYso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moE8S8WWNIVDXYso.write(\"cv_moE8S8WWNIVDXYflashcontent\")) {\n          fp_resizePlayerSpace('cv_moE8S8WWNIVDXY', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moE8S8WWNIVDXY';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moE8S8WWNIVDXY', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moE8S8WWNIVDXYloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moE8S8WWNIVDXY\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"186-4170166-7990560\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3DQ9OVQD4W7DI\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3DQ9OVQD4W7DI\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1EJHHF40K4FES\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3DQ9OVQD4W7DI/186-4170166-7990560\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/186-4170166-7990560\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moE8S8WWNIVDXYduration')) {\n      document.getElementById('cv_moE8S8WWNIVDXYduration').style.display='none';\n    }\n    cv_moE8S8WWNIVDXYloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moE8S8WWNIVDXYloadSwf(movieID, playerVersion) {\n   return _cv_moE8S8WWNIVDXYloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moE8S8WWNIVDXYnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moE8S8WWNIVDXY', 0, h);\n}\n\nfunction cv_moE8S8WWNIVDXYresetPlayer(w,h,bw,cc) {\n  cv_moE8S8WWNIVDXYnewHeight(h);\n\n  cv_moE8S8WWNIVDXYso.addVariable(\"resetBandwidth\", bw);\n  cv_moE8S8WWNIVDXYso.addVariable(\"cacheCode\", cc);\n  cv_moE8S8WWNIVDXYso.setAttribute(\"height\", h);\n  cv_moE8S8WWNIVDXYso.setAttribute(\"width\", w);\n  cv_moE8S8WWNIVDXYso.write(\"cv_moE8S8WWNIVDXYflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moE8S8WWNIVDXYRollOverImg = new Image();\ncv_moE8S8WWNIVDXYRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91phbk3ubeS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moE8S8WWNIVDXYpreplay = document.getElementById('cv_moE8S8WWNIVDXYpreplayImageId');\nif (cv_moE8S8WWNIVDXYpreplay) {\n  cv_moE8S8WWNIVDXYpreplay.onmouseover = function() {\n    cv_moE8S8WWNIVDXYpreplay.src = \"http://ecx.images-amazon.com/images/I/91phbk3ubeS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moE8S8WWNIVDXYpreplay.onmouseout = function() {\n    cv_moE8S8WWNIVDXYpreplay.src = \"http://ecx.images-amazon.com/images/I/91phbk3ubeS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moE8S8WWNIVDXYpreplay.parentNode;\n\n  var cv_moE8S8WWNIVDXYcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_moE8S8WWNIVDXY/186-4170166-7990560?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moE8S8WWNIVDXYcurrentClick) {\n      return cv_moE8S8WWNIVDXYcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 4:31 MinsLet me start out by saying I really love this tablet but that does not mean that it is without flaws.  However, when I sat down to write this review I asked myself a question, \"Are any of my issues with this device the fault of the device?\".  The answer was no.  That is why the device gets a 5 star rating from me and it is well deserved.  The issues I have with the device are the fact that being such a new device, I did not find many accessories available for it and the size of the system partition.  I am used to a device that has the whole size of the memory available for installing apps and media but android has a whole multi-partition thing going on and I guess I will have to get used to it and learn my way around that.  I have always purchased a bluetooth keyboard case for my tablets and have not been able to find one for this device yet so I purchased the Fintie case which is the best thing available for now and I will have to keep an eye out for a bluetooth keyboard case in the future.  Neither of these issues can be held againt the device which I think is on par to my iPads for a quarter of the price!The device arrived in a timely fashion and well packaged.  Included in the box were the tablet (with screen protector already installed), an extra screen protector, a wall charger, a usb to computer cable and a usb host cable to attach usb devices such as thumb drives to the tablet.  The device is similar in size and weight to my iPad 2.  It booted up quickly even the first time.  It was easy to setup and start using right away.  It has some nice apps pre-installed such as facebook, skype and a really nice video player called 4K, which will play most anything you throw at it flawlessly.  The screen is crisp, clear and very responsive to the touch.  The quad-core processor makes everything seem very responsive and quick.  It has some nice and helpful screen widgets available to customize your main screen. I am a big fan of news and weather on my home screen and I was easily able to place it there.I am also a big movie and tv fan so XBMC is a must.  I was a little dismayed when I installed XBMC and the video was stuttering a litlle.  Have no fear, with a little research I was able to figure out that another version of XBMC called SPMC worked perfectly!  Just do a google search for SPMC you will find it and be happy you did! Battery life has been very good, even when streaming video and movies.Overall,  I would say the this tablet more than lives up to my 5 star rating and would definitely have no qualms recommending it to friends and family and in fact I already have!", "Title": "Fantastic tablet!  Great Value!", "Date": "April 29, 2014"}, {"Author": "Mark Heffernan \"Mark Heffernan\"", "ReviewID": "R37HZ1SQ8ORVDD", "Overall": "5.0", "Content": "I recently purchased the G-Tab for a Mother's Day present for my mom.  I'm relatively tech savvy and did some serious shopping of what was offered in the 10\" category.  Unless you are going to use this tablet for taking pictures, Skyping a lot, or need serious processing power... this IS the tablet you want.It powered up right out of the box and the first thing you notice is DAMN that screen is excellent!  The resolution and brightness really is the best characteristic of this product and frankly, that's what a tablet is for.  It has it's own kind of Matricom Android load which is snappy but had some difficulty customizing myself - basically because it's not a \"clean\" load and has some of their own apps.  I was able to quickly connect to a wifi signal and begin downloading and configuring it for my mom.  I was able to create Instagram and Facebook accounts in about 10 minutes and had the whole thing configured in about an hour with all the icons/widgets/apps before i sent it to her.PROS++ The screen is sharp, bright, and responsive --- A+++ There is about 11GB of user-storage which is more than plenty for most people+ The screen transitions aren't SUPER smooth, but the unit is very snappy opening apps, updating, etc.  Good power.+ The battery is great.  I think a full charge lasted the entire day i spent configuring it with screen brightness on full+ Sleek design, good bezel, metallic back, decent build quality+ Slot for microSD card which pretty much puts you at infinite storage+ Arrived in an attractive boxing with very good packaging and all the power/USB cables+ It arrived with a screen protector ALREADY applied and an extra in the box!!!+ I received an email followup asking about what I thought and with direct contact information and a forum for discussions.  I don't know for sure, but my guess is Matricom has some pride in their product and good customer service.+++ VALUE!!!!CONS-- The only actual negative thing are the cameras.  Both cameras, and/or the software, are sub-par.  If you are one of those people (which I hate) that walk around town taking pictures with your tablet then this won't work and you need to buy a new mobile phone.  Both cameras were choppy, low res, couldn't focus well, and there's no flash.  That said, it's a tablet and there may be Android Apps that can help.- Really a small gripe is the screen was a little jumpy with very subtle finger movements.  That might be because I have large fingers or I needed to calibrate it but it wasn't annoying but noticeable.- The power button location, for whatever reason, always seemed to be in the \"wrong\" place.  I don't know if it's a cultural thing, but I seemed to constantly have trouble finding it.- I didn't have a problem, but the charging port and module seemed small enough to be a problem.  Like, real small.  If this thing is charging and your dog or kid grabs and pulls it at 90 degrees my guess is it will break off.  So, just be responsible.Overall, my wife has an iPad2 and this was just as fast or better in every category except the cameras.  If i could give this 4.5 stars because the cameras are so bad, I would STILL give it a 5 because the screen and everything else is THAT good.", "Title": "The G-Tab is the BEST value out there for a tablet computer", "Date": "May 20, 2014"}, {"Author": "D. Parker", "ReviewID": "R39M3WTN31N626", "Overall": "5.0", "Content": "First of all, I'll admit that you need to be ok with the Android platform in order to truly enjoy this device.  As far as I'm concerned, this tablet performs on par with the Ipad with the exception there is no 4G cellular capability.  But then again, it's several  hundred dollars less.  To get around that issue, I'm just using my phone as a hotspot and away I go.  I own both an Ipad 3 and a Nexus 7 and this device is formidable competition for either.  I'm running video apps like Slingplayer and XBMC and I can say that both run flawlessly.  No hesitation, skipping or degradation in the quality of the movies, TV shows, etc. at all.  This device handles Blue Iris to monitor my video cameras on the go with absolutely no issues.  I am not blown away by the quality of the cameras, but I don't use them that much so it's a non issue for me.  All my banking apps run well.  I am purposely not creating this review for techies because most of us just want to know how the device works as it relates to practical applications.  Just as important I have used this tablet for navigating my work spreadsheets and with word processing documents and have had no issues.  It's handy to be able to connect a wireless keyboard and mouse which makes it my portable computer on the go.  I'm not much for games so with the exception of Solitaire, which again works great, I can't talk about that.  The quality of the tablet is on par with much more expensive models.  There seems to be a noticeable difference between this tablet and the Ipad when it comes to weight.  Not at all heavy but heavier than the Ipad.  Bottom line, if you need a tablet computer but don't want to spend a fortune on it, I'm comfortable recommending this little tablet.  You won't be disappointed.", "Title": "A Great Inexpensive Tablet!!", "Date": "April 14, 2014"}, {"Author": "Neal Quaresma", "ReviewID": "R1PTWDZFT9YUR0", "Overall": "5.0", "Content": "This tablet is the best value you can get for the price. I'll be honest I hate Apple and all things related to it. I can also say that this tablet definitely blows the iPad out of the water with the features and specs. I've been using it for a week now and have watched a movie, played a couple apps for hours, surfed the internet for a day and also read some e books and only had to charge it once! If your thinking about getting it, just do it you will be happy you did. Bottom line it boots up quickly, very responsive, doesn't freeze or lock up while multi tasking and will do what your expecting it to do.", "Title": "This will eat your iPad for breakfast", "Date": "May 19, 2014"}, {"Author": "Benjamin M. Ridler", "ReviewID": "R1ZFR24EVO9V1N", "Overall": "5.0", "Content": "- This tablet is similar to an iPad in size and appearance.- It's a lot heavier than other cheap Android tablets I've used, but the battery life is worth it.- The screen is clear and bright.So far so good.", "Title": "Nice, Solid Performer", "Date": "May 13, 2014"}, {"Author": "givitumee", "ReviewID": "RGCVURKUPQG7M", "Overall": "1.0", "Content": "Got mine today and WIFI is barely functional. I have it next to my motorola droid phone connected to the same access point and getting very high internet speeds. However, the tablet can barely load a web page. If I get closer to the router it improves somewhat but still very flaky and connection drops in and out regardless. Upon reading other reviews, it looks like you're rolling the dice if you get one of these with defective Wifi hardware or not. Clearly some are reporting zero wifi problems. So, I'm going to return this one and try to order a new one (Amazon won't let me exchange directly). I will update the review on the wifi status of the 2nd one. It is possible Matricom just doesn't invest in high yield manufacturing, which would cause a higher rate of these duds.UpdateGot the 2nd one. Kudos Amazon for fast shipping. Same problem. Placed it next to Google Nexus 7 tab and ran speed test application on both connected to same WIFI access point. Results:Nexus 7 - 1 to 2 MbpsMatricom Iota - 0.05 MbpsThis indicates to me they have put a horrible Wifi chip or antenna in this product. Do no but this tab if you are even a light internet user. I found it to be a piece of garbage and I'm returning it.", "Title": "Updated: Wifi Horrible on mine", "Date": "May 9, 2014"}, {"Author": "Josephine Fresquez", "ReviewID": "R3RO1JXRPP8XD6", "Overall": "4.0", "Content": "Well, I have never owned a tablet before but have used one in the past. I had been looking into purchasing one for a while but did not want to pay a whole lot of money for one. I'm going on maybe a couple of weeks now using the G-Tab and have really enjoyed it. It has a quick start up, love the size of the screen, good color.  Only disappointment is that I've had to reset it once already cuz it had frozen up on me. I'm going to continue checking out all it's features and see how well it rates. Will come back after a month or so and let you know how well it is doing.  Price wise, I believe it has been worth it.", "Title": "First Time Owner--Satisfied So Far!", "Date": "May 26, 2014"}, {"Author": "Phong Truong", "ReviewID": "R3FST1U1WQWGA7", "Overall": "5.0", "Content": "I bought this tablet and the black one.  It's well made.  The material in the back cover is aluminum.  My main usage is to easily copy movies, and music on either external sd or usb hard drive to watch while I am traveling.  This tablet can do just that.  I can just drop the movies (mp4 and MVK) and music on the external hard drive, plug it in the tablet and play. Simple and straight forward.  This is how it should be instead of going through some middle application.  My wife and I really like this tablet.", "Title": "Good product at excellent price!", "Date": "May 20, 2014"}, {"Author": "Phalanx", "ReviewID": "RGGEPUZK9PMFB", "Overall": "4.0", "Content": "I can honestly say this tablet works better than expected. I use it solely for work, and not for entertainment. I have PowerPoint presentations on this, and have them displayed on a full-size monitor (when used with an adapter).One cool and unknown (to most) feature is you don't actually use the standard charger it comes with. A micro USB charger will charge it just fine.One downfall to note is there are not too many accessories that fit this particular tablet. I use a \"universal\" tablet stand for this, as well as a Bluetooth keyboard, and they work just fine on this device.Another issue is removing the micro SD card when inserted. It's takes effort and tools to remove it. But, despite what the box says (32 GB), it can accept a 64 GB micro SD card.You can play games on this, and it has good graphics and a good processor. So, if you're looking for something that looks really good, performs well, and is very inexpensive, this is definitely something I recommend.", "Title": "Great value for the price", "Date": "May 23, 2014"}, {"Author": "kim", "ReviewID": "R1139A6P36956R", "Overall": "5.0", "Content": "This is a great first time tablet, very easy to maneuver and it already comes with all of the basics already loaded onto it. Not a lot of memory, I will need to be purchasing more soon. Other then that is it great so far, I received it about 2 days after placing the order.", "Title": "Great!", "Date": "May 27, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00IU745S8", "Features": null, "ImgURL": null, "Name": null}}