{"Reviews": [{"Title": "A Tremendous Android Tablet for the Price Point!", "Author": "Steve H \"books911\"", "ReviewID": "R2AIFTOGHRE5XO", "Overall": "4.0", "Content": "I must preface the review by stating my time with Android devices has been limited.  I have had more iOS devices and spent more time with that platform. I have always respected the Android platform, its functionality, and the value it presents.Nevertheless, this Acer Iconia A1 with Intel Atom processor has more than impressed me.The first thing?  The speed of the device.  The internet browsing, app launching, startup, etc. are all nice and speedy.  This is a very important factor when looking at tablets.  Surely, the 1GB of RAM helps too.  You never feel as though you're waiting around for a page to load or application to launch.  It just works and works as it should!  My primary iPad is a third generation with retina display, and the speed of this Acer Iconia A1 is much more impressive.The form factor of the device? A perfect size.  Hold it one hand or two hands, the choice is yours.  It's comfortable.  While a full size iPad I find uncomfortable in bed, I can use this product in bed for at least a few minutes without feeling uncomfortable.  Lying back on the couch to read a book?  That is enjoyable and comfortable.  I can do that a couple hours. Sure, the Iconia A1 weight more than an iPad mini and it isn't quite as sleek, but I am not complaining.The screen?  The size of the screen is fine as again it adds to the comfortable form factor of the device.  The screen size and resolution is the same as the original iPad Mini, which sells for approximately one hundred dollars more than this device. The quality of the screen is \"ok,\" for the price point.  It is similar to original iPad mini screen in quality, but doesn't pop quite as much.  Compared to a retina display on the retina iPad Mini or retina iPad, this screen looks poor!  Sure, you can still comfortably read, navigate around etc.  If retina displays did not exist, it would be fine, but with retina available today, you do truly notice the low resolution display.  Still, for less than two hundred, something has to be cut.Build Quality?  The Iconia A1 feels anything but cheap.  In fact, it feels solid, looks beautiful, and fits right in your hand.  It has a beautiful aluminum finish on the back.  I have many Apple devices, and the build quality is right up there close with say an iPad mini.  It really does look cool.Storage - 16 GB of internal storage is good for the price.  16 GB is the same amount on an entry level iPad, but the Iconia offers expandability with a microSD card slot, something iPad never offers.Software - You can do almost anything with this tablet.  The Google Play App Store is at your fingertips.  All the apps you can imagine are there.  Hundreds of games, news, music, etc.  Name an App on iOS, and it is probably available on Android too.  The only thing, for someone like me, if you already own apps on the iOS App Store, you will of course have to re-purchase them on Google Play, but if you're a long time Android user, all your applications and preferences will transfer over immediately when powering on the tablet the first time and entering your Google ID.  Google makes the process simple and painless.  Well done Google.  They keep you backed up too!The included Android version is Jelly Bean, and it runs smoothly.  There are a few pre-installed apps for games, several for music, etc.  I find these rather annoying, but I simply remove them from the main screen and use the more popular apps like Google Play, Amazon MP3, Pandora, SiriusXM, etc.I have DirecTV service, and I can even stream a selection of channels to the device in the DirecTV App (available via the Google Play store for free) when I am on the same network as my DirecTV receivers.Voice recognition is near perfect.  I find it better than Siri and voice recognition on iPhone/iPad.  Google gets what you say right, almost every time, if not too complex. Search your tablet, search the web, compose an email.  Android's voice over support is superb!The screen seems to hold onto fingerprints a bit more than iPad's oleo-phobic screen, but I have a little display cleaner to use on it at the end of the day, no big issue.Camera?  Both a rear and front camera are included.  Personally, I never use the cameras on any of my tablets.  Phones have much better cameras.Spakers, fine if you need to hear something in a pinch. Otherwise, plug in some headphones.Your Ecosystem - It's hard to leave your ecosysystem, rather Google Play or iOS App Store.  I have so many purchases on App Store.  Furthermore, I love features like Airplay in iOS so I can scream content on my iOS devices to Apple TV. Nevertheless, there are similar alternatives for Android.  Even being locked in iOS ecosystem, I am happy to add this product to my arsenal of devices.  It fits in nicely, and I can do almost anything with it!Overall, Acer is presenting an incredible value with the newest Iconia A1.  The Intel Atom processor makes your experience smooth.  You never feel you are waiting on the tablet, and that makes for a good experience.  Battery life is acceptable.  Most of all, at a very low price point you get a speedy Android 7.9-inch tablet, a comfortable size and it gets into the Google Play ecosystem of incredible applications a click away.  Plus, you have Amazon's App store available, Kindle Application, as well as Amazon MP3.  Amazon videos are not available on any Android devices (except Kindles which are specific Android devices).Web browsing, music with headphones, book reading, email review, and quick games are a joy on this device.  The display will let down your videos, photos, and sharp text somewhat, but the price point with the fluidity of the device makes it a compelling product.  I was skeptical before using the A1, but I can now see it being a part of my life nearly every day.  It is small enough and light enough to take anywhere, and when you do take it, you can count on a device that you know will work with the applications you need!  Very much recommended!", "Date": "March 26, 2014"}, {"Title": "Excellent Tablet For the Money, But Don't Get Rid of Your Laptop", "Author": "Colorgirl \"Spreading color around my world\"", "ReviewID": "R1CWNB9R08CCKT", "Overall": "5.0", "Content": "I have ready many reviews on tablets, and have found most of them to be why a certain tablet is better than another to the nth degree with all kinds of technical jargon which really just pits one expert against another.  As a person who tutors people who are not technologically savvy, I am going to review this tablet from the point of view of someone who has not had one before and whether or not this is a good choice if you want to get one.I have been told by several business people and those who claim to be very tech savvy that they have gotten rid of their laptops except for occasional spreadsheet work in their offices or at home.  Can you get rid of your laptop by getting a tablet like this?  Let's take a look.WHAT IS THIS TABLET LIKE?SIDE SWITCHESThis tablet is around the size of an ipad mini or a Kindle.  The on off switch is on the upper right hand side (with screen facing you) and below it is a rocker switch just below the power switch.  There is a space between the two buttons which will allow for elastic bands should you want to get a case for it that has them.  That will make it so that the tablet will not be turned on and off by accident.  The power button has to be pushed and held for a moment before the unit turns on.SCREENThe tablet screen is shiny which can be annoying, but that is the nature of the beast.The touch sensitivity is excellent- I did not find any problems with response time or lag.The orientation changing when you turn the screen around is also well set.  It works nicely and is not overly sensitive.INPUTTo input into the tablet, you have a choice to either type or speak what you want the tablet to do.  I have to say that this tablet responds very well to either set of input.  After working with several i-pads, my daughter constantly raves about how this Acer tablet is superior in the way it responds to input with the microphone than the i-pads are.  I have not had any problem with typing into this tablet beyond what I normally do on any unit.  The microphone occasionally mistypes a word, but it is not nearly as bad as I expected it to.Response time of the tablet is excellent.  I am quite impressed with how quickly it responds to input without lag or difficulty.APPSI have put a few apps on this unit which tend to be popular with tablet users.  Sketchbook Pro is one of those apps.  I really like it.  The response time is good, and the app seems to work well on this tablet.  I also love the radio app which allows you to listen to radio stations in the area or around the country.  With a case that folds into a stand, it is a great panel to use in a room where you want to listen to the radio.Quite a few apps that come in the tablet already are handy and easy to use.  The screen is quite intuitive and easy to use.INTERNET USAGEThis tablet is wi-fi accessible to the internet which means that you can not go out in no-man's land to use it like you can an android phone, but you have to be near a wi-fi station to use it.The wi-fi response time is excellent- although it does occasionally lag when the signals get weak- something that all wi-fi units will do.Android is a Google engine so everything you do will be monitored by Google or you will be using something they have designed to get where you want to go.  You can find other ways to purchase apps if you don't like the Google store, however, such as Amazon.This tablet comes with McAfee virus scan which is not a huge deal, but I am not sure how to replace that yet, should I desire to do so.CAMERAI am not a big advocate of phone and tablet cameras.  This one has a decent camera to use on the back, and an adequate camera on the front of the camera to use for Skype which is pretty much all you need.  If you want a really nice camera, buy one.  For quick pictures to capture something you want to show someone, then this will be fine.PROSEasy to holdScreen responsiveSpeech recognition works wellGood fast performanceBoots up quicklyClear screen makes reading books niceGood colors for photos on the screen (better than laptops)Power button hard to accidentally turn on or offLearning is pretty intuitive for first time usersCONSWi-fi onlyNot as easy to use as laptop for extensive typingCan be a bit clumsy to use at times (the nature of tablets)Start up literature is a bit underwhelming for first time usersTHE BOTTOM LINECAN YOU GET RID OF YOUR LAPTOP?Can you get rid of your laptop to substitute this tablet?  My answer would be no.Even if all you did was go on the internet to wander through web sites, using a tablet is a bit cumbersome if you want to do any kind of extensive writing.  If you use the microphone, it will probably be pretty accurate, but you will still have to use the keyboard to correct what is used.For occasional internet usage, watching videos, movies, and reading books, this tablet is fabulous.  I think it works beautifully.  I would say that it is just as nice as other more expensive tablets and you will invest a lot less money in it.If you want a tablet and do not want to pay a fortune for it, this is the way to go.  The Acer Iconia A1-830 is an excellent value and I use mine a lot.  I just could not substitute it completely for my laptop.  I prefer to have a choice in my browser, features, and fine tuning or replacement of parts should I desire to do so.I do find that having the tablet helps a lot when I want to quickly do something on the internet and don't want to boot up my laptop.  This tablet is pretty quick and I like it.  If you are a tech fanatic and have to have the biggest and best, you might find fault with this tablet, however.  It is worth a test run in any case.", "Date": "April 7, 2014"}, {"Title": "Fantastic First Tablet", "Author": "M. Karazim", "ReviewID": "R1GXGW4FT4Q0AU", "Overall": "4.0", "Content": "I'm not a technical person, so this review is purely a usability review based on overall functionality.  I have coveted an iPad for years, but never wanted to cough up $600 for one, so this is my very first tablet.  I own an iPhone and a MacBook Pro, so my recent experience has all been with Apple products and I have never used an Android device. The tablet came almost fully charged and only required a short hour of charge time before I started messing around with it.  I was pleasantly surprised that setup was a breeze, and only slightly annoyed at the few items that were offered for sale during the process.  I already had a Google account before receiving this, but if you don't have one it might be a good idea to set it up.Pros:Packaging is simple, sleek, and mostly recyclable.Easy setup and connection to home wireless was effortless.The tablet design is gorgeous, and right in line with what you'd expect from an Apple device, with the brushed metal finish on the back and a white face.The camera (back and front) is nice at 5mp.Storage is ample at 16g.  Expandable by micro SD card up to 32 gb.Web is fast and most pages look good.My almost 2-year-old can use this with ease.  He loves it.Battery life is good at 7.5 hours.  It truly lasts this long, even with downloads, playing videos, and playing games.On and off is as easy as touching a button on the side, and very responsive.Screen size is ample, better than Kindle Fire.ConsDisplay is only 1024 x 768The screen is not as responsive sometimes as I think it should be.Overall I would say, without owning another tablet, that this is a great basic and inexpensive tablet.  For surfing, email, YouTube, and other similar applications, you can't go wrong.", "Date": "March 25, 2014"}, {"Title": "Finally and Android tablet in 4:3 that I like", "Author": "Skeptic \"Dito\"", "ReviewID": "R1VKC192NSY5DB", "Overall": "5.0", "Content": "I've been waiting for this tablet since it was announce at CES back in January, its my first tablet and this is the reason why, I'm not an apple fan I have nothing against apple I'm just used to Android, but 90% of all android tablets have a 16:9 aspect ratio which is good for watching videos they look like big cell phones to me, I wanted a tablet with a 4:3 aspect ratio like the ipad mini for reading and surfing the web, but with an android OS, this one is perfect good size and half the price of the first ipad mini with the same resolution if you own an iphone go with ipad if you are familiar with android this one will do.", "Date": "April 3, 2014"}, {"Title": "Excellent price point, great features and great performance", "Author": "C. Miller \"IdoNotes\"", "ReviewID": "R15MQLKY06151X", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2DOK6Z7TFQV4embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2DOK6Z7TFQV4refresh_preplay() {\n\ndocument.getElementById(\"cv_mo2DOK6Z7TFQV4chiDiv\").innerHTML = document.getElementById(\"cv_mo2DOK6Z7TFQV4hiddenPre\").innerHTML;\n};\ncv_mo2DOK6Z7TFQV4refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2DOK6Z7TFQV4so;\t   \n\n\nfunction cv_mo2DOK6Z7TFQV4loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2DOK6Z7TFQV4so = new SWFObject(swfLocation, \"cv_mo2DOK6Z7TFQV4AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2DOK6Z7TFQV4so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2DOK6Z7TFQV4so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2DOK6Z7TFQV4so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2DOK6Z7TFQV4so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2DOK6Z7TFQV4so.setAttribute(\"height\", swfHeight);\n          cv_mo2DOK6Z7TFQV4so.setAttribute(\"width\", swfWidth);\n          cv_mo2DOK6Z7TFQV4so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2DOK6Z7TFQV4so.write(\"cv_mo2DOK6Z7TFQV4flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2DOK6Z7TFQV4', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2DOK6Z7TFQV4';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2DOK6Z7TFQV4', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2DOK6Z7TFQV4loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2DOK6Z7TFQV4\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m53FWCDNTGQD4\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m53FWCDNTGQD4\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R15MQLKY06151X\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m53FWCDNTGQD4/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2DOK6Z7TFQV4duration')) {\n      document.getElementById('cv_mo2DOK6Z7TFQV4duration').style.display='none';\n    }\n    cv_mo2DOK6Z7TFQV4loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2DOK6Z7TFQV4loadSwf(movieID, playerVersion) {\n   return _cv_mo2DOK6Z7TFQV4loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2DOK6Z7TFQV4newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2DOK6Z7TFQV4', 0, h);\n}\n\nfunction cv_mo2DOK6Z7TFQV4resetPlayer(w,h,bw,cc) {\n  cv_mo2DOK6Z7TFQV4newHeight(h);\n\n  cv_mo2DOK6Z7TFQV4so.addVariable(\"resetBandwidth\", bw);\n  cv_mo2DOK6Z7TFQV4so.addVariable(\"cacheCode\", cc);\n  cv_mo2DOK6Z7TFQV4so.setAttribute(\"height\", h);\n  cv_mo2DOK6Z7TFQV4so.setAttribute(\"width\", w);\n  cv_mo2DOK6Z7TFQV4so.write(\"cv_mo2DOK6Z7TFQV4flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2DOK6Z7TFQV4RollOverImg = new Image();\ncv_mo2DOK6Z7TFQV4RollOverImg.src = \"http://ecx.images-amazon.com/images/I/91UvU%2BMKceS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2DOK6Z7TFQV4preplay = document.getElementById('cv_mo2DOK6Z7TFQV4preplayImageId');\nif (cv_mo2DOK6Z7TFQV4preplay) {\n  cv_mo2DOK6Z7TFQV4preplay.onmouseover = function() {\n    cv_mo2DOK6Z7TFQV4preplay.src = \"http://ecx.images-amazon.com/images/I/91UvU%2BMKceS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2DOK6Z7TFQV4preplay.onmouseout = function() {\n    cv_mo2DOK6Z7TFQV4preplay.src = \"http://ecx.images-amazon.com/images/I/91UvU%2BMKceS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2DOK6Z7TFQV4preplay.parentNode;\n\n  var cv_mo2DOK6Z7TFQV4currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2DOK6Z7TFQV4currentClick) {\n      return cv_mo2DOK6Z7TFQV4currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:20 MinsIf you are looking for an alternative to the standard iOS tablets, this is a great choice.  With a processor upgrade over the 810 model, it moves quick even with numerous applications open in the background thanks to the 1.6 GHz.  The ports on the device were all readily accessible and even labeled. Which is non-existent in most other devices.  They just presume you know what each port or button does around the outside.The built in storage of 16GB should handle all of your application needs. The bonus is the microSD card slot that takes of to 32GB cards for added storage for movies, pictures and larger application files. The Android 4.2 Jelly Bean is a stable release and we had no crashes during testing.The front camera is only 2MP so you definitely need some lighting to use it, but the back camera was decent at 5MP. That helped keep the price point down I imagine since most Android phones now have 8MP cameras on the back.The 1024x768 resolution on the screen was acceptable. With a 7\" tablet can you really see HD quality and different than SD? For most people this is meant to be a functional and reasonably proved device. Yet you do get over 7 hours of battery life playing movies. The edges of the screen were clear and didn't have the haze or ripple as they call it. I was able to see everything with good clarity at some nice angles. You just don't use or watch it like that often enough to matter.Finally the sizing was decent.  too big for a pants pocket or most inner jacket pockets for sure. But it fit well in your hand and was quite light. The metal back cover gives it a sturdy feel and also a sleek look.This is a great buy for a tablet and I hope it keeps up in the performance I saw in the weeks of testing.  That is why I wanted to post this and get some real testing time into it first.", "Date": "April 7, 2014"}, {"Title": "Great Tablet at an Outstanding Price!", "Author": "Buckerou", "ReviewID": "R33SFA1YT58AD2", "Overall": "5.0", "Content": "I need to write this review as 99% of the reviews here are from the Vine program and I felt the need to add my non-sponsored two cents. Let me start by saying that I bought this tablet as a present for my wife. I had bought her a Motorola Xoom 10\" a few years ago as a Birthday present. That was considered too big and too heavy. I have been using that tablet myself for the past 2 1/2 years. My wife primarily uses email, Facebook, Chrome, and Netflix. She has an iPhone and getting an iPad would have been a great idea had I not been too cheap to fork out that much money. I was looking for a tablet in the 7\"- 8\" range for about $200 and seen this stylish looking tablet. It a very sharp looking tablet and the perfect size. Most will respond with the fact that it looks like an iPad Mini. It has nice clean lines and a beautiful brushed aluminum back giving it an elegant look. It comes loaded with so many Apps and Widgets that one hardly need to get any more. Setup took all of 10 minutes tops. The screen, while not being the highest in resolutions, certainly looks vibrant to me. I am sure if compared side by side, one could see a difference, but I am not inclined to do so. It is extremely snappy in opening apps and browser windows. We have not tried any games on it, but then she does not game. It has a slot for a micro SD card to add up to 32 Gb of storage. I downloaded Netflix and the TV network apps and they all appear colorful and crisp. The sound is considerably louder and better than the Xoom. It has not dropped the WiFi connection once since initial setup and gets a great signal throughout our house. She loves everything about the tablet and so do I. Are looking for a stylish tablet and are sick of the basic black models out there? Then look no further. Are you wanting a new tablet and not willing to pay the price the fruit people are asking? Then look no further! Anyone want to buy a used Xoom? - I want one for myself so bad!PS:  A bit of advice for anyone buying one: To change the Accuweather Widget on the home screen from Centigrade to Fahrenheit - merely tap at the top center of the widget and a setup screen will open. Tap on the farenheit and then tap on done to save the setting. I hope this saves someone else the time and frustration that I had.", "Date": "April 25, 2014"}, {"Title": "Great Tablet - Surprised Me", "Author": "Charles H. Thompson III", "ReviewID": "R18NSEONERJ2FL", "Overall": "5.0", "Content": "This tablet is awesome! It was easy to set up once opened and also easy to use. You can use it for many different activities. You can search the web, listen to music, and even download Kindle books. The Kindle app impressed me. My six year old daughter also liked it. I was able to download games for free. She enjoyed playing them. The ones that are available to purchase are not very expensive either as only a few dollars at most. The weather is also available on the tablet and much, much, much more! I would recommend this tablet for any adult, youth, and children who are old enough to use technology with responsibility.", "Date": "March 27, 2014"}, {"Title": "Great Surprise at Budget Price Point", "Author": "NyReckDiver", "ReviewID": "RHWGWSMS7B1NN", "Overall": "4.0", "Content": "Let me start by saying that I am a long time Ipad user.  In our household, we owned every version of Ipad and IOS. So, I was not really expecting much at this price point or from a non-Apple brand.  I was extremely surprised by what I discovered and my view of Android platform devices has changed completely from negative to very positive, especially given the cost savings.  In fact, the only thing stopping me from transitioning completely from the IOS devices to Android devices is the heavy investment I have in Apple provided content locked to my Itunes account and devices.The Iconia A1 comes packaged very well.  The packaging and boxing reminded me very much of unboxing the Apple Ipad Mini. The build quality is very, very, good and I liked the brushed metal back.  It has a solid feel very much like the Ipad mini.  The design is very similar to the Ipad mini as well in that it is very sleek.  Very easy to hold with very little associated fatigue even though it is slightly heavier than the Ipad mini.  Once again, I compare to Ipad Mini (my frame of reference) and find it just as good in build, design, and form factor.Usability of the Iconia was top notch as well.  Setup and connection to a wireless network took under five minutes.  The screen size and resolution have the same specifications as the original Ipad Mini.  However, even with those specifications, the Iconia screen did not produce the vivid colors of the Ipad Mini.  This will be particularly noticeable to photographers who may want to use the Iconia in their workflow or as a presentation (portfolio) tool.  Of course, there is no comparison between the Iconia screen and an Apple Retina display.  The Retina display will win hands down.  However, the screen was very clear, viewable from many angles, and the edges of the screen were very clear.  The screen was definitely more than adequate in responsiveness as a touch display, though not quite as good as my Ipad Mini.  Acer provides 16GB of internal storage, which will be sufficient for most users.  However, unlike the Ipad, Acer provides expandability with a micro SD slot. In my opinion, this makes the Iconia more usable in that regard.  I found battery life exceeded eight hours during regular use.  The voice recognition as an alternative to touch input was nearly flawless. I also found the Android operating system (“JellyBean” 4.2) very responsive and well thought out.  Better than IOS in some respects and not as good in others.  Wi-Fi responsiveness was very fast and rock solid.  The Iconia also comes with front and rear facing cameras that I found suitable for everyday (“snapshot”) use or video.  The tablet provides a very fast boot up time, on par with Ipads.Using an Android driven device will tie you into the operating system much like the Apple IOS does.  Though not as robust as the Apple Store and available applications for the IOS, Google Play is gaining momentum.  Over time I suspect they will be comparable.  Until that time, the Android OS is a Google controlled system and you know what to expect with condition.  YouTube will be the primary means of video for example.  Once again, given time, I believe many more options will be available.Without a doubt the Acer Iconia is a solid product at a very good price point.  It is more flexible than Ipads (memory expansion) and while not necessarily a “photographer’s dream” like a Retina display, the screen is more than adequate for everyday usage such as web browsing, e-mail, etc.. The Iconia is a very good buy and may end up replacing my Ipads over time, or at least an Android OS driven device anyway.  If I had to buy a tablet today, never owning one before, and I was not a photographer, I would buy the Acer Iconia over the Apple.  However, if you have a developed ecosystem of Apple products currently, or rely on Apple Air Play significantly, you will want to probably stay with Apple products.  This does not mean the Acer Iconia is necessarily inferior, it just means you are stuck in the Apple Ecosystem.", "Date": "April 11, 2014"}, {"Title": "Surprisingly nice and enjoyable", "Author": "Shlok Vaidya \"The Rise of Siri\"", "ReviewID": "R9U8Y9S2FQBF0", "Overall": "4.0", "Content": "I'm not going to lie. I'm an iPad kind of guy. I also have a Kindle Fire HD which I enjoy. But the few Android tablets I've tried have been sloppy messes. Slow, clunky, and just felt gross/heavy.This thing is actually very nice. Form factor is great, feels great in the hand. It's still Android, but fast enough to be responsive and do most of the stuff I do on a tablet (read, surf the web).", "Date": "March 27, 2014"}, {"Title": "Works Great", "Author": "Ronald T. Roseborough \"Ronrose\"", "ReviewID": "R1CK2894GOBOEW", "Overall": "4.0", "Content": "This tablet is very responsive with a snappy user interface. It's small size makes it great for just surfing the web or reading the latest ebook while relaxing in an easy chair or at the beach. The only downside is the fact that the colors seem to shift a bit depending on what angle you hold the screen.", "Date": "April 2, 2014"}, {"Title": "A Solid Budget Tablet", "Author": "Michael Cavacini", "ReviewID": "R9HJGDX6XM0U", "Overall": "3.0", "Content": "This budget tablet has a great interface and it's good for reading magazines, playing casual games and listening to music. However, if you're trying to watch video using anything other than YouTube, it's not going to deliver a satisfying experience. If you're looking for a high-performance tablet, buy a Kindle Fire HDX. If you're trying to save some money and looking for something similar in size to the iPad mini, this is a reasonable option.", "Date": "March 27, 2014"}, {"Title": "I am in LOVE with this Tablet", "Author": "Latrease Mcclary \"lmcclary322\"", "ReviewID": "R3O4S6J6BGUPAY", "Overall": "5.0", "Content": "I cant say that I am a tablet expert.  As a matter of fact I would say this is my first real tablet.  I have owned 2 other tablets, both purchased from \"Big discontinued/refurb\" chain store.  Both tablets sucked rocks!  This time I waited and researched, read reviews, and vowed  I would not buy another tablet until I could afford the tablet I really wanted.  I made up my mind it was going to be either a Samsung Galaxy something or other or an HP Slate.  Then one day while browsing on Amazon.  This Acer Iconia popped on my screen at an amazing price.  Well, I started reading the reviews, and saw it had great reviews.  So I figured I give it a shot.  I ordered it next day shipping because I couldn't wait.  Well the same day I ordered it, I went to Walmart and saw they had a Samsung Galaxy Tab 3 on sale for the exact same price as the Acer.  Of course my heart sank.  Well I figured I would give a try and if not I would take the loss and return as open box.  I have had it now for over 12 hours and I cant put it down.  And maybe because of my previous sucky tablets, my standards are low, but, this thing is amazingly fast.  I saw the video review where the guy started up out of the box and was ready to go.  I was ready to play with my new toy in less than 10min  It immedately located my WiFi  I logged into my Google play store, it immediately started pulling in all of my play store apps.  So far I have surfed the web, streamed Video, played games I wouldnt dream of playing on the other tablets I had because they were so slow, or on my smartphone because its soo small.  I watched a full episode of Charmed, and the video was as smooth as if I were streaming from Roku or my blu-ray player.This Tablet is super duper fast.  Screen resolution is crystal clear.  The one thing, it comes with loads of pre-installed apps that I am not sure yet if I can, or how to uninstall them.  The dual speakers are great as for video and games.  I havent tried to listen to music yet, as I forgot to purchase an SD card. So I haven't installed my music yet.  Another thing, it did drop my WiFi, but I am not sure if its because of the Juice Defender app I have installed, or the fact that my roommate and I are both gadget junkies  I have a phone, roku, laptop, she has a couple of Ipads, Iphones, IMacs.  So I dont know if we just had too many devices connected to the Wifi at once.  But once I disconnected my phone from the WiFi the the tablet connection seemed to be fine.So all in all, I am quite please with this purchase. This is a great tablet, especially at $150.00 price point. The design is quite sleek.  My roommate came downstairs when I first opened it  and she said OMG you finally got an Ipad (she's an Apple Junkie)  But at a far glance it does look like the Ipad mini.  If I have any problems in the future I will update this review.  but for now I love it!!", "Date": "May 31, 2014"}, {"Title": "Good quality, easy to use, inexpensive tablet", "Author": "Houston", "ReviewID": "R3BLN00DMPXDFU", "Overall": "5.0", "Content": "I have been looking for an inexpensive tablet to use for basic tasks- Internet browsing, email, skype, games, etc. I also wanted one that was well made, with decent speed, and few technical/hardware issues. The Iconia A1 fits the bill nicely.The Acer Iconia is well made, with solid aluminum backing, a nice looking screen, and easy to push buttons.It runs Android Jelly Bean, and has access to the google play store, and thus thousands of aps.The technical specs are very similar to the 1st gen iPad mini-It is slightly larger and heavier, but not to any notable degree. (5.45” x 7.99” x 0.32” and 0.83 lb. for the Acer; vs. 5.3\" x 7.87\" x 0.28\" and 0.68 lb. for the iPad mini).The screen resolution and ratio is the same- 1024x768 resolution, 4:3 aspect ratio.The rear cameras are the same- 5 mp. However the Acer's front camera beats the iPad at 2 mp vs. 1.2 mp for the iPad.The Acer uses an Intel chip (Intel® Atom™ processor Z2560 1.6 GHz), while the iPad uses an Apple chip (Apple A5 1 GHz).Reported battery life in the Acer is shorter- 7.5 hours vs. 10 hours in the iPad.Both have built in GPS/GLONASS.Unlike the iPad, which uses a proprietary lightening port, the Acer has a micro USB port.Also unlike the iPad, the Acer has a microSD slot for memory expansion up to 32 GB.I haven't had any problems with the hardware or software after more than a month of use, which is great, but I therefore can't comment on the customer support offered by Acer.Overall, I'm very happy with the tablet; it does exactly what I want it to without any problems, and could probably do a little bit more.", "Date": "May 15, 2014"}, {"Title": "Best value tablet on market", "Author": "Susan", "ReviewID": "R3D3K5OSPTYB4W", "Overall": "4.0", "Content": "I bought the entry level Iconia B1  A71 at $150. I would really go for a larger screen, more battery time, more power under the hood. Be aware its only Wi fi. 3G models are available such as the A1 811 at around $250. Had problems accessing my Kindle library and also using Bluetooth. Have to get the Amazon app as well as the Kindle app or buy a Kindle Fire that is not such a great deal for international buyers as no benefits to Prime. The screen could be a touch more responsive. It is also reflective and is best viewed from an angle. Great for You Tube, Music Videos, reading PDF,s and e books. Micro USB handy for transfers along with Micro SD card and Bluetooth. Don't throw away the laptop yet but build libraries of music, videos, books and docs on SD cards and use your Tablet as a player or viewer. I love Acer products. I have a netbook and smartphone as well. Quality, reliability and service at a great price. I am ready to trade up but I honestly feel their original Aspire One netbooks were greatly underated. Also coming out is the W4 tab with Windows 8.1 and MS Office with an 8in screen. Its the Aspire One with optional keyboard re packaged for $600!", "Date": "May 13, 2014"}, {"Title": "Good value for the price point", "Author": "A Book a Day", "ReviewID": "R27DPYO23VF1IN", "Overall": "4.0", "Content": "When all you've used is an Ipad. it's hard to be objective when writing reviews on other tablets.  My review can easily be biased based on what I'm used to, but overall, this is an extremely intuitive and responsive tablet, especially for the price point.  Because it uses Android apps, the selection of standard apps are the same such as banking, airlines sites and what not, however the selection of games is different.  Regardless, the Acer Iconia was easy to charge and get started.  The first time you turn it on, you have to hold the power button down for several seconds, but after that it will go into a light hibernation mode where you can click the button quickly and turn it back on.  The power lasts a good 6 hours, perhaps slightly more and I didn't have any issues with apps closing or with the functionality lagging.  I still haven't figured out how to remove the giant calendar with temperature in the middle of the screen since I find it distracting, but that's because I was able to use it without any directions what so ever.  Again, depending on what you're using it for, it's does everything an Ipad does and is about the same size as the Ipad Mini, with a sleek look and feel but without paying $400.00.  Good Value overall", "Date": "May 5, 2014"}, {"Title": "Excellent", "Author": "Inderjeet \"indi\"", "ReviewID": "R1RONW33WNNSJ4", "Overall": "5.0", "Content": "I picked up this device for my 13 yr old son from SAMs club for $159.  Excellent hardware build quality. Jelly Bean android OS is snappy with intel's atom processor. Not sure about future software upgrades/updates but it is good for a daily use tasks performed by a middle school student. Going from a nexus 7, the little increase in screen size matters a lot says my son. No lag in video performance. Decent screen resolution and colors. Expandable memory with front and back camera is a plus. Lot of bloat ware that occupies valuable memory space but easily disabled. Can't complain about bloat ware at the price point. Excellent value for your money. This is a nice slim tablet at an extremely value price. Don't hesitate to purchase if you're looking for a cheap daily use tablet.", "Date": "April 29, 2014"}, {"Title": "This is one nice tablet", "Author": "J. Billhofer", "ReviewID": "RNLDFZDL19Y8N", "Overall": "5.0", "Content": "We needed a second tablet for my wife and our main criteria was for it to have a real GPS chipset, so we decided to get the Acer A1-830-1633. My tablet is an I-Pad with Retina display and I was wondering what this display would look like after reading some very biased reviews.To make this short, I like it, the resolution is in my opinion absolutely sufficient for a 7.9\" screen. It may be somewhat inferior to the I-Pad mini, but at about 1/3 of the price for a comparable I-Pad mini, I can live with that.The tablet arrived well packaged and on time.Set-up was very easy and it updated it's OS automatically to 4.2.2.There is a wide variety of apps available from various sources and all apps that we loaded were installing easy and are working well. It is my observation, that apps that are available for both, IOS and Android, seem to be more polished in their IOS version.In conclusion, I like this tablet.If you don't need to scratch the edge of technology and you are price-sensitive this is one to look at.", "Date": "May 15, 2014"}, {"Title": "An excellent STARTER tablet for general use.  Very good value for the cost.", "Author": "Kersi Von Zerububbel \"Kersi\"", "ReviewID": "R1F8NRQBWIMSMJ", "Overall": "5.0", "Content": "This is an excellent tablet at the current price point (less than $200).  The Android OS works great for casual use, viz., reading books, surfing websites, casual games, music, etc.  However viewing video is not so hot as there is a definite lag and the picture quality is moderate to good.  To test the system I have had music playing, had a large spreadsheet going, and used the Mathlab Graphing Calculator simultaneously and the tablet handled the load quite well.  Compared to my Kindle Fire HD this is definitely a lower quality tablet but then the price is significantly lower than the Kindle.The front and back cameras work fine.  The tablet has a solid feel and is quite slim with a classic silver finish.  One BIG plus for me is that it has a micro SD slot and thus gives me more storage should the need arise.  One con for me was the absence of a HDMI slot and thus watching movies connected up to my TV was definitely lower quality than the Kindle Fire.As an aside; I did have a problem connecting up to my WiFi for the first time.  I kept getting compatibility errors.  But then I set DFHPC to manual and the thing worked fine.  I tested the WiFi connectivity at a different location and there was no problem.  I suspect that my device was in use overseas and I thus had to change the settings once and from then on the thing works fine.Yes, this is not a high end tablet but for the price it is an EXCELLENT value.", "Date": "April 21, 2014"}, {"Title": "Excellent bang for the buck", "Author": "Craig", "ReviewID": "R2ERIOJO66PNZO", "Overall": "5.0", "Content": "We've got several existing tablets and other devices in our house.  My wife and I both have used iPads for several years, and my daughters each have their own Nexus tablets, while I also have an Android phone.  So I was excited to see what an Acer tablet running Android might offer.  My past experience with Acer has been that they provide reasonably-priced devices that perform well for the price, and this tablet is no exception.There are several factors I like about this tablet:1) Quality packaging makes a good impression and provides security.2) Android Jelly Bean system is intuitive and easy to use.3) Wireless setup was extremely easy.4) Screen size is quite large, makes for excellent web browsing, magazine reading, etc.5) Excellent battery life.The device isn't perfect, and has some limitations.  The front camera is only 2MP, which is lower than you typically find now in Android phones.  And most notably, the screen resolution of 1,024 x 768, which is fair but not outstanding.  However, limitations have to be expected on a device that has been designed with the focus on price and function while trying to keep the price down.If you're looking for the perfect table with price not being a concern, then the iPad or a Kindle Fire should be researched.  For the price, however, this Iconia is difficult to beat.  My girls still prefer their Nexus 7 tablets, but given what we paid for the respective devices, the Acer has a higher cost benefit.  An excellent table choice.", "Date": "April 21, 2014"}, {"Title": "Great for the Price!", "Author": "Adam Thomas", "ReviewID": "R2S843KOYKD5HT", "Overall": "5.0", "Content": "The Acer Iconia A1 is a great little tablet for the price. You can’t fairly compare this tablet with other tablets of the same size that cost twice as much, it simply wouldn't be fair. Don’t expect this tablet to be an iPad killer, even though it has a similar brushed aluminum back.This tablet is great for kids who tend to be rough on tablets and other electronic devices. I got this tablet for my children and it has worked with every game they installed. The sound is good and the display is clear and crisp.I highly recommend this tablet to anyone on a budget or if you are shopping for a new tablet for younger children.", "Date": "April 17, 2014"}, {"Title": "Very nice tablet, but did not work", "Author": "David", "ReviewID": "R1XIM0C8WPR98Z", "Overall": "3.0", "Content": "The materials used are very good and looks nice. The reason for 3 stars is because the wifi was not working properly (im guessing defect in product). I could only connect to the internet if was standing next to my router. This made my tablet useless. The return procedure from Amazon was hassle free and quick... I might get another since they are on sale right now. Hopefully the next one I get works perfectly.", "Date": "May 24, 2014"}, {"Title": "Good value", "Author": "booksandbliss", "ReviewID": "R3UV5VEAGU9I4M", "Overall": "4.0", "Content": "I think this is a good value for anyone who doesn't want to shell out more than $200 for a tablet. We've used only Apple products and my family all took turns using this, with the final verdict being a unanimous thumbs up. The tablet is responsive, fast, and intuitive enough. There were a few places where we had to go, \"Where's the.../How do you...\" but it didn't take long to figure it out. Having gotten so used to the iPad, it's basically like going to a foreign country (or maybe more like going out of state) and having to get used to a few things. It's an attractive tablet, lightweight, and a nice size. I'm petite and I hold it comfortably in one hand.The few \"cons\" we found were the sound - it didn't bother me but my husband says that the speaker sounds like a non-sophisticated or basic radio. I also think this is a tablet that is best held horizontally. The frame is very narrow on the left and right if you are holding it vertically, so especially if you have medium to large hands you'll end up with your thumb on part of the screen when holding the tablet (unless you hold it the way you hold your phone, with your palm underneath the tablet). But if you hold it horizontally it's fine, as the frame on those sides is wider. Finally, the quality of pictures taken on this tablet is just so-so to me (a bit grainy), but then again I'm also not crazy about this same feature on the iPad, and I usually use either my iPhone or DSLR for photo taking.All in all, this seems like a really good value for the money.", "Date": "April 24, 2014"}, {"Title": "Highly impressed!", "Author": "jade7 \"jade7\"", "ReviewID": "R2SEQ5ULU10UOE", "Overall": "5.0", "Content": "I have used a 2nd Gen iPad for the last three years,  while having ventured into playing with a few Android units in the past, I was not impressed enough to even think about switching over to that operating system, too much lag, glitches and unfamiliarity to overcome in the past.  Not so with this tablet!  Very impressive!  The clarity of the screen, front and back camera, and responsive touch has pushed me to take on the Android operating system.  The size, weight, and thin profile are perfect, small yet a solid quality feel in your hands, at this price, it's a steal!", "Date": "April 16, 2014"}, {"Title": "Decent tablet", "Author": "Paul E. Richardson \"Russian Life\"", "ReviewID": "R34742U507H8HT", "Overall": "3.0", "Content": "Once I got past the realization that this was not going to be an iPad mini, I grew to appreciate this nice little tablet.No, it does not have a retina screen, and it does not have the zip and zing and standard Mac OS gestures I am used to (frankly, the whole Android OS takes a bit of getting used to), but it is a nice, inexpensive tablet for things like reading emails, browsing the web and watching occasional videos.I was not overly impressed with the battery life. Yes, it can play videos and probably an entire movie before running down. But what bothered me most was that if left on standby (or sleep, whatever they call it) the battery ran down in about 3-4 days. This may be because some app I am not aware of is running in the background; I have not investigated that. But that did seem troublesome.Screen is nice and responsive, and the resolution is decent for things like videos, photo browsing, and web browsing, but not optimal for long-term reading. I will likely invest in a matte screen cover as the shiny screen, as on all tablets, makes viewing and reading challenging in anything other than a dark room.Sound quality is a bit underwhelming, because for some reason they put the speakers facing to the back of the device. So if you are watching a video and holding the tablet in your hand or have it lying down on a surface, the sound can be muffled by your hand or that surface.The camera is decent and front camera is useful for video conferencing.In all, as I said at the outset, if you are looking for a good, low-priced tablet this should have plenty of storage and muscle for standard uses. If you are looking for high resolution screen, top sound quality or that familiar iOS interface, you will be disappointed.", "Date": "May 3, 2014"}, {"Title": "NO HDMI PORT but otherwise nice for the price", "Author": "S. Ostrander \"budgetqueen\"", "ReviewID": "R1U5640UPV2JVU", "Overall": "4.0", "Content": "I have the Iconia A1-810 and while I like it I'm giving it to my Mom so I bought this as a replacement. (I also have an 10\" Asus TF but often find it bulky for running around.) For a budget tablet the resolution is really good and the speed also seems good. HOWEVER, the specs online list this as having an HDMI port but IT DOES NOT HAVE ONE. Still deciding if this is a deal breaker.One week in -- I am really loving the compact size of this tablet. I have found a work around for my HDMI application (turns out I can stream my Slingbox through my Roku player, who knew...) so that is no longer an issue for me. The only little glitch to report at this point is that the MicroSD card pops out of the slot easily.  Don't know if this is particular to my unit or a design issue. A small piece of invisible clear tape solves the problem easily but if you buy this keep an eye out.  Otherwise, still in love.", "Date": "April 24, 2014"}, {"Title": "Must Have", "Author": "Tyquan Woods", "ReviewID": "R2JHIHGOLLG315", "Overall": "5.0", "Content": "I love this tablet ... Its definitely worth buying the price makes it better, hands down get this tablet or be a fool", "Date": "June 8, 2014"}, {"Title": "Great tablet for the price. I love tablets only break out the lap top when I absolutely have to use it.", "Author": "The night shift", "ReviewID": "R3I3FRYYL3LTFJ", "Overall": "5.0", "Content": "I ordered this tablet on a gold box deal. I was going to ordered the dell venue 8 tablet.  This tablet is great for 99$. The battery life is a lot better than my Dell venue 7 tablet.  The charge is about the same as my Nook HD. The picture and colors or crisp. Professional reviews complain about lower pixel rate but I can not tell the difference between this and my dell tablet. I do think my nook HD has a better display. I like all the preloaded apps on this tablet. The sound is good and I like the radio app. The only thing I do not like about this tablet is the way my words with friends is displayed on screen. I have tried to change this but can not. I have been playing with this tablet  for past four days since it arrived. It some times takes longer to load than the other two tablets but this is not a deal breaker. This tablet is well made and I like the aluminum case.♥ I wish I had ordered a few more for Christmas presents!! I am always looking for a great deal.", "Date": "June 8, 2014"}, {"Title": "exceptional value for an 8-inch 4x3 tablet", "Author": "Amazon Customer", "ReviewID": "R1UYRI420X8RNU", "Overall": "4.0", "Content": "8-inch tablets with 4x3 form factor are rare. The Acer A1-830 is lighter and smaller than the A1-810, with better screen color, but without micro hdmi port.Pro: inexpensive 8-inch tablet with sufficiently good screen and performance. Micro SD card slot, micro usb port. Plenty of third party, well-designed yet inexpensive cases. Adequate stereo sound.Con: no micro hdmi port, screen resolution is not high (but adequate for browsing.)", "Date": "June 7, 2014"}, {"Title": "tablet", "Author": "Ramon Inguin", "ReviewID": "R143H9LX8G5ZVB", "Overall": "5.0", "Content": "its good, i have my laptop and it gives me no problem for many years and still ok that's why i buy acer unit again.", "Date": "May 27, 2014"}, {"Title": "So far, so good", "Author": "Floris M. Chowenhill", "ReviewID": "R26WG18ODNNNWQ", "Overall": "4.0", "Content": "I received this product very on time, nice wrapped, it looks excellent.  I just set it up, but it is going to South America for a new user as a gift.  Will keep another post in a couple of months to see how it is doing.  Highly recommend this vendor.", "Date": "May 26, 2014"}, {"Title": "Not bad, but far from the best in class", "Author": "The Bee Bee \"BB\"", "ReviewID": "R3HZAYW8MOR5CO", "Overall": "4.0", "Content": "Acer doesn't pretend to be Apple. They are not innovators in any significant way, but they do a great job of putting a lot of features in their products and keeping the price low. I have used Acer laptops over the years and have found them to be reliable if not a little uninspired. The same holds true for the new Acer Iconia A1-830-1633 7.9-Inch tablet. It's a decent device, but the low resolution and limited feature set make it a budget-first choice for people who want to enter the world of tablet computing and are more concerned about price than performance. If you have used an iPad or the amazing new Galaxy Tab Pro from Samsung, the Acer Iconia A1-830-1633 will seem pretty crude by comparison. However, if you're just looking for an entry level tablet to surf the web, watch videos, and read books and magazines, then the Acer is a very competitively priced alternative to those top-shelf tablets.", "Date": "May 15, 2014"}, {"Title": "Need more option", "Author": "Carlos", "ReviewID": "RN9HFXNOATLB4", "Overall": "3.0", "Content": "The tablet is good, but the software need more option, for example, the camera. I want mute the option of the sound when i take a picture. But i cant see this option.The other problem is the tablet is a bit hot. I downloaded a app for check the temp and say 39-40 celcius normal in activities, and if i have my tablet charging, the temp is 42 celcius.", "Date": "April 24, 2014"}, {"Title": "So so Tablet", "Author": "Sheryl Katz", "ReviewID": "R1NPVO20AJ2CEE", "Overall": "3.0", "Content": "This is a middle of the pack product.  Not great.  Not Terrible.  The interface works ok and the processor is reasonable that it doesn't lag too much.  The problem is that the screen is OK but not up to the level of what I've come to expect.  The Kindle DX is a significantly better user experience, much better screen, much more responsive.  It is more expensive.  The size of this Acer is like the original iPad mini.  There is too much bezel for a design of the current generation.Overall I find this tablet a little dated for what is supposed to be a current model.", "Date": "April 13, 2014"}, {"Title": "Mac user that is no longer hopeful for Windows", "Author": "JF \"Fontenot\"", "ReviewID": "R1VPV7LR2S8ZRP", "Overall": "2.0", "Content": "Mac user that was hopeful this would demonstrate the future in computing.Not only is the touch screen sensitivity erratic, but coupled with wim8 disaster, it can only be considered a frustrating rock.The crapware - malware (specifically conduit and its aliases} is rampant.I mention malware because it caused me to want to do a clean reinstall and it is near impossible with the BOOt system setup.More trouble than value.", "Date": "May 21, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00I054WFQ"}}