{"Reviews": [{"Title": "Great Portable Doodle Machine!", "Author": "Reyna", "ReviewID": "R27AD52KZPBLW6", "Overall": "5.0", "Content": "I've had mine for only a few days but I'm absolutely in love. I bought this as a portable art machine for lite projects, as it's specs wont allow it to handle anything too large, and it's been so great to use. The drivers needed to work with the included Wacom pen were a touch difficult to track down, but once located and installed, the pen pressure works like a dream. It's quickly becoming a pivotal tool in my daily work schedule. It's also light enough to tote in my purse so I can take it everywhere. It's a great product and was worth getting.", "Date": "March 27, 2014"}, {"Title": "Awesome", "Author": "Ryan", "ReviewID": "R366FWEIY2HER7", "Overall": "5.0", "Content": "This was a no brainer, first because of the price $299 w/ full windows 8!  And for the size.Pros: Great display, sleek design, love the sylus and ability to doodle, etc. Very light, good memory and HD size, very speedy, touch screen is very accurate, solidly built. I could go on...Con: Agree w/ other reviews that it takes a sec for the pad to load a program or feature, but once it's up, lightening fast.  This is not an issue or me at all.  Plenty of other pros that far outweight this little nit-picky thing.I purchased the optional keyboard dock at a local MicroCenter (in store only).  Check their website.  Was alittle pricy at $199 but worth it.This is a VERY well built machine.  My wife has an iPad 2 and this is every bit as good a quality as an apple product, w/ the productivity of windows 8.I'm a very nipicky consumer and i researched tablets for several weeks.  I'm rarely 5 stars on anything, enough said.As a side note: The poor reviews given for this machine simply because the customer can't find the docking station anywhere should be removed.  The reviews should focus on the product purchased...you're decieving the public by giving it a 1 star rating because the availability of a peripheral.  Would you give a refigerator a bad review if you dont have any electricity in your house?", "Date": "June 11, 2014"}, {"Title": "Love it, but the keyboard dock is not produced anymore.", "Author": "Ben H.", "ReviewID": "R18T0CQDI3WT3V", "Overall": "4.0", "Content": "I love it.-cool, quiet-long battery-almost like a small laptop-stylus works very well-HD movies are okaySmall office uses are good.Heavier programs take longer to load, but once loaded, works okay.I love it, and I want to buy the keyboard dock.ASUS stopped producing the keyboard dock.I can't find it anywhere. That's kinda frustrating.", "Date": "May 23, 2014"}, {"Title": "Too good to be true", "Author": "jr", "ReviewID": "R31KOP5M26XJQ5", "Overall": "1.0", "Content": "The low price offered on Amazon for this item is deceiving.  The keyboard docking station for this tablet is not available anywhere.  Seems like Asus is making a product change or something.  I am sending it back.", "Date": "May 24, 2014"}, {"Title": "Excellent Tablet.", "Author": "Dr.", "ReviewID": "RA060E4YYB14M", "Overall": "5.0", "Content": "In my opinion and having purchased the first one more than a year ago, this is the best tablet of its size in the market. Very long battery life, responsive touch screen, and digital pen which works very well. I purchased this second one due to paying $400.00 less than the first one.", "Date": "May 25, 2014"}, {"Title": "very deceiving", "Author": "A. Hutto", "ReviewID": "R1DKHEPBIEDUBX", "Overall": "1.0", "Content": "this is a great price for a potentially great tablet except for the fact the keyboard docking station does not exist anywhere and Asus customer service doesn't give rats behind. Also mine crashed when trying to update and there is no way to reboot so I had to sit there and let the very long battery life die out....which is a shame because I wanted this because of the long battery life to take notes in school.I sent it back.this product should be delisted or clearanced out at 50 dollars or less.", "Date": "June 2, 2014"}, {"Title": "Don't trust in the seller", "Author": "Zaid Al Mandalawi", "ReviewID": "R2ONGUEP8I7J0", "Overall": "3.0", "Content": "The tablet is not new. I believe somebody bought this tablet and broke the screen and then return it to seller. Because Asus package opened. And also there is inclination in front lens.", "Date": "March 4, 2014"}, {"Title": "Stay clear of warehouse deals", "Author": "boatmiser", "ReviewID": "RFNGD57H6XP2K", "Overall": "1.0", "Content": "I bought this from amazon warehouse deals and they advertised it as very good condition with damage to the package. The package had no damage but the notebook looks like it has been used by kids! The screen has scratches the back is gouged. The software on the notebook is not what is advertised. The notebook is very unstable and jumps around without being touched. Stay clear of warehouse deals with electronics! And amazon was no help at all. They said because it was bought at warehouse deals there was nothing they could do.For $40.00 more I should of bought NEW!", "Date": "May 8, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00ID10FOY"}}