{"Reviews": [{"Title": "Liking it more as I get used to it", "Author": "Squatch Fan", "ReviewID": "R1UFGB04LWSJFV", "Overall": "4.0", "Content": "Update 5/7/14Really like this tablet! After having it over a month now, I have all the same good things to say as below and one to add. I upgraded my cable/internet modem to docsis 3 from docsis 2 and now the issues with playing videos and slower speeds has resolved. Have downloaded more apps and they are very functional. I use this tablet daily for work, email, games, videos, etc. Much easier to carry around than a laptop and much more user friendly touch screen keyboard than the iPad mini.Update 4/7/14Updating to 4 stars instead of 3.Was able to download RT 8.1 finally and outlook was included. Took a while to figure out how to use it and get email addresses to work.It really is quite a functional tablet. I just wish it would have come with more easy to find directions. I have had to google a lot for directions and  so I am leaving 1 star off. But for the functionality after I figured it out, I would give 5 stars.Other than the available apps in the app store, I like it much better than the I-pad mini. The on screen keyboard is great. I did buy an external one but only because I work on word docs a lot. The touch screen is awesome!4/1/14-It was shipped quickly and securely.Quick user guide got me started.Pairs easily with keyboard.Has USB port that I have used for flashdrives and charging keyboard without issues.It was supposed to come with Microsoft Office Home and Student 2013 but it came with Microsoft Office Homeand Student 2013 Preview Edition.It didn't come with a user manual so luckily I was able to get answers by googling- to go to control panel,security, check for updates, and click on the Microsoft Office Home and Student 2013 Preview update to get the Full version.Sadly though there were 57 other updates at that point and the updates didn't all load. It stated my internetconnection was slow. I have not had this issue with the ipad or laptop so this is new to me that at peak hours,there is no downloading possible and at normal hours, it can take several hours to download updates whenthere are several to download. There are new updates constantly which involves waiting to use the tabletlong periods of time while tablet is installing, restarting, configuring. So I've learned to do this when I canwork on other things.The app store has an upgrade to RT8.1. I tried it, but after it attempted downloading for  several hours,even into the next morning when I had to go to work, I came home to find it was unscuccessful-no surprise there. So I haven't tried it again yet. I'm not sure if it would be better to do it since I now have the Microsoft 2013 Full Edition up and running and have used it successfully. I'm afraid to mess anything up.I can read books on it. That feature is nice and I just touch the screen instead of swiping for the next page.Videos stop and start which is too annoying to watch.Speakers are too low to listen to music.I bought it for the touch screen, the Microsoft Ofifice Home and Student 2013 Full Edition, the USB port, and forreading Kindle books. All are up and running now. If I want to watch videos or listen to music, I will have to useother devices to do so. And if I have other issues, I will have to google since no clear instructions came with this.For the price and for the functionality of it, I am basically satisfied with it so far.Will update if I find other perks or problems.", "Date": "April 1, 2014"}, {"Title": "Luther24", "Author": "Luther24", "ReviewID": "R8RTI18RVSJFK", "Overall": "5.0", "Content": "Purchased this for my daughter, she loves it.  It works for her because she doesn't have to carry her heavy laptop.It does everything her laptop does.", "Date": "April 11, 2014"}, {"Title": "very good product", "Author": "Gary E. Whitehall Jr.", "ReviewID": "R2BHK3A9S8EBG4", "Overall": "4.0", "Content": "Only one minor problem, it doesn't let install a lot of other programs I like to use. I like the Firefox browser and Quicken 2000 - they are not installable. In fact, the only things I have been able to Netflix.", "Date": "March 15, 2014"}, {"Title": "Love it.", "Author": "G. Harris", "ReviewID": "R2D5RTEO5ID10Y", "Overall": "5.0", "Content": "Purchased the Surface RT over the Pro or Pro 2 with the Moko Bluetooth Keyboard Cover case which is much nicer than Surface keyboard. Since this is the first model, you will have to contact Surface Tech Support to reinstall new updates and upgrades. Once you do that, you will be able to use download all of your favorite apps. Plus, you can save space on the drive by using your ONE CLOUD to store your pictures and documents. For this reason, the 32GB may be sufficient enough disk space. Highly recommend.", "Date": "June 9, 2014"}, {"Title": "Loving the Surface in St.  Thomas VI", "Author": "Jacquelyn J. Barnes", "ReviewID": "R2QFBM49VCLCTD", "Overall": "4.0", "Content": "Bought it for my son ( a junior in HS) to work on his numerous school projects and PowerPoint presentations and he loves it. It is user friendly and has the portability he needs with limited backpack space.  I luv that it came with the Microsoft programs loaded and he can still have fun with it.", "Date": "May 26, 2014"}, {"Title": "Worth the price!", "Author": "Avinash Mahadeo", "ReviewID": "R2K500E056G6IA", "Overall": "5.0", "Content": "Very nice device, Works exceptional. Wish I had bought the 64 GB though because of the space constraints of the 32 GB but it will do the job for the while : )", "Date": "May 14, 2014"}, {"Title": "Neat tablet", "Author": "oldoc", "ReviewID": "R1KQX6Q95HYJMN", "Overall": "4.0", "Content": "I am still learning. Windows 8 is enough different to require study, but has a lot of appeal. The device is light and quick, and seems to have long battery life. The charging connector is strange. Everybody should use compatible connectors.", "Date": "May 2, 2014"}, {"Title": "not happy", "Author": "lorna", "ReviewID": "R2EQWFSTOTPMDH", "Overall": "1.0", "Content": "I am so ready to sell it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I got it to do my school work and can not. Can't load ADOBE the one thing I really need. Can't play my games that I like to play on Facebook JUST NOT HAPPY AT ALL.....Grrrrrrrrrrrrrrrrrrrrrrrrrr", "Date": "April 21, 2014"}, {"Title": "Seem very usefull and handy", "Author": "Steven Crawford", "ReviewID": "R3F1G9HBKHJVTF", "Overall": "4.0", "Content": "This is a very can do tablet when you become more accustom to the using  Windows RT8.  I do like the size , battery life is very good.", "Date": "April 4, 2014"}, {"Title": "Bad switch of order", "Author": "Jerry", "ReviewID": "R1UR3C7416WMD6", "Overall": "1.0", "Content": "It was the worse order i had ordered i had ordered the one with the key board on it seeing it costed more for it and after words they had switch my order to one without a keyboard and still had to pay the same peice", "Date": "April 22, 2014"}], "ProductInfo": {"Price": "$295.00", "Features": null, "Name": "New Original Microsoft Surface 32GB Tablet - Windows RT 8, 10.6\" HD LCD Touchscreen, Front and Rear Camera Office 2013 RT Included", "ImgURL": "http://ecx.images-amazon.com/images/I/51Kq3iYuKoL._SX300_.jpg", "ProductID": "B00IGLBER8"}}