{"Reviews": [{"Author": "Jessica", "ReviewID": "R1NSR1NSTE65MJ", "Overall": "2.0", "Content": "The tablet itself is not that bad for a beginner. The battery only last around 45 minutes without using wifi.  If you use wifi it only last about 20 mins. The screen is very touchy, and a little cheaply made. But it arrived on time, and it downloads fairly quick. Easy to use. But not a lot of memory, downloaded  around five short games and the memory is full.", "Title": "Horrible Battery Life", "Date": "June 7, 2014"}, {"Author": "Candice", "ReviewID": "R1VSFVAKD6O1GM", "Overall": "1.0", "Content": "I ordered this tablet on the 6th & got it the 8th. Let it fully charge & tried to use it, the battery kept getting hot & the battery life sucks, barely an hour at the most. If it continues to do this, I'm going to send it back & request a FULL REFUND. You get what you pay for I guess.", "Title": "Eh.", "Date": "May 9, 2014"}, {"Author": "Honesty", "ReviewID": "R1RYP52YBWEB5T", "Overall": "1.0", "Content": "Bought this for Christmas for my son who needed an e-reader with some basic gaming.  We discovered it holds a charge for only 30 minutes as a reader, less if you are surfing.  The camera is grainy at best and does not work in normal room light, only when it's very bright.  Although there are lots of apps available and the unit moved along fairly fast if you didn't close every open window or app running in the background it would freeze, necessitating a hard reset.  With 1 GB ram, if that is really what it has, I'm not sure what was going on with the freezing.  We also found that it can get very hot, which is probably why it no longer powers on.  I'm hoping the seller quickly refunds my money so I can buy a better entry level tablet that Fires in HD reliably.  Cheapness once again proved to be costly.", "Title": "Sometimes you get less than you pay for", "Date": "January 17, 2014"}, {"Author": "Chris Smith", "ReviewID": "RK1OB0180W1Y0", "Overall": "3.0", "Content": "This is an alright tablet. Its a little slow. The battery only last for two hours and it difficult trying to pick other wifi signals.  But for what I paid its alright. I wanted to give it 4 stars but the battery life is just not what I expected. A good start up tablet.", "Title": "Only 3 Stars....", "Date": "January 28, 2014"}, {"Author": "amy", "ReviewID": "RF8BY44ULCXQJ", "Overall": "2.0", "Content": "I'm amending my product review. The first day I used my tablet I had issues, so I thought I'd give it a try for a few days. Having huge issues with this tablet: it doesn't hold a charge for more than an hour or so, the screen freezes ALL of the time and I have to tap it several times to get anything to work. I have excellent signal strength in my home but can't stay on line for long without getting booted off line. I want to return this tablet.", "Title": "l am very disappointed", "Date": "January 8, 2014"}, {"Author": "Edmundo Ellis", "ReviewID": "R1OBVXZSJBLH4O", "Overall": "3.0", "Content": "Well I'm just this a pointed, because I tatt I was purchasing a bran new tablet and this particuler item look's like if it was reaferbish, the cream have scratches on it. and the cream protector look's like if was taking out a trash can.", "Title": "I will thing it be four baying some thing cheap..", "Date": "March 10, 2014"}, {"Author": "Mina C", "ReviewID": "R1X0NWBXIABSAM", "Overall": "3.0", "Content": "I suppose I should've looked closer at the camera specs even though it's not a big deal to me, but I did expect better than 0.3mp. The pictures, it turns out, are like normal photos that have been run through some weird filter to make them artistically blurry or something.Had some issues with it flickering red all over when I first got it, but that seems to have stopped after a bit of use.The casing is a little separated at one point, but nothing major/that affects its function. The screen seems to scratch pretty easily, but it does come with a screen protector I failed to put on at first.A few problems with lag here and there, but it actually runs faster than I'd expected.So if you just need to do simple stuff like browse the web, simple school/work stuff, or play games, it's good enough for the money.", "Title": "Works well overall so far, camera is terrible", "Date": "March 26, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00IWNOD9G", "Features": null, "ImgURL": null, "Name": null}}