{"Reviews": [{"Title": "Great Tablet", "Author": "Jeff Richards", "ReviewID": "REX4ML3J1I1OO", "Overall": "5.0", "Content": "I love this tablet. At such a low price, I was skeptical at first. I decided to give it a shot and I am glad I did. This is a great tablet at a low price. I have already put about 5 different games on it and they work perfectly. It downloads the games fast. I get around 4 hours or more on the battery. My son has one of the Samsung Tablets and he argued with me that this one will not work as well as his with the same games he has on his. I definitely proved him wrong. It works just as good as his $250 Samsung Tablet. It is even bigger than his and the display is excellent. At first, I thought it was going to be bulky being a 9\" tablet, but it actually isn't. It's just as thin and lightweight as the Samsung 7\" tablet. This one even included a screen protector, but I ruined it trying to put it on with my shaky hands and while my granddaughter was still up. If you are looking for an affordable tablet that works great, I would definitely recommend this 9\" TouchTab to anyone. As I mentioned earlier, I compared it to the newer Samsung Tablet and it performs just as well. Both my son and my daughter are completely impressed by the performance. Another plus is that it comes with a wall charger and USB cords. I am definitely going to order one for my daughter. You can't go wrong with this tablet. At this point in time, I am 100% satisfied with this tablet. If I do happen to run into any problems with it, I will definitely update this review. I don't foresee any problems though. One more plus is that it has a 1 year warranty. Most of the other ones only have a 30 day warranty. Since I have my 1 year old granddaughter living with us, I even added the 1 year accidental insurance for $15 more. It is well worth it.I just want to update my review:Not only is the Tablet an excellent deal, the customer support is one of the best I ever dealt with. I had a couple of questions and each time I contacted the seller, he answered and resolved any issues I had within a couple of hours. I have been running it day and night and it runs great. I will be putting this seller on my top 5 Amazon seller list. If you want a great tablet and great customer support together, I recommend this seller to anyone.", "Date": "December 19, 2013"}, {"Title": "Expected much more", "Author": "Dustin", "ReviewID": "R10CQF17K9V0ZZ", "Overall": "1.0", "Content": "it doesnt come with the full amount of memory that is advertised...i tried to play some games with it, like the free sonic 3d game, performance was \"OK\" nothing special, and it hiccupped often. My battery lasted like 2 hours, charging took about 2 hours... cant charge through the mini/micro usb port... and wifi reception and RETENTION is poor... it was tough to multitask with internet... it would often disconnect and id have to reconnect... the cameras are pretty bad quality... nothing special at all... i added a 32gb microsd card... pretty much useless since all the apps want to be on the root system... 512mb of RAM isnt enough in my opinion... i often had to stop apps when i was running only around 5 at a time... After 3 days of use, i left my tablet on the charger and something went wrong... white screen no matter what i did... probably 1 in 100... but i just thought id throw it out there... and yes i'm biased against this tablet because i expected much more out of it, then it broke...BASICALLY:if camera doesnt matter: yesif battery doesnt matter(maybe mine was just a bad battery): yesif you want microhdmi: yeslow res screen, but functional: yesnot for gaming or intense apps: yesif you just want for note taking: yesthis tablet wont do anything super special", "Date": "January 15, 2014"}, {"Title": "Worked good for us", "Author": "tomi c.", "ReviewID": "RYW08H41AWF4Q", "Overall": "4.0", "Content": "We got this tablet mainly so my wife could Skype with her sister back east.  The neighborhood computer guru helped set it up, and off we went.  Everything worked as promised.  Our issue with this particular model, (I can do computers but tablets are not my cup of tea) was the limited distance away from the router when video was lost.  Inside the house was only about 15 feet around the corner and down the hallway.  We took it outside the house near the room where the router is and could only do maybe 25 feet or so.  The router is supposedly the best that our carrier has and that is Verizon so I can't go changing that around.Bad part is that we sent it back.  Good part is that Adnteck representative Jeff, was very receptive to the problem.  Even though the tablets are not made to just do Skype that is all we wanted it for.  Everything else worked great.  They took back the tablet.  Jeff checked out and even compared it with some other models.  He kept us constantly informed  on the testing status and at not time at all did I feel we were being misled,We will explore other Skype options.  Meanwhile this was by far the best customer experience that I have had when returning a product without being able to find an actual fault with it.  Depending on what you are buying it for, I highly recommend it for the price but even more so for the Adnteck company behind the product.", "Date": "January 16, 2014"}, {"Title": "TOUGH TAB 9", "Author": "Barbara L. Gayle \"Sockos\"", "ReviewID": "R380L4MAQIW52F", "Overall": "4.0", "Content": "After receiving the TouchTab 9 I fully charged it and found that after doing so it would not hold a charge.  I could use it as soon as it was charged, but once I shut it down and then tried to turn it back on a few hours later the charge was completely depleted.  Returned it to the seller who was very nice in refunding my money.  If the tablet had worked properly I would definitely have kept it.", "Date": "January 9, 2014"}, {"Title": "Great value for the price", "Author": "William C Raynor", "ReviewID": "R38IDDA3CDXTJT", "Overall": "4.0", "Content": "So far I'm very happy with the product - especially the camera and the internet hook-up, both of which have worked very well...", "Date": "January 25, 2014"}, {"Title": "10 year old daughter loves it!", "Author": "ana rosie", "ReviewID": "R1GHU039TDKKOW", "Overall": "4.0", "Content": "My ten year old daughter had been saving her allowance and birthday money for a while. One day she asked me how much it would cost to buy a tablet, so we looked it up on amazon to see. We found this one with a very reasonable price and good reviews. We decided to take a chance. She purchased the tablet with her own money and seems to be very happy with it. She has downloaded games, some music, and also uses it for some of her school work. The only reason I don't give it five stars is because I haven't used it myself. All in all, a good buy.", "Date": "April 11, 2014"}, {"Title": "Please turn on", "Author": "Scarlet J. Arroyo", "ReviewID": "R3GSM41TCDLWPC", "Overall": "4.0", "Content": "The problem I found was the delay in turning on, but the screen is very responsive once it turned on.  The image is sharp, it is light weight. The best was the customer service, they were courteous and prompt in addressing the problem and finding a solution.", "Date": "February 9, 2014"}, {"Title": "Limited device no solution", "Author": "M. Schlecht", "ReviewID": "RMXJZPOIB5T9F", "Overall": "3.0", "Content": "This is a very limited version of android.  As soon as I received the device I put apps on it but I can not default or move those apps to the storage card like you can on any android phone.  The newer version of jelly bean is worthless if the builder hid most features.  There is no auto brightness, SD card is the thing that gets me the most angry.  I also email support asking why if the device sees the SD and I can browse it that the app management doesn't have method to move off local storage.  If they ever release a build that fixes this my rating would change.I originally gave this this 1 star because they didn't respond to my inquiry.  I now give it 3 stars because the tech support spent a lot of time researching for me and even called my phone to help me.  They have very good tech support.  However, I still can not give it 5 stars because they didn't change the result of the jelly bean.  4.1.1 apparently the tech guy says the chipset or build doesn't allow sdcards to act same way as I wish it too.  I don't know if that is correct but that's besides the point.  The device creates /sdcard and /sdcard1.  The 32 gig storage drive is on /sdcard1 so hench half the apps try to store on /sdcard which is internal storage which is limited to a few gigs.  So you can manually copy all the files over to true sdcard location but many applications can not offload 3/4 of their application size to the true sdcard. Also many music apps don't look in some mount drive that is /sdcard1.  When or if they ever change this I would change my rating.", "Date": "December 29, 2013"}, {"Title": "For $60, ehh, but I'll make due.", "Author": "Taylor Berrier", "ReviewID": "R194JIFH6RZS4E", "Overall": "4.0", "Content": "NO BLUETOOTH. Saw a review that said you can't charge through the Micro USB port. That's false. In fact, it's way faster than charging through the DC port. Wi-fi is weak, but works fine in hotels and close to routers. There are some games that just plain suck and don't run well on this tablet. I won't comment on the camera, no one should expect any thing good from a generic Android device. I bought this for Google Play Store access, since I am already running Windows 8 on my laptop and carry an iPhone 4s (Microsoft and Apple app markets). Surfing the web, email and some games. Clash of Clans, Bloons TD 5, VGBA I can say all run great. Other faster and larger games not so much. Chromecast was good, even with Netflix. No Amazon app in Google Play store, but no big loss here as the browser works fine. Kindle app, check.SPEAKER IS TERRIBLE. Game Boy Advance games sound better on an actually Game Boy Advance. Starts out slow, but with some fiddling around in the settings, might start taking to class with a silicon roll-up keyboard to take notes with on my Google Drive. Got a case for it at Wal-Mart. All-in-all, way better than my previous $80 Coby.***UPDATE*** This device is not compatible with Candy Crush Saga. I reiterate. You can NOT play Candy Crush on this device.", "Date": "June 3, 2014"}, {"Title": "For $50 you get a fine product.", "Author": "Ryan Thomas", "ReviewID": "R2PPTGD5C83AYA", "Overall": "4.0", "Content": "Look.... for less then a hundred dollars you get a very good tablet. It runs just fine without very many issues. The settings won't let me change the time ...thats wrong. But it doesnt matter. If you're a person who lives off your tablet then this is not for you.... Obviously....  Good for the cost.", "Date": "June 1, 2014"}, {"Title": "Excellent.", "Author": "AK from Trinidad", "ReviewID": "R37Y3PXHF3VZ0A", "Overall": "5.0", "Content": "I've had this for about a month now and compared to high price big brand, if it's not the same it's probably better. Crisp clear screen, boots up fast, runs fast and very smooth, no regrets, very good.", "Date": "May 28, 2014"}, {"Title": "Great deal", "Author": "airchamp \"ariel\"", "ReviewID": "R1S49HOF1JCG5F", "Overall": "5.0", "Content": "I couldn't believe I found a 10\" tablet the latest Android OS.for such a low price.Honestly, I still have not noticed the difference between the 4.2 and the Kit Kat OS, but tis tablet works really welland can basically do anything an ipad can d for much much less money.At $150 you can't beat this deal.", "Date": "May 27, 2014"}, {"Title": "happy with tablet and price!", "Author": "doug Landry", "ReviewID": "R1V7X6EE9FH882", "Overall": "4.0", "Content": "I just recieved my andteck 10\"\" quad core tablet .very happy but I need to buy a andteck protective cover or after market cover? So if anyone can help me I would really appreciate it cheers. Doug☺", "Date": "May 4, 2014"}, {"Title": "Not even close to advertised.", "Author": "Alexander Wallgren", "ReviewID": "RHOWTHXX4X17M", "Overall": "1.0", "Content": "Not that I had a whole lot of expectations for what I paid. However, the battery dies within an hour of using it. Don't be fooled by the presentation of the tablet. Generally I needed it to recieve and send emails and not a whoile lot more. Yet another vendor who sells junk on Amazon.", "Date": "April 7, 2014"}, {"Title": "NO SO MUCH", "Author": "Stacey", "ReviewID": "RXOIEFD37ULKC", "Overall": "1.0", "Content": "Okay, listen, I bought these after I bought my kids their tablets (At Walmart - 59$) for Christmas.  I spent $88.00 on these and the picture quality just isn't there.  You seem to have to struggle to see what is on the screen.  Just not a fan for everything this thing say it has, it really doesn't seem like it.", "Date": "January 11, 2014"}, {"Title": "Great", "Author": "Kathy Tatum", "ReviewID": "R2WXRRF4S1GF36", "Overall": "5.0", "Content": "for the price and having bluetooth-can send things straight to print or share photos without going to the computer and attaching cords.", "Date": "January 7, 2014"}, {"Title": "Really good deal", "Author": "XRAXPRT", "ReviewID": "R1HRS9Y7QIQIRO", "Overall": "5.0", "Content": "Loads fast and the screen quality is excellent. Battery life is better than expected. I took notes at a meeting for over 2 hours and still had 68% battery life.", "Date": "January 27, 2014"}, {"Title": "GREAT PRODUCT, FOR THE PRICE.", "Author": "edward fichter", "ReviewID": "R3G1RCBPCM9USD", "Overall": "5.0", "Content": "I JUST GOT MY TABLET AND KEY BOARD, AND WAS  AMAZED AT HOW EVERY THING WAS PACKEDI WAS IMPRESSED WITHE PRODUCTS, EVERYTHING WORKS JUST FINE, THE ONLY THING I FINDWRONG IS THE INSTRUCTIONS BOOK TO DARK TO READ, OTHER THAN THAT MINOR PROBLEMEVERY THING IS JUST FINE....  ED FROM PA.", "Date": "April 8, 2014"}, {"Title": "nice and hot", "Author": "preston", "ReviewID": "R2FPGSE0X9P9ZY", "Overall": "3.0", "Content": "Nice image..hard to turn on..and this thing gets hotter than hell after 10 mins of use..so hot my daughter can't touch it..why is that...not to mention I bought 3.", "Date": "March 24, 2014"}, {"Title": "Great for loading apps and easy", "Author": "Jennifer Adams Young", "ReviewID": "RGI74MIXA9A57", "Overall": "5.0", "Content": "I got this for my tech loving 5 year old to game with.  He is a calm child so I don't worry he will break it.  It works great for him.  He can run it all by himself, install his owns apps, and plugs it in to charge.  It works great for him.  It is affordable without giving up on quality.", "Date": "March 10, 2014"}, {"Title": "help me plz", "Author": "teeradech", "ReviewID": "R2L6OCBBLMFH1F", "Overall": "1.0", "Content": "mini HDMI prot its not work .How can i do? if u guys have saler mumber plz send it to me \"teeradech_new@hotmail.com\" thnk u so much", "Date": "April 23, 2014"}, {"Title": "Good but", "Author": "R. Ken", "ReviewID": "R1IS9MMSBSPH1P", "Overall": "3.0", "Content": "The wireless range of the unit is limited.  The customer service has been a positive experience.  My primary reason for choosing the unit over several others was the warranty.  With that in mind, the fact that the company has responded to my request gives them a bump in the rating.", "Date": "April 8, 2014"}, {"Title": "buy a kindle fire instead!", "Author": "Kindle Customer", "ReviewID": "R2G2XBA1PTWEBP", "Overall": "1.0", "Content": "The customer service rep was really nice but the charger broke after less then a week and the one that was sent to me was already bent so it's just a matter of time before it breaks also. I've had it less then a month and the screen is already cracked. Honestly I would spend the extra money and stick with kindles they are reliable and I've never had a problem with any of mine!", "Date": "April 3, 2014"}, {"Title": "TouchTab 9", "Author": "Pen Name", "ReviewID": "R2SW6KP09OVIY2", "Overall": "5.0", "Content": "Best tab for th price and customer service is great one of th best out thr... i wanted a tablet with hdmi to see movies on tv and is great hight def but th tablet screen is lik a 3 star", "Date": "March 23, 2014"}, {"Title": "7 inch Tablet", "Author": "Blenthia King", "ReviewID": "R2GN3HT22F9OK0", "Overall": "4.0", "Content": "I would have given a 5 stars but the power cord in the box does not appear to be the right cord because it does not fit properly.  I have not contact the seller yet.  I have not really has time to work with tablet, so i am not rating the tablet yet..", "Date": "March 16, 2014"}, {"Title": "TOUCHTAB 7", "Author": "Joyce pepper", "ReviewID": "RWFJ498250SMZ", "Overall": "4.0", "Content": "Volume to low otherwise no other problem. I will call them  Grateful for the flash app  now able to view more favorite christian programs", "Date": "March 16, 2014"}, {"Title": "Great item  don't pass it up I might buy another one for myself because my daughter won't let me touch it.", "Author": "super dad", "ReviewID": "R3DZMTCQ0VVD4E", "Overall": "5.0", "Content": "It's a great product and good quality i Would Recommend It To Anyone It's great for a child and my  daughter love's it.", "Date": "March 6, 2014"}, {"Title": "Worth the price", "Author": "Marsha Gibbs", "ReviewID": "R2V1F29875JWID", "Overall": "4.0", "Content": "This tablet is good for the price. It's a bit slow but that could be due to my wifi connection. The screen size is great. The touch screen is very sensitive, so I found myself being back on the main menu a lot. If you just want something to play games, read, etc.... then this is a great buy.", "Date": "March 6, 2014"}, {"Title": "Touch Tab 7\" x2 Dual Core Google Android Andteck", "Author": "Ivan Johnson", "ReviewID": "RN43H9134RHMR", "Overall": "4.0", "Content": "This unit arrived promptly with no problems. My first Android tablet. So far so good. It should more than meets my needs and expectations.", "Date": "February 28, 2014"}, {"Title": "its \"alright\"", "Author": "Dustin", "ReviewID": "R22FTZ0HSGVOV3", "Overall": "2.0", "Content": "alot of games have crashing issues. i had to return it twice because i had a defective tablet. otherwise it's a decent little tablet", "Date": "January 14, 2014"}, {"Title": "Nice for the money", "Author": "Tem", "ReviewID": "R2HZC4AAKE686J", "Overall": "5.0", "Content": "Got these for my kids ages 5-7-10. Now I have my phone back all to myself! Kids love them. One of the chargers broke, kinda cheap, easy to replace.", "Date": "January 14, 2014"}, {"Title": "grandkids", "Author": "david stevenson", "ReviewID": "R2KHNVGU8YR5D9", "Overall": "4.0", "Content": "it works fine, the grands love it. even though they were expecting them they r very happy ,so I am too", "Date": "January 7, 2014"}, {"Title": "TouchTab 7\" X2 Dual Core Google Android 4.1 Tablet PC, Quad Core GPU, HDMI,...", "Author": "Christopher L. Runkles", "ReviewID": "RZU8PH9VU1T6T", "Overall": "4.0", "Content": "nice and clean items. the only thing I could say is that on the description said it had 4gb on board memory and when I turned it on to check to see what it was it said 1.42gb onboard. No biggy though It was a great gift for a child!", "Date": "December 17, 2013"}, {"Title": "touch tab", "Author": "momboss.", "ReviewID": "RB53WWN8388BM", "Overall": "5.0", "Content": "yes it is a nice tab better than the kindle i enjoy it very much i like it i dont have to get on my computer", "Date": "February 1, 2014"}, {"Title": "Had to return the tablet", "Author": "Don Thacker", "ReviewID": "R35IQV0HID5965", "Overall": "3.0", "Content": "The tablet battery was bad. I had to return it for a new one. The new one seems to be working okay so far.", "Date": "April 29, 2014"}, {"Title": "awsome tablet would recommend to anyone.", "Author": "Todd", "ReviewID": "R2CZ24X3OCTIW1", "Overall": "5.0", "Content": "I love this product, I would recommend this to anyone as well as the price is great. I enjoy the convenience of being able to take it everywhere. I can have contact with friends and family no matter where we are.", "Date": "April 3, 2014"}, {"Title": "An excellent company to do business with!", "Author": "L. Tucci \"letucci\"", "ReviewID": "R11FLFXS9PGMFE", "Overall": "5.0", "Content": "Honestly, I didn't have a chance to use the tablet since it came after I received a tablet for Christmas.  But I want to say that Jeff Chen and customer service is very customer-friendly!  I returned the tablet for a complete refund including shipping.  I also mistakenly returned a tablet case with the tablet that wasn't purchased from Andteck.  He was very helpful and forwarded the package to the seller, and he did it without delay. So,  I have given a 5-star recommendation for Andteck customer service!", "Date": "February 17, 2014"}, {"Title": "Love", "Author": "nisamccollum", "ReviewID": "R13B7KPO5KN3NM", "Overall": "5.0", "Content": "I can see what I am do  good  poto and the bluetoole work good to I just lovely  and go to buy one for my son", "Date": "January 27, 2014"}, {"Title": "nice tablet.", "Author": "CARL", "ReviewID": "R85ZZ8IU6BYYR", "Overall": "4.0", "Content": "this was an all around nice tablet. bought it as a gift for my niece and turned it into a learning tablet. she loves it. 4 stars because i wish it held a charge a little longer.", "Date": "January 13, 2014"}, {"Title": "touch tab 7 x 2", "Author": "SHAMIM SHEIKH", "ReviewID": "RDD8FJNF26I01", "Overall": "2.0", "Content": "i get a 2 to the touch tab  i would not recommend it to anyone  it is not  what it looks like  no good.  again i give it a 2", "Date": "January 22, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IRUAX7K"}}