{"Reviews": [{"Author": "Jim G", "ReviewID": "RSSJQBTPRH39Q", "Overall": "5.0", "Content": "I replaced an a8 with this dual core tablet.This tablet is so much faster and its lighter.It has the 3+ hour battery life (WiFi on and browsing, screen at 2/3 brightness)No problems watching Netflix. It downloads from the play store quickly.The screen protector is neatly installed, better than trying to put one on myself. I would recommend this tablet to anyone.", "Title": "dual core...very snappy.", "Date": "March 1, 2014"}, {"Author": "Stephanie Hansen", "ReviewID": "R18H6KD2CAAOIP", "Overall": "5.0", "Content": "For the price paid, I expected something cheaply made and mediocre for speed. I have been very pleasantly surprised. The speed is great for an android tablet and the battery life is wonderful! I use this primarily for streaming with my Google chrome. Even being used for 3 hrs each night, I still only have to charge it every 3-4 days. I would definitely purchase this again!", "Title": "Great tablet, low cost", "Date": "March 22, 2014"}, {"Author": "RUBEN RODRIGUEZ", "ReviewID": "R3BR50JXH9IDOC", "Overall": "5.0", "Content": "Purchased for a trial use for my resort. We plan on having all of our maids carry tablets. So far this tablet has worked perfectly. I will update as time goes by. So far so good.", "Title": "Great value", "Date": "March 28, 2014"}, {"Author": "E. Gadbois \"Sport Pilot\"", "ReviewID": "R35Y28ECSBJV0O", "Overall": "3.0", "Content": "This was a birthday gift for our second son who is a bit mentally challenged so I ended up creating accounts. It arrived in amazingly short time, 2 days. We bought the suggested cover with a keyboard for something like $8 which is a bargain.As stated by other reviewers the off axis viewing is impossible, the usb input from the external keyboard is slow to respond at times , the WiFi reception is weak, and it seems very slow to boot up to me. I found android a hassle to set up as compared to setting up a Nexus 7 for my wife. I am probably spoiled and too tough on a tablet this low in price. My favorite portable computer is the Acer Chromebook 720 with a boot up time of 7 seconds and runs the Chrome OS.", "Title": "The general impression is a bit overstated", "Date": "June 4, 2014"}], "ProductInfo": {"Price": "$119.99", "ProductID": "B00I09YPYU", "Features": "Look no further for a budget tablet with more features and value for less. As the only tablet having both Bluetooth and HDMI in its price range, it is a good buy for kids and first-time tablet buyers. While this is NOT a lighting fast tablet, it WILL get the job done.\n2800mAh battery ensures 3+ hours (Wi-Fi off, low volume & 35% brightness; Expect shorter run time with Wi-Fi and higher volume/brightness settings) of smooth 1080P video with the latest Android 4.2.2, Dual Core CPU and same series graphic processors as in iPad. Keep all your movies in expandable storage up to 8GB + 32GB Micro SD + 64GB USB flash drive. Front and rear 0.3MP cameras for convenient Skype commuinications (Low resolution cameras for video calls and fun only).\nNew 2014 Cortex dual core 1.3GHz CPU is more powerful and more compatible with new software and hardware than old A8 and A5 (such as Allwinner A13) CPUs in many other budget tablets. Pre-installed screen protector matches perfectly. You have to look hard to find it! Optional ValuePad silicone protector (B00KGCS7IO - Pink; B00KGCS5R2 - Black) for extra protection.ValuePad for Kids VP111-K (B00I09WN7Q - Pink; B00HDKWEFO - Black) comes with the silicone protector.\nCapacitive Multi-Touch 800x480 display. Endless fun with the freedom to connect external keyboards, mouse, joysticks, flash drives and Ethernet adapters. Online chatting using the dual front and rear cameras. Real English instruction manuals - no more broken English! Lower prices and a Quick Start Guide with battery and charging instrutions available at valuechainusa. Kids version VP-111K available in Black (item B00HDKWEFO) and Pink (B00I09WN7Q).\nNOTICE: THERE IS A MISPRINT ON THE FIRST 2 PAGES OF THE QUICK START GUIDE THAT COMES WITH THE TABLET. Please disregard the booklet in the tablet box and download \"Quick Start Guide (VP111/VP111B/VP112)\" from the support page on our valuechainusa website. You can also contact us via email or Amazon message system to obtain a copy. We apologize for this inconvenience and thank you for your support.", "ImgURL": "http://ecx.images-amazon.com/images/I/51ibhkVsxyL._SX300_.jpg", "Name": "ValuePad VP111 7\" Tablet 8GB Bluetooth HDMI Scr Prot Android 4.2.2 1.3GHz 1080P Google Play 3D Game MicroSD Dual Core Dual Camera (Black)"}}