{"Reviews": [{"Author": "anna", "ReviewID": "R29G7NG2NCDTI3", "Overall": "5.0", "Content": "I purchased the new Contixo 7.85\" tablet for Christmas, after I used for a while and have to say it is definitely one of the more nifty devices, with lots of cool features and options. Before I talk about them, I'd like to say that I enjoy tech gadgets and usually get my hands on the latest and greatest ones. This review will cover the Contixo as well as my experiences with other devices.DisplayThis tablet has a very nice and fresh looking display, it is the latest IPS screen. The images are super sharp and everything looks crystal clear. It is easy to view on off angles, which is useful when me and my friends are viewing the screen at the same time or for using the device in presentations and meetings. The anti-glare feature is a nice touch, I can view it in direct sunlight without a huge loss in clarity. Granted, it's not as great as in dim light or shade, but it does the job.AudioThe audio was a huge selling point for me. Most speakers on laptop, netbook, and other portable devices like tablets and smartphones produce poor quality sound. You always have to plug in external headphones to really enjoy music and movies. That issue doesn't exist with the Contixo tablet. These speakers get loud, produce an enjoyable experience. Again, this can come handy when you are listening/viewing the device with multiple people.BluetoothNice, handy feature, I don't know why more devices don't have them. I can connect to my Bluetooth wireless headphones and walk around the house without being tied to the device.Vs iPad miniThe main advantages iPad has over Contixo 7.85 are that iPad's Retina display gives its screen a higher resolution, but not by much. And the Contixo is amazing IPS Display 1024x768. iPad mini has both a front and rear camera, as well as the Contixo 7.85 has Front facing and Rear facing Cameras. The clear advantage for Apple is the number of apps. Contixo get access to thousands of useful apps and fun games to download and installed on you tablet with Google Play Store pre-installed .On the other hand, the Cotixo 7.85 is 0.256in, a bit thinner, lighter, and smaller than the Apple counter part.For most people, the key distinction between iPad mini and Contixo 7.85\" is the price. The Contixo is considerably cheaper, costing $250 less than iPad mini's comparable model. Another disadvantage of the iPad is that you get the deliciously awkward pleasure of joining a cult that brainwashes you into thinking buying Apple makes you different, better, while offering an advanced product; when in reality they are like the million other Apple users, spending twice as much for a device that is rarely up to speed with current technology.Falling behind in technology is one of the main reasons I've strayed from Apple over the few years. The original iPod and iPhone were true innovations. You might even say the iPad was an innovation, even though it was simply an oversized iPhone, even using the same operating system. To make their products work smooth, Apple's uses highly specialized components in their products. This makes it difficult for their products to evolve as quickly. The initial iPhone was one of the last phones to make the switch to 3G. And even though 4G has existed for nearly 2 years, iPhone made the jump only a few months ago. Apple's prized Siri is just an enhanced version of Google's voice activated search, which came out 2 years prior to Siri. Now Apple is playing catch up with the iPad mini and Amazons already on its second generation 7\" tablet.As far as hardware, both boast a dual core processor, though Nexus is a little faster at 1.7Ghz But Contixo is A31S Quad Core CPU with a top requency of 4x1.5GHz and 1Gb DDR3 Ram. On the other hand, Contixo has more storage capacity up to 32Gb extra space.I love technology and enjoy following its progression, I've really enjoyed sharing my thoughts about this so I hope you've found it helpful.", "Title": "Contixo 7.85” vs iPAD Mini", "Date": "February 1, 2014"}, {"Author": "adams", "ReviewID": "R33A3MQ8W7HHF6", "Overall": "5.0", "Content": "Amazing product! Perfect for the purpose i bought it! i have had it for 1 month and have experienced no problems so far. It has similiar size of iPAD mini 7.9\" display and performance, but the price is very affordable. The screen has an amazing, very comfortable for reading, high quality color, music, browsing and such, which is what i bought it for. Compare with other 7.85\" tablets, the Quad-core 1.5GHz processor is very fast. Built-in 1G DDR3/16G HDD is a good advantage. 2MP cameras work great for Skype chat. The battery lie is good too, lasts HOURS before i have to charge it again. Came with Google play and I've downloaded some apps that work perfectly. Both front and rear cameras work fine as well. Came with all accessories, charger, usb cable, usb connector. Very good product :)I will update if I have any issues later...", "Title": "great tablet", "Date": "February 2, 2014"}, {"Author": "William Henry", "ReviewID": "R2FTXYI0RXNT9Q", "Overall": "5.0", "Content": "Nice product & good service. Still trying to sort out a Bluetooth connection problem but may not be the tablet.", "Title": "Nice tablet", "Date": "May 26, 2014"}, {"Author": "L. Williams", "ReviewID": "R3BSIFBG07KVUZ", "Overall": "3.0", "Content": "I bought 2 of these, one for my husband and one for me.  Let me state, I do tech support for a major wireless carrier, and do troubleshooting  for mobile devices and computers all day.  My point is, I am not a beginner when comes to technology.  At first they seemed like nice tablets, but now on day 4, mine seems to have glitches. My speaker sounds blown or crackily and I only used it for the first time today.  It freezes sometimes when changing screens and I may have to power it off to bring the functionality back.  Also, the battery seems to drain quickly.  I keep my brightness at the lowest level, but that doesn't seem to make much of a difference.  They are nice sized tablets, not too big which is a good thing. I will most likely be returning mine.", "Title": "Overall ok devices", "Date": "March 14, 2014"}, {"Author": "Zamir", "ReviewID": "R1OD3KP446XT0Q", "Overall": "1.0", "Content": "I bought this tablet from Amazon about 2 week ago. It came with a strange-looking browser. When I select the browser, zstore.com is the home page and I cannot figure how to remove it. Also, I get a warning that zstore.com is an unsafe site. Despite deleting the url, zstore.com still opens as the home page. I did not buy this device to have zstore.com advertise to me and make me unable to browse the net. I am yet to figure-out how to install chrome. I never had this problem with my Nexus-10.Had I know this, I would certainly have reconsidered buying this device.I wish I could have given it a red star, to imply danger. I am totally frustrated with this device only because for ztrore.com. At this time, my investment is useless, until I remove zstore.com. I searched the net for a solution but was unsuccessful. Apparently I am the only person with this problem on this device.", "Title": "zstore is an overt trojan on Contixo", "Date": "March 28, 2014"}], "ProductInfo": {"Price": "$199.00", "ProductID": "B00I4BVCOK", "Features": "Contixo LR782 featuring A31S Quad Core CPU with a top requency of 4*1.5GHz and 1GB DDR3 Ram\nAndroid 4.2 Jelly Bean OS brings tons of new features to your Contixo tablet. Get access to thousands of useful apps and fun games to download and installed on you tablet with Google Play Store pre-installed. Micro SD card slot allows you to add up to 32Gb extra space to store songs, videos, photos and other files\nAmazing IPS Display 1024x768 resolution which makes everything look crisp and sharp. With the IPS display, you can read text, see images and watch videos from a wider angle than normal HD screen.\nWi-Fi (802.11a/b/g/n) and Bluetooth keeps you connected on the go. Front-facing camera makes it easy to chat with friends and family, while 2.0M rear-facing camera allows you to capture the special moments and upload them to facebook and twitter.\nLive customer service and tech support from Contixo. Robust warranty, on-time customer service/tech support, frequently updated firmware guarantees customer satisfactory. Feel free to contact us whenever a question pops up in your head, we are always here to help.", "ImgURL": "http://ecx.images-amazon.com/images/I/51vwMPEunNL._SY300_.jpg", "Name": "2014 New Contixo 7.85\" Quad Core Processor 1.5GHz Google Android 4.2 Tablet PC, IPS Touch Screen 1024x768, Dual Webcams, Bluetooth, HDMI, Wifi, 16GB Flash Storage"}}