{"Reviews": [{"Title": "I have the pink one", "Author": "Deshawn", "ReviewID": "R2OVY0T55ZSKSA", "Overall": "5.0", "Content": "I love this tablet because it is very easy to use. It  has Google play installed so you can download all of the apps that you may need. The battery life is really good. I have all my music,games and pictures on it. I would recommend this tablet for anyone.", "Date": "May 6, 2014"}, {"Title": "I bought the pink one", "Author": "Ella Moore", "ReviewID": "R1R8V12O2KGERM", "Overall": "5.0", "Content": "I like this tablet because it is very easy to use. the price was very nice I only paid $55 for it with free shipping. My package arrived on time. only thing I did not like is that there aren't any programs on the tablet might have to install them yourself from Google Play but outside of that I really love it", "Date": "April 23, 2014"}, {"Title": "broken after 3 weeks", "Author": "kcbutterfly", "ReviewID": "R3H7SXIKWFJB48", "Overall": "1.0", "Content": "bought two of the axis a23, one for my son (blue) and one for my daughter (pink). they have been using it only 3 weeks and after that time the problems started. One had \"only\" a white line, but the other one was a disaster. It was flickering, fluttering and you could not see nothing on the display. The kids were disappointed!!!!!!!!!!!", "Date": "May 7, 2014"}, {"Title": "Works well.", "Author": "Ernie", "ReviewID": "R3RF7KG2ZX9MRT", "Overall": "4.0", "Content": "I bought this as a gift but did take it through a test run. Found the tablet to be very responsive and easy to use.Everything worked as expected.", "Date": "June 2, 2014"}, {"Title": "The price is right!  Good starter tablet!", "Author": "D. Schroeder", "ReviewID": "R39JDY92WHU3LP", "Overall": "4.0", "Content": "I bought the pink one for my nine year old.  It does everything that she wants it to--apps, etc.  The camera part isn't super high quality but it serves the purpose for her.  The price is right for a starter tablet and makes me much less nervous to have her responsible for it.", "Date": "June 2, 2014"}, {"Title": "Must Have for 2-3 yr olds", "Author": "Avg User", "ReviewID": "R2X3W5W855PJ4F", "Overall": "5.0", "Content": "Makes an excellent gaming tablets for games played by younger children in the 2-4 yr old range. We bought it to take on a cruise with us to keep our 2 yr old daughter entertained in the main dining room during the long multi-course meals. She played on it relentlessly and was completely quiet and enthralled by the free Android educational games we had downloaded in advance. For the low price this is a perfect tool for entertaining a 2-4 yr old child. The amount of free educational software and games available for it is incredible.", "Date": "May 29, 2014"}, {"Title": "Perfect for kids", "Author": "n2flipn", "ReviewID": "RC88PKOXV0UYA", "Overall": "5.0", "Content": "We bought this for our 4 year old daughter.  First off, she loves that it is pink!  Our daughter loves to watch video's on you tube, and plays various educational games we download from playstore.  The size is perfect for her, and I like the compact case that allows it to stand up on it's own.  It easily fits in my purse so we can take it with us when going on long drives, or out to places like restaurants so she can quietly entertain herself.  This tablet is faster than the similarly priced model she had before.  The only complaint I have is that the battery seems to die faster than I would expect.  Overall this tablet is worth the $55 we paid for it, and is perfectly adequate for children.", "Date": "May 28, 2014"}, {"Title": "Great for Kids!", "Author": "Debbie", "ReviewID": "R4PWOZJ5G74NW", "Overall": "4.0", "Content": "We just purchased a pink and a black tablet for our 8 and 9 year old girls. Other than occasionally dropping wifi, they work great. Our purpose for buying them was for the girls to play games, so the internet is not a priority for us. The camera doesn't take the best pictures, but it is fun for kids.Overall, we are pleased with the price and quality. These are great starter tablets.", "Date": "May 14, 2014"}], "ProductInfo": {"Price": "$99.99", "Features": "The Quantum Axis A23 tablet features an x23 ARM Dual Core 1.5GHz CPU coupled with the Mali-400 GPU, doubles the power of its predecessors, making gaming and web browsing more fluid, while maintaining affordability.\nDual cameras allow for high quality images and video in various file formats. Use the front-facing camera for Google Hangouts or Skype chats.\nA multi-touch 7\" display with 1024x600 resolution provides higher quality video. It also comes with a FREE installed screen protector!\n802.11 b/g/n integrated wireless connects you to the web. Browse the web, play online games, stream music and video off your home network using apps installed from Google Play or side-loaded from your SD card running Android 4.2 Jelly Bean OS. 8 GB (6.5 GB of usable storage)\nFull LIFETIME defect warranty on any manufacturing defects! Drop and spill coverage available through SquareTrade at a small fee to ensure your investment is 100% protected.", "Name": "Axis A23 7\" Dual Core, Dual Camera, 1024*600 Capacitive Screen Android 4.2 Tablet Pc (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/51okVssU51L._SY300_.jpg", "ProductID": "B00IFFEN96"}}