{"Reviews": [{"Author": "Mercer1105", "ReviewID": "RKP1RG0S27YR1", "Overall": "4.0", "Content": "So far I love it.  I picked up a cheaper tablet at a local store & was shocked how slow it was compaired to this one.  The resolution on this tablet is amazing & the speed is wonderful.  Though I'm not a tech person, I was surprised that I was able to download 3 apps at the same time.  I would definitely recommend it for the first time andriod user as a well as a semi-tech person.", "Title": "Great tablet", "Date": "May 5, 2014"}, {"Author": "Amazon Customer \"forevereire\"", "ReviewID": "R2I12GGE35OMRF", "Overall": "1.0", "Content": "24 hours usage, good for this price.  screen is very good, better than my previous 10\" galaxy tab 2.  however, the touch screen is not as responsive as the tab 2.  it is ok for my use, mainly for ebooks, web and video.  no issue with wifi.  Battery is good, after watching one CSI aND some light web browsing, still has 96%.Update 1 after 4 daysScreen ffrozen a lot yesterday, need to restart it by long press the power button... consider other options, will return it soon.", "Title": "good tablet as this price", "Date": "May 16, 2014"}, {"Author": "Zachary C. Miller", "ReviewID": "R236AT1IQ1AT4Y", "Overall": "5.0", "Content": "I couldn't be more pleased with this tablet.  I was looking for an affordable 10 in. tablet to replace my aging 1st generation Kindle.  Price was an important factor.  I didn't have the four or five hundred dollars to spend on a new I-Pad or Samsung Galaxy, so I had to be smart about the choice I made.  I wanted a low priced tablet that looked and performed just like the high priced brands.  After doing extensive research, I initially decided on a different tablet than this G-Tab Iota.  But as fate would have it, the tablet I picked wasn't working properly when it arrived so I had to return it.  This turned out to be a blessing in disguise because after the return I decided to search other alternatives and found this beauty.  This model is sleek and good looking, the processor is fast, the touchscreen works perfectly.  It runs the Android network - which I prefer over the Apple App Store - and comes with Google Play pre-loaded.  It's the perfect tablet for my needs.  I would highly recommend it for anyone who wants a great product for an affordable price.", "Title": "Great Tablet!!!", "Date": "May 12, 2014"}, {"Author": "Keith Martini \"Martini\"", "ReviewID": "R2H0YXVTIAWV3R", "Overall": "5.0", "Content": "This tablet is absolutely incredible! I did a ton of research and then bought it still with some hesitation because I had never heard of this brand tablet. The screen resolution is outstanding! The speed in browsing is lightning quick. An awesome feature is that you can take video of something and while capturing that video, you can take pictures at the same time without affecting the video! Battery life is awesome. I can get on and surf the internet, watch videos all day, periodically check e-mails, run multiple applications for over 24 hours before I need to charge it. I compared it to my mother's ipad mini and I am so glad now that I didn't buy one of those.  A better performing tablet than most at a fraction of the price. Is there any downside to this tablet? Nope, None, Nada!", "Title": "Look no further! Better than the big name tablets", "Date": "May 29, 2014"}, {"Author": "Larry Thompson \"Texagander\"", "ReviewID": "RX56YQTP9DZIS", "Overall": "1.0", "Content": "Perfect, or so I thought until I ran out of memory.  I installed a Sandisk 30 GB SD Card but nothing will load to it.  I bought two of these tablets, one for my wife, and one for me.  Now I have the problem times two.  I downloaded two card game apps, 1 calendar app ( the one it came with would not allow input on either device), and one other small app.  I wanted to add an app for and address book, but was not allowed due to insuficient memory.  I tried to delete some of the factory installed apps to open more space, but only seem to be able to deactivate, but not remove.  The instruction book that it comes with for the most part tells you not to use the device outside in a thunder storm, nor to use it under water, but little else.  I searched the products web site and forums and could not find any help.  I wish I would have purchased something somewhere I could get a little assistance.  Should be easier to manage files, and absolutely have some better instructions", "Title": "Perfect - or so I thought, until....", "Date": "May 25, 2014"}, {"Author": "PG", "ReviewID": "R3OH9I92RXKXSQ", "Overall": "4.0", "Content": "I chose this tablet because its the perfect size gave it a four because nothings perfect. For the price,make and what I need to use it for it was the perfect fit customer support was good too.However I did purchase an extra 32G memory.Would recommend to my son and friends", "Title": "Very happy with this tablet", "Date": "May 23, 2014"}, {"Author": "Eglideman \"eglideman\"", "ReviewID": "RL5I9TKYUZ5BW", "Overall": "5.0", "Content": "I like to catch up on the news before going to sleep at night and I was doing so by streaming the Fox News Channel on my iPhone 4s.  I thought this tablet would work for the same purpose, but provide a larger, easier to see screen.  If (and it's very rare) I can connect to my Xfinity wireless home network with the tablet, the programs are un-watchable due to buffering which goes on forever.  I can still connect with the iPhone and there's no buffering of the video.  What's up with the WIFI, Matricom?  When I check the connection on the tablet it says it's Excellent at 65MBps.  BS.  I'm using the Xfinity TV Go app and I have Xfinity high-speed internet.  No other devices on my home network have these kinds of issues. If you want to use a tablet for internet access, DON\"T BUY THIS ONE!CORRECTION!  After much experimentation I discovered the problem wasn't with the tablet, but with my ISP.  The tablet is performing flawlessly when I have a good internet connection to my wireless router.In every other respect this tablet is terrific.  Great screen resolution, fast processing, good touch sensitivity.  Recommend you buy this tablet.  Price can't be beat.", "Title": "Mea Culpa", "Date": "May 8, 2014"}, {"Author": "George", "ReviewID": "RBICYDRFH27M4", "Overall": "1.0", "Content": "I was interested in buying this tablet. The Matricom website listed them as $144.00 and provided a link to Amazon who was selling the table for $166.00. I sent an e-mail to Matricom about the discrepancy when they did not reply I sent another request four days later and still not response. If customer service is an issue you may want to avoid buying.", "Title": "No Customer Service", "Date": "May 21, 2014"}, {"Author": "Corey G.", "ReviewID": "RB7YX7761HPUB", "Overall": "2.0", "Content": "I don't like how when you browse everything shows up in \"mobile\" form. This is a 10.1 inch tablet why on earth is it doing that. Just like one other review said you cant download allot of apps on this tablet. I mean not allot at all. Then i couldn't  for the live of me figure out how to download mix tapes or songs from the internet on too this tablet either...", "Title": "ITS not all its hyped up to be", "Date": "May 14, 2014"}, {"Author": "Susan \"Sue\"", "ReviewID": "R27LIM76RVHADT", "Overall": "1.0", "Content": "If you are used to a laptop with a soft keyboard and a smooth touchpad as I have been, you will never get used to this touch screen type device. First of all the screen looks tiny as compared to my 15.6\" widescreen laptop, as a result it is # 1: hard to get used to typing on a virtual keyboard on the tablet. Many times, I had to tap the link multiple times for it to react. There is a major problem w chrome browser, the tabs:say 4 of them are open on the tablet in chrome. You cannot close them by tapping on the top of the tab (x) as you would do with a mouse and a laptop. The wireless is not too good on the tablet although it is fast with my laptop.Firefox browser is very slow on the tablet to open gmail. Overall there are major problems with this unit and I do not recommend purchasing this item, especially if you are used to a laptop w a touchpad/built-in mouse. The tablet seems very small and it is not easy on your eyes!Returned to Amazon, awaiting refund.", "Title": "Read this Before you Buy!!", "Date": "May 10, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00IU70DWK", "Features": null, "ImgURL": null, "Name": null}}