{"Reviews": [{"Title": "Almost perfect...", "Author": "Amazon Customer \"I'm retired. Don't ask me to...", "ReviewID": "R358TVPELOGVV4", "Overall": "4.0", "Content": "Except for the incredibly silly position of the home, back and settings keys, in the center of the LONG bottom axis and arranged old style, like the Honeycomb days, with Back on the right and Settings on the left. I've long since become accustomed to Back on the left and recent apps on the right.I've got lots of tablets under my belt, and they all either have soft buttons that move as the orientation changes, or hard buttons at the bottom of the short axis. I work almost exclusively in portrait mode, and I expect the home and back keys to be at the bottom. They're not, they're at the left side. That's the side I hold from, and my hand is forever hitting the back button by accident and losing work. I'm training myself to use it in the opposite direction in portrait, which puts the buttons on the right where my \"active\" fingers are. That helps.As I understand it, the hard buttons were a way to get a bit more screen real estate, but I think I'd be willing to trade the real estate for always-visible buttons.Battery life on the Note isn't great, but it'll do, especially since my Droid Razor Maxx HD has incomparable battery life. When the Note dies I can switch to the phone until I'm recharged.I took a few pix in my office and camera quality seems ok, but too soon to be sure until I get it out taking pix in real life. I have a trip next weekend, we'll see how it does.So much for what I didn't like - now for the good stuff... The tablet arrived with Jellybean installed, but within a couple of hours of turning it on I was presented with the upgrade option to Kit Kat; I was worried about that since I've had some bad experiences with Samsung devices never being updated.The S-Pen - all I can say is WOW. My handwriting actually looks like my handwriting, not undecipherable chunky glop like all the others.My 128gb micro SD card seems to work fine, despite the specs saying it will only read 64gb. My Nexus 7 2013 is totally awesome, but when I needed to go to a bigger screen I decided to go with the Note instead of the Nexus 10 because of the expansion. Yes, you can add on to the Nexus with an OTG device, but then you're not SLEEK anymore!By the way, I ran the purchase from Amazon using my existing Verizon account, and from Verizon directly, and Amazon was cheaper. Plus, the device arrived already activated so I didn't have to go through that exercise. And there's an interesting Kindle widget on the tablet that is kind of similar to the Kindle Fire interface. I really like it, but have been unable to figure out how to get it on my other tablets. I'm thinking maybe you only get it when you buy through Amazon? That's just a guess, not confirmed.Oh, yeah, one last thing, the Samsung on-screen keyboard has a number key row across the top like a pc does - no more press & hold for numbers! At first I thought I'd have to choose between that & Swype, but the Samsung also has swiping capability. It's not quite as slick as the mature Swype keyboard, but the number buttons make the trade worthwhile.For the most part, it's screaming fast like you'd expect it to be, but there is an unexpected lag at times. I've been unable to identify the culprit causing the lag.", "Date": "May 31, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IYYXIQ2"}}