{"Reviews": [{"Author": "Truvru", "ReviewID": "R20XBAK0KXB4WP", "Overall": "1.0", "Content": "I was looking for a low cost tablet that would fit the bill for my kids, and came across this listing with all 5 star reviews (now after posting mine, it will not longer be that). Before deciding on the purchase, I was curious about these \"Verified Purchases\" as they seemed too good to be true, \"awesome product\", \"Good buy\", \"5 star\", \"GREAT TABLET\", etc. so I went through each of the reviewers profile by clicking on the \"See all my reviews\". And guess what?! Each of the reviewer had 5 or 6 other reviews on tablets ALL made by FastTouch, which made me suspect these so-called \"Verified Purchases\" were made by their own company trying to boost up their own ratings giving the false sense of a 5-star product. Even though I have not purchased this product, such type of tactics are one of the worst things that can be done and will ruin a companies reputation. I can no longer trust any reviews from FastTouch products as being genuine or honest. If Amazon can allow such reviews, I have to carefully \"review\" other reviewers to see if they look honest and legitimate. Please check out the wiki how on how you can also spot other fake reviews on Amazon.", "Title": "5 star reviews look fake and suspicious. Verified purchases only reviewed FastTouch products. How to spot a fake review.", "Date": "June 7, 2014"}, {"Author": "Katie", "ReviewID": "R125METTAE0RAX", "Overall": "5.0", "Content": "The product arrived way before it was supposed to which is a HUGE PLUS! Loved the pink color and the size was perfect!  It was decently fast which added to the bonus because of how cheap the product is! :)", "Title": "Good product!", "Date": "May 19, 2014"}, {"Author": "talafiana singh", "ReviewID": "R2VBZWTXJK9RQM", "Overall": "5.0", "Content": "I bought this product before going on vacation to leave with family back home and they love it, they can skype me easily, facebook play games and use all kinds of other apps. They absolutely enjoy it and now more of my nieces and nephews would like one of their own too.. =) Very happy that they enjoy this product, enjoy my gift. I will definitely order more before my next trip... it just makes a perfect gift. works great. thanks so much", "Title": "awesome product", "Date": "May 2, 2014"}, {"Author": "Jen", "ReviewID": "R1TK8Z5TVQR7KS", "Overall": "5.0", "Content": "So far happy with this tablet. Didn't want to spend too much money on other tablets avail on the market. I'm happy I chose this. Capable of doing anything the other tablets can. Good investment.", "Title": "5 star", "Date": "April 13, 2014"}, {"Author": "Smart Dealer", "ReviewID": "R1NVZSAJK8O04O", "Overall": "5.0", "Content": "THIS PRODUCT IS VERY GOOD TO USE WITH PICTURE AND USE THE OFFICE FOR PLANNING.IS SHORTER AND EASY TO USE FOR ALL PROPOUSESHIGHLY RECOMMENDED", "Title": "GREAT TABLET", "Date": "April 8, 2014"}, {"Author": "Tsandhu", "ReviewID": "R2X1RIUK9J8GXG", "Overall": "5.0", "Content": "I got my android shipped in way sooner than I expected. I feel I got a great deal. I use it to get in touch with my relatives over seas through Skype and all.. And it works great, picture is clear, sound is clear. In fact a colleague ordered one for himself as soon as he tested mine out..", "Title": "Good buy", "Date": "April 7, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00INKKQBM", "Features": null, "ImgURL": null, "Name": null}}