{"Reviews": [{"Title": "Great value & works good", "Author": "Gary L. KIMMY \"Digital Guy\"", "ReviewID": "RE7ONNWX4NOYO", "Overall": "4.0", "Content": "This is my first tablet so it`s a new & different experience from a desktop. The screen is not as bright as I wish. It`s ok for indoor use, but forget using it outside. I played some old MP1 vivdeo files on it & they play great. I definately reccomend getting the case/keyboard with it. There is an adapter with the tablet to plug in the keyboard. If your eye sight is not that good I think you should consider getting the 10 inch model. It will take a lot of time downloading & installing apps, so be patient with that. Also get a 32gb micro SD card to expand the storage. I do not see the micro HDMI slot as of yet, but dought I would need it anyway. Its ok for reading a book, but the Kindle is probably better for that purpose. Over all it`s a good device for the money.", "Date": "May 2, 2014"}, {"Title": "Good price performance", "Author": "Paul Cook \"stat guy\"", "ReviewID": "R25266DWYN4XYS", "Overall": "5.0", "Content": "Okay, it is not a high-end tablet but if you don't expect a $200 tablet for less than 70 bucks, you will be pleased with this one.Starting off with the minuses:-- The screen is not particularly bright-- The cameras are not particularly good-- The battery life is nothing to write home about.-- The sound is just acceptable.Now for the pluses:-- I was pleasantly surprised by how responsive the touch screen is.-- The screen is quite clear-- The processor is quite fast-- The wifi has a good range-- It has an up-to-date version of Android, so it works well with a lot of appsIt even interfaced directly to an $8 USB keyboard/case.  (See  SANOXY® 7\" Tablet Stand with USB Keyboard)I bought my wife a Samsung 7\" tablet a year ago and find that this tablet is a real price-performer in comparisonI can recommend this to anyone looking for a kid's tablet, a second tablet, or wanting to play around with a tablet for much less money than the high-end tablets.", "Date": "June 2, 2014"}, {"Title": "Very good", "Author": "Walter Pambabay", "ReviewID": "R1759ZIJO887XX", "Overall": "5.0", "Content": "This tablet buy it for my younger sister and loves it, hours and hours spent playing, there are many games that work perfectly, plus listen to music, or watch a movie, time battery life is very good for the cost one pays is a good product, nothing to envy to other tablet brands above, I myself have thought of buying one for use, if you plan to buy a ideausa, I recommend it.", "Date": "May 9, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IDNGU7S"}}