{"Reviews": [{"Author": "Dustin", "ReviewID": "R22FTZ0HSGVOV3", "Overall": "2.0", "Content": "alot of games have crashing issues. i had to return it twice because i had a defective tablet. otherwise it's a decent little tablet", "Title": "its \"alright\"", "Date": "January 14, 2014"}, {"Author": "Tem", "ReviewID": "R2HZC4AAKE686J", "Overall": "5.0", "Content": "Got these for my kids ages 5-7-10. Now I have my phone back all to myself! Kids love them. One of the chargers broke, kinda cheap, easy to replace.", "Title": "Nice for the money", "Date": "January 14, 2014"}, {"Author": "david stevenson", "ReviewID": "R2KHNVGU8YR5D9", "Overall": "4.0", "Content": "it works fine, the grands love it. even though they were expecting them they r very happy ,so I am too", "Title": "grandkids", "Date": "January 7, 2014"}, {"Author": "Christopher L. Runkles", "ReviewID": "RZU8PH9VU1T6T", "Overall": "4.0", "Content": "nice and clean items. the only thing I could say is that on the description said it had 4gb on board memory and when I turned it on to check to see what it was it said 1.42gb onboard. No biggy though It was a great gift for a child!", "Title": "TouchTab 7\" X2 Dual Core Google Android 4.1 Tablet PC, Quad Core GPU, HDMI,...", "Date": "December 17, 2013"}, {"Author": "momboss.", "ReviewID": "RB53WWN8388BM", "Overall": "5.0", "Content": "yes it is a nice tab better than the kindle i enjoy it very much i like it i dont have to get on my computer", "Title": "touch tab", "Date": "February 1, 2014"}, {"Author": "Don Thacker", "ReviewID": "R35IQV0HID5965", "Overall": "3.0", "Content": "The tablet battery was bad. I had to return it for a new one. The new one seems to be working okay so far.", "Title": "Had to return the tablet", "Date": "April 29, 2014"}, {"Author": "Todd", "ReviewID": "R2CZ24X3OCTIW1", "Overall": "5.0", "Content": "I love this product, I would recommend this to anyone as well as the price is great. I enjoy the convenience of being able to take it everywhere. I can have contact with friends and family no matter where we are.", "Title": "awsome tablet would recommend to anyone.", "Date": "April 3, 2014"}, {"Author": "L. Tucci \"letucci\"", "ReviewID": "R11FLFXS9PGMFE", "Overall": "5.0", "Content": "Honestly, I didn't have a chance to use the tablet since it came after I received a tablet for Christmas.  But I want to say that Jeff Chen and customer service is very customer-friendly!  I returned the tablet for a complete refund including shipping.  I also mistakenly returned a tablet case with the tablet that wasn't purchased from Andteck.  He was very helpful and forwarded the package to the seller, and he did it without delay. So,  I have given a 5-star recommendation for Andteck customer service!", "Title": "An excellent company to do business with!", "Date": "February 17, 2014"}, {"Author": "nisamccollum", "ReviewID": "R13B7KPO5KN3NM", "Overall": "5.0", "Content": "I can see what I am do  good  poto and the bluetoole work good to I just lovely  and go to buy one for my son", "Title": "Love", "Date": "January 27, 2014"}, {"Author": "CARL", "ReviewID": "R85ZZ8IU6BYYR", "Overall": "4.0", "Content": "this was an all around nice tablet. bought it as a gift for my niece and turned it into a learning tablet. she loves it. 4 stars because i wish it held a charge a little longer.", "Title": "nice tablet.", "Date": "January 13, 2014"}, {"Author": "SHAMIM SHEIKH", "ReviewID": "RDD8FJNF26I01", "Overall": "2.0", "Content": "i get a 2 to the touch tab  i would not recommend it to anyone  it is not  what it looks like  no good.  again i give it a 2", "Title": "touch tab 7 x 2", "Date": "January 22, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00IRUAX7K", "Features": null, "ImgURL": null, "Name": null}}