{"Reviews": [{"Author": "E E Espiritu", "ReviewID": "R1B3409KHXZC3G", "Overall": "4.0", "Content": "All features are excellent - picture, sound, wifi, android, dual camera, etc. except for the viewing angle. The face of the tablet needs to be  perpendicular to the viewer's line of sight to see a perfect display. Not a big issue. I  used it for skype, email, facebook, facetime, web-browsing, taking picture, video, screen shots ... We have ipad mini, and I don't see big difference. I ordered on Monday and got it on Friday with a free shipping. I would recommend this $150 tablet that can do the job of a more expensive other tablets.", "Title": "10.1\" Android KITKAT 4.4.2 [QUAD Core] Tablet w/ 1GB RAM + 32GB", "Date": "April 19, 2014"}, {"Author": "Franklin W. Johnson", "ReviewID": "R1C7QIZKEL5YU9", "Overall": "2.0", "Content": "I bought this tablet to see how I liked using a tablet. It was not the least expensive tablet, but it had a lot to offer for the price. It was delivered fast and packaged well. I've been using it now for over a month and still learning all the features.  Its great for email and Facebook. The battery life is only a couple hours of continued use, but it charges fast and can be used with the charger. This tablet is definitely worth looking at.  After using this tablet for a couple months the battery life has gone downhill to being able to use it 15-20 minutes before hooking it up to the charger.", "Title": "Battery Life", "Date": "May 18, 2014"}, {"Author": "Alec", "ReviewID": "R2T881FOMNG0FE", "Overall": "3.0", "Content": "First of all, the screen resolution is 976 x 600, not 1024 x 600 as stated in the product description. It's fast, but the poor quality of the screen creates rather negative experience when you try to use it for reading, so I would consider this as a toy for kids who want to play games rather than an office device for business.", "Title": "OK for the price", "Date": "June 7, 2014"}, {"Author": "Markk1pe \"Marko\"", "ReviewID": "R1Y2EGHF2O3CW7", "Overall": "1.0", "Content": "I was disappointed when I opened the shipping package and saw a plain looking white box marked \"Tablet PC\".  I was expecting something marked \"American Pumpkins\" or something like that.  Because the details stated that it \"ships from American Pumpkins in Columbus Ohio\" I mistakenly thought that it was made in America.  I've had problems with my existing tablet that was made in China (it keeps going to Chinese language web sites for example).I was hoping for a non-Chinese tablet which is why I was interested in this.  However the tablet comes with an inspection sticker on the corner with either Chinese or Japanese characters so it's clearly not made in America.The description also says the color is white, but only the back is white, the face that you look at is black.  I did see that in the picture but thought that was just a stock photo.  So it is white rear, black front and sides.It comes with a small manual that has a title of \"MID-android\" inside the front cover, no mention of American Pumpkins.  The grammar is poor as if it was written by a non-English speaker, hard to understand.  It refers to buttons on the device by symbols that are very hard to read, I couldn't figure them out.This device depletes the battery quickly.  I only browsed the internet with it, battery went down fast.The product description says\"32GB Storage Space, which can be further expanded up to 64GB using the SD card slot. Features include ... + TF card slot to further expand memory. \"so it implies there is an SD card slot and a TF card slot to further expand memory, but the SD Card fits in the TF card slot; they are one and the same - 64 GB appears to be the maximum memory.The description also says earphones are included, but they are actually ear buds, minor detail but earphones are more comfortable and can block out noise. Not a dig on the product, just information for you.", "Title": "Not what was implied", "Date": "June 3, 2014"}, {"Author": "joseph jackson", "ReviewID": "R31HGTTYW96OHA", "Overall": "5.0", "Content": "Speed,screen size, are both great sound with Bluetooth headset is also great.The quick start is quick. No more waiting to gear up. I received the tablet on 5_30 .", "Title": "Excellent tablet fast and big.", "Date": "June 4, 2014"}, {"Author": "Biff \"Mr. Biff\"", "ReviewID": "RBUD1PHZXJRZF", "Overall": "5.0", "Content": "This little tablet is a gem. I can even do everything I need to do with very little trouble. It's fast enough to view you tube and Netflix without buffer lag. The SD slot will take a 64gb card and even mount a USB drive. I was wondering if I should buy an iPad so I got this to try a tablet. I don't think I'll bother with the iPad since this is the best bang for the buck!", "Title": "I don't need that budget busting iPad after all!", "Date": "June 3, 2014"}, {"Author": "Angel", "ReviewID": "RCVBBPCNM8WRS", "Overall": "5.0", "Content": "My tablet is great, it works perfectly, the battery is almost what I wanted, it drains not that fast, but I think it could be better.I loved it.", "Title": "Excelent!", "Date": "May 31, 2014"}, {"Author": "Happy", "ReviewID": "RVIJ5EU0C2722", "Overall": "5.0", "Content": "I am very pleased with this inexpensive tablet. I would recommend to others. Just wondering where I can get a dongle for it.", "Title": "Great tablet, great price", "Date": "May 25, 2014"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B00ITCEHAA", "Features": "10.1 inch 16:9 IPS LED capacitive 10-point panel 1024 x 600 featuring the latest 2014 Quad Core AllWinner 1.6GHz CPU for superior multi-tasking, ultra-fast 2GB DDR3 RAM for running apps, and a 8-core GPU for smooth 3D graphics.\nAndroid 4.4.2 KITKAT [QUAD CORE] Allwinner Processor w/ 32 GB Storage (expandable upto 64GB via SD Card)\nDual Camera, HDMI output, inbuilt speakers, WiFi + Bluetooth ready\nSupports 1080P HD video playback, 1080P decoding and HDMI video output\n3D Gaming Accelerator comes installed. Comes with Google Play Store, Netflix, Youtube, Facebook, Skype and other popular apps.", "ImgURL": "http://ecx.images-amazon.com/images/I/51FTMvsvEaL._SY300_.jpg", "Name": "10.1\" Android KITKAT 4.4.2 [QUAD Core] 32GB Tablet / 2GB RAM / Dual Cameras / Bluetooth / HDMI - PumpkinX"}}