{"Reviews": [{"Author": "JohnDaGeek", "ReviewID": "R2GTF7T4B0RTKF", "Overall": "5.0", "Content": "I'd been looking at the Asus Memo Pad 8, planning to buy, then saw this one.  Asus and Lenovo are both are solid names with good reputations, I've owned and loved laptops made by both. The price is practically the same.  I'm not normally an \"early adopter,\" but the dual front speakers and a color other than white are what sold me on this one.  I ordered it today, should be here Tuesday, so more to follow.Update:The build feels solid, and finish feels good and \"grippy.\"Display is bright, and looks good from the side.  I'm generally using it at 60% brightness in normal room light.  I like the 8\" form factor, my eyes aren't young any more.  :)The sound is OK, the SINGLE speaker faces front and is about what you'd expect.Battery life:  It drops about 2% per hour when in \"standby.\"  Watching videos will use about 14% per hour with the display at 60% brightness.There's not a lot of bloatware.  Of the 16GB of storage, about 11.8GB is available to use.  (And a 32GB Micro SD is under $20 now.)The OTG port works as expected.  No problem reading a thumb drive, or seeing my smart phone as external storage.  It even charged the phone while connected.The cameras are mediocre, but don't expect much from a tablet.  My phone is much better as a camera, easier to use and always with me.Performance seems fine, I haven't noticed any lag or hesitation.Value:  It's the best price of the \"major\" brand 8\" tablets. To me, it feels more solid than the Dell Venue, and the display looks better than the Asus Memo Pad.  If you're looking for an 8\" tablet under $200, I'd recommend it highly.For a sleeve-type case that'll also work as a stand, GreatShield DENIM Series Protective Sleeve Case with KickStand for for ALL 7-8 inch Tablets - Fits: Apple iPads, Samsung, Lenovo and other tablets (Blue) fits it nicely and still has room for earbuds.", "Title": "OK, Couldn't resist... (Updated)", "Date": "May 9, 2014"}, {"Author": "jeffw79", "ReviewID": "R219PF7JTIS30V", "Overall": "4.0", "Content": "I have been using this for a few weeks and I haven't had any problems. It's nice and light, and it's pretty thin too. The back has a soft touch feel. The display is nice and has good viewing angles. The plastic does creak a little when you are holding it. That's really one of the only things I don't like about it. Also, the 8\" version only has one speaker. I was really expecting 2 speakers. I have had two other 8\" tablets and they both had a 4:3 aspect ratio. I think I like that better than the 16:9 ratio that this tablet has. It's just easier to hold and I'm more used to it. I would have given this 5 stars if it did have the dual speakers, the plastic didn't creak, and it was 4:3.", "Title": "Nice tablet", "Date": "May 12, 2014"}, {"Author": "Kelvin", "ReviewID": "RTHE0LXEP2AI", "Overall": "5.0", "Content": "This is my first tablet. I have thoroughly enjoyed it so far.  I use it to watch moves, check email, browse the net, get on FB, play games, update my calendar - same as my phone, but bigger.  The screen and quality are excellent. I even fell asleep on it once, and it still works like new. Not sure how it stands up to a Samsung table or the IPad, but this has been a great little investment for me and provides everything I need in a table (especially great wifi connection).", "Title": "I love my new tablet!", "Date": "June 5, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00JAIEAU4", "Features": null, "ImgURL": null, "Name": null}}