{"Reviews": [{"Author": "Thom Loomis", "ReviewID": "R26082GE0ETYXF", "Overall": "5.0", "Content": "I continue to learn new capabilities of The Samsung Galaxy Note Pro every time I use it. I previously used the Galaxy Tab 2 and the Note Pro is a giant leap forward. Tremendous display, syncs with other accounts and apps seamlessly. Extremely east to set up and use right out of the box. The capabilities of the pen and the choices of settings the pen allows make it feel just like writing on a legal pad. Battery life is tremendous. I highly recommend this tablet to anyone considering a tablet purchase. Having the Note Pro has reduced my laptop use by at least 50% daily. Very easy to carry just like a legal pad. A big +1 in my opinion!,", "Title": "Outstanding device!", "Date": "May 24, 2014"}, {"Author": "U2", "ReviewID": "R3JLI0FIGXVAAB", "Overall": "5.0", "Content": "Finally decided to give another tech company a shot after 8+ years of Apple iphones and ipods. And I'm so glad I did. Samsung look, feel, features and OS is light years ahead of Apple. Somehow overnight Samsung jumped beyond the competition and created superior products. I even have a Samsung refrigerator. Their smart TV's are also wonderful. If they made one, I'd buy a Samsung car. I'm sold on the brand.", "Title": "Hello Samsung - goodby Apple", "Date": "May 25, 2014"}, {"Author": "RobT", "ReviewID": "R39I5IPR37HY6C", "Overall": "5.0", "Content": "This is probably one of the best tablets I've ever used.  I have all the generations of iPads, they're good but this thing is great!  I'm very satisfied with it's performance.  Multiple windowing is awesome, the resolution is incredible, the speed is amazing.  If you're in the market for a higher priced tablet, I'd say go with this one.  I haven't found anything that I don't like about it.", "Title": "Holy Tablet Batman!!", "Date": "May 22, 2014"}, {"Author": "Julie", "ReviewID": "RD7T1UHCE2HAV", "Overall": "5.0", "Content": "Thanks to Windows XP support slowly expiring I needed a new laptop and at the same time a tablet for school (we are using mostly ebooks.) I realize this might not be a complete laptop alternative for some people, but I really only need to create/edit documents (word, excel), web browsing, and media consumption - all of which this tablet does for me.The tablet is larger than others so it does take adjusting, but I already love it. I also have the Galaxy Note 3 and it actually makes my phone feel small! It is heavier than smaller tablets, but considering the size I don't know if you could expect it to be much lighter.The android version of office is very nice and offers a familiar feel. I ordered a blue tooth keyboard (the Anker model.) I think it would become tedious to type long documents using the tablet alone, but the keyboard pairs nicely and works great.I love that it has an expandable micro SD slot as the bloatware does take up space. I stick with ScanDisk models because I already know and trust their products.The screen display is very nice. It has a nice crisp picture. As other's have stated it has the same resolution as the 10.1\" models so technically the smaller screens will look better - but I personally haven't noticed much of a difference. I haven't had any problems with lag. Nice work Samsung!I rooted the device and synced all my game progress from my phone and games like Plants vs Zombies look awesome on a big screen. I look forward to learning even more things I can do with this device.PS. The multi window feature is awesome! I love being able to run multiple apps at a time and didn't realize how useful this would be. As mentioned I am rooted so I can multi-window any app;)", "Title": "Love this!", "Date": "April 24, 2014"}, {"Author": "Richard Smith", "ReviewID": "R17M4HMHHALXWK", "Overall": "5.0", "Content": "Needed a device that crossed the boundary between my every day work requirements and the desire to be a bit More creative.I read a lot of documentation and Wanted an alternative to wheeling up and down with a mouse.l Wanted to be able to  annotate Screen shots.I wanted to compare two Sources or read and Make notes like I do with my dual Monitor Setup at My desk.l needed to be able to remote desktop Into My work PC.I find using a laptop on a train gives me a Sore neck  I wanted an alternative to typing for the train and for when I work In front of the TV.I wanted to try Evernote premium as this Would allow me to do all these things from one Place.I am left handed and found that other devices were uncomfortable and difficult to use with a pen.l have been using my note pro 12.2 for a week now And I an extremely pleased It does everything I wanted it to do.Things that Suprised me.Facebook chatting using the pen to write on the train Is a lot more relaxing and a lot less frantic then using your thumbs.The Screen size is great the split Screen really Makes it possible to Complete Most of the everyday work tasks.The google play store credit was great to have it allowed me to grab a few extra apps without feeling the need to analyse them all.This device really works Well the learning Curve on the pen was two days for me. All the other expected hardware related benefits are there.In Summary If you have to work long hours and you are prepared to adapt a few of your work processes to enable access to your documentation this device is by far the best I have found available at this time. It gives you options and it switches things up a bit from the desktop environment. The screen size and pen have been really exciting additions to my daily grind.", "Title": "Fully integrated into my work process in two days.", "Date": "April 4, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R27W81XE5QSZHV", "Overall": "5.0", "Content": "This is by far the best all purpose productive tablet available to date. The build quality is excellent. For students it is the mostuseful tablet for taking notes in class, while reading books, and on-line articles and news.  With the free software from Samsung foroffice with Microsoft Office compatibility it turns the tablet into a laptop. The software for typing letters, articles, and more is the best availablefor any tablet. And finally, the S pen app for taking handwritten notes is simply a dream to write your thoughts down digitally. On balance a quantum jump in tablet experience.  Some makers think customers want to use a tablet just for entertainment, Samsung's tablets are great for that, but more importantly their's is extremely productive for mature adults.", "Title": "Great screen, Great multitasking, Great Productivity: What's not to like?", "Date": "April 2, 2014"}, {"Author": "T. Martin", "ReviewID": "R13Z7RPABK38M4", "Overall": "5.0", "Content": "Just got this last night at a retail store, I primarily use an Apple iPad 4th gen, Ipad Mini Retina and MacBook Pro 13\" Retina.  Most other devices I have tried suck bad -- the slate, the Surface 1, etc. etc.  I bought this primarily for taking notes during meetings.  My early impression is this device is awesome for business.  The Google Drive integration, the S Pen Writing and the Dropbox integration with everything is great.  The multi window feature and scrapbooking pages on the fly is equally awesome.My early impressions is this will become one of my favorite devices.  I will update once I have used it some more.", "Title": "Light, Fast, Gorgeous Screen, Solid OS  -- Early Opinion is it is GREAT!", "Date": "March 31, 2014"}, {"Author": "Robert Novak", "ReviewID": "R3UU0SLF5S0CKK", "Overall": "5.0", "Content": "I'm very picky when it comes to my computing devices. Android has generally fallen out of favor for me as a mobile OS, however this device makes a very strong case for it.A little background, I'm a Professional Software Engineer, decently educated, and very hard working. From about 7 am until about 11:30 PM I am consistently looking at a screen.The screen on the Note Pro is an absolute delight to gaze at, even for hours on end. If there are any defects, I cannot see them. Pictures look gorgeous, and reading/writing is an absolute delight. (the Zagg Case however, is a different story).Drawing on this tablet, whether it be in S-Note or Sketchbook Pro is delightfully painless. Coming from an iPad, this is a great surprise. Resultant output from pen input is roughly equivalent to the same results achievable (at least for me).For professional level diagrams, this has been a great tool so far, and as my familiarity with the device grows, so will it's usefulness.", "Title": "Absolutely Wonderful Device", "Date": "February 21, 2014"}, {"Author": "almost_an_engineer", "ReviewID": "RZ6W78HSYVECV", "Overall": "5.0", "Content": "I bought this to use primarily to use in school! I LOVE the 12 inch screen. 10 inches has always seemed a little small for taking notes and this is perfect. The stylus is excellent and S-Note works very well! This is my first time using Android as I've always been an Apple guy myself, but so far I'm liking the new experience. There is a learning curve though! It's definitely not as simple as an iDevice, but that's no surprise. It runs fast and it has a great battery life. There's a little lag sometimes when opening split screen apps, but it's not worth taking a star off of the review.", "Title": "Great purchase by a college student!", "Date": "February 21, 2014"}, {"Author": "CDR Neutron", "ReviewID": "R48CUP9T3QAIQ", "Overall": "4.0", "Content": "I have numerous tablets with this being the latest I've tested. I am seeking to find the right tool to basicly replace my laptop and allow me the same capabilities in a form factor a 6'2\" guy can use on an ever shrinking airplane. This is the best I have now! I think it blows away my IPAD 3 (something I never thought anyone but Apple would do). It is NOT ready to do everything a laptop can, but I see that SAMSUNG is getting closer than anyone else.I think it is worth the money. Definitely.", "Title": "Now we are getting somewhere!", "Date": "April 8, 2014"}, {"Author": "Armando Ramirez", "ReviewID": "R2I688OO2PTL0Y", "Overall": "5.0", "Content": "Great gadget. Awesome screen. Excellent quality In every material. Magazine software could work better. Multiscreen is good and useful. 9.5 .", "Title": "bigger is better", "Date": "April 27, 2014"}, {"Author": "College Student Barber", "ReviewID": "RP65DH87ZBG9D", "Overall": "5.0", "Content": "i have sm-p9000zwfxar 64gb 12.2 bought for $800. If you like value don't get it. Its about $100 over priced in my opinion. Solid and good tablet for note taking which is what it's made for. It's android so you get so much more utility over an iPad, I have both.", "Title": "Great tablet, $100 overpriced in my opinion", "Date": "April 25, 2014"}, {"Author": "B. Just", "ReviewID": "R1TQH6R5L1YO6G", "Overall": "5.0", "Content": "This tablet is a perfect fit for me. The apps that were included such as drop box, remote PC and the Hancom suite provide all the flexibility I require in a tablet. I also purchased a USB 3.0 9 pin flash disk adapter cable. I store videos on thumb drives and view them on the tablet. I very rarely use my desk top computer any more. Stopped delivery of the newspapers. My wife and I eash have Samsung tablets ( she has a Galaxy note 10.1) so no more waiting for the newspaper to be delivered in the AM. All our favorite news feeds are on the tablet and we have more room when we have our coffee at the kitchen table.", "Title": "Samsung Galaxy Note Pro 12.2 (64GB, Black)", "Date": "April 23, 2014"}, {"Author": "Yvonne McKnight", "ReviewID": "R2XQK1M0CMP5ET", "Overall": "5.0", "Content": "This is the best tablet that I have brought, and I have quite a few, Nexus 7, Windows Surface, just to name a few.  My Samsung Galaxy Note Pro 12.2 is the bomb, it far exceeds all the rest...", "Title": "Samsung Galaxy Note Pro 12.2 beats all", "Date": "April 22, 2014"}, {"Author": "jogenova", "ReviewID": "R34OSTLUS9HYNM", "Overall": "5.0", "Content": "I Love this thing. I've had mine for 2 weeks now .this is my 3rd TABLET and there is no comparison. I thought the size would be combersomb but its not bad at ALL. IM writing this Review using the stylus pen. I write Like Im using paper and it transfers it to text.  f*$@ing Amazing!", "Title": "I LOVE IT!", "Date": "April 21, 2014"}, {"Author": "Bohemian Girl", "ReviewID": "R1DX9LTKEQDJ6P", "Overall": "5.0", "Content": "My husband ordered my note pro for me  thru Amazon. I got the white, 12.2, 64 GB.I do not use it for business. This was over kill for me in the professional department.For me, the screen size is perfect for watching movies, reading books and news, playing games etc.The weight is just fine for me. I normally have it setting on my lap. Perhaps for a business person it may be a bit cumbersome.The note pro comes with goodies. A free year of Bloomberg, NY Times, Amazon Prime, and Samsung discounts.A tiny part of me wishes I could have waited for 4G capability.", "Title": "Perfect in Every Way", "Date": "April 19, 2014"}, {"Author": "Marc Gaynor", "ReviewID": "R3RAJOPKFL6XPN", "Overall": "5.0", "Content": "This isn't a PC replacement,  but it is a fantastic tablet in general. Only took a week to integrate into my workday. It is big, but that was one of the appealing factors for me. The price is justified, in that it does the things I want it to do in the manner I want to do them.About the only drawback is for Amazon, who I bought this tablet through. Since I can't stream amazon digital video purchases on an Android device (that isn't a Kindle that is), I have lost a major incentive to renew my prime subscription with them.", "Title": "Fantastic tablet.", "Date": "April 15, 2014"}, {"Author": "J-Man", "ReviewID": "R36PUGJ7WBXKUP", "Overall": "5.0", "Content": "Love the 12 inch format and handwriting  ability. I like to draw (not very good at it ) but hate to type. I'm not a student or businessperson but I like this tablet . I use the handwriting for almost everything. Had the original Note 10.1 first but like the 12inch better .Kind of $$ but this is my computer. This is just what I was looking for  .", "Title": "Galaxy note pro 12.2", "Date": "February 23, 2014"}], "ProductInfo": {"Price": "$849.99", "ProductID": "B00JQAFO92", "Features": "Android 4.4 Kit Kat OS, 1.9GHz Samsung Exynos 5 Octa processor\n32 GB Flash Memory, 3 GB RAM\n12.2-inch 2560x1600 WQXGA Display\nFeatures Hancom Office, Multi Window (up to 4), Magazine UX, Remote PC, Sidesync\nIncludes Samsung Bluetooth Keyboard Stand/Cover Accessory", "ImgURL": "http://ecx.images-amazon.com/images/I/41woa-VpXLL._SX300_.jpg", "Name": "Samsung Galaxy Note Pro 12.2 Keyboard Bundle (32GB, Black)"}}