{"Reviews": [{"Title": "Good tablet in 10\" range, better resolution was expected", "Author": "rpv", "ReviewID": "R1E3E93MNC6P9I", "Overall": "4.0", "Content": "Samsung has done it again. They are releasing tablets at very periodic intervals. Samsung's fourth generation of Galaxy Tab series is as expected and for this price point phenomenal. I have been using Galaxy Tab 2 and 3 and I am very much impressed with Galaxy line of devices.  In my opinion 8\" is the maximum value for the money and features and hence I gave 8\" a 5 star. If you are looking for playing games/reading books, 10.1” is good. I really wish this had a better resolution. Hence only 4 stars for pixels per density for this tablet.Samsung has introduced 7\", 8\" and 10.1\" of the Tab 4 series. This year the space has become crowded as Samsung also has 8.4”, 10.1” and 12.2” Tab Pro Series. They are pricier, but if you can afford I very STRONGLY suggest you get the PRO series just for one thing - RESOLUTION. I was really hoping the Tab series will go to a larger resolution. But again price/performance is a factor that drives Samsung to make devices at all ranges.Let's start off with salient points of all of the Galaxy Tab 4 series. I will later compare with the previous Tab 3 models. I have also listed brief specs of current leading tablets at the very end if you would like to really compare and shop. If you have Tab 3, don’t upgrade. No need to. Those devices worked well a year back and still are. The photos look just as beautiful on them as they did a year ago!Some Tab 4 specs have certainly become better, but not in a revolutionary sense. The pixels per inch ppi is the best in 7” among all of Galaxy Tab 4 series. That is because all have same resolution and size is the variable. For a first time user, you will be blown away by the feature set now. The tablets have multi user profiles, so each user can customize like a home PC.Look at three specs that really interest you and nail down the tablet you need. Look at the big picture, what you want from a tablet now, a year from now, what your family needs out of this and make a decision.7-inch Galaxy Tab 4 tablet: 1280x800, 216 ppi, 1.2 GHz Quad-Core, 1.5GB RAM, 8GB built-in storage (ROM), a microSD card slot (up to 32 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 9.74 oz. (276 grams). Android 4.4.28-inch Galaxy Tab 4 tablet: 1280x800, 189 ppi, Qualcomm Snapdragon 400 1.2 GHz Quad-Core, 1.5GB RAM, 16GB built-in storage (ROM), a microSD card slot (up to 64 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 11.1 oz. (315 grams). Android 4.4.210.1-inch Galaxy Tab 4 model: 1280x800, Qualcomm Snapdragon, 149 ppi, 1.2 GHz Quad-Core, 1.5GB RAM, 16GB built-in storage (ROM), a microSD card slot (up to 64 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 17.3 oz. (490 grams). Android 4.4.2Look at the salient points of all of the Galaxy Tab 3 series.7-inch Galaxy Tab 3 tablet: 1024 x 600, Marvell dual-core 1.2GHz processor, 1GB RAM, 8GB built-in storage (ROM), a microSD card slot (up to 64 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 10.58 oz. (300 grams). Android 4.1.28-inch Galaxy Tab 3 model: 1280 x 800, Exynos 1.5GHz dual-core processor, 1.5GB ram, 16GB of built-in storage (ROM), a microSD slot (up to 64 GB), Camera: 5MP rear-facing, 1.3MP front-facing and weighs 10.9 oz. (309 grams) Android 4.210.1-inch Galaxy Tab 3 model: 1280 x 800,  Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, a 16GB built-in storage (ROM), a microSD slot (up to 64 GB), Camera: 3.2MP rear-facing, 1.3MP front-facing and weighs 17.99 oz. (510 grams). Android 4.2I am not going into other details like accelerometer etc. as they are all standard these days, Audio support - AAC, AMR, MP3, OGG, WMA/ASF, 3GA/M4A, FLAC, WAV; MP3/MP4/Music Tones; Music Player; Ringtones, Polyphonic. Video support: AVI/DIVX, WMV/ASF, FLV, MKV, MP4/3GP, WEBM; Video Player; Video Streaming.The 10.1\" has a physical home button so are others in the series.  Also has capacitive Back and Menu buttons. Camera is a 1.3-megapixel front-facing camera for skype, and a 3-megapixel rear-facing camera. It is also equipped with an IR blaster so it will work as a universal remote on both your TV and cable box. Camera is only so and so, and I will not rely on it to produce outstanding photos. Weighs very lightweight. SD card capability is awesome! With prices plummeting for microSD GB cards, it is a great boon. Put all your music, books, photos on the SD card and you have a powerful computer in hand always! I personally use the 64 GB microSD card on my mobile devices. Get this mobileUltra (SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging.This has Bluetooth 4.0\" and have USB Host. USB Host is one of the most under noticed features of Androids and is in my opinion one of the best features compared to iPad lines. What this means you get a USB Host cable also otherwise called OTG (On the Go) cables and plug in your USB thumb drive or other USB devices and the device recognizes it. I have used it with Alfa AWUS036H for a wireless project with Android PCAP Capture from reputable Kismet wireless.  GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up). I personally use Navigon from Garmin and have downloaded several apps.Finally, believe me, don't get mired in the spec game. All devices perform most of common functions.7” Tab is smallest, portable8” Tab is biggers, readable8.4” TAB PRO awesome crisp resolution - Best pixel density of all 6 Tab 4 and TAB Pro versions10.1” TAB gameplay10.1” TAB Pro games/books/sharper resolution12.2” Bring on the books and Glossy magazines!If you are reading books, browsing, listening to music, looking at photos, playing games 10.1\"is definitely great. Samsung is creating markets for all form factors and I would consider this as an exploratory stage. Just like Ford or Toyota has cars in different shapes, sizes and price range, so are the tablet vendors now. Remember the laptop wars, 10\", 12\" 13\", 15, 17 and even some 19\" if I remember right few years ago. We used to debate endlessly which laptop sizes are better, which has better speakers and so on. The time has come to fight it out for tablets!I tried following apps and they just worked awesome. A tablet is only as good as the apps you have and how productive it makes you. It's almost like the camera/lens analogy in the DSLR space. What good it is to have a great DSLR body if you have no good lens? Same with Tablet body and apps you have.WolframAlpha (I can go on for hours praising this. This is a truly genius app powered by hundreds of supercomputers in the background. Wolfram is a computational genius).Withings HealthMate. (another remarkable app great UI/UX). I am getting the Pulse device as soon as it hit stores.)Aldiko Book Reader Premium (absolutely love it)Amazon MobileAndroid Central app (great and must have for Android users)Amazon App StoreBattery Monitor Widget Pro (a great app)BeyondPod (excellent for podcasts, I haven't used Pocketcast, some friends say it is very good too)BoxChromeDictionary M-W PremiumNAVIGON (from Garmin - offline maps)Google Navigation/Earth/Maps using a portable MiFi boxGoogle Currents (nice way to read News)Google Keep/Keyboard/Drive/Search/Books/Voice/HangoutsEbayLinkedinGoogle Music (Awesome, I have now upto 10,000 songs halfway through Google's 20K Limit)Tapatalk HD (awesome forum browsing app)Microsoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTweetCaster Pro for AndroidSkypeRealCalc Plus (Awesome calculator app)Tweetcaster Pro (again awesomeness)Plenty of WidgetsAsk questions, the reviews cannot do full justice. I will be glad to answer any questions and usually answer within 24 hours to any query.APPENDIX: Overview of other tablets in the market.Samsung Galaxy TabPRO 8.4-Inch {B,W}, WQXGA 2560 x 1600, 359 ppi, 2.3 GHz Qualcomm Snapdragon 800 quad-core processor, 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB, 8MP Rear + 2MP Front, 331 gm, Android 4.4 Kit Kat OS, 8.62 x 5.06 x 0.28 in, microUSB, GPS yes. 4800 mAh battery (best resolution on a tablet!)Samsung Galaxy TabPRO 10.1 {B, W}, WQXGA 2560x1600, 298 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB, 8MP Rear + 2MP Front, 469 gm, Android 4.4 KitKat, 9.57 x 6.75 x 0.29 in, microUSB, GPS: y, 8,200mAh batterySamsung Galaxy TabPRO 12.2 {B, W}, WQXGA 2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32GB/64GB Flash, microSD upto 64 GB, 8MP Rear + 2MP Front, 732 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.31 in, microUSB, GPS: y, 9500mAh batterySamsung Galaxy NotePRO 12.2 {B, W}, WQXGA 2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32/64 GB Flash, microSD card slot up to 64GB, 8MP Rear + 2MP Front, 748 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.33 in, microUSB 3.0 port with backwards compatibility with microUSB 2.0, GPS - y, 9500mAh battery, S-Pen, NFC, Ethernet connectivity via adapter.Kindle Fire HDX 8.9\" model: 2560 x 1600, 339 ppi, Snapdragon 800 2.2 GHz quad-core, 2 GB RAM, 16/32/64 Flash Memory, No microSD card, 8MP rear-facing camera, front-facing 720p HD camera, 374 grams, FireOS 3.0, 9.1 x 6.2 x 0.31 inches, microUSB, GPS:no [cellular versions have GPS]Samsung Galaxy Note 10.1\" 2014 Edition: 2560x1600, 299 ppi, 1.9GHz Samsung Exynos 5420 Quad-Core Processor, 3GB RAM, 16/32 GB Flash Memory, microSD slot:yes(upto 64 GB), 8MP rear camera and 2 MP front-facing camera, 560 grams, Android 4.3 Jelly Bean OS, 9.57 x 6.75 x 0.31 inches, microUSB, GPS:yes. S-Pen (flagship),iPAD Air 9.7\" (2013): 2048 x 1536 resolution, 264 ppi, A7/M7/64 bit processor, Flash Memory: 16/32/64/128 GB, SD Card:no, 5 MP back, 1.2 MP front, 469 grams, iOS 7, 9.4 x 6.6 x 0.29 in, lightning port, GPS:no [cellular versions have GPS]Google Nexus 10\" model: 2560 x 1600, 300 ppi, CPU: Dual-core A15, 2GB RAM, 16/32 GB, SD:no, rear:5 MP, front:1.9 MP, 603g, 10.4\" x 7\" x 0.35\", mcroUSB, GPS:yesYou should come up with three top three specs you want and should be able to nail it down with the above spec. If you have doubts shoot me a comment, I can help! I hope the key specs I have consolidated here of all the tablets will help you narrow down and help in buying the right tablet for your needs.", "Date": "May 1, 2014"}, {"Title": "GREAT TABLET, GREAT PRICE!", "Author": "jwstaton", "ReviewID": "R2DRMFHAWQNZEF", "Overall": "5.0", "Content": "This is my review of the Samsung Galaxy Tab 4 10.1. This review is not incentivized by Samsung in any way. I purchased the product for my own use.What is it?The Samsung Galaxy Tab 4 is the aforementioned company’s latest foray into the midrange tablet market. With these tablets you’re not likely to find a “retina display” or anything over 720p resolution, but they’re more reasonably priced, and therefore, more likely to be adopted by more people.SpecificationsProcessor: 1.2 GHz Quad CoreMemory: 1.5GBStorage: 16GB with additional microSD slotDisplay: 1280×800Operating System: Android Kit Kat 4.4 with Samsung’s TouchWiz UIAs you can see, those specs really aren’t too shabby, but they’re definitely not bleeding edge technology. However, having the latest and greatest isn’t always the best. For example, I recently purchased the higher end Galaxy Tab Pro 12.2 and was utterly disappointed in it. Yes, the screen was beautiful but you could tell that not a lot of games had been properly coded for that resolution as the HD graphics appeared pixelated and blocky. Also, the Tab Pro suffered from massive lag and stuttering when when navigating through the operating system. You can read about my experience with that tablet here. It was promptly returned to Best Buy.Back to the Galaxy Tab 4.As mentioned earlier, it runs Kit Kat 4.4 with Samsung’s custom TouchWiz user interface over top. In my opinion, this isn’t a bad thing since I have never been a fan of HTC’s Sense UI. It sadly still comes packed full of bloatware that I almost always remove if possible.Initial ThoughtsBeing an ex-member of the cult of Steve Jobs, I am still getting used to the Android world and the lack of high resolution displays in some products. The Galaxy S5, which I own, has the best display and form factor on the market right now. Are you listening Apple? Thankfully, there are cheaper Android tablets available that still offer a high quality user experience.Once you go through the obligatory setup screens and sync your applications, the tablet is zippy and runs with no lag whatsoever. Overall memory utilization is low when using several apps at once and multi-tasking.DisplayOK, this is a 720p display. You will notice a difference if using an S5 and then the Galaxy Tab 4 – but let’s not compare the two. The 1280×800 screen is actually quite beautiful and bright. This is one of the brighter screens I’ve seen on a midrange tablet. Text is sharp as are the graphics, both are quickly rendered thanks to the 1.5GB RAM and quad core processor. Yes, I think it should be a 1080p panel, but it’s a $319 tablet.PerformanceI was able to open apps and switch between them fairly quickly. This little tablet is definitely more responsive than it’s bigger, more expensive brother. Even under heavy use the Tab 4 performed excellent. It’s able to handle video encoded to 1080p with no stutter, even though it’s obviously rendered at 720p on the screen. No complaints at all about performance.Final ImpressionsI’m still an Apple fanboy, just now living in an Android world. I really like the Galaxy Tab 4. It’s fast, responsive, light, and does what I need it to do. I feel like for the most part, I could ditch my laptop when traveling. That is, as long as I’m not running a GoPro, or editing HD video.The display is not as sharp as I like, but the applications and games I use are not upated to be displayed yet at the higher resolutions on the Tab Pro.Kit Kat has grown, the OS takes up about 4GB of the internal 16GB, and by the time you add-in the Samsung applications and associated bloatware, you have only about 9GB of usable space. That almost sounds like a Surface tablet, no? LOL Sorry, couldn’t resist. Samsung says the answer is to use a microSD card – which you will want to do immediately. They state on their site, that a maximum of 64GB is supported, although I am tempted to buy a 128GB and try it. I know those work in the S5.So, should you buy it? If you like new gadgets, sure. If you want a great performing Android tablet for a great price, absolutely. I can’t really find anything wrong with this little guy. It’s a keeper.UPDATEI pre-ordered the Galaxy Tab 4 on Amazon at $349. It was released May 1st, and it looks like the price was dropped to $319.99, making it an even better value.", "Date": "May 2, 2014"}, {"Title": "I like it BUT......", "Author": "Bruce", "ReviewID": "R2IWRCS7H5LI39", "Overall": "3.0", "Content": "Got our Galaxy 10.1 and were very anxious to get started with it. Everything went fine until we tried to link up devices with bluetooth. We like it BUT it turns out that some of these tablets have problems with Bluetooth and we must have gotten one of them. Other than that so far it has been good. I need to contact Amazon and find out what can be done about the Bluetooth issue.Note: I did do some research on this and found that Samsung does not have a fix and they really do not seem to know what to do about it. So if you want to purchase one make sure it will scan and detect bluetooth devices before you purchase it.", "Date": "May 18, 2014"}, {"Title": "I believe that this is the best tablet on the market.", "Author": "EmeraldMeadows", "ReviewID": "RZDHCJ7DPR252", "Overall": "5.0", "Content": "This product is an iPad crusher. I have several iPads, iPhones, iPods and Mac computers. I love Apple products but this Samsung Tab 4 is better, faster, easier to use and comes with a host of standard features that Apple does not even have available such as opening most attachments, file system connectivity and what I love is the enhanced print features. Finally, there's the price. At half the price there is no question that this is the tablet to buy.", "Date": "May 20, 2014"}, {"Title": "Love this Tablet", "Author": "B McKenzie \"B McKenzie\"", "ReviewID": "R3GUY4EIZ9EB7X", "Overall": "5.0", "Content": "Extremely lightweight and very fast processing. I bought the Samsung stylus (Here on Amazon) to use with it and it has exceeded my expectations.", "Date": "May 12, 2014"}, {"Title": "fast shipping and great tablet~~!!", "Author": "gongho koh", "ReviewID": "R1WGYMORBU4GMZ", "Overall": "5.0", "Content": "I love this Tablet. Processor is very fast. Couldn't ask for a better Tablet. Thank youin the future ill buy another one :))", "Date": "May 27, 2014"}, {"Title": "5 Star Product - 5 Star Customer Service - 1 Star Quality Control.", "Author": "Lip Gallegher", "ReviewID": "R2XX9QEAM94VN3", "Overall": "5.0", "Content": "The product is perfect and I'll get to that in a minute, but something else needs to be addressed.Amazons quality control or shipping control needs to be checked, or maybe its the carriers? I'm not sure.I personally know my local USPS does not handle packages like some Fedex and UPS workers we've all seen in Youtube viral videos destroying packages. I can't speak for the rest of the shipping team in other parts of the city and country. The box it arrived in wasn't damaged at all though, it had a minor crease in it, can't even call it a dent. The Tablet however arrived with a crack in the upper left hand corner of the screen, which at first seemed very minor and my mother still loved the gift and decided she would keep it anyway due to her being old and not caring for superficial things like us modern day kids do. However, almost a week later she started to complain to me that she couldn't figure out how to use some of the features correctly. I inspected the product further and after some testing I noticed about a quarter of the screen where the crack was located was not functioning properly. While there were no cracks in the screen itself, only the glass protecting the screen, the finger sensor was not reading her finger so when she tried to click on things to swipe it didn't work in that specific region leading to almost all if not all the apps not working properly.Talking to Amazon they offered a replacement or refund, I would rather have a replacement considering my moms loves the idea of being able to watch T.v and E-mail from anywhere. I opted for that and now I'll be receiving a replacement in a few days.Overall happy, just wish it didn't come as it did.The product however 5/5 Stars, its a tablet on steroids, No need for overpriced Ipads.", "Date": "May 15, 2014"}, {"Title": "super", "Author": "Richard C. Briggs", "ReviewID": "R2HKUQJ8T542U7", "Overall": "5.0", "Content": "I love these tablets, I take care of the tablets for are company, and being able to find these deals really helps a lot.", "Date": "May 27, 2014"}, {"Title": "Best Tablet out there", "Author": "M. Johnson", "ReviewID": "RTBRWSMC02PFA", "Overall": "5.0", "Content": "I love this Tablet. The battery life is incredible!! Processor is very fast. Couldn't ask for a better Tablet. Thank you", "Date": "May 26, 2014"}, {"Title": "Amazon does NOT stream on Android Galaxy Tab", "Author": "Gymnastics Mom", "ReviewID": "RXHP2AEKM6YEE", "Overall": "3.0", "Content": "I purchased my Samsung Galaxy Tab 4 from BigBox (cheaper price than Amazon at time of purchase). I LOVE the tablet. Beautiful picture, best keyboard (allowing SWYPE), easily add storage, responds quickly, simple to use. HOWEVER, this table will not allow user to view Amazon video on this device. Contacted Amazon. Received note that Amazon video currently does not stream over Android. So, sadly, I am returning to store. If you have no need to stream Amazon video, then this issue will, of course, not affect you. Good Luck.", "Date": "May 27, 2014"}], "ProductInfo": {"Price": "$349.99", "Features": "Android 4.4 Kit Kat OS, 1.2 GHz quad-core Qualcomm processor\n16 GB Flash Memory, 1.5 GB RAM Memory\nWXGA Display (1280x800 Resolution)\n64GB of memory available through a microSD slot and 50GB of free Dropbox storage\nComes with over $300 of free content and services", "Name": "Samsung Galaxy Tab 4 (10.1-Inch, Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41DYk8EttbL._SX300_.jpg", "ProductID": "B00JKCH4X0"}}