{"Reviews": [{"Title": "Amazing quality and performance at a very good price point!", "Author": "jjceo", "ReviewID": "R2U3BHQXFZ81CN", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo31FZZI9404I7YembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo31FZZI9404I7Yrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo31FZZI9404I7YchiDiv\").innerHTML = document.getElementById(\"cv_mo31FZZI9404I7YhiddenPre\").innerHTML;\n};\ncv_mo31FZZI9404I7Yrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo31FZZI9404I7Yso;\t   \n\n\nfunction cv_mo31FZZI9404I7YloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo31FZZI9404I7Yso = new SWFObject(swfLocation, \"cv_mo31FZZI9404I7YAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo31FZZI9404I7Yso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo31FZZI9404I7Yso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo31FZZI9404I7Yso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo31FZZI9404I7Yso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo31FZZI9404I7Yso.setAttribute(\"height\", swfHeight);\n          cv_mo31FZZI9404I7Yso.setAttribute(\"width\", swfWidth);\n          cv_mo31FZZI9404I7Yso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo31FZZI9404I7Yso.write(\"cv_mo31FZZI9404I7Yflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo31FZZI9404I7Y', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo31FZZI9404I7Y';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo31FZZI9404I7Y', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo31FZZI9404I7YloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo31FZZI9404I7Y\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"180-0047172-1480865\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m236RGEJEIIAL2\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m236RGEJEIIAL2\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2U3BHQXFZ81CN\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m236RGEJEIIAL2/180-0047172-1480865\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/180-0047172-1480865\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo31FZZI9404I7Yduration')) {\n      document.getElementById('cv_mo31FZZI9404I7Yduration').style.display='none';\n    }\n    cv_mo31FZZI9404I7YloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo31FZZI9404I7YloadSwf(movieID, playerVersion) {\n   return _cv_mo31FZZI9404I7YloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo31FZZI9404I7YnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo31FZZI9404I7Y', 0, h);\n}\n\nfunction cv_mo31FZZI9404I7YresetPlayer(w,h,bw,cc) {\n  cv_mo31FZZI9404I7YnewHeight(h);\n\n  cv_mo31FZZI9404I7Yso.addVariable(\"resetBandwidth\", bw);\n  cv_mo31FZZI9404I7Yso.addVariable(\"cacheCode\", cc);\n  cv_mo31FZZI9404I7Yso.setAttribute(\"height\", h);\n  cv_mo31FZZI9404I7Yso.setAttribute(\"width\", w);\n  cv_mo31FZZI9404I7Yso.write(\"cv_mo31FZZI9404I7Yflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo31FZZI9404I7YRollOverImg = new Image();\ncv_mo31FZZI9404I7YRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81%2BlFtrq%2BaS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo31FZZI9404I7Ypreplay = document.getElementById('cv_mo31FZZI9404I7YpreplayImageId');\nif (cv_mo31FZZI9404I7Ypreplay) {\n  cv_mo31FZZI9404I7Ypreplay.onmouseover = function() {\n    cv_mo31FZZI9404I7Ypreplay.src = \"http://ecx.images-amazon.com/images/I/81%2BlFtrq%2BaS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo31FZZI9404I7Ypreplay.onmouseout = function() {\n    cv_mo31FZZI9404I7Ypreplay.src = \"http://ecx.images-amazon.com/images/I/81%2BlFtrq%2BaS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo31FZZI9404I7Ypreplay.parentNode;\n\n  var cv_mo31FZZI9404I7YcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_mo31FZZI9404I7Y/180-0047172-1480865?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo31FZZI9404I7YcurrentClick) {\n      return cv_mo31FZZI9404I7YcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:48 MinsI own a lot of different tablets but this is my first Samsung and let me say that I am impressed. I went to the store to buy a 7 inch unit but quickly decided to upgrade to the 8 inch version. There were several features that I was concerned about and the 8 inch unit just fit my needs better.* Larger screen size for reading* More basic internal memory at 16 GIG versus 8 GIG for the 7 inch unit* The ability to upgrade to a 64 GIG SD card instead of just 32 GIGJust remember that in my experience your need for more memory grows as you use your tablet more and if you buy a smaller memory upgrade capability you may regret it. The price difference on launch day was only $40 more. I already own 8 tablets in my family so my experience has proven this need for more memory. As you add more books and more apps the memory slowly gets eaten up. I went ahead and also purchased a Samsung 64 GIG Micro SD memory card and I got a Class 10 Pro series at a cost of $55. It reads at 70 MB/s and a write speed of 20 MB/s. For under $300 you will have a powerful tablet that has more memory (80 GIG) than a 64 GIG iPad Mini for a much lower price.Here is the link to the Samsung Memory that I purchased:Samsung 64GB MicroSD XC Pro Class 10 UHS-1 Read Speed 70mb/s Write Speed 20mb/s MB-MGCGB Ultra Fast Speed Memory Card with SoCal Trade, Inc. Memory Card ReaderSome other key features are:* A powerful Qualcomm quad core CPU operating at 1.2 GHZ ( You can see the speed in using the tablet)* 1280 by 800 pixel display* A 3 MP rear facing camera* A 1.3 MP front facing camera* It weighs in at 11 ¼ ounces per my scales* Bluetooth 4.0* Internal 16 GIG of flash memory and it goes to 80 GIG using a 64 GIG Micro SD card (Use a high quality Class 10 Micro SD card)* 1.5 GIG of internal RAM* A 4450 mAh internal battery pack* Android 4.4 operating system Kit Kat* 1080P playback and recording* A built in IR blaster to control your TV and other infra-red devices and an App called WatchON the help you control your TV and see what is playing on your cable service.* The tablet comes with a 31 inch charging and data cable that is a Micro USB on one end and a USB on the other.* It comes with an AC wall charger that outputs 5 VDC at 1 Amp and it will operate on 100 to 240 VAC and 50/60 HZ.* It features a power multitasking function that lets you see and use two apps simultaneously which is something that an Apple iPad cannot do. Very nice feature!* You can set up multiple users and limit the apps that they can see and use.* You can set up a child friendly and protected user interface.* You get $300 worth of free contentI found this tablet to be extremely versatile and very fast. The quad core processor is very impressive and browsing the internet was fast and easy. Adding my Gmail account to the tablet literally took a minute. I put together a video to show you the locations for the controls and what the tablet looks like. It is a bit long and I couldn't even talk about all of the items that I wanted to include. I apologize for the length of the video but I get excited over good technology. Overall the tablet is impressive and it is well worth the money based on the quality and performance that I have seen. I rate it as a 5 star item.You can register your device with Samsung Galaxy Perks and get more free items:* A $10 credit on the Google Play Store* 3 months free of Hulu plus* 1 year free of Boingo WIFI* 50 GIG of free Drop Box cloud storage for 2 years* Sirius 3 months free* 3 free audible books for new members* 3 digital magazines free on Zinio for 2 months* A free Polaris OfficeUpdate May 2, 2014:Last night I installed the Amazon AppStore and the Amazon Kindle reading app. I down loaded over 950 books and I was blown away by the speed of the downloads. The CPU and strong WIFI connection really shines with its speed. I was using a strong 2.4 GHz WIFI and I downloaded the speedtest app from Google Play and I could download data at 13.36 Mbps and upload data at 2.09 Mbps. Since I am on ATT Uverse that is a reasonable result. The tablet can use either a 2.4 GHz or a 5 GHz WIFI channel. On the 5GHz frequency I got 17.71 Mbps download and 2.24 Mbps upload.I used the Amazon AppStore as I own over 1000 apps and it was fast and easy to download many of them. I could transfer them to the SD card to conserve my internal memory. I had to do this manually on some of the apps and others went to the SD card automatically.The sound of the speaker is pretty loud for its size. I paired the tablet with a Bluetooth speaker and the process is fast and easy. I use Bluetooth a lot and I was glad to see it work so well and Bluetooth 4.0 is the low power version to help reduce battery consumption.Over three hours of continuous work the battery dropped from 98% to 62% which is pretty good considering I downloaded over 950 books and 35 apps. I love the fact that I can use my Amazon books and apps so easily and still have access to the Google Play Store to download utilities and apps that are not available on Amazon. It is like having the best of both worlds.Photographs are easy to take and edit. I even shot some videos. I wanted to include some in my online video but there was not enough space and time remaining to do so.Using an app called Hangouts I was able to do face to face video calls and text messaging with my wife using our gmail account emails. The quality was as good as Facetime and the connection worked very well. I had to install the app Hangouts on my wife's iPhone 5S and the app is free on iTunes. The app was already installed on my Samsung Galaxy Tab 4.I continue to be impressed with the performance and capability of this tablet.I did want to add that the case is slippery and a little wide to hold so I suggest that you get a case to improve your ability to grip the tablet and hold it.", "Date": "May 3, 2014"}, {"Title": "The BEST of Galaxy Tab 4 series - BEST Pixel density of all", "Author": "rpv", "ReviewID": "R1L4LA673FVBNQ", "Overall": "5.0", "Content": "Samsung has done it again. They are releasing tablets at very periodic intervals. Samsung's fourth generation of Galaxy Tab series is as expected and for this price point phenomenal. I have been using Galaxy Tab 2 and 3 and I am very much impressed with Galaxy line of devices. I got to play with all of the three Samsung Galaxy Tab 4 series for few days. I like them that I am getting all three and selling last year’s model. First, if you have not had any tablets before, Get THIS! Yes, Get this 7\". It is ideal for plane trips, long journeys. I had used a 7\" Tablet on a long journey to listen to songs and read epub books (Aldiko) and it was a very pleasant experience. 7\" form factor is lightweight, compact and great. If you are a bit experienced and can afford it, I highly recommend the 8\". In my opinion 8\" is the maximum value for the money and features, but 7” has the best pixel density of all three Galaxy 4 series.  If you are just starting out 7” is great and prices will FALL further as year progresses.Samsung has introduced 7\", 8\" and 10.1\" of the Tab 4 series. This year the space has become crowded as Samsung also has 8.4”, 10.1” and 12.2” Tab Pro Series. They are pricier, but if you can afford I very STRONGLY suggest you get the PRO series just for one thing - RESOLUTION. I was really hoping the Tab series will go to a higher resolution. But again price/performance is a factor that drives Samsung to make devices at all price/performance ranges.Let's start off with salient points of all of the Galaxy Tab 4 series. I will later compare with the previous Tab 3 models. I have also listed brief specs of current leading tablets at the very end if you would like to really compare and shop. There are too many choices out there now in 2014. If you have Tab 3, don’t upgrade. No need to. Those devices worked well a year back and still are. The photos look just as beautiful on them as they did a year ago!Some of Tab 4 specs have certainly become better, but not in a revolutionary sense. The pixels per inch ppi is the best in 7” among all of Galaxy Tab 4 series. That is because all have same resolution and size is the variable. For a first time user, you will be blown away by the feature set now. The tablets have multi user profiles, so each user can customize like a home PC.Look at three specs that really interest you and nail down the tablet you need. Look at the big picture, what you want from a tablet now, a year from now, what your family needs out of this and make a decision.7-inch Galaxy Tab 4 tablet: 1280x800, 216 ppi, 1.2 GHz Quad-Core, 1.5GB RAM, 8GB built-in storage (ROM), a microSD card slot (up to 32 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 9.74 oz. (276 grams). Android 4.4.28-inch Galaxy Tab 4 tablet: 1280x800, 189 ppi, Qualcomm Snapdragon 400 1.2 GHz Quad-Core, 1.5GB RAM, 16GB built-in storage (ROM), a microSD card slot (up to 64 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 11.1 oz. (315 grams). Android 4.4.210.1-inch Galaxy Tab 4 model: 1280x800, Qualcomm Snapdragon, 149 ppi, 1.2 GHz Quad-Core, 1.5GB RAM, 16GB built-in storage (ROM), a microSD card slot (up to 64 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 17.3 oz. (490 grams). Android 4.4.2Look at the salient points of all of the Galaxy Tab 3 series.7-inch Galaxy Tab 3 tablet: 1024 x 600, Marvell dual-core 1.2GHz processor, 1GB RAM, 8GB built-in storage (ROM), a microSD card slot (up to 64 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 10.58 oz. (300 grams). Android 4.1.28-inch Galaxy Tab 3 model: 1280 x 800, Exynos 1.5GHz dual-core processor, 1.5GB ram, 16GB of built-in storage (ROM), a microSD slot (up to 64 GB), Camera: 5MP rear-facing, 1.3MP front-facing and weighs 10.9 oz. (309 grams) Android 4.210.1-inch Galaxy Tab 3 model: 1280 x 800,  Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, a 16GB built-in storage (ROM), a microSD slot (up to 64 GB), Camera: 3.2MP rear-facing, 1.3MP front-facing and weighs 17.99 oz. (510 grams). Android 4.2I am not going into other details like accelerometer etc. as they are all standard these days, Audio support - AAC, AMR, MP3, OGG, WMA/ASF, 3GA/M4A, FLAC, WAV; MP3/MP4/Music Tones; Music Player; Ringtones, Polyphonic. Video support: AVI/DIVX, WMV/ASF, FLV, MKV, MP4/3GP, WEBM; Video Player; Video Streaming.The 7\" has a physical home button so are others in the series.  Also has capacitive Back and Menu buttons. Camera is a 1.3-megapixel front-facing camera for skype, and a 3-megapixel rear-facing camera. It is also equipped with an IR blaster so it will work as a universal remote on both your TV and cable box. Camera is only so and so, and I will not rely on it to produce outstanding photos. Weighs very lightweight. SD card capability is awesome! With prices plummeting for microSD GB cards, it is a great boon. Put all your music, books, photos on the SD card and you have a powerful computer in hand always!I tried a OTG cable and  7\" does not support OTG.  I know for sure Tab 4 8\" supports as I tested it.  USB Host is one of the most under noticed features of Androids and is in my opinion one of the best features compared to iPad lines. What this means you get a USB Host cable also otherwise called OTG (On the Go) cables and plug in your USB thumb drive or other USB devices and the device recognizes it. GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up). I personally use Navigon from Garmin and have downloaded several apps.Finally, believe me, don't get mired in the spec game. 7\" is equally capable as a 8in for `most' day to day apps. If you are reading books, browsing, listening to music, looking at photos 7\" is more than enough. Samsung is creating markets for all form factors. Just like Ford or Toyota has cars in different shapes, sizes and price range, so are the tablet vendors now. Remember the laptop wars, 10\", 12\" 13\", 15, 17 and even some 19\" if I remember right few years ago. We used to debate endlessly which laptop sizes are better, which has better speakers and so on. The time has come to fight it out for tablets!I tried following apps and they just worked awesome. A tablet is only as good as the apps you have and how productive it makes you. It's almost like the camera/lens analogy in the DSLR space. What good it is to have a great DSLR body if you have no good lens? Same with Tablet body and apps you have.WolframAlpha (I can go on for hours praising this. This is a truly genius app powered by hundreds of supercomputers in the background. Wolfram is a computational genius).Withings HealthMate. (another remarkable app great UI/UX). I am getting the Pulse device as soon as it hit stores.)Aldiko Book Reader Premium (absolutely love it)Amazon MobileAndroid Central app (great and must have for Android users)Amazon App StoreBattery Monitor Widget Pro (a great app)BeyondPod (excellent for podcasts, I haven't used Pocketcast, some friends say it is very good too)BoxChromeDictionary M-W PremiumNAVIGON (from Garmin - offline maps)Google Navigation/Earth/Maps using a portable MiFi boxGoogle Currents (nice way to read News)Google Keep/Keyboard/Drive/Search/Books/Voice/HangoutsEbayLinkedinGoogle Music (Awesome, I have now upto 10,000 songs halfway through Google's 20K Limit)Tapatalk HD (awesome forum browsing app)Microsoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTweetCaster Pro for AndroidSkypeRealCalc Plus (Awesome calculator app)Tweetcaster Pro (again awesomeness)Plenty of WidgetsAsk questions, the reviews cannot do full justice. I will be glad to answer any questions and usually answer within 24 hours to any query.APPENDIX: Overview of other tablets in the market.Samsung Galaxy TabPRO 8.4-Inch {B,W}, WQXGA 2560 x 1600, 359 ppi, 2.3 GHz Qualcomm Snapdragon 800 quad-core processor, 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB, 8MP Rear + 2MP Front, 331 gm, Android 4.4 Kit Kat OS, 8.62 x 5.06 x 0.28 in, microUSB, GPS yes. 4800 mAh battery (best resolution on a tablet!)Samsung Galaxy TabPRO 10.1 {B, W}, WQXGA 2560x1600, 298 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 2 GB RAM, 16/[32] GB Flash, microSD upto 64 GB, 8MP Rear + 2MP Front, 469 gm, Android 4.4 KitKat, 9.57 x 6.75 x 0.29 in, microUSB, GPS: y, 8,200mAh batterySamsung Galaxy TabPRO 12.2 {B, W}, WQXGA 2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32GB/64GB Flash, microSD upto 64 GB, 8MP Rear + 2MP Front, 732 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.31 in, microUSB, GPS: y, 9500mAh batterySamsung Galaxy NotePRO 12.2 {B, W}, WQXGA 2560x1600, 247 ppi, Exynos® 5 Octa (1.9GHz Quadcore + 1.3 GHz Quadcore), 3 GB RAM, 32/64 GB Flash, microSD card slot up to 64GB, 8MP Rear + 2MP Front, 748 gm, Android 4.4 KitKat, 11.64 x 8.03 x 0.33 in, microUSB 3.0 port with backwards compatibility with microUSB 2.0, GPS - y, 9500mAh battery, S-Pen, NFC, Ethernet connectivity via adapter.Kindle Fire HDX 8.9\" model: 2560 x 1600, 339 ppi, Snapdragon 800 2.2 GHz quad-core, 2 GB RAM, 16/32/64 Flash Memory, No microSD card, 8MP rear-facing camera, front-facing 720p HD camera, 374 grams, FireOS 3.0, 9.1 x 6.2 x 0.31 inches, microUSB, GPS:no [cellular versions have GPS]Samsung Galaxy Note 10.1\" 2014 Edition: 2560x1600, 299 ppi, 1.9GHz Samsung Exynos 5420 Quad-Core Processor, 3GB RAM, 16/32 GB Flash Memory, microSD slot:yes(upto 64 GB), 8MP rear camera and 2 MP front-facing camera, 560 grams, Android 4.3 Jelly Bean OS, 9.57 x 6.75 x 0.31 inches, microUSB, GPS:yes. S-Pen (flagship),iPAD Air 9.7\" (2013): 2048 x 1536 resolution, 264 ppi, A7/M7/64 bit processor, Flash Memory: 16/32/64/128 GB, SD Card:no, 5 MP back, 1.2 MP front, 469 grams, iOS 7, 9.4 x 6.6 x 0.29 in, lightning port, GPS:no [cellular versions have GPS]Google Nexus 10\" model: 2560 x 1600, 300 ppi, CPU: Dual-core A15, 2GB RAM, 16/32 GB, SD:no, rear:5 MP, front:1.9 MP, 603g, 10.4\" x 7\" x 0.35\", mcroUSB, GPS:yesYou should come up with three top three specs you want and should be able to nail it down with the above spec. If you have doubts shoot me a comment, I can help! I hope the key specs I have consolidated here of all the tablets will help you narrow down and help in buying the right tablet for your needs.", "Date": "May 1, 2014"}, {"Title": "Nice form-factor tablet", "Author": "Yu-jin Chia \"Yu-Jin Chia\"", "ReviewID": "R4XFJXT7G3COY", "Overall": "5.0", "Content": "I've used more than my fair share of 7\" tablets, which I consider to be the ideal size. Larger ones (which I have also owned and used) tend to be a bit too clunky for my tastes. If I'm going to carry around a 10\" tablet, I figure I might as well just bring an ultrabook instead- the added weight is worth the extra power, storage, and keyboard. I know some other folks love their iPad/Surface/Transformer/whatever though, so to each their own. If you're looking at this, you're probably someone who tends to agree with me. If not, you're probably looking at the wrong product.First things first: this is not the cheapest tablet out there for the given specs, nor is it anywhere near the most powerful 7\" tablet around. The Galaxy Tab 7 series, to be frank, has never scored high marks in either category- focusing more on packaging and reliability. You can get an ASUS MeMo Pad HD for about half the price as this unit, with very similar specs. You can also get a 2nd gen Nexus 7 for a little more, and it has specs that blow the Galaxy Tab 7 out of the water.So why get one of these? Put simply, it's a good balance of relevant features. The most notable of these are:- Android 4.4: This is a big improvement over 4.1 which the previous gen Galaxy Tab and a lot of other similar-gen devices use. Most notably, it lets you move apps to SD without root. This makes the limited internal memory largely a non-issue.- Expandable memory: Part and parcel with the above, you can get an inexpensive 32 GB microSD card and instantly increase your device memory from 8 to 40 GB. That's plenty for even most gamers.- Very nice form factor: This is one of the most compact and lightweight tablets available. It's noticeably shorter than the Nexus 7 (2013) and slightly lighter.- All-day battery life: When they say this tablet can go 10 hours on a charge they aren't joking- and it's 10 hours of regular use, not with the backlight so dim you can't see anything.- IR blaster: If you don't already have one, you can use this as a universal remote. When you consider that most good standalone universal remotes cost around $100, that's not an insignificant bit of functionality.For the cost, this is a nice tablet that is competitive with any other in its price range. Yes, you can get cheaper ones that have similar specs, but not with all the same features (e.g. the aforementioned MeMo Pad HD doesn't have the IR blaster or Android 4.4, and the Nexus 7 doesn't have expandable memory).There are a few things that it would have been nice to have though. Particularly I would have loved to see:-NFC: It doesn't have it, so no google wallet, android beam, etc.-Qi wireless charging: Not what I'd call a huge plus, but it is cool to have.-More internal memory on stock model: Also not a huge deal as it has Android 4.4 and micro SD, but memory is so cheap nowadays- hard to imagine why they'd still have just 8 GB at this pricepoint.A note on the 8\" version. I have to say, I don't understand why anyone would get the 8.0 over the 7.0- it has the same resolution and hardware, the only significant differences are a slightly larger (in terms of dimensions) screen and up to 64 GB on the micro SD. Really not worth the added cost.On that note, the screen is not the sharpest one out there but looks very nice and has great viewing angles. The CPU and RAM are sufficient for most applications and a lot better than the previous gen Galaxy Tab. Though not the greatest, the rear-facing camera is fine for taking Instagram shots and can record 720p video.Aesthetically, it's a very attractive device that looks and feels well-built and has a nice textured rear that feels like leather. It has that polished look that Samsung is known for and does not look cheap.If you're mainly an Android gamer, you may want to pay a bit more and get a Nexus 7 or other high-end tablet. However, for most people this is a great tablet that has very solid look and feel and a great feature set. If you're looking for a universal remote, it's almost worth picking up for that functionality alone. If you're also looking for a very light and thin tablet, this is a great choice and hard to beat.", "Date": "May 12, 2014"}, {"Title": "Meh", "Author": "J. Blum", "ReviewID": "R3UI6EMUOPS0MK", "Overall": "3.0", "Content": "I'm coming off of an iPad 2 (march, 2011) and bought the Tab 4 7\" because my 2-year-old basically confiscated the iPad to play toddler games. I wanted something smaller that I could hold in one hand for reading, browsing, and a few games here and there.The first impression of the design was that it was quite good for the price. It's light, it's slim and it's utilitarian. There's no aluminum uni-body construction here, just plastic and more plastic, but it certainty looks acceptable and I don't need to worry about scratching all that pretty brushed aluminum. What's the point if you're just going to slap a protective cover on it anyway?.Other impressions are that I like Android for it's openness compared to iOS. It may not look (by any means) as pretty, and it's certainly not consistently designed, but it works for what it was intended and I don't need Apple's \"approval\" to download an app that does something they don't agree with.I also like the ability to use cheap SD cards for storage (BIG plus here), whereas Apple locks up memory into a completely proprietary $100/GB scam. The stuff is on the market for $1/GB, and that's for the performance RAM. 'Nuf said about the fleecing Apple has been committing for YEARS when it comes to RAM prices.I'm not even going to complain about the paltry (these days) 1280x800 display. I don't need the extra resolution because my eye's aren't exactly what they used to be, nor do I want to pay for it. 1280x800 is acceptable, especially on a 7\" tablet, which makes for halfway decent density. I can't see the pixels even with glasses, so it's good enough. However If I were reviewing the 10.1, I'd be hammering it for pixel density.All that being said, what I really do NOT like about the Tab 4 is that it's FREAKING SLOW. My (almost 4) year old iPad 2 blew this thing out of the water. I can only imagine that the 1.2Ghz processor Samsung is using is 3 years behind the times and/or there's not enough internal RAM (1.5GB). Somewhere along the way they decided to save $10 and gimp what would otherwise be a no-brainier choice. You can't even browse a simple page without lagging and shuddering. If I had to do anything quickly on this thing, I'd send it back immediately and get a Tab \"Pro\", which looks to be twice as fast at 2 times the cost.In the end, and as long as you don't care/need anything even remotely resembling speed, this is a reasonable choice. To the reviewer that said \"Samsung has done it again!\", all I can say is, done what? Barely updated the under-powered Tab 3 with another under-powered Tab 4? Seriously how much does it cost a manufacturer to use a faster processor of their own design and production? $5, $10?  Some performance would have made this a 5-star tablet at this price point. As it stands, It's a ho-hum tablet at a ho-hum price.", "Date": "May 2, 2014"}, {"Title": "A realistic POV.", "Author": "Wendy V Brejot", "ReviewID": "R39QFK0NV4O915", "Overall": "5.0", "Content": "ProsIt's easy to use.It's durable. See the knife and hammer test on You Tube.It has decent processor speed. I'm not a heavy app gamer. So I'm happy with it.Honestly turning an ebook  page for 4 secs is pretty damn fast. If it took 3 minutes then I would understand why people gripe about the processor speed.The touch screen is quite responsive even with a screen protector on.WiFi is good. My kitchen is on the first floor at the back.  My router is in my room on the 2nd floor witch is at the front. From that distance this device can pick up the signal. It can also pick up signals from my neighbors houses.  The only time i notice any lag is if a page or video is poorly coded.Sound is good but even better with head phones.The battery life is good but you can squeeze more juice out if you tone down the screen brightness. And adjust the other settings.It has a micro SD slot. Totally trumps the iPad there.It's very light weight. Thin too.Has a very clean UI. Not crowded and confusing.The device and charger do not heat up.It syncs very well with my online accounts.GPS on this tablet is fairly accurate.  I live in St. Louis and GPS doesn't always work well due to street renames, buildings sitting behind another one and such.Controls are responsive, it will only take a feather light touch.I can't speak about Bluetooth connection and the IR blaster because I have no comparable devices to test them with.Cons. The cameras could have been better. Only 3 mega pixels for the back and  1 for the front. Come on Samsung at least give us  5 mega pixels!  Colors look a bit saturated even in bight light. It's just OK enough to use the outer camera as a QR scanner just don't expect much.", "Date": "May 31, 2014"}, {"Title": "Best!", "Author": "Marypat Bruckshaw", "ReviewID": "R240M65KRXRVDL", "Overall": "5.0", "Content": "Great tablet to get for anyone! My sister in law loved it and never puts it down! 100% the best hands down!", "Date": "May 27, 2014"}, {"Title": "Very good tablet", "Author": "Yongbing Wan", "ReviewID": "R13SMJ3L9RJDZK", "Overall": "4.0", "Content": "I never used iPad so I can't compare it to the iPad. But for all the tasks I use, it works wonder, weChat, Yahoo Mail, Google apps, games, you name it. I don't know anything that iPad can do that this on can't, with a lot less money and convenience. You can plug it to your computer USE, and it becomes a removable storage, and your can copy anything on to the directories. The touch and response time is excellent too.", "Date": "May 22, 2014"}, {"Title": "Great little tablet.", "Author": "Linda Nussas", "ReviewID": "REBFD3C8WBBSP", "Overall": "4.0", "Content": "This is a great tablet. I love all the features. I do have a problem holding it without changing the page. There is a very small bevel on the sides. I guess you get more screen that way. The camera takes very grainy pictures no matter what mode you are in, also there is no flash. The audio is weak can barely hear it. Speaker is in the back. I like the SD slot which I promptly installed the 32 gb . It is a Wi fi only device. The router is upstairs and I still get signal in the backyard. The touch screen responds very well. The device is very light. I like the remote and TV Guide.", "Date": "May 10, 2014"}, {"Title": "Unfortunately, not up to par...", "Author": "rvajeff", "ReviewID": "RUP8CHUKRE1FW", "Overall": "3.0", "Content": "Up front disclaimer: having owned many android, apple and windows devices (from all the big manufacturers), I am partial to none. I think they all have pros and cons.I was excited when I saw this tablet was coming out, with a quad core processor, a better display than its Tab 3 predecessor, and of course Android 4.4. It looked like a much better version of an affordable tablet.It's ok. It's not bad, and I wouldn't rate it as such. But I did a physical comparison between it and the 2013 Nexus 7, which in my opinion is a valuable comparison since they are both on the same version of Android, and are both lower priced 7 inch tablets. The Galaxy Tab 4 7.0 doesn't even come close. This is for one big reason - lag. My guess is that this has everything to do with Samsung's custom Android skin, TouchWiz. There is noticeable lag when using the browser and other apps. There is noticeable lag when switching applications. Not all the time, but enough to make it a nuisance. This was not the case on the Nexus, which was snappy and smooth in all my use of it.Other points of comparison - the screen is not nearly as vivid on the Tab 4 as it is on the Nexus. The camera seemed slightly better on the Nexus, but really, it's a tablet... I'm not concerned with that so much. I do like the physical home button on the Galaxy but do not miss it having made the switch to the Nexus 7.All in all, for the specs on the Galaxy Tab 4, it should really perform with no lag. It's disappointing to say the least. It is definitely not a \"bad\" tablet, and if you just want to spend 200 and no more, then you'll probably get the most out of it. But for not a lot more, you can get a much better experience in my humble opinion by getting the latest Nexus tab.", "Date": "May 9, 2014"}, {"Title": "Decent low budget tablet.", "Author": "w.w", "ReviewID": "R2VWBT5I1M4Z97", "Overall": "4.0", "Content": "This is a decent, low cost, no frills tablet.  The screen isn't the sharpest, it is not the lightest or thinnest, the processor isn't the latest model, the camera isn't the best, but it is only $200 so it is hard to complain.I thank Samsung for including an SD card slot, not having one is a deal breaker for me.  Some companies would rather not include one and then charge you an extra $100 for 16 additional GB's of storage -- that is basically a slap in the face when you can get 64GB sd cards for less than $50.The one thing this tablet is missing is an LED notification light!  Not having one is a huge disappointment.  On most android phones you get a small LED that will flash a certain color when you have notifications, but on this tablet I constantly have to pick it up and turn it on to see if I missed any notifications when I stepped away from my desk.", "Date": "May 28, 2014"}, {"Title": "I love it!!", "Author": "Mandy Bennett", "ReviewID": "RYA2ALNND0KWK", "Overall": "5.0", "Content": "I absolutely love this tablet!! I had a Galaxy Tab 2 and decided to get an up to date version of it. I love the multi tasking too!! The only down side is that it is very slippery and it slides out of my hands. But everything else is awesome!!!", "Date": "May 23, 2014"}, {"Title": "so far, so good!!", "Author": "ty", "ReviewID": "RQDQWCQT9LBL8", "Overall": "5.0", "Content": "Definately not disappointed in this purchase!!  I read many reviews, and this is what was promised!  Fast shipping and the device came pretty much with a full charge, so I was able to start playing on it immediately!  Using mostly for gaming (I have a 10 year old) and internet surfing.  Fast and easy to use", "Date": "May 12, 2014"}, {"Title": "Mostly great with some exceptions", "Author": "Bernard H. Robinson", "ReviewID": "R2PLW3F1O75A5D", "Overall": "4.0", "Content": "Sound, resolution, and performance is very good. However, I seem to lose my wifi connection periodically wven when in a strong signal location. Also found some play store apps that come up as not compatible with my tab even though they are specified as KitKat compatible (", "Date": "June 12, 2014"}, {"Title": "Almost perfect", "Author": "Kanileah Phelps \"Shopping Mommy\"", "ReviewID": "R3GBM7S70LGORV", "Overall": "4.0", "Content": "Bought this for my nine year old. She loves my iPad but the tablet is a better size for her, I think. The apps I've downloaded speak to her interests, and she can share it with my husband!  Fits well in any of my purses, a plus.  Charges quite slowly and I'm trying to see if that is a defect.", "Date": "June 12, 2014"}, {"Title": "Samsung Tablet 4 - 7inch", "Author": "Jane M. Pacheco", "ReviewID": "R1VHB16KOJ6BUV", "Overall": "5.0", "Content": "I simply love this Samsung tablet. The only this I would like to comment on is that could they of put a better book with it. It does so many things I never could believe could be done. Every day is a new adventure, thank JP", "Date": "June 12, 2014"}, {"Title": "This Tablet is awesome", "Author": "Regina L.", "ReviewID": "R1PTPN2ESUFM25", "Overall": "5.0", "Content": "I received my tablet yesterday and love it the very moment I turn it on everything came in immediately not like most some tablets that take for everloading this is fast and quick I going to buy my sister one for her birthday 71 birthday This tablet has all the features I was looking for in a tablet  THANKS SAMSUNG I WILL BE PURCHASING MORE OF YOUR PRODUCT", "Date": "June 11, 2014"}, {"Title": "Samsung Galaxy Tab 4", "Author": "Debrah Morgan", "ReviewID": "R6340A8IIBJXG", "Overall": "5.0", "Content": "It met every expectation that I purchased it for and will definately refer this item to family and friends alike.", "Date": "June 10, 2014"}, {"Title": "Get both fun and function.", "Author": "Joan", "ReviewID": "RU3Q2OF358PRH", "Overall": "5.0", "Content": "Great tablet for both staying organized and informed as well as having fun.  Battery life is great and recharge time is minimal.  Light to hold especially if you are playing a good game.  Colors and clarity are very good.  Would highly recommend this tablet.", "Date": "June 10, 2014"}, {"Title": "a great device for gather data", "Author": "Golden Lion \"Reader\"", "ReviewID": "R3LQZ391V9TL96", "Overall": "5.0", "Content": "I used the samsung device to gather remote data from multiple locations.  The data is transmitted using a data plan to a  server.  The tablet is easy to use, very reliable, auto syncs with new applications and can be rapidly setup and deployed.basic4android and samsung galaxy tablet have been  a great solutio", "Date": "June 9, 2014"}, {"Title": "Samsung Galaxy Tab 4 (7-Inch, Black)", "Author": "Amazon Customer \"Old Jim\"", "ReviewID": "RAM7CTVPRJ976", "Overall": "5.0", "Content": "Had it for about a month now. My 1st tablet. I'm not a gamer. Tab is handy for reading e-mails, alarms/reminders, calendar. Seems to load websites fast....not as fast as my computer (Pentium 7), but not objectionably slow.  Nice bright screen. I'm spending less time on my laptop.", "Date": "June 8, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00J8DL78O"}}