{"Reviews": [{"Title": "Affordable, Kid-Friendly, Good Customer Service", "Author": "John A. McClellan \"mcclellan28\"", "ReviewID": "RNP3HWTGQQ5TP", "Overall": "4.0", "Content": "One of the main selling points for this iRulu 7\" tablet is that it's kid-friendly. It's affordable too. Though, I'd recommend purchasing the corresponding 7-inch Portable Bookstyle Folio Artificial Leather Tablet Protector Case Cover for Google Android Tablet PC MID(Blue) if you're buying an iRulu for a child. I bought this tablet for my five-year old son, and he loves it.", "Date": "May 19, 2014"}, {"Title": "Great Buy!", "Author": "Christopher Beebe", "ReviewID": "R6KBO6N4KQXY5", "Overall": "4.0", "Content": "I bought this for my 2 1/2 year old as his first tablet for educational apps, games and movies on the go, but couldn't justify the price of an iPad for a toddler who may throw it in the toilet. It arrived very quickly and was just as described. It has a rubbery molding around the edges, easy for little fingers to hold onto. Very easy to set up and got apps and videos going for him right away. Although, the storage capacity is not huge, the SD card should be an easy fix to that. The downsides are that the camera and speakers need some work, but for a toddler, just fine. I would buy it again!", "Date": "May 9, 2014"}], "ProductInfo": {"Price": "$75.70", "Features": "Latest Google Android 4.1 Jelly Bean OS, Allwinner A20 Dual Core CPU (1.2GHz) with Quad core Mali-400 MP GPU, offer unprecedented fast surfing online, video playing and 3D games playing experience\n7 inch secren display, 5 point capacitive touch screen,800*480 resolution.\nWith front & back dual cameras (0.3MP & 2MP), be adequate for skype video chat and taking general picturesdroid tablet\n8GB storage capacity, built-in micro sd card slots, can be expanded to 32GB\nBuilt-in 3.7V 3000mAh Li-Polymer rechargeable battery, enjoy longer running time (almost 3 days for stand-by status)", "Name": "iRulu 7\" lovely Capacitive Tablet PC Android 4.0 Jelly Bean for Birthday Gift to Kids Children Allwinner A13 1.2GHz 8GB Dual Camera,Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/41T382rNsbL._SY300_.jpg", "ProductID": "B00JB6F0PE"}}