{"Reviews": [{"Author": "Filip Grujoski", "ReviewID": "RVNF64CL3CPB3", "Overall": "5.0", "Content": "I've been using this tablet for a couple days now and so I'm ready to post my initial thoughts.Here's the good:1. The case makes it feel very solid and well-built2. Battery life is fantastic3. VERY fast and responsive4. Can't beat the price5. Starts up from full power down in less than 30 seconds. Starts up immediatley from standby.The bad:1. Sound from speakers is not the best.2. The cameras aren't great, but do the basic job.3. I wish a HDMI cable had been includedEven with the few bad point I would still give the touchtab3 5 stars because of the performance and price. I shopped around for a tablet for a couple months before purchasing this one. I'm confident I made the right choice. I would definitely buy this tablet again.", "Title": "A must have", "Date": "April 24, 2014"}, {"Author": "Alex", "ReviewID": "RG0BE1BDDL1MK", "Overall": "5.0", "Content": "The Touchtab3 is an excellent product. I was originally going to get an ipad but I found this on amazon for 249.99 so I purchased it so save some money. I was very surprised that when I got the product at how easily it is to use. The display is a 9.7inch and is crystal clear and is very light tablet. The main reasons I needed a tablet was for net surfing, Netflix watching, and dealing with emails for work. Within the first twenty four hours I found myself completely addicted to this tablet and wondering how I'd ever managed life without it. The graphics and sound quality are excellent for the price and it is extremely easy to set up and use. However, I am getting more addicted to Facebook now that have the Touchtab. I've played around on of my colleagues Ipads before and personally I prefer the Touchtab. I also like that it had the dual cameras which makes skype easier. Overall this is a great tablet and well worth the money.", "Title": "Best one", "Date": "April 17, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00JR9T5PQ", "Features": null, "ImgURL": null, "Name": null}}