{"Reviews": [{"Author": "Technophilos", "ReviewID": "RCCF3W3MG45ZW", "Overall": "4.0", "Content": "OK, it's a cheap tablet computer. Find the right apps and it works fine. It initially had some power and wireless issues, but, as a previous reviewer said, use a screen dimmer and blanker app and you'll get better battery life and less heat. My wireless issues went away with a reboot too. Hey, I thought ya didn't have to do that with Linux! Oh yeah, it's \"almost Linux\" - aka Android. Oh well.  Mine came with Android 4.1, so I'm that much more happy with it. It definitely needs a protective case though.  The screen is a bit better than OK. Once dimmed, it's quite usable. It plays movies clearly without any fuzz or jitter. It surfs the web (well, Firefox does...) It comes with all the USB plugs you'll need too. The sound is a bit low - but clear. Hey, whaddya expect from a speaker the size of a tictac?  The battery life is its defining characteristic. It's short. Unless you bring a charger, it ain't gonna be entertaining you with movies while you're out deer hunting... It does, however, come with a bunch of irritable birds installed. Boy are they fun!  So, for the price of dinner for two at an midscale sit-down restaurant, you get a tablet computer. Pick one.", "Title": "It Ain't On Fire, But It'll Keep Ya Warm", "Date": "May 13, 2013"}, {"Author": "James R. Boffenmyer", "ReviewID": "R3T9ZP1WZFMR2Y", "Overall": "5.0", "Content": "I originally purchased this product to read .pdf textbooks for my graduate classes. Though I had to upgrade to a later edition of Adobe, I can do what I needed with no problem. For the price, the tablet works just as well, if not, better than a friend of mine's kindle fire. It has the same features but without the heavy cost.I also purchased a case with the keyboard and a USB splitter, and the USB is able to support both a keyboard and a mouse, and you can use it just like a laptop computer. (Once you get used to the small keyboard).This is my first tablet, I've always used apple products and It was not difficult to take this out of the box and figure out how to use this.Overall, I'm quite pleased with this product, and so far, it's living up to my expectations for an electronic device.", "Title": "Does more than what I expect.", "Date": "May 4, 2013"}, {"Author": "Sophie's Manager \"Javier\"", "ReviewID": "RP19X905OA3N8", "Overall": "5.0", "Content": "This tablet has a great potential to provide your recipient a chance to own a great tablet at a great price.  I love it and feel it will be my company's product for a long time until 10\" tablets drop in price or Chips become even more advanced for tablets.", "Title": "I would endorse this product over most tablets in stores.", "Date": "March 23, 2013"}, {"Author": "todaniels71", "ReviewID": "R2U6AIHVFOV9BU", "Overall": "5.0", "Content": "i got this just because the specs were so good.....when i got it in the mail i was like i hope i hope i hope..... got it fully charged and downloaded the one thingi really wanted to see if it would work thats magic jack free for android now i have gotten rid of my smartphone and landline using my new phone tab on wireless....wayyy less wires and the other cool thing is that it has an email alert.......you can choose which one you want out of alot.....the only problem is that halfway thru the day i have to charge the android but that only takes a little while.......other than that ive been giving everyone i knowreferalls to get one.....theyre awesome man...", "Title": "awesome product", "Date": "September 10, 2013"}, {"Author": "Mackmario8", "ReviewID": "R170W50K3VFJ72", "Overall": "5.0", "Content": "i bought this tablet and when i got it it worked right out of the box it played almost all the apps at full speed. i had to return nmine though do to a bad battery, but service was excellent quick replies and good help.", "Title": "Tablet okay good service", "Date": "May 5, 2013"}, {"Author": "nmcafee", "ReviewID": "R2NXGKBWQT7YDO", "Overall": "5.0", "Content": "Quick service and I am very pleased with the tablet.  SInce I received it I havent put it downn.  Really nice for the price.", "Title": "Quick service", "Date": "April 4, 2013"}, {"Author": "kory", "ReviewID": "R223IM89EJEICQ", "Overall": "2.0", "Content": "I got this product thinking it would be great it only responds half of the time and it is very slow ,I tried subway surfers and I kept running into the first thing that popped up and every app takes forever to load you have to toutch the app at least 3 times for it to open then you have to wait at least 5 minutes for it to load its not just the internet that's slow its the entire device", "Title": "nooo", "Date": "July 25, 2013"}, {"Author": "V. Behan", "ReviewID": "R3KBX2SPZVAVMO", "Overall": "4.0", "Content": "Other good reviews say a lot. Works well for my needs. I was so surprised at how well this little tablet performs. I downloaded Netflix and You Tube apps and both work flawlessly. The wifi works from a fair distance away from my router, too. Nook app works flawlessly, too. SD micro card slot easy access to add more content. So much for such a small price.", "Title": "Great tablet! Better than expected.", "Date": "July 10, 2013"}, {"Author": "Roger J Johnson", "ReviewID": "R2OWZCLDG1TS2D", "Overall": "5.0", "Content": "Got this for my son, I am SUPER PLEASED with this. it functions as it said and the price... unbeatable!!!!!!!!  Im getting a second one.... for me!!!!!!", "Title": "tablet", "Date": "May 13, 2013"}, {"Author": "Poonman66", "ReviewID": "R3C4BEIMI8KOCT", "Overall": "5.0", "Content": "I bought Two one for me and one for my wife, she loves the big screen for Words With Friends. We are getting old.", "Title": "For the price this is a very good Tablet.", "Date": "March 5, 2013"}, {"Author": "Shalyn Evans", "ReviewID": "R2U7R3QIB7P8N2", "Overall": "4.0", "Content": "I bought this as a replacement for my sons Coby Kyros tablet that cracked recently after just receiving it for Christmas. Even though he had his own tablet he always wanted mine because his didn't have google play or any games he really liked. I have a Samsung Galaxy and didnt want t to get broken. After reading plenty of reviews I ordered this tablet. It came very quickly, with in 2-3 days of order. It came with a screen protector and a stylus.  My son tried it out tonight and loves it. He was enjoying setting up his games on it that he had on mine. This was cheaper than the Coby tablet and I even like it better. Im thinking about getting a 2nd one when I can for my 5 year old so he will stop playing mine as well. Excellent product, excellent price.", "Title": "For 8 year old", "Date": "April 17, 2013"}, {"Author": "speeps", "ReviewID": "R1E9Z2IMOVEFYO", "Overall": "5.0", "Content": "Just as good as a brand name tablet. No delay when using the touch screen (I expected the screen response to be slow for a cheaper product). Everything opens fast. No complaints. Highly recommended for price.", "Title": "Love it", "Date": "September 5, 2013"}, {"Author": "Light", "ReviewID": "R3QWFDMSZFZT4S", "Overall": "5.0", "Content": "Bought this tablet for my mom so she could read email, thats about all she needed it for. Works well for simple tasks, but was suprised when you could watch full HD movies in perfect playback and play angry birds no problem. Didn't expect it to be that good. Actually is a decent tablet, a little slower than my girls \"google nexus 7\" but that is to be expected, thats not what you would buy this tablet for. Anyone who is a light user or just getting into tablets this is a great buy!", "Title": "Good tablet great price", "Date": "May 25, 2013"}, {"Author": "anonymous", "ReviewID": "R217IEELL09693", "Overall": "4.0", "Content": "I bought this for my kids (10 and 8) to play games on. We have several laptops/desktops in the family but this is the first tablet. Some PC games have new version in apps so we want to have a tablet to try those games. The instruction booklet indicates a welcome screen to set up the tablet. It didn't have that. It came with a locked screen which took me a while to figure out how to unlock it. After that, the tablet works great. The battery only lasts 1.5-2 hours. A couple of apps in Play Store did not show up on screen although I could see the files through my laptop. Maybe the version of Android on the tablet is incompatible. We are not serious users so this is good enough. It is great for the price.", "Title": "Great for Kids", "Date": "October 30, 2013"}, {"Author": "JOHN T SMITH", "ReviewID": "R3KEJAT6SWLI0L", "Overall": "5.0", "Content": "For the price, I like it. I'm new as a senior but I will accomplish this piece of equipment. Only fault that I have is the manual, why is it so small. The print is to small. Is there a full size one out there. Want to save my eyes.", "Title": "7 - inch Tablet", "Date": "May 15, 2013"}, {"Author": "Sara", "ReviewID": "RKDUW83UDA6TX", "Overall": "5.0", "Content": "I love having a tablet. it's good for somebody's first tablet r ur 5th tablet. it's a great size for me.I want to think Alldaymall for letting me get a tablet for $68.99", "Title": "IT'S JUST GREAT", "Date": "March 23, 2013"}, {"Author": "soledad", "ReviewID": "R2UZXJ70SI3U2P", "Overall": "5.0", "Content": "Better than I expected. Graphics are good, sound is loud and clear, and all works very fast (at least compared with my old 512MB/4G tablet). I can say that now I have a useful tablet again, and at a very good price.", "Title": "excellent", "Date": "July 26, 2013"}, {"Author": "B. Vidolov", "ReviewID": "R22RRTY8UQE3QE", "Overall": "1.0", "Content": "Pros: Thin, lightCons: Very poor qualityThe item arrived very fast and the price was good, but the device quality is really bad. Examples: the gravity sensor that is used to change orientation doesn't work. I installed a few apps that track it and they detect the sensor, but confirm that the sensor simply doesn't work. As result, the only way I can use the device is as in landscape mode.The accelometer detects some of the movements, but has very low accuracy/sensitivity. The device cannot distinguish whether headphones are plugged in or not. In Skype you need to switch to speaker manually at each call, as it defaults to non-connected headphones. Camera is bad too, but it matches the expectations.Finally, the externals: the charger doesn't even go all the way in and a big metal piece is sticking half way out. Obviously, they used charger for a different device. The glass of the screen is not glued evenly, so it looks like it has peeled off on some edges. I wouldn't recommend.Update: I gave it to my relatives overseas and they now say that the screen cracked while the device was left charging. The charger didn't even fit well, so I won't be surprised if it has overheated due to wrong charger being shipped with the device. Unfortunately, I cannot even return it, as the device is on the other side of the earth.", "Title": "Bad quality", "Date": "June 20, 2013"}, {"Author": "Bert", "ReviewID": "RS8VMF4W3BYCN", "Overall": "2.0", "Content": "The device arrived packaged well and looked good enough. It powered on with no troubles and was surprisingly responsive. The viewing angles are pretty awful; in landscape mode, it looks mostly fine, but in portrait mode you don't get much viewing angle to work with. If you tilt it to the side by about 30 degrees the colors will fade out on you. All in all, the hardware seemed to be par for the course for a $70 tablet. I was not disappointed nor was I blown away by the hardware; if I was simply web surfing it would probably be fine. I didn't try streaming any videos with it.However, there is some problem with the OS that doesn't let all apps work correctly on it. I was planning on using this as a dedicated Pandora alarm clock by using Tasker and Pandora to automate it. For the price it would have been a great deal, but Tasker wouldn't run at all. It would install from the Play Store just fine, but would always return an error when attempting to run- it wouldn't load at ALL. I Googled around a lot, and it appears that this type of thing is a common problem with certain tablets. It has something to do with not having the Google Maps libraries installed, and no matter what I tried it absolutely wouldn't let Tasker start up. I am returning this tablet and going with a brand name I recognize.Summary: It may or may not run the apps you want it to. Build quality is decent, but I wouldn't expect it to hold up well to daily usage in the long term. Light usage should be fine. Unfortunately I cannot recommend this tablet as I don't know if it has the OS installed correctly or not, so any apps that I would want to run may not work at all.", "Title": "Barely works- not all apps will install and work correctly.", "Date": "April 9, 2013"}, {"Author": "John Chladek", "ReviewID": "R2TF9J9PA8P2QY", "Overall": "5.0", "Content": "The price was reasonable then the other tablets out there.  It has for me the great features i was looking for. My granddaughter loved this tablet. she was able to play the games she loves on the tablet. Overall a nice tablet for the price .  Thank you.", "Title": "For my granddaughter", "Date": "May 7, 2014"}, {"Author": "Leighar", "ReviewID": "R360QPEQC8OORO", "Overall": "1.0", "Content": "When i got this the first day i loved these but now Some letters won't come up the delete button isn't working along with some of the options button and unfortunately i bought 2 and one is just frozen and i can't do anything with it!!!!", "Title": "Waste of money", "Date": "September 2, 2013"}, {"Author": "Jen Tescher", "ReviewID": "R11GVSTAX93A1S", "Overall": "1.0", "Content": "This product is very slow to load. Often times it will stall and just stop working.. Battery life is extremely low.  I am considering a return.  Very disappointed.", "Title": "This product is very slow to load.  Often times it will stall. Battery life is extremely low.  I am considering a return.", "Date": "September 2, 2013"}, {"Author": "maggy", "ReviewID": "R3V2EGIARFTA8H", "Overall": "3.0", "Content": "Having had a kindle, this tablet just was not to my liking. I gave it to my kids but they still prefer my kindle. If a could redo the purchase, i could add the money and purchase the cheaper kindle just as a personal preference. If on a budget can make this do.", "Title": "alldaymall tablet", "Date": "August 31, 2013"}, {"Author": "EF", "ReviewID": "R9KK0YCZJ5W5G", "Overall": "1.0", "Content": "I bought 2, one of them works, the other one does't work, and remain freeze, i wrote many times to Alldaymall, they sent me some ways for reinstall the operative system, but it does't work.", "Title": "Doesn't Work", "Date": "August 29, 2013"}, {"Author": "Dee Generate \"Dee Generate\"", "ReviewID": "R1YSI9577L89LD", "Overall": "1.0", "Content": "Can't really offer a review of this product,because it wouldn't work.The wi-fi wouldn't connect despite my best efforts over several hours.So I packed it up and returned it.One positive note-Amazon's refund was processed very quickly !", "Title": "wouldn't work", "Date": "August 23, 2013"}, {"Author": "ash", "ReviewID": "R1W4S0M4HHZGLW", "Overall": "1.0", "Content": "I chose 1 because the tablet is basically broken the chargers that was sent doesnt work I had to use my cellphone charger overnight finally got it charged had it on for 10 mintues and the tablet went DEAD the shioment package was sent very nice", "Title": "Allday Tablet", "Date": "July 28, 2013"}, {"Author": "Carson", "ReviewID": "RK19ZUJAJQR3O", "Overall": "1.0", "Content": "This tablet really sucks. It crashes every time you do something. I can't even go on the play store, the moment I search an app it crashes. It even crashes when its just on the home screen. Don't buy this, save your money.", "Title": "I hate it.", "Date": "July 27, 2013"}, {"Author": "Darden A McGlothlin", "ReviewID": "R2Z69QFSCQNJPM", "Overall": "5.0", "Content": "This is a good reason not to buy a iPad mini for a person who only knows how to check their email and do a Hangout.", "Title": "Works", "Date": "July 11, 2013"}, {"Author": "amhb123", "ReviewID": "R3S8MVCA841Z28", "Overall": "5.0", "Content": "I was surprised when my son told me he wanted this for a graduation gift and I went to amazon and walmart.com...I decided to buy the everything from amazon. The price was better. I was pleased with the product information....I am so glad that I bought it.. thank you", "Title": "Thank you for this item", "Date": "July 7, 2013"}, {"Author": "Karina", "ReviewID": "R1E04FU4J9SLIB", "Overall": "5.0", "Content": "My son love this tablet, excelent product and excelent customer service. I recommed for everyone who wants a tablet for a great price.", "Title": "Great tablet", "Date": "July 6, 2013"}, {"Author": "dundalkbob", "ReviewID": "RDGE1HA1QWW7B", "Overall": "1.0", "Content": "This tablet is garbage.  I have to fight to do anything with it.  The screen is unresponsive 95% of the time when I took it out of the package it was seperated almost completely fron to back.  I want my $ back", "Title": "This tablet is garbage !", "Date": "October 4, 2013"}, {"Author": "Melissa", "ReviewID": "R3OC0IPYGC9ZDG", "Overall": "4.0", "Content": "Perfect for the price, daughter runs a few games and types on it. It's slower when a lot of things are on it, but it has a micro sd slot which we liked.", "Title": "Good first tablet", "Date": "October 4, 2013"}, {"Author": "D. Chambers", "ReviewID": "R3I68QD3T1R0KI", "Overall": "1.0", "Content": "Short power cord, doesn't load apps well, charge barely lasts 20 min. Would not buy again. Save your money and look elsewhere.", "Title": "Does not hold charge.", "Date": "October 3, 2013"}, {"Author": "Derrick Linwood Owens", "ReviewID": "R2U46KC3K2VR4Z", "Overall": "1.0", "Content": "It was hard to get WiFi connection. It wouldn't charge. And customer service I horrible. It has almost to months and they haven't sent me another one. And I have shipped the old one back with my own money. Don't waste you money on this Item.", "Title": "Don't waste your money on this item.", "Date": "October 3, 2013"}, {"Author": "giovanni silva", "ReviewID": "RKMPAFNFXL9S3", "Overall": "5.0", "Content": "It does the job for its price, out of all the orders for this tablet none has any problems yet.", "Title": "All orders came in great condition and no problems", "Date": "October 2, 2013"}, {"Author": "Germano", "ReviewID": "R3TVULVHVSMLES", "Overall": "4.0", "Content": "For the moments, this tablet its working very well for me. The games works really well, but the camara isn't that great. Is a pretty good item for the price.", "Title": "Great", "Date": "September 30, 2013"}, {"Author": "D. Sabean", "ReviewID": "R1786HVJFGH8RX", "Overall": "1.0", "Content": "It worked OK for a couple of weeks, then wouldn't charge.  Customer Service is decent, but you have to send numerous emails to communicate with people who only have the most basic grasp on the English language.  They replaced the charger, and all was well for a month.  Then the tablet bricked itself while it was turned off for the night.  Again with the numerous emails until communication was achieved.  They tried to send me several different firmware files (they didn't know which one would work!), but no explanation on how to install.  Finally they replaced the tablet and even reimbursed my shipping expense.  A month went by, and it was working fine, then the inner screen cracked while it was put away for the night!  Back to the numerous emails, which boiled down to them wanting me to ship it to CHINA for repairs which would cost $30 for the inner screen repair - half of what I paid for this non-durable piece of crap - plus the cost of shipping it to China.  I finally gave up and bought a Kindle Fire (which I highly recommend, by the way!), and my problems with this junk tablet are over.  I am still out the major hassle and the $63 I paid for it, but I guess I have to chalk that up to an expensive lesson learned the hard way.", "Title": "Buyer Beware!", "Date": "September 25, 2013"}, {"Author": "zachattack", "ReviewID": "RFGDM4VJSFOSM", "Overall": "1.0", "Content": "dont spend your money on this pice of junk.  Its slow and the touch screen is non responsive to touch", "Title": "wifi fonctioning stinks", "Date": "September 24, 2013"}, {"Author": "Susan Bryant", "ReviewID": "R2ELYNJWFY9L75", "Overall": "3.0", "Content": "I purchased this for my grandson and it runs fine for what he wanted it for. He is 6 so its ok. Not a clear picture, runs extremely slow but again for him it is fine.", "Title": "Ok", "Date": "September 22, 2013"}, {"Author": "Imoni", "ReviewID": "R1NAAFJOOL6XHM", "Overall": "4.0", "Content": "A little slow but I'm a first time user.... I don't use much m y boyfriend plays with it more than me lol great for games and quick notes wish it had a front camera", "Title": "great!!!", "Date": "September 21, 2013"}, {"Author": "Quintin Cantu", "ReviewID": "R67GKJB5B6UU9", "Overall": "5.0", "Content": "First day with the tablet and very impressed. Everything works and works smoothly. The thing runs acceptably fast, loads web pages quickly, no problems with the apps that I've down loaded (netflix, nook, office suite, backgrounds, lookout). Physical feel of the device is of good quality.The documentation is slim. A little booklet written in english as a second language. So you have to poke around a bit to figure out how to delete the bloatware (I don't need the Fishy Game, Fruit Ninja, the Shrek movie trailer and whatever that song was that was loaded on it - okay, I kept Angry Birds)...Bottom line... For $65 bucks this thing is awesome... Is it an iPad, no.... But, for what it is and what it does it's an excellent purchase and value.Again, first day. It might all crap out tomorrow, but right now, very happy with the purchase...", "Title": "For the price - Excellent (so far)", "Date": "April 24, 2013"}, {"Author": "Claudia", "ReviewID": "R1ISSPROAVG5Q0", "Overall": "5.0", "Content": "the best tablet for the price thanks I order other one or my sister. has everything easy to work and for travel also.", "Title": "the best tablet", "Date": "March 25, 2013"}, {"Author": "Leah", "ReviewID": "R33S60OPC8AFBL", "Overall": "1.0", "Content": "This tablet has a horrible picture.  It's not responsive.  It was freezing when I got it, then the screen went out within 4 hours of having it.  I had to return it. I did get my money back quickly but with a shipping fee taken out.", "Title": "Not for me", "Date": "March 28, 2013"}, {"Author": "joefox", "ReviewID": "R31C5TFVT64XQS", "Overall": "3.0", "Content": "OK, the build it's fine, does not feel cheap, kind of solid.Speed it's fine for most apps.Storage show 829mb internal and 1.5Gb external available, but it's suposed to be 4gb??? don't get it.Screen is very responsive but bright it's very low even on highest level, also the text looks a bit blurry.For this price it's ok, also show option to upgrade, will see on future if available.", "Title": "It's ok, could be better", "Date": "April 2, 2013"}, {"Author": "Dario O.", "ReviewID": "R5MDJ4PIO11EH", "Overall": "4.0", "Content": "At first all good but after a few days android keyboard and google play crashes everytime. i reset the device and all its ok again. after a few days, same problem.", "Title": "android keyboard and google play crashes", "Date": "May 27, 2014"}, {"Author": "ISZURETTE  HUNTER", "ReviewID": "RD8AMV1YMB1CY", "Overall": "3.0", "Content": "The screen went black other than that the tablet worked fine. My grandaughter had no problem navigating pretty simple she enjoyed playing.", "Title": "tablet", "Date": "May 23, 2014"}, {"Author": "Jmaya lang", "ReviewID": "R3GF8NYDA7BT2", "Overall": "1.0", "Content": "- this is not a good product. Do not waste your money! It doesnt have very good face chat and it runs very slow.", "Title": "Do Not Buy !", "Date": "September 21, 2013"}, {"Author": "Crystal", "ReviewID": "R36DHZCLEG84W3", "Overall": "2.0", "Content": "I bought this product for the kids to play games on.  Even they complain that it doesn't work well.  This is my first android product - maybe I'm spoiled by Apple.", "Title": "Slow and cumbersome", "Date": "September 18, 2013"}, {"Author": "Rudy Inoa", "ReviewID": "RJK6VK3DGXVRP", "Overall": "5.0", "Content": "Works flawlessly and is nice looking too. The screen is way better than other tablets. Only found trouble with wifi connections sometimes, i couldnt be very far from the router. Other than that, great item!", "Title": "Good Tablet", "Date": "September 10, 2013"}, {"Author": "carrie barenbrugge", "ReviewID": "R2JMV11OENAQZV", "Overall": "1.0", "Content": "imy daughter ordered this had it two months and the lcd screen shattered. before this although it worked well with no problems. but dont set it down on a hard suface.", "Title": "this will last two months", "Date": "August 2, 2013"}, {"Author": "Jessica", "ReviewID": "R3ASFFRBMBEGS5", "Overall": "5.0", "Content": "Bought 2 and have had no issues with them, They work great and run all the apps we need. Really can't beat them for the price!", "Title": "Great Tablet for the price!", "Date": "June 9, 2014"}, {"Author": "Kendra", "ReviewID": "R1TD6KM83SF4ED", "Overall": "1.0", "Content": "Purchased the tablet so my 2 years old could watch Sesame Street videos, but it arrived broken!!!!!!! Very upset!! Do not buy", "Title": "Arrived Broken", "Date": "June 8, 2014"}, {"Author": "Theodore Fletcher", "ReviewID": "R1PR9JAQ4VLNB1", "Overall": "5.0", "Content": "Very fast an good tablet I even let my friend ordered one an one thing I never know is that it have Bluetooth on it. Am enjoying it.", "Title": "razor", "Date": "June 8, 2014"}, {"Author": "Bryse M", "ReviewID": "R214MKN44JIFED", "Overall": "3.0", "Content": "I was leery of buying a brand I wasn't familiar with. The price attracted my attention and the description reeled me in. Received the item in record time even though it was shipped free. My son LOVED IT until he was sitting on the floor and dropped it accidentally on thick carpeting. It's user friendly, Great looking slim design, light weight & portable and just what was needed. I have buyers remorse due to the very fragile screen that shatters far easier than other more expensive items such as: The ipod and other touch screen devices that I own but have not broken so easily under the same circumstances.", "Title": "Down graded my review: Good product but......", "Date": "June 8, 2014"}, {"Author": "elay06", "ReviewID": "R2Y7BGBAE9QJNZ", "Overall": "4.0", "Content": "It actually came day later and my little one was getting impatient, too me, not a big deal. I am happy with this tablet, what do you expect for under 50$ I downloaded some music for my 8 year old son and was pleasantly surprise how fast it was. He uses it for you tube,Netflix and music as well as couple games. I will buy him the bigger memory card to store more stuff. Great little tablet for a kiddo. I'm happy with it. It has everything you would pay for more expensive one. Wi fi, Bluetooth,sd card slot. So far ,so good.", "Title": "great little tablet..", "Date": "June 8, 2014"}, {"Author": "Rick Z", "ReviewID": "R3UUMVWQA68MDG", "Overall": "2.0", "Content": "It's a used one. Touchscreen is not good for typing.I cannot start the tablet now. Poor quality.not recommend.", "Title": "Poor quality and not recommend", "Date": "June 6, 2014"}, {"Author": "Jeff", "ReviewID": "R3KV8S4JOWOPO4", "Overall": "4.0", "Content": "I bought this just to read my online newspaper but while it connects wirelessly at home I have not been able to connect at work or at my favorite coffee shop. It's a bust.", "Title": "Not so great", "Date": "June 3, 2014"}, {"Author": "Kerry", "ReviewID": "R3O58XDPYLHB0J", "Overall": "1.0", "Content": "I purchased this tablet last June. At first it seemed okay but there were always underlying issues. Certain apps froze, it took forever to go online, the battery died very fast just to name a few. Soon this tablet became a total nightmare. I was constantly contacting tech support and most of the time they wasn't able to resolve my issue. I was getting extremely frustrated and about six months later (none of these issues were ever resolved), I was unable to update or download apps. Finally the tablet decided to convert from english to an asian language. One good thing came out of this, the company gave me a full refund. I would stay away from this tablet. I spent an additional $20 and purchased a very good tablet. I've had it four months no issues and I love it.", "Title": "Stay Away", "Date": "April 19, 2014"}, {"Author": "robert", "ReviewID": "R1W0YVMMEFEZ26", "Overall": "1.0", "Content": "it stoped working 36 days after I got it an square trade wont fix or replace it under the warrenty I paid for thay suck the big one .", "Title": "poor", "Date": "April 4, 2014"}, {"Author": "Destinykaderly", "ReviewID": "R23UHPR4AX11MQ", "Overall": "1.0", "Content": "It was good at first but after a week it stopped working !!! I wish I wouldn't of wasted my money on this I would have been better of going to Walmart", "Title": "Horrible", "Date": "March 23, 2014"}, {"Author": "marlon", "ReviewID": "R1FYQQ830DKJCV", "Overall": "4.0", "Content": "this item was well made. the camera is very clean. unlike other tablets.it is how ever moving a bit slow for my taste, its knew so i did not expect this defect so soon.", "Title": "7 inch tablet", "Date": "March 19, 2014"}, {"Author": "Alfonso L. Puerta \"Technomaniac\"", "ReviewID": "R168PX4F4VP2LM", "Overall": "1.0", "Content": "We got this product mostly for the price but the true is that it is not worth it. It is painfully slow and the signal is poor.It barely makes a good toy.", "Title": "No a good deal.", "Date": "March 15, 2014"}, {"Author": "milagros cuevas", "ReviewID": "R2M40E1UTWGLF5", "Overall": "4.0", "Content": "good product, worth the price, my son is happy, and also because I do not pay as much money as I thought", "Title": "good product", "Date": "March 13, 2014"}, {"Author": "Sara Ladd", "ReviewID": "R33LCDFL2N1ONW", "Overall": "1.0", "Content": "Wanted a basic tablet for my son to play angry birds and temple run on. This tablet couldn't even do that!! Battery life was pathetic.", "Title": "Crap crap crap", "Date": "February 26, 2014"}, {"Author": "Dorothy Stephens", "ReviewID": "REUWHFB27JFGT", "Overall": "1.0", "Content": "I bought this for my granddaughters for CHRISTMAS, one lasted exactly 30days before frying.  The fact that I bought it in advance so as not to miss out, meant it's 90 days since purchase and I must eat the lost. I foolishly had bought 4 of them and know it won't be long. They have to be plugged all the time because they only hold a charge for a short time.", "Title": "Keep your receipt. Not worth the trouble.", "Date": "February 5, 2014"}, {"Author": "Amanda", "ReviewID": "R39TID874J6H04", "Overall": "1.0", "Content": "This tablet was pretty crappy and my fiancé was disappointed in the purchase. We ended up returning and getting something with a little more quality.", "Title": "not good", "Date": "January 21, 2014"}, {"Author": "Steve", "ReviewID": "R11D7YYRPLOL63", "Overall": "2.0", "Content": "I bought this for my 6 year old knowing she would eventually drop it.  The device was so slow, that she would eventually end up using my wife's phone rather than this.  The battery life was horrible.  It would last for about 2 hours before she would have to charge it.  The micro usb connection was the first thing to break, so we had to use the included power adapter that never seemed to fit right.  Then she eventually dropped it 1 foot to the ground and it broke.  The screen is not glass, so it only separated into the 2 front and back halves.  After many tears, and a few minutes for daddy to put it back together for her, we eventually ended up spending twice as much for a much better one with 10 times the battery life and processor.  Unless you pick this thing up for $20, don't bother.", "Title": "Got it for a 6 year old.", "Date": "January 16, 2014"}, {"Author": "Pina Campo", "ReviewID": "R3QY428P7IN4CD", "Overall": "4.0", "Content": "The product is good for its price. Sometimes hangs on google play and it complains that deserve a reboot but you can search for other download options.The device performs well, touch screen responds well and has a good battery life.", "Title": "The product is good for its price", "Date": "January 13, 2014"}, {"Author": "Ezra J. Chumley", "ReviewID": "R217W6PK2MR3MI", "Overall": "5.0", "Content": "I purchased this tablet to replace the prior model I gave away to my Sis which was similiar I thought! It works very well, But I do have a problem with the display icons being smaller than the one I had before. My icons on huge size is still smaller than the large size setting on the one I gave away. Both are from Alldaymall.com and 4.0 Android tablets. The live wallpapers are very limited compared to the other one as well. Setting it up was a little more complicated than the prior one too! This model does have a better Wi-Fi connection than the previous model, so that is a good plus! Overall it is a good tablet and works very well!", "Title": "Very Good Tablet", "Date": "January 7, 2014"}, {"Author": "G. Wichman", "ReviewID": "RW188I12Q7ZVE", "Overall": "1.0", "Content": "Showed up cracked and never used it. Worst 70dollars i ever spent . and i dont wanna use insurance (which i purchased) i just wanna take it back.", "Title": "Horrid", "Date": "January 7, 2014"}, {"Author": "Sharon Bain", "ReviewID": "R2K5HV78HSRX3C", "Overall": "5.0", "Content": "I really didn't use it, its a birthday gift. I love the specs and I know it would be a great gift. With Alldaymall 7\" Tablet  you could surf the net play games. The memory is pretty good. Besides it has wifi and a camera that's cool.", "Title": "Alldaymall tablet", "Date": "December 13, 2013"}, {"Author": "Travis Wayne Hensen", "ReviewID": "R1I4XMCVS33T41", "Overall": "3.0", "Content": "i had it for month i got to set it on the damn counter and the screen cracked but for the price i cant complain so if you get this tablet be careful with it", "Title": "its okay", "Date": "December 13, 2013"}, {"Author": "Mudfarmer", "ReviewID": "RNSPUDJD49AYG", "Overall": "5.0", "Content": "Surprisingly useful for something so cheap. I wanted a screen a bit bigger than my android phone to read news feeds and emails over coffee. This runs all my favorite apps. Got the deal with the included keyboard case. I'm quite pleased. The keyboard case is excellent in quality and the keyboard works seamlessly. The tablet is protected and easy to carry around with the case. There is a great little prop on the back for hands-free reading. A lot more text shows than on my Samsung S4, so a lot less scrolling, more coffee swigging time. For the money you can't go wrong - get the bundle.", "Title": "Get the Bundled Keyboard Case", "Date": "December 12, 2013"}, {"Author": "john mccloud", "ReviewID": "R1V3UAJ9DYJFZD", "Overall": "5.0", "Content": "Thank you it is a wonderful holiday gift and my husband stole it from me and I had to by another one but thank you .", "Title": "Hope you have a wonderful holiday and new year best of wishes", "Date": "December 11, 2013"}, {"Author": "Casey T", "ReviewID": "R2YKTAF8LLXRMF", "Overall": "1.0", "Content": "Don't buy this. It is extremely slow with very few apps. I bought it for my 3 year old and still returned it. It also came from China so it cost me over $20 just to return it. What a waste of money!", "Title": "Don't buy this!", "Date": "December 3, 2013"}, {"Author": "Gwyndolyn Cochran", "ReviewID": "R2WSOGX9C0P320", "Overall": "3.0", "Content": "This is an okay tablet for a kid or someone who won't use it much. It does how ever freeze up more often than I feel feel it should.", "Title": "it's ok", "Date": "December 3, 2013"}, {"Author": "CB", "ReviewID": "RVY7W793DGEHJ", "Overall": "2.0", "Content": "You generally get what you pay for. I bought this as a Christmas gift and thankfully decided to try it first. I was not impressed as it will nor run any of the pages I have to utilize for my college classes and when toy just try to surf the Internet it takes forever to load. ....I know it is not my internet service as a other devices work fine. I can keep it for very basic uses. ...facebook, candy crush,  etc but is not great. If you are going to get one of these check our nomorerack.com the one I got there is much better.", "Title": "Please don't", "Date": "November 30, 2013"}, {"Author": "Wendy grim", "ReviewID": "RBWOFMK1XFOV1", "Overall": "1.0", "Content": "I brought this product in September . It's been only two months an it needs to be repair first the sound disappeared now it want turn on at all . Very disappointed", "Title": "Waste of money", "Date": "November 29, 2013"}, {"Author": "Leslie E. Brisco", "ReviewID": "R1E4489I1B3QAC", "Overall": "3.0", "Content": "A decent product. Nothing spectacular about it though. It was what my son wanted. good price for the particular item", "Title": "Not too bad", "Date": "November 29, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3O1M9GRHDKN7P", "Overall": "5.0", "Content": "Gave this to my granddaughter.  It fell off the bed and shattered and now does not work at all.  We have had it less than 2 weeks.  It is a nice little tablet, but you must be very careful not to drop it.", "Title": "Shattered", "Date": "November 28, 2013"}, {"Author": "Tamie", "ReviewID": "R2NMV4FT35IY4B", "Overall": "4.0", "Content": "The tablet is a very small, easy to handle, and a simple entertainment. All though it can be a little slow, ( I do not have that many apps on mine ) Its a good device. My touch screen has cracked though, and once you do that, it is very hard to controll the touch settings anywhere. I suggest getting a warranty and taking very good care of the tablet. The camera is great and the storage on it is amazing.", "Title": "Its okay", "Date": "August 20, 2013"}, {"Author": "Jonathan Davis", "ReviewID": "R38TNSLHNVK4G8", "Overall": "5.0", "Content": "I am very impressed of the many features this tablet has !!!This is a great tablet with a great price !!!", "Title": "Great price for a great device !!!", "Date": "August 18, 2013"}, {"Author": "H. P.", "ReviewID": "R19II8C85BKOIB", "Overall": "3.0", "Content": "Got this for my daughter.  The vendor we bought if from, got it to us in about 6 weeks (slow boat from China).  The screen initially had a distorted spot on it, which I kind of ignored.  After about 4 months she said it's just not working right.  That's been our experience on several of these really cheap tablets.", "Title": "It's ok...", "Date": "August 16, 2013"}, {"Author": "David J. Eng", "ReviewID": "R3HQIE8B8T1FXZ", "Overall": "2.0", "Content": "I received the product with the microphone not functioning.Pros: Lightweight, great internet browsing experience, battery fully recharges in ~30 minutes.Cons: Heats up, Poor Battery Life, Feels CheapOverall: I wouldn't buy it. I rather shell the extra cash for a brand name tablet since it really gives you a different experience. I ended up getting a 1st gen Nexus 7 for about $100 more and am super satisfied with it!", "Title": "Wasn't what I had hoped", "Date": "August 16, 2013"}, {"Author": "tyrone williams", "ReviewID": "R8SLR9IQ91B7S", "Overall": "3.0", "Content": "this is a good tablet for the price. I really like it but my main problem with this tablet is that on the 2 tablet that I orderedthey both loss the sound while I was playing fruit ninja.", "Title": "not bad for the price", "Date": "August 14, 2013"}, {"Author": "Mr. harrison", "ReviewID": "R3VH2UVJ62RSRO", "Overall": "4.0", "Content": "Very glitchy light damage on screen, looked new but saw signs of ware and tare,will be buying a different version.Would hold a full charge less than an half-hour.charge socket was damaged, and manual has spelling mistakes.", "Title": "it's ok", "Date": "August 13, 2013"}, {"Author": "GENE", "ReviewID": "R251YZGK295RTY", "Overall": "2.0", "Content": "I was trying to take a picture and the screen just froze and won't move. I have tried to cut it off and start it againg. No Luck. I have been had. I just got this darn thing. I read some of the review and should have heeded them. What do I do now. Aby suggestions?", "Title": "Stopped working", "Date": "August 13, 2013"}, {"Author": "Jonathan", "ReviewID": "R3CV87RLK0M6BO", "Overall": "5.0", "Content": "Hello. I finally got the tablet Yesterday. I really like it I have not found any of the issues other people have had with it. Yeah the power cord sticks out a bit but thats just nit picking. I am able to get onto the internet and pretty much look at anything. My only real issue is the music. Seems it fills up fast with the music which is one of many reason why I wanted it, So I can put music on it. And for some reason it doesn't recognize the music. If anyone knows if you can change that please help me out. If there is an app I can store music on instead that would be great. To free up space. But so far so good. I have most of the apps I would want downloaded. I can skype, kik and anything else. It's like phone without actually being one. Which is cool. Would be cool if it connected to something outside my home so I can be on internet all the time. but that would probably cost me money. I give this product a 5 star anyway.  I am still getting to know it. Again my only problem is the music fills up fast. I'm not able to put all the music I want on it. And it lists most of the music as unknown. They're off CD's. Hope you enjoy it. I recommend buying one. I'm not a fan of the I products. I'm just not. I see a lot of off branded stuff that works just as great. Like this one. the 7 inch through me off. It's a lot bigger than I had imagine. The touch screen makes me feel like Ironman with being able to shrink stuff and move all about. If anyone reads this and can help me out with the music let me know. If there is a way to get more music and have it readable would be great to.", "Title": "I like this Tablet", "Date": "August 13, 2013"}, {"Author": "zack", "ReviewID": "R3ESRI3LIPO1SG", "Overall": "4.0", "Content": "It work good. I like it that I can put it in my back pocket but still. See the screen", "Title": "alldaymall", "Date": "August 12, 2013"}, {"Author": "Brett", "ReviewID": "R1SDXGE9VQBRRY", "Overall": "4.0", "Content": "I purchased this for a friend of my daughter's as a graduation present, and has not expressed any complaints so far. She is part of the digital world and uses it for everything. She is very picky about everything so since she hasn't complained I have to assume she is happy with this purchase.", "Title": "Surrogate", "Date": "August 11, 2013"}, {"Author": "carol nagy", "ReviewID": "R2QTW19JMYA7L0", "Overall": "1.0", "Content": "Could not get it to charge completely. Directions were useless. They did not tell one how to use it and were vague.", "Title": "Alldaymall Andriod", "Date": "June 12, 2013"}, {"Author": "Augustine", "ReviewID": "R2U3EU3TVPQQ43", "Overall": "5.0", "Content": "This is a great multi-functional device.  It's compact but definitely gets the job done.  I have no hesitation to recommend this product.", "Title": "NIFTY!", "Date": "June 11, 2013"}, {"Author": "KIMBERLY STEELE", "ReviewID": "R32Q5K1051N5BO", "Overall": "1.0", "Content": "I was very disappointed with this tablet.  The price was nice but the quality stinks!DONT BUY THIS IT DROPS WIFI OR HAS TROUBLE FINDING IT.", "Title": "very slow and no good conections with wifi", "Date": "June 10, 2013"}, {"Author": "David Rivera", "ReviewID": "R2GADXA15M4IGW", "Overall": "5.0", "Content": "This tablet does everything it's supposed to, and for what it cost, does it very well. The screen does kinda scratch up a bit, but that's only because I don't have a screen protector.", "Title": "Great for the price", "Date": "June 5, 2013"}, {"Author": "MAMADOU    SECK", "ReviewID": "R1LY932HQG6MYX", "Overall": "5.0", "Content": "this is a really good tablet,the only problem i had was the battery get drain really fast but other that it the best tablet i had", "Title": "the best", "Date": "May 30, 2013"}, {"Author": "Brooke", "ReviewID": "R1BPN6M2EVM1BQ", "Overall": "3.0", "Content": "The screen is kinda dark...the charger broke the day I got it, thank god I had an extra one. The battery life isnt the best BUT it does its job and its great for my 7yr old.", "Title": "Perfect for my son..", "Date": "May 30, 2013"}, {"Author": "Jml", "ReviewID": "R2G70FXN20R3L2", "Overall": "4.0", "Content": "I was skeptical when I bought my brother this tablet for a graduation present, but I must say he loves it and I'm thinking of buying one myself. This tablet. Is extremely thin and the touch screen works pretty well. As for the speed it does lag and the viewing angels are bad. Over all I say you can't beat it for a budget tablet. One major draw back however is it uses a propriatery charger.", "Title": "Very decent tablet", "Date": "May 29, 2013"}, {"Author": "C. Yamaguchi \"pax\"", "ReviewID": "R3LWOIQSFM2OD9", "Overall": "4.0", "Content": "product came within a reasonable amount of time, esp for free shipping...works well..no complaints so far, except for short battery life--meter on device does not appear accurate...drainage possibly depends on functions using...unsure how to close apps, so this may be draining battery as does online usage", "Title": "Money's worth", "Date": "May 24, 2013"}, {"Author": "lisa", "ReviewID": "R1NK0XXAWHQUTO", "Overall": "5.0", "Content": "My tablet is great. It does everything i need it to do. It was a great purchase. Best buy ever.", "Title": "android", "Date": "May 21, 2013"}, {"Author": "Gussie", "ReviewID": "R33IMSOGNT5C10", "Overall": "3.0", "Content": "This is not a bad item, but you do get what you pay for.  Very light weight.  I ordered 2 and had to immediately send one back because the screen did not work.  Luckily, the customer service was amazing and made the return simple and fast!  The power cord fits into the tablet awkwardly.  It's hard to plug it in and it doesn't go all of the way in...just enough that it connects.  Functions similarly to any other Android tablet.  If you are wanting a tablet that will get a lot of use, I would invest in something a bit more ... but for my mother (who can barely use electronics) it works fine for her to check email and play games.", "Title": "It's okay", "Date": "May 21, 2013"}, {"Author": "Diane L. Fredrick", "ReviewID": "R2N4KDVG2UCRZY", "Overall": "4.0", "Content": "This product is just what I ordered, this is  my first tablet and works just great,still learning all the features", "Title": "7 in. tablet", "Date": "May 20, 2013"}, {"Author": "dushann smith", "ReviewID": "R1ZBCNY76LR5BK", "Overall": "4.0", "Content": "I like this tablet, and it actually seems to be a pretty good item. Its holds a whole lit if applications, games, movies, music and I am able to multitask without any issue. Its easy to use which is even better because I have to do things quickly, like taking notes for class or searching for stuff. What I don't like are the chargers, however. They don't charge properly, but I have other chargers so thats all right. It doesn't have Bluetooth or at least it doesn't properly show the settings. Some words are misspelled while going to the settings menu. Other than that, its a good product. I would recommend it for people who need a tablet, and never had one. Its good to start with. Nice job All Day Mall, and I hope to see you guys come up with better products.", "Title": "Pretty Nice.", "Date": "May 20, 2013"}, {"Author": "Beverly in Ormond Beach", "ReviewID": "R334CMCCJ1POBX", "Overall": "4.0", "Content": "This little tablet is a typical clone, and works great from removal from the box. Its battery is low on duration, so keep the screen brightness down, but it sets up easy, logs onto the local WiFi network quickly and has reasonable processor speed for using the web. The keyboard is almost a necessity with this one if you want to max out its use. It is light weight and the wife loves it.", "Title": "Great for the price", "Date": "May 16, 2013"}, {"Author": "J. Chun", "ReviewID": "R3HFE48X1XV4E5", "Overall": "2.0", "Content": "To me I thought the quality of the product was ok.  It didn't seem cheaply made, but I could not controll it.  The date would change back to 2000 everytime I turned it on.  It went where it wanted to, it turned off when it wanted to, the battery seems to run out pretty fast.", "Title": "Not that great", "Date": "May 15, 2013"}, {"Author": "gaon escude", "ReviewID": "R10U2CT07TXPDB", "Overall": "3.0", "Content": "there is no phone number or address to contact this company the manuel of instructions is so small you need a magnifying glass to read it.  could you please send me info on contacting this company. also the keyboard on thecase does not work on this android. would like to know if there is a defect or this is not compatible. why would a company conceal their name and not provide any warranty information or contact no? gescude@yahoo.com", "Title": "HOW DO YOU CONTACT ALIDAYMALL ?", "Date": "May 15, 2013"}, {"Author": "David G \"Rassy\"", "ReviewID": "R2VA039TJYLD0H", "Overall": "4.0", "Content": "The tablet works so well except the battery doesn't last very long but I love playing with it and the way it's set us it's so easy to use. It's more stable then an iPad I don't ever feel like its going to brake or need a case. It has a camera in the front which is great especially at the price of this deviceAll in all very good item", "Title": "Cute tablet", "Date": "May 12, 2013"}, {"Author": "Morisato", "ReviewID": "R3MXOFXVEX1B75", "Overall": "5.0", "Content": "Purchased this as a gift! And they love it :) This is a good gift for someone who has never had a tablet before.Pros:  - Includes JELLYBEAN 4.1! Yes. Although this tablet only has 512MB of RAM, it is factory installed with JellyBean 4.1.1 (refer to photos)  - Has a good feel to it, doesn't feel flimsy (I expected to for the price).  - The screen looks good, when directly facing it.Cons:  - Slow loading times, but that's to be expected from a budget tablet.  - On the tablet we received, the AC Adapter sticks out slightly. (This worried me a little, as I'm uncertain whether or not you could get shocked by touching the exposed part that slightly sticks out).I'll update this review if anything happens to the tablet during normal use. Otherwise, GREAT tablet especially for the price!", "Title": "Amazing for the price! AND includes Jellybean 4.1!!!", "Date": "May 3, 2013"}, {"Author": "michelle", "ReviewID": "RE30HXY5J4CLL", "Overall": "2.0", "Content": "This item is very slow. Its very hard to access the internet, it take at least 5 minutes for something to come up.  Battery goes down very fast. Sometimes my son cannot access the internet at all", "Title": "slow", "Date": "May 2, 2013"}, {"Author": "Ashorntae McQueen", "ReviewID": "R8V1QZSIL4A2E", "Overall": "3.0", "Content": "What can I say it is ok and could've been beter. Don't buy if you want to surf the net with it. Its a anoying when I'm on fb and I have topress the comands on he screen so hard to get a response. Its good if you wang to useplay store a lot. But honestly i'not impressed. I got this because I wss on a real TIGHT budget an a wanted a tablet util I could afford an ipad or samsung.", "Title": "tablet", "Date": "April 29, 2013"}, {"Author": "Savone Madlock", "ReviewID": "R3HZOW08IN4ENO", "Overall": "5.0", "Content": "I would definitely recommend this tablet to anyone that's new to tablets it works perfectly fineand I must say that I enjoy everything it offers and with the 7\" Tablet Stand with USB Keyboard - Black Faux Leather Carrying CaseIt's just a steal lol.", "Title": "Definitely for tablet beginners", "Date": "April 29, 2013"}, {"Author": "teddi", "ReviewID": "R3RKEYEA8VL4GZ", "Overall": "5.0", "Content": "it works great and very easy to use.  i would buy it for anyone on my gift list.  and it came when promised", "Title": "touch screen tablet", "Date": "May 27, 2013"}, {"Author": "George Hall", "ReviewID": "R3Q8QK0FL1BJFF", "Overall": "1.0", "Content": "After the first day this tablet started getting hot and freezing up. I figured I would let it cool down and try to use it again. It took about 10 minutes to start up and then it froze again. Trying to turn it back on gives a blank screen. The one time it was on I tried to download an app, but the Google Play-store icon took me into the settings menu.I already threw the box out else I would definitely return this. Wait until you have the funds to get a decent tablet!!", "Title": "A piece of CRAP!", "Date": "May 15, 2013"}, {"Author": "TonyTheTiger", "ReviewID": "R1WX7O4FB44C74", "Overall": "5.0", "Content": "This tablet is actually pretty good for running and downloading apps. I originally was going to just use it to surf the web which it does great , but surprisingly it can function with games and apps just as good. I use it to play games and watch youtube video with it. I Had it for a week or 2 now and so far had no problem with it. The only downside is small storage of memory but for the price i cant really complain.", "Title": "Not as bad as I thought it would be", "Date": "May 9, 2013"}, {"Author": "Zak \"Diva\"", "ReviewID": "R14M92CMOZH32I", "Overall": "5.0", "Content": "I bought this tablet for my four year old brother because he loves to play the games on an older android phone we had given him. I was able to get a screen protector, keyboard case, and an adapter, four styluses, and the tablet for all under 90 dollars. The tablet is blue as the seller I had picked stated it was blue. It came with Android 4.1.1 Jellybean. When I first turned it on I was kinda disappointed that it was a bit slower then I was expecting but I had fixed that by downloading Nova Prime Launcher which allowed me to change the home layout, hide apps, etc. I put a 32GB SD Card in the tablet to put the games on the SD card to save memory which also helped a lot. I downloaded a task killer and taught him how to use it to save battery life. I know it states this tablet has about 5 hours of battery life well that's a total lie. It's got about 2 hours, but for the price and how fast it charges back up It doesn't bother us. Its got a one year warranty which is another reason why it's a great buy. I would recommend this to anyone who's looking for a great deal and a fast tablet! Also If you're wondering the seller I had bought from is Andteck USA (They're amazing and offer you tech help after you buy probably one of the best sellers on Amazon!) If you have any questions feel free to ask!", "Title": "GREAT tablet for the money!", "Date": "May 3, 2013"}, {"Author": "Michelle", "ReviewID": "R2D74KDZE16EU5", "Overall": "4.0", "Content": "Well I just got this tablet today. I got this for my mom and for the most part is a nice tablet. Screen is nice, way nicer than I expected. Its responsive to the touch but the machine is a little slow...but this is a cheap tablet so no surprise. Plus I have been spoiled by faster computers. It seems to charge fast and the battery life really isn't to great. probably just get a couple hours. You can still use it if its plugged in and charging if you must. My major complaint is the speaker volume its barely audible. It may be ok if you are in a very quiet place or use decent earbuds but not good to set on a table closeby and listen to Pandora or anything. I may return over the sound volume thing not sure yet. It was disappointing. I will update later if anything arises and feel the need. All in all for $60 for a cheap portable little web browsing Facebook machine its ok.", "Title": "Beautiful, responsive screen. Speaker volume sucks", "Date": "May 1, 2013"}, {"Author": "Karen Smith", "ReviewID": "RPCSRGUO0L5G8", "Overall": "3.0", "Content": "I gave this a 3 because the screen scratched  on the first day of use. I did get a screen protector  for it.after that. Also it is slow at downloading . My young grandson likes it so for the price it is okay for the games he likes to play on it.", "Title": "I bought if for my 4 year old grandson", "Date": "April 30, 2013"}, {"Author": "Tina", "ReviewID": "R33ZXSUWVUCEDB", "Overall": "4.0", "Content": "I really enjoy my Android.  It took a little to get used to and figure it out since I usually only have used ipads or iphones.  My kids enjoy using it.", "Title": "Great product", "Date": "April 24, 2013"}, {"Author": "Lawman", "ReviewID": "R1KRNQ9PTB9NVI", "Overall": "2.0", "Content": "First, this was the cheapest 7\" I could find at the time, $68.  I am comparing it to my $199 Kindle Fire.  Perhaps not a fair comparison, I get that.  Out of the box it is much lighter and has a feeling of cheapness compared to KF.  The power cord does not insert all the way, which seems like a malfunction, but it does work.  The battery is much less adequate, running down in less than two hours compared to over 4 for the KF. The display screen is very dark and not able to be lightened sufficiently to be what I consider adequate.  KF is brilliant in this category.  Frequently it misbehaves and needs a total reboot to get it to work at all.  About every other day with this problem.Positives:  It works.  For one third the price of KF you can get a working tablet.  It has Google Play, which means my 8 year old can download and play all the games that Amazon won't let us get on Kindles.  It has a front facing camera (KF does not) so presumably Skype should work, tho I did not test that.  It gets gmail without issue and it can browse the web adequately.Bottom line--After seeing the great display on KF, I would never be satisfied with this.  But I will keep it for my daughter, and she loves it.  If you are an adult and can afford better, buy better.", "Title": "dark screen and problematic", "Date": "April 22, 2013"}, {"Author": "AvidR&B;&Gospel;", "ReviewID": "R1UAZ4S6257GIQ", "Overall": "1.0", "Content": "This tablet is much smaller that I believe it should be for a normal 7' tablet and it's static not smooth and the youtube vidoes are horrible, lastly the screen often rotates at a monents notice w/o even turning the tablet itself... I believe this tablet is only useful for playing compatible games and maybe searching some web sites but not much else.. it only cost me $69 so can't get too upset and I think I'm going to give this away to my lil 10 & 12 yr old cousins..", "Title": "Smaller than I thought", "Date": "April 21, 2013"}, {"Author": "ABSOLUTELY DISGUSTED", "ReviewID": "R2GA8UK54Z8GP1", "Overall": "1.0", "Content": "I can't even use this tablet, it won't charge, because the ports are not centered. This was a birthday gift for my daughter and I am going to have to return it and then repurchase it. Not only that, but in the 3 days it took me to get it, the price dropped almost $10! Seriously?!The tablet itself, from what I could do with it, was great, but since I can't charge it or access the USB port, it's useless as soon as it dies.", "Title": "USB AND CHARGE PORT ARE OFF CENTER CAN'T USE", "Date": "April 23, 2013"}, {"Author": "isis Alexander", "ReviewID": "R9JCT1MKVCSCE", "Overall": "4.0", "Content": "I was tripped while going to put it on the charger and i fell but my lip broke the fall and even though my lip broke the fall when it was finally on the charger a white-ish black-ish color appared and i instantly knew it was over. even the power button and the volume buttons were busted...  Thanks!", "Title": "i actually liked it until...", "Date": "October 21, 2013"}, {"Author": "Brandon Probst", "ReviewID": "RA1NS827OAP7Q", "Overall": "2.0", "Content": "This tablet comes with the Korean version of Android, which isn't immediately apparent since everything's in English. Why does it matter, then? Because as soon as you log into Google account, you're now Korean, with no access to the North American (or wherever you are) Play Store. I did a factory reset on my North American phone, as well as the tablet about a dozen times, and even had a 45 minute phone call with Google support, and an email exchange with Google engineers, because this is apparently a glitch in Google - it now thinks you're in both countries, but errs on the side of Korea, so you're pretty much locked out from any content.As far as the tablet itself, it's pretty slow, the low resolution looks way worse than you expect it to on a 7-inch screen, the battery has about two hours of life in it (that's after being fully charged, with a fresh install of android, nothing running) and it needs to be at the right angle for the screen to be visible and not distorted. Basically, I'm advising against it.", "Title": "READ BEFORE PURCHASING", "Date": "June 18, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R341JRQE8KJL3J", "Overall": "1.0", "Content": "I am in need of the firmware to rest this tablet but it appears that everyone I contact can not give me that information. All I want to know is the firmware needed to reset my grandson's tablet!", "Title": "Who has the firmware?", "Date": "June 17, 2013"}, {"Author": "felix", "ReviewID": "RBRC3CAMFINM", "Overall": "1.0", "Content": "i barely dropped this s*** and it broke it was from like 2 feet my cousins ipad got stepped on and nothing happened", "Title": "piece of s***", "Date": "June 16, 2013"}, {"Author": "Melanie Holmes", "ReviewID": "R27CQT1COXEL56", "Overall": "4.0", "Content": "I ordered two tablets for my two 7 year olds.  The shipping and arrival was excellent.  The look of the tablet is amazing.  My girls actually think it's an Ipad.  It seems to be performing well so far.  I have had a problem with some of the games not playing correctly.  Also on Nickjr.com some of those games would not play.  But overall it is worth the price so far.  I will definately update once they have used the tablet a little longer.", "Title": "OK so far", "Date": "June 14, 2013"}, {"Author": "Tina Bui", "ReviewID": "R3VQAGAIU8H2PW", "Overall": "2.0", "Content": "A lots of frustrated after I received this 7\" tablet first no power up, second, software not communicate to WIFI, I got laptop and IPad 2, too, these things worked fine. A few days after got help from computer geek friend, than I found out in screen of front camera left side had a black dot, a size of a black bean, even I turn to maximum brightness, a picture had a little color more than black & white, is time to return back to a seller.", "Title": "I don't like it.", "Date": "June 5, 2013"}, {"Author": "Rochelle N. Stern \"Rosie\"", "ReviewID": "R2F6TJNVL57SK", "Overall": "1.0", "Content": "Would not turn on.It only turned on WHILE plugged into a wall outlet, even fully charged. It shut down and would not turn on, as soon as it was unplugged.", "Title": "Did not work", "Date": "June 5, 2013"}, {"Author": "Gildardo", "ReviewID": "R1GBTBECKIFPIK", "Overall": "4.0", "Content": "... BROWSING. EMAIL. MUSIC. JUST NOT FOR HIGH GRAPHIC GAMES. BUT GETTING URE MONEYS WORTH FOR SURE. AIGHT TABLET AND LIGHT.", "Title": "GOOD FOR NON GAMERs", "Date": "May 31, 2013"}, {"Author": "HolyCow", "ReviewID": "R1F9CLROHBV0YU", "Overall": "4.0", "Content": "The android works great.  It is sleek in design and seems to be pretty durable.  It is easy to navigate.  The instruction booklet that comes with it is not detailed and of little use.  The system is easy enough to figure out just by working through the various apps already installed. The battery life is disappointing, it dies after less than one hour of use.  However, the battery recharges in less than one hour.  We purchased the android to use solely for checking email while traveling.  It works great for that purpose.  The size is what appeals to me, It can be stowed in a small spot in a carryon bag. There is no identifiable name anywhere on or in the android, and no warranty information was provided wit the android, so good luck if it dies.", "Title": "Alldaymall Android", "Date": "May 31, 2013"}, {"Author": "Tammy", "ReviewID": "R3FDTPL05G4F8C", "Overall": "1.0", "Content": "I am a bit disappointed because even with high speed internet, it takes a long time for url to open up. Also,  the scree. Is not clear,  kinda dull. This tablet does not meet my expectations being an android. I pkan on returning rhis one and order a different brand.", "Title": "Tablet", "Date": "May 27, 2013"}, {"Author": "HijadeDios1967", "ReviewID": "R1B2O49IWFSYPE", "Overall": "5.0", "Content": "This tablet is very good. MID-Robin have 4gb, bit don't need more. There are many data cloud, plus TF card and. USB.", "Title": "Awesome!", "Date": "May 26, 2013"}, {"Author": "Nancy Lau", "ReviewID": "R3CV9P0OJAITEK", "Overall": "5.0", "Content": "My granddaughter is 8 yrs old and I didn't think an Ipad or Samsung Tablet was approriate for her age. Kids don't really take care of things and this cost a lot less and does what she needs it to do!!!", "Title": "My granddaugther loves her new tablet", "Date": "May 22, 2013"}, {"Author": "Douglas P. Garrow", "ReviewID": "R28WK7CQL92O10", "Overall": "5.0", "Content": "I ordered this item as a birthday gift for my grandson in June.  I know he will be jumping around. The ease of ordering here is product is always of good quality.", "Title": "Alldaymail", "Date": "May 21, 2013"}, {"Author": "donald l.", "ReviewID": "RXJVI17PLIL9G", "Overall": "3.0", "Content": "I have not had it very long but so far so good. I will try to keep you posted if it stands the test of time.", "Title": "Item seems to be ok.", "Date": "May 21, 2013"}, {"Author": "dalthin", "ReviewID": "R1S9NY0841IM9R", "Overall": "5.0", "Content": "For the price it is awesome! I read the reviews and after setting it up with the night mode software (thank you pennywyze for recommending this excellent software, there are many good reviews on here but yours was by far the best)  the battery life was much more manageable. I gave it 5 stars because of the price, if you are looking for cutting edge you may want to get something else, but for less than $60 you'll be hard pressed to find better.", "Title": "I'm using it to write this review", "Date": "May 19, 2013"}, {"Author": "Damian Harouff", "ReviewID": "R2F8OS2X9MJQRM", "Overall": "1.0", "Content": "Arrive dead. Received it in the afternoon, played with it intermittently throughout the day trying to get it to turn on, but no go. Tried with the charger, without the charger, with the USB cable, without the USB cable.Could have been great. Oh well.", "Title": "Arrived dead.", "Date": "May 11, 2013"}, {"Author": "Madelyn Grey \"pendrell3\"", "ReviewID": "R12B472AB0Z4HP", "Overall": "3.0", "Content": "If you are buying this for the camera don't. The resolution is pretty terrible. As is the battery life. I got this for my kid and within 2 hours the battery was drained. It is a cheap tablet so I am paying for what I got. Set-up was remarkable easy and it does have a good screen resolution but it's nothing compared to an ipad or kindle", "Title": "Pay for what you get", "Date": "April 26, 2013"}, {"Author": "blondb", "ReviewID": "R3ESBUAU0LZRGG", "Overall": "3.0", "Content": "battery life  dies under 2 hours of use ,a bunch of apps that are already installed doesnt work  and apps that i download but its for my two year old son so he is happy with it just to play the games that do work. internet works fine.", "Title": "its ok", "Date": "April 24, 2013"}, {"Author": "Pen Name", "ReviewID": "R3AE3ZV1N27O0E", "Overall": "4.0", "Content": "Product works very well. Some of the games downloaded did not work correctly but good enough for my daughter. She loves it, it's a good deal for the money", "Title": "perfect for my 5 year old", "Date": "February 8, 2013"}, {"Author": "Stephen Boyd", "ReviewID": "R8PXMZYNPZZ2Z", "Overall": "3.0", "Content": "It has worked for me.  I use it as an external drive and store my musicon to use in my car.  Don't expect top of the line quality, but, worth whatyou pay.", "Title": "Good as a supplemental external drive", "Date": "October 8, 2013"}, {"Author": "Omar", "ReviewID": "R264MJKVOXPEEM", "Overall": "4.0", "Content": "hello recently purchase a tablet you the problem is that I broke the lcd screen not only the front glass let me know if you have parts for this tablet if you have one please let me know", "Title": "screen glass broken", "Date": "June 27, 2013"}, {"Author": "Teri Miller", "ReviewID": "R3H2XQONHZEARS", "Overall": "1.0", "Content": "I didn't want to spend hundreds of dollars on a tablet but I guess I should have.This little tablet looks good and worked great for the whole day that it actually worked. I put it on the charger and went to sleep. When I woke up, I noticed it had powered off, though I hadn't shut it down previously. I started it up and it took AGES to boot up, somewhere around twenty minutes. As soon as I went to use it, the stupid thing restarted on it's own! So I let it boot back up (another twenty plus minute affair) and again it restarted without warning only seconds after I unlocked the screen to use it.Needless to say, I am returning it for a refund. Don't waste your time. Buy something that will actually work.", "Title": "Junk", "Date": "May 2, 2013"}, {"Author": "Yaritza Tevenal", "ReviewID": "R2UVR6IA6JNO62", "Overall": "4.0", "Content": "I bought this for my 10 years old son and it works just fine. I recommed this product to anyone one that want to a tablet for a great price.", "Title": "Great!", "Date": "April 13, 2013"}, {"Author": "home-mom", "ReviewID": "R2O8EF8IAE6BI7", "Overall": "5.0", "Content": "I've only had this a week, but I am very impressed with this tablet.  The price was great, and it does more than I expected.  My daughter has used the tablet to play games and watch movies from Netflix with no problems at all.", "Title": "Great tablet.", "Date": "April 8, 2013"}, {"Author": "Jen", "ReviewID": "RR9VT7FMX43F8", "Overall": "2.0", "Content": "I bought this tablet as a birthday present for my 4 year old who wanted an \"iPad\". She believes it is one. Thank goodness she is fooled, and doesn't understand what a tablet is supposed to do. This tablet is turtle slow, apps are difficult to download, and it turns itself off on a whim. The graphics are as I expected them to be for the price. I have to say overall I am disappointed. I will add that she is pleased with it. So if you are 4 and have a vivid imagination, this product might be what you are looking for.", "Title": "Review", "Date": "May 26, 2013"}, {"Author": "Danelle", "ReviewID": "R3VCM2BHVAM1O3", "Overall": "1.0", "Content": "We haven't even had the item for a week and the power button sticks in.  What a waste of money!  We have a Kindle Fire and we will just buy another one for our household....save your money on this one.", "Title": "Broke in less than a week", "Date": "April 21, 2013"}, {"Author": "vickyo", "ReviewID": "R2DXMSQTTF80HR", "Overall": "5.0", "Content": "this looks brand new, hope my granddaughter likes it and can use it for school and band and for her personal stuff", "Title": "good looking tablet for a great granddaughter", "Date": "November 10, 2013"}, {"Author": "zuleica javier", "ReviewID": "R3ONL49T2LBIYF", "Overall": "1.0", "Content": "i lost my money.. is so slow, isn't what i expect. didn't work like i wanted... bad software bad camera bad screen", "Title": "doesnt work", "Date": "June 30, 2013"}, {"Author": "DK", "ReviewID": "R3D6VYTKAEWQW2", "Overall": "2.0", "Content": "not a good tablet. could not calibrate the screen.I was hoping this would be good, but not very well pleased. sent it back.sorry....", "Title": "yikes", "Date": "May 2, 2013"}, {"Author": "Wayne Tulley", "ReviewID": "R3PH7DVD2RTQOW", "Overall": "1.0", "Content": "I just notice the tablet doesnt look like the ones on the picture \"aldaymall\" logo, small icon app wigets, HD vids, only front screen camera..instead mines was cheap, poorly build, poorly function,  low quality camera,  and every download is a virus which slows do my tavlet and freezes for 30 mins...I just now notice all of these before it froze on the loafing screen \"android\"... I wajt a new tablet and I will ship the piir excuse on back.  Thank you if ajyone reads this.Also no update optionsNo games workApps frezze ti 2-3o minutesIf falls on floor back will come offSpeakers really low...lower than an 85 year old woman calling for help!!Please I want a refundor new tavlet..the old one I will ship back or you can put the miney on my paypal. Thank you", "Title": "please read my review", "Date": "August 6, 2013"}, {"Author": "Thomas A. Lawler", "ReviewID": "R2VD6IFE318WC4", "Overall": "1.0", "Content": "I bought it just to keep me organized and all it did is crash on all of my apps. Its slower than molasses and is just crap!", "Title": "Don't buy", "Date": "June 2, 2013"}, {"Author": "maria", "ReviewID": "R3LZC80GFMRZ99", "Overall": "5.0", "Content": "i am so happy. the shippement was  faster than expected. the product is as good as described. and works perfectly. the most important thing is that the price is extremely cheap for this great tablet I recommend every one to buy it. and I probably will buy more for  all my familly'thank you so so much amazon.", "Title": "great tablet for a stupid price", "Date": "April 16, 2013"}, {"Author": "khoa trinh", "ReviewID": "ROXUO19O38YFI", "Overall": "5.0", "Content": "Tien nao cua do,neu dung de coi tin tuc,hay choi nhung games nhu angry bird,shooting...thi ok. tien loi co the bo trong tui", "Title": "Good tablet", "Date": "May 3, 2013"}, {"Author": "Makayla", "ReviewID": "R1JRMCOTF7HW2", "Overall": "1.0", "Content": "They called me block and wanted me too remove my review and if u are reading this I'm not removing how I feel I don't care if u people gave my money back I'm telling people how it works and how it is a rip off . .. Because them calling me telling me too remove my comment for my review no I'm not the picture went out and the screen went black worked for a day or two", "Title": "7\" tablet", "Date": "June 3, 2013"}, {"Author": "susanne spellman", "ReviewID": "R1KLY5IHQ7IWTP", "Overall": "3.0", "Content": "to slow long to chargekids will eat it up not long enough charge cord do they expect you to sit to the wallif you are a fast person like me you wont want thismade a great gift for kid for the price only", "Title": "my kid likes it", "Date": "April 7, 2013"}, {"Author": "YR", "ReviewID": "R1A35QHDIMF66C", "Overall": "2.0", "Content": "well all except for a tablet that does not load wine turns bad.tablet is bad loading and no more", "Title": "Tablet Bad", "Date": "February 25, 2013"}, {"Author": "Drew Rogers", "ReviewID": "R18R03G0F5WPMH", "Overall": "1.0", "Content": "i dont have one of these pices of crap i have a 600$ asus tf700t.people stop looking at this crap go buy a name brand tab like asus ,samsung etc....dont buy  off brand crap.", "Title": "i dont have one but", "Date": "June 4, 2013"}], "ProductInfo": {"Price": "$129.99", "ProductID": "B00J1W0NYG", "Features": "This Alldaymall tablet use fast 1.5GHz Allwinner A23 Dual Core CPU, which has high performance and low power consumption.\nGoogle Play Pre-Installed, which gives you access to thousands of free apps isntantly.The tablet supports Skype Video Calling, Netflix, Facebook, YouTube and more.\nThe built-in Wi-Fi in this tablet supports Wi-Fi 802.11b/g/n to make it easy for users to connect online, downloads or surf the web with advanced Wi-Fi technology.\nIt is 4 GB of built-in storage, but you're free to expand that storage capability by up to 32 GB TF card. Simply slide an TF card in and enjoy photo slideshows, music playback, and even video playback!\nSupported and fully warrantied by Alldaymall!", "ImgURL": "http://ecx.images-amazon.com/images/I/51oi%2ByUmo-L._SY300_.jpg", "Name": "Alldaymall® 7 Inch Android 4.2 Tablet PC MID with Capacitive Touchscreen (Dual Core CPU, 1.5GHz, Wi-Fi, Dual Camera) Black"}}