{"Reviews": [{"Author": "Serious shopper", "ReviewID": "R26NJ5ULMOXILQ", "Overall": "5.0", "Content": "My husband loves technology and this is his new toy. He has an android phone and this works very similarly. He would highly recommend it!", "Title": "My husband's new toy!", "Date": "May 25, 2014"}, {"Author": "JR Account", "ReviewID": "R11XF471CCEVOX", "Overall": "5.0", "Content": "I have been happy with this item from day one.  I got it to stream Youtube and do emails.  It works great for them both.  I do not experience much buffering.  I say much because I stream mostly on Wifi and some connections are weak.  The color the sound are crisp and clean. Pictures are awesome.  It automatically syncs contacts, etc.  And the price was right.  You will be more than satisfied with this purchase.", "Title": "Happy Am I", "Date": "June 5, 2014"}, {"Author": "Mase", "ReviewID": "RTLVO1JLMM2XI", "Overall": "5.0", "Content": "Perfect choice...l love my tab right now. Im so happy a got it and and its working perfect. Value for the money..its cool.", "Title": "Perfect Choice", "Date": "June 5, 2014"}, {"Author": "Kelly Borelli", "ReviewID": "RALVF09YF03ME", "Overall": "5.0", "Content": "I bought this for my 72 year old mother..so she could take pics and upload to Facebook with ease. She can also look at email and the internet. I have a Samsung Galaxy Phone so i found it easy to navigate and easy to show her. So far so good.", "Title": "I really Like this", "Date": "June 4, 2014"}, {"Author": "Adam Hayslett", "ReviewID": "R3EC65XT7LXR0Q", "Overall": "5.0", "Content": "Let's face it, everyone wants to know how it compares to the God of tablets: the iPad. It's every bit as good. Now that it's common for people to jail break their iPads to be more like Droid devices, it's pretty obvious which is more user friendly.The only downside of going with Droid rather than Apple is the app availability, but that's hardly the fault of a device. Strictly speaking, this thing is awesome. I didn't buy it over the iPad to save a couple hundred bucks, I bought it because it's more versatile and practical.", "Title": "Great tablet!", "Date": "June 4, 2014"}, {"Author": "Anna Lino", "ReviewID": "R14W8R4F4DODWU", "Overall": "4.0", "Content": "The camera is not that good and you might as well search between the new releases. But I am using it a lot and what I most love about it is that it doesn't look really fragile. Which is great!", "Title": "Very good", "Date": "May 22, 2014"}, {"Author": "StormFireKitty \"StormFire\"", "ReviewID": "R3BUXPYGMQLD6W", "Overall": "5.0", "Content": "I was getting ready to buy the Tab 3 when I noticed on the Samsung website that the Tab 4 was available for pre-order and would be released in a week, with almost double the processing power, and only $20 more.I'm one of those oddballs who can't fall asleep unless the TV is on, but my Apt does not have A/C, so the heat given off by the TV gets pretty bad. This works quite well with the Samsung Galaxy Multimedia Desktop Charging Dock for Samsung Galaxy Phones (although make sure that you buy it directly from Amazon, as some of the affiliated sellers are sending clone/counterfeit units that break almost instantly) going into docking mode, charging, and using the external speakers.I take my Tab with me to read comic books on the bus on my commute, and then when I get home, I dock it and load up Netflix, Hulu+, or Stitcher on my desk, turn it to face the bed when I'm ready to doze off, and never have to power on the space heater that disguises itself as a TV.One odd note: I also have the Samsung Galaxy Smart Dock Multimedia Hub for Galaxy Note II/ Galaxy S 4/ Galaxy S 4 Active/ Galaxy Mega which works beautifully for my Note 2, but works ONLY as a stand and charger with the Tab 4. It does not go into docking mode, or recognize the USB/HDMI ports and external speakers.", "Title": "I adore this Tablet", "Date": "May 31, 2014"}, {"Author": "Amanda Lynn", "ReviewID": "R1AKO3KWQHVFZY", "Overall": "4.0", "Content": "Great features:Love the screen size!Love the lightweight!Love the kid friendly interface option!Love the extras included!Love the speed!Love the space! Lots of available space!Less than great features:Pixels-Ehh, not your best job on resolution SamsungNot as user friendly as Apple productsOverall assessment:Good product at an affordable price. Chances are if you are an android fan already you'll love this product, if you lean towards apple products you may not be as impressed.", "Title": "Almost love it!", "Date": "May 13, 2014"}, {"Author": "Sean H Allred", "ReviewID": "R28NDMAC1F2ZDL", "Overall": "3.0", "Content": "Pros : Sleek, lightweight, has the same \"home\" button used on Samsung's smart phone line, with similar menus.Just fast enough to play a properly formatted movie or some music.Decent color reproduction.Cons : Abysmally poor sound quality and volume ( You'll need headphones or a bluetooth speaker ).Battery life and screen resolution not up to par with competitors for the same price.Charge time is ridiculously long.In order to use a card reader or external usb device, you must buy an expensive, proprietary dongle from Samsung. While using said dongle with a card reader, battery percentage as reported on screen never goes down, no warning of low battery, and it will drain until tablet shuts off. To add insult to injury, the dongle plugs in the charging port on the bottom of the tablet, making it impossible to set the tablet upright to watch movies. Whoever designed that port should be fired.", "Title": "Does what I bought it to do, and that is to watch movies and listen to music.", "Date": "June 2, 2014"}, {"Author": "Sarah Roetcisoender", "ReviewID": "RFZ880MAA2DHL", "Overall": "5.0", "Content": "This is a fantastic tablet!! The price, number one, is very decent for what you're buying. The quality of the product is amazing. The screen is crisp and clear, operation is very easy and user friendly, it operates on an android system so you have all the apps available to the android market, the placement of buttons is well thought out, and my favorite thing by far is the option to add on to your storage with an SD card. Love this tablet, am completely happy with my purchase.", "Title": "Great tablet", "Date": "June 9, 2014"}, {"Author": "Scooter Lady", "ReviewID": "R3ADQCH8EXS7WZ", "Overall": "5.0", "Content": "easy to operate, touch screen is easy and smooth.  Fits in the Fintie cover without having to worry about it falling out.", "Title": "10.1 screen tablet", "Date": "June 7, 2014"}, {"Author": "countrygirl", "ReviewID": "RQXF67ZHRHWY2", "Overall": "5.0", "Content": "My brother and sister-in-law came to visit recently and each of them has a tablet or notepad. After watching them use theirs so much I decided to get one for myself. I still don't really know the difference between the notepad and the tablet but the tablet without any telephone connection is all I needed. It is still full of useful features  I'm still learning how to use it but the quality and appearance seem great.", "Title": "My first tablet and I love it.", "Date": "June 4, 2014"}, {"Author": "Timothy Collins", "ReviewID": "R2YI2OU5VPQGSL", "Overall": "5.0", "Content": "Love this tablet! It does everything I need it to, just wish you could get it with data instead of WiFi", "Title": "Great Tablet", "Date": "May 27, 2014"}, {"Author": "T. Perkins \"Buys from Amazon\"", "ReviewID": "R17ME5H4XVSEW8", "Overall": "5.0", "Content": "This is the second Galaxy Tab I've owned. Better screen resolution would have been nice, but I couldn't justify the additional $150 for a Pro.", "Title": "Great tablet for the price", "Date": "May 20, 2014"}, {"Author": "Micahel Stamps", "ReviewID": "R25SD0TT39FLN9", "Overall": "2.0", "Content": "The first one I received was defective. However with Amazons amazing return plan this was a minor problem.If it weren't for the following two things I'd give it a 4 or a 5 however1) If you connect it to a computer this device is not seen as a simple storage device. It thinks it's a music player using something called MTP. This is truly annoying since I wanted to simply move files to the device using the standard drag and drop methodology. There are workarounds but they are annoying2) It will NOT charge off of a computers USB port. I left it plugged in for an hour and it didn't gain even a percentage point. This truly sucks big time. You can charge it from the wall socket but not from your computer.", "Title": "It has problems", "Date": "May 23, 2014"}, {"Author": "Penny Parker", "ReviewID": "R1DOQ51LOZK5PG", "Overall": "4.0", "Content": "It took  a while to decide on what tablet I would get but I knew it would be Samsung. I have been very happy with their products in the past, as with the Galaxy line. It is user friendly, a great size and the touch ability is great. I am enjoying it very much. I have a lot to learn still but was able to start using it as soon as it was charged. I have and will recommend it to others", "Title": "Awesome tablet", "Date": "May 18, 2014"}, {"Author": "Catherine Gilliam", "ReviewID": "R18PF9229J92QH", "Overall": "5.0", "Content": "Very nice.  Boots very quickly.  Firmware support locked up during update using Kies 3, but Win7 64bit should have been using Kies 2.6, so the whole thing went sideways, halfway.  Tech support call walked me thru a factory-reset of firmware, and the stuck-halfway-update vanished.  Updating to newest firmware using Kies 2.6 worked okay (though all data stored on device was erased).  Overall, very good, would buy another.", "Title": "Fast.  Slick.", "Date": "May 4, 2014"}, {"Author": "ROSAMAE KING", "ReviewID": "R3AR5WXMHFMWH9", "Overall": "5.0", "Content": "I HAE THE FREEDOM TO GO ANYWHERE WITH THIS IT NOT TO HEAVY  I AM REALLY ENJOYING THIS IT MAKES MY LIFE MUCH EASIER", "Title": "GO ME", "Date": "May 8, 2014"}, {"Author": "Xue Ling", "ReviewID": "RDPBNP612WGTQ", "Overall": "1.0", "Content": "The first day was still usable, but the second day, the tablet's touchscreen was unresponsive and it was resetted many times without any effect.", "Title": "Disappointing", "Date": "May 16, 2014"}, {"Author": "Michelle", "ReviewID": "R2SJF2707RK26A", "Overall": "5.0", "Content": "On the tab3 how did u redeem the free Google play and boingo credits. And hulu plus membership. Those apps where not pre installed.", "Title": "? for Amazon user", "Date": "May 2, 2014"}], "ProductInfo": {"Price": "$349.99", "ProductID": "B00JKCH552", "Features": "Android 4.4 Kit Kat OS, 1.2 GHz quad-core Qualcomm processor\n16 GB Flash Memory, 1.5 GB RAM Memory\nWXGA Display (1280x800 Resolution)\n64GB of memory available through a microSD slot and 50GB of free Dropbox storage\nComes with over $300 of free content and services", "ImgURL": "http://ecx.images-amazon.com/images/I/41k-Sst5XzL._SX300_.jpg", "Name": "Samsung Galaxy Tab 4 (10.1-Inch, White)"}}