{"Reviews": [{"Title": "Excellent tablet!", "Author": "Little Beau", "ReviewID": "R22EDC8KNFPCWS", "Overall": "5.0", "Content": "This tablet is great.  I purchased one for myself and will definitely have to get another for the hubby.  It is super fast.  I like it a lot more than my Kindle Fire HD.  Now I read all my books on this tablet using my Kindle app.  The screen is sharp and clear.  I like the idea that I can add more storage which I will probably never do.  Will be buying these for Christmas gifts.  They are the perfect tablet for young and old alike.  They are a great tablet for kids - who wants to spend big $$ on an iPad just for them to screw up, right?  They are simple to figure out even if you are a bit older and not accustomed to using a computer.  You'll enjoy getting emails from family, looking at their pictures and getting onto Facebook to check out all your friends, family and acquaintances.", "Date": "June 10, 2014"}, {"Title": "Best Value out there.", "Author": "Pen Name", "ReviewID": "R1I5XT9QKST4AG", "Overall": "5.0", "Content": "There are so many budget tablets to choose from on Amazon, but the Scout, in my opinion, is the best bang for your buck.  It's specs (1gb RAM, 8 gb hard drive and 1024 x 600 resolution) are far superior to any tablet you'll find in the $50 to $100 price range (usually only 512 mb RAM, 4 bg hard drive and 800 x 480 resolution).  Plus the Scout has WiFi, Bluetooth and a 2MP camera.  The OS runs smooth, and once you get to know your way around the device (the instruction book included is very basic, but you can find more detailed info on ThingamajigZ official website), navigating is pretty easy.  Definitely a great value for the price.", "Date": "June 10, 2014"}, {"Title": "SCOUT ANDROID TABLET", "Author": "R. Blaggo", "ReviewID": "R6GK6G3HQ7KQ7", "Overall": "5.0", "Content": "I purchased this Scout Android Tablet a few weeks ago and so far I am VERY impressed. It is very easy to navigate and use. I find myself reaching for this over my smartphone (Galaxy S3). The speed, resolution and memory capacity are great. I haven't needed to expand the memory yet but it is awesome that I have the option if/when the time comes. So overall, I would definitely recommend this product, it's a  great tablet for a great price. I'm going to buy another one in black so my husband can get his mitts off mine. Maybe for father's day! Oh, and shipping was super fast!", "Date": "June 10, 2014"}, {"Title": "Fine tablet at decent price", "Author": "Michael Farina", "ReviewID": "R1Q20XWYUHCKK2", "Overall": "4.0", "Content": "The Scout tablet has what I've come to expect from an Android tablet.  It runs apps and downloads at speeds similar or maybe a bit faster than my Samsung phone.  The camera is clear, and the battery life appears fine (I've always gotten bored before it dropped below 70%).  The case is sturdy and feels right in the hand. Deliver is on time.It's a fine tablet at a decent price.", "Date": "June 7, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00JX321C0"}}