{"Reviews": [{"Author": "Amazon Customer \"Matt in Chi-town\"", "ReviewID": "R13CSZGQU343XK", "Overall": "5.0", "Content": "For less than most 10\" tablets, this all in one android computer operates like the 21\" tablet that it is. With a keyboard and mouse provided, it functions for the purpose that most android users use a Windows product, for typing longer than would be comfortable on a phone or tablet.Cloud access is relatively simple for storage, and it's hard not to like this product, it fixes all of the shortcomings of their original 21\", has a faster processor, and more onboard storage.Jelly Bean 4.3 allows for use of nearly all apps in the Play Store so you can get around more quickly for news and sports than a typical computer with ease. I use Slingbox for tablets so it's also a TV backup for those Sunday nights when your DVR is too busy to provide the big games.......At the least, this is a nice monitor that can be used for your laptop if necessary via HDMI connection.", "Title": "Great product, great price, for the Android fan!", "Date": "March 18, 2014"}, {"Author": "Bron \"Bron\"", "ReviewID": "R1KB1L0OXGHA8J", "Overall": "5.0", "Content": "HP Slate 21 Pro AIO - review.Verdict:  An excellent android AIO and a superb HDMI touch monitor - highly recommended!Pros:- A superb 21.5 inch IPS display with great color and contrast - a beautiful display!- Sound quality is very good for this type of device.- Solid build quality -- everything seems well made (and it has the weight that implies).- Easy set up and flawless operation.- Easy to switch between android tablet mode and HDMI touch monitor mode.- Nicely designed keyboard has lots of very useful keys to directly access android functions.- Plenty of ports (3 USB 2.0, Ethernet, SD Card, Headphones, HDMI, up-stream USB (touch,keyboard), etc..- Nice looking design, good stand, quality/pro look.- Can store custom settings for HDMI monitor mode.Cons:- Highly reflective screen can be an issue in bright conditions.- Hard to see control buttons in dark conditions.- No remote control for HDMI OSD display settings.  Would make adjustments a *lot* easier.The unit came well packed as you would expect. One note, there is a nice keyboard size well in the top Styrofoam tray that will be empty. You may think the keyboard was left out, but never fear, it is in the bottom of the box, underneath the second tray that hold the panel. The unit comes with wired keyboard and mouse, a USB cable, and so printed doc, including a \"quick start\" guide.  You have to go online to down load the full PDF manual (and you should as it contains much needed information).The unit was heavier than I expected and the 21 inch width makes it a sizable AIO unit (there are larger, of course). The conservative black finish looks better than I expected and the whole thing seems solid and of good quality, The port layout is fairly typical with port facing down in the back (power cable, 2 USB 2.0, HDMI, Ethernet and an up-stream USB (for touch screen, keyboard, and mouse to PC connections when used as a touch PC display) and some additional ports along the left side (SD card, head phones and another USB 2.0 port). A pretty complete set. In additional to the wired ethernet, it also has WiFi and Bluetooth.  I won't list all the specs here as they are readily available, but they are good for the price.Why a wired keyboard and mouse?  Well, although part of it might be price, I'm also pretty sure part of it was to reduce initial setup issues and product returns which are costly. Wired peripherals are easier to set up correctly than wireless. That's my guess, anyway. And now would be a good time to note this caution, set up your Slate 21 Pro \"without* connecting the mouse and keyboard.  Once you have completed the initial setup and have the Android HOME screen up, then you can plug in your USB devices. You can, of course, use the touch screen input for setup and do not need the keyboard and mouse for the initial setup anyway.  This will avoid issues as the USB devices are not fully supported until the system has been setup the first time. (There's a small note about this in the manual, but you might miss it.)Other than the same clunky issue of trying to insert cables into the down facing ports shared by many other monitors and AIO's, everything is really very easy. Set up is the same as for any Android tablet. And if you enter a Google account id and password it will sync up your Gmail and such for you automatically as usual. Everything went very smoothly. The touch screen worked well, no issues at all, and the display looked good right out of the box. It took me 10-15 minutes to get everything set up to my satisfaction and then I had a gorgeous *huge* Android home screen setting on my desk. A very nice \"out of the box\" experience.The IPS panel is very nice with a great 1000:1 contrast ratio (meaning deep blacks), good color, and fairly bright.  It is very reflective. That is the only issue I've noticed so far.  At night, all is fine, but during the day if there are windows near by, you can get some bad reflections on the screen. It is one of the most reflective displays I have seen, but I can live with it.  The overall image displayed is superb, sharp, bright, deep blacks, fairly crisp whites, and good color.  Text is very easy to read and photos, videos, and graphics look great. A very nice display. In fact, this was my primary reason for buying the slate, to get a nice IPS panel touch screen monitor that could be used with my windows laptops together with the nice bonus of being a functional Android tablet as well.  (There will be some very similar units coming out soon that support ChromeOS rather than Android. I'm a big fan of the ChromeOS \"ChromeBoook\" devices, but I like Android as well.)The display sets up nice and solid, no movement. The display stand works well and there are rubber feet on the bottom of the unit so it will stay in place. You can angle it from 15-70 degrees, more than I'll ever need. There is a power button on the bottom right front along with 4 OSD controls that let you set the monitor color temp, brightness, contrast, and other things.  In android mode these are controlled by the usual Android settings, in HDMI monitor mode, you use the control buttons.  In Android \"slate\" mode, everything looked fine from the get go and other than brightness, I left everything else alone (I turned down the brightness). In HDMI monitor mode everything was \"juiced\" too much for my tastes, so I turned down both brightness and contrast. The power button is lit, but the others are not and at night in a dark room they are almost impossible to see. Luckily you won't need to use them very often.The display is great. No if's, and's, or but's.  The touch screen works very well.  The android OS (4.3) is plain vanilla, though with some nice extras thrown in (this was designed to be a business unit). The \"office\" software seems fine and worked well, I have not tried the Citrix apps yet. They won't be of use to many, but may be very useful to some.  Android is snappy and everything seemed very responsive.  The Pro model has more memory and storage and runs better than the base 21. Since it costs only a few bucks more, it's by far the better choice.The keyboard is light and decent enough. It has some nice extra function keys for direct access to things like settings, google calendar, browser (your choice of android or chrome), contacts (google), Google Listen now (music), sleep, media controls, brightness, and so on. There are also search, go back, and other functions. I am happy with the keyboard. It seems well thought out. I also have a nice Logitech bluetooth keyboard which I might use at some point, but I'm actually OK with the wired for an AIO device. There's also a generic HP mouse, but I used a mouse I already had on hand which I prefer. The HP mouse seemed fine, I just preferred to keep the one I am used to using. It works fine with this AIO.The Google voice search works very well using the AIO's microphone and the built in camera seemed OK, though nothing special. Basically you have a humongous android tablet with a great touch screen and very nice display and it all works as you would wish. Beautiful display. That's the icing on this cake.  OK, so a great android tablet. How 'bout them apps?The main app I wanted to give a whirl was Netflix. I fired it up and it worked great. Very fast and the movies look fantastic.  Here is where I got a big surprise.  The sound!  The sound is very good. Better than I expected.  The speakers have good stereo separation and are very crisp and clear. Vocals and dialog are simply excellent and music sounds very good as well.  If I put my critical ears on, I can say the bass is a bit weak (no surprise), but it's plenty sufficient for enjoyable listening.  The speakers are also quite loud for a unit like this.  Sweet!  Music and movies sound great. And the movies look great! Good colors, nice rich blacks. Sharp (not overly sharp, and you can tweak the sharpness, but I was fine with the default). Google Play worked well, Netflix was perfect, so I am very pleased.  (All the apps I have tried so far have worked fine.)I have not tried it with my laptop yet (via HDMI), but I will do so and will update this review. I did, however, try it with my Amazon Fire TV unit which I hooked up to the HDMI port.  It works great.  Good images, good sound, no issues. (I did find that I had to turn off the Fire, hook it up, then turn it on to get the display to initialize correctly. After that, all was fine.) Once I had this hooked up, I could easily switch between the Fire TV and the tablet/slate mode using the \"source\" button and I had no problems doing so. Amazon Fire TV games looked superb on the display. As did movies and other fare, of course. Everything worked just as you would want. For Netflix, I actually prefer the android app on the slate side, but the Fire TV has much more on offer, of course.2014-05-31 Update:  Tried hooking up my laptop via HDMI and it wokrs great!  I just plugged the HDMI cab;e into the laptop from the AIO and voila!  Even though my laptop's native resolution is 1366x768 it still looked great. I don't need touch (Win 7), so I just used my laptop's touchpad, keyboard, mouse, etc. and everything worked fine. I played music, videos, photo slide shows - all good. Then I tried some gaming - awesome!  They games looked fantastic on the big screen of the AIO and played fine. This is the what pulled me over the line to buying the HP Slate 21 Pro - being able to use it as a high quality HDMI monitor and I am very pleased!I do a lot of photography (and digital art) and the Slate in HDMI mode is a great way to review images and photos. Color and contrast are good and the larger screen is a big aid in evaluating my shots. Very pleased and satisfied with it for this use. Well worth the price, in my opinion. The superb display gets the job done and is a treat.I added a 16 GB SD card for additional storage, The unit comes with 12.25 GB (of the 16 built in) of user storage available of which about 11.65 GB is free after the apps are installed. That's pretty good for a tablet AIO. (Again the Pro model has double the storage (and RAM) of the non-pro model.)The manual says the side USB port is not functional in HDMI mode, but it does remain powered, so can be used for charging, running a USB fan or other USB device, and so on. Nice. The ports remain powered in sleep mode as well which is also good. You can set a \"daydream\" sleep mode that will display photos, colors, a clock, or other things (even Google Photos), if you wish, rather than just a blank screen. Music will also continue to play in sleep mode as with most tablets.All in all, I am very happy with the HP Slate 21 Pro. It lived up to or exceeded all my expectations.  The display is gorgeous. Sound is great. Everything works well out of the box. Performance is good. The price seems good for the Pro model, also. Double the memory and storage and some additional useful apps.This is an easy 5 stars from me and I think if you are looking for an android tablet/AIO and a great HDMI touch display in one unit, this is worthy of serious consideration.[Note: Shop around! Prices vary greatly for these units with the current range in the $370-$450 area as of 5/31/2014. The HP price is currently $379.]", "Title": "An excellent Android AIO and HDMI touch monitor!", "Date": "May 30, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00J24940M", "Features": null, "ImgURL": null, "Name": null}}