{"Reviews": [{"Title": "really impressed!", "Author": ":)man", "ReviewID": "R36768YBMQ2YMP", "Overall": "5.0", "Content": "I honustly wasn't expecting much because of the price and it's 1 gig of ram. I love it! Small light and portable. Great picture quality. Fast and responsive. Great video playback(faster then my old laptop). The features are great. Wallpaper that move! I bought this for a temporary use until I could afford a new pc. Not even going to buy a pc now. Very impressed. Keep in mind though that it is not touch sensative, so some apps won't work. Candy crush is awsome on it! Games like farmville won't work. But i knew that when I bought it. I'm only saying that because I have a friend who bought one not knowing. Find out what your netbook needs are first. This thing does what I need and way more. Only $110!  Android has the right idea(in my opinion). Make a grea product and sell it cheap for people like me on a budget. I'm doing the happy dance!", "Date": "April 30, 2014"}, {"Title": "good gift  for my boys very nice, more than what I expected I was very pleased with this my kids", "Author": "MJ \"MJ\"", "ReviewID": "R26YE0UD63BV5N", "Overall": "5.0", "Content": "good gift  for my boys very nice, more than what I expected I was very pleased with this my kids love it I ordered two highly recommended.", "Date": "April 15, 2014"}, {"Title": "Good netbook", "Author": "jerome mendeleyev", "ReviewID": "R1120449AADTCV", "Overall": "5.0", "Content": "The netbook serves its purpose OK, as a handy backup unit. In my instance the unit isn't going to be used as primary, but good to have available as a secondary.", "Date": "June 10, 2014"}, {"Title": "Outstanding", "Author": "Autumntribe", "ReviewID": "R2N2IKPP8RW9NH", "Overall": "5.0", "Content": "I have had this for about 10 days now.  I am getting ready to deploy, so I wanted a basic net book with most common features. First of all, this is a tablet with a buit in keyboard. It has the Jellybean processor. So it has features exactly like most tablets. Web, Music, Games, Apps. The battery is built in and it seems you might get about 2 hours depending what demand you are putting on it. Screen is bright and beautiful. The keys are large enough not to be stumbling over the letters. It includes a mouse, but you can use the finger pad also. It is described to have 1 gig of ram, however the sticker on the bottom says 512.  It performs like a 1 gig though. There is also a Quality Control sticker on the bottom. Although it is from China, they seem to be looking at the product they put out. The outer case is gloss black, very stylish. I ran the HDMI out to TV, works perfectly.  Blue Tooth is strong and works great, speaker is good. One note on the USBs and HDMI, be very careful as they seem a little loose, but they work fine, just plug and remove slowly. Very impressed for the Money I paid. If it lasts two years I’ll be happy. My only concern is the built in battery over time, but I leave it plugged in mostly anyway. I’ll leave another review as I get more into the netbook.", "Date": "May 20, 2014"}, {"Title": "Worst thing in the world", "Author": "daniela aguirre", "ReviewID": "ROMO8ZI8PX36D", "Overall": "1.0", "Content": "I really don't suggest you to buy this product it's the worst thing in the world to take somewhere to help you study. I mean it good to play games but I didn't buy it for that reason I brought it for studying so if you are reading this I really would not buy it unless you are going to give it to a kid to play games and the worst thing of all it won't even pick up the internet connection and I'm standing right beside it", "Date": "June 5, 2014"}, {"Title": "Waste of time and money", "Author": "pfunkzuppo \"Pam2010\"", "ReviewID": "RVAD5TYIQCV9X", "Overall": "1.0", "Content": "I got this for my son, who mostly uses his computer for streaming videos on Netflix and Amazon Instant Video. This computer, however, is NOT able to do that. It's not really useful for much...it's almost like a glorified smartphone-minus the phone. I was surprised b/c there were very good reviews of this item! I guess it depends on your computer needs.  It also was delivered without ANY INSTRUCTIONS AT ALL...it took 3 people and 24 hours to figure out how to operate all the features....that's ridiculous!! On the up side of things, I was able to return it fairly easy. Just had to print out the return label and bring it to a UPS store (which happens to be 3 blocks from my house) and was credited back the purchase amount. Buyer Beware...", "Date": "May 30, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00J2T6RM0"}}