{"Reviews": [{"Author": "rpv", "ReviewID": "R2BDTYQXTU93JQ", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3466N5DZYWPZSembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3466N5DZYWPZSrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3466N5DZYWPZSchiDiv\").innerHTML = document.getElementById(\"cv_mo3466N5DZYWPZShiddenPre\").innerHTML;\n};\ncv_mo3466N5DZYWPZSrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3466N5DZYWPZSso;\t   \n\n\nfunction cv_mo3466N5DZYWPZSloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3466N5DZYWPZSso = new SWFObject(swfLocation, \"cv_mo3466N5DZYWPZSAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3466N5DZYWPZSso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3466N5DZYWPZSso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3466N5DZYWPZSso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3466N5DZYWPZSso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3466N5DZYWPZSso.setAttribute(\"height\", swfHeight);\n          cv_mo3466N5DZYWPZSso.setAttribute(\"width\", swfWidth);\n          cv_mo3466N5DZYWPZSso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3466N5DZYWPZSso.write(\"cv_mo3466N5DZYWPZSflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3466N5DZYWPZS', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3466N5DZYWPZS';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3466N5DZYWPZS', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3466N5DZYWPZSloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3466N5DZYWPZS\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mT6403DMOR6RS\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mT6403DMOR6RS\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2BDTYQXTU93JQ\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mT6403DMOR6RS/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3466N5DZYWPZSduration')) {\n      document.getElementById('cv_mo3466N5DZYWPZSduration').style.display='none';\n    }\n    cv_mo3466N5DZYWPZSloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3466N5DZYWPZSloadSwf(movieID, playerVersion) {\n   return _cv_mo3466N5DZYWPZSloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3466N5DZYWPZSnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3466N5DZYWPZS', 0, h);\n}\n\nfunction cv_mo3466N5DZYWPZSresetPlayer(w,h,bw,cc) {\n  cv_mo3466N5DZYWPZSnewHeight(h);\n\n  cv_mo3466N5DZYWPZSso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3466N5DZYWPZSso.addVariable(\"cacheCode\", cc);\n  cv_mo3466N5DZYWPZSso.setAttribute(\"height\", h);\n  cv_mo3466N5DZYWPZSso.setAttribute(\"width\", w);\n  cv_mo3466N5DZYWPZSso.write(\"cv_mo3466N5DZYWPZSflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3466N5DZYWPZSRollOverImg = new Image();\ncv_mo3466N5DZYWPZSRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81wwl%2BUk8FS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3466N5DZYWPZSpreplay = document.getElementById('cv_mo3466N5DZYWPZSpreplayImageId');\nif (cv_mo3466N5DZYWPZSpreplay) {\n  cv_mo3466N5DZYWPZSpreplay.onmouseover = function() {\n    cv_mo3466N5DZYWPZSpreplay.src = \"http://ecx.images-amazon.com/images/I/81wwl%2BUk8FS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3466N5DZYWPZSpreplay.onmouseout = function() {\n    cv_mo3466N5DZYWPZSpreplay.src = \"http://ecx.images-amazon.com/images/I/81wwl%2BUk8FS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3466N5DZYWPZSpreplay.parentNode;\n\n  var cv_mo3466N5DZYWPZScurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3466N5DZYWPZScurrentClick) {\n      return cv_mo3466N5DZYWPZScurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 7:58 MinsI purchased and reviewed the blue tablet. This is same one with different color. ProntoTec Axius 7 inch HD Dual Core Tablet is a very good value in price per performance. It has 6 GB storage. After installing bunch of applications, I still had available 5 GB. This runs Android 4.2.2. I have been using for few days with no issues. Obviously you should know the feature set and use within the limit. I will go into the specifications and review based on my user experience. The clarity of the screen is great for watching videos and reading e-books. The tablets are fast becoming commoditized and it is great we are seeing such value budget tablets. Performance was smooth among this price point 7\" tablets I had used in past several months. As you can see in my video review, Temple Run Oz can be played smoothly and it has a buttery feeling. The tablet feels nice to handhold and the USB Host interface tops it all. Hand holding was easy, and the blue color is so vibrant it pops out!Most of tablets have ARM based processors. This makes sure all of the Apps in Google Play ecosystem are available. This has Cortex A8 Dual Core 1.2 GHz. If you look at my video review, I have screenshots showing the CPU speed and other kernel details. The screen is 1024x 600 Pixels and has a RAM of 512MB. (DDR3 RAM). This tablet has high-performance Quad Core Mali-400 GPU ensures smooth and dynamic 3D graphics. This supports a wireless and cellular with Wi-Fi (802.11 BGN) and Support for 3G Dongles. Settings page has a IMEI number already assigned. Tablet has 2 cameras - Front 0.3M/Rear 2M. There is a built-in 2800mAh Rechargeable Lithium Battery. Battery came for a good 5 hours with moderate usage. Battery usage really depends on how heavy you use the system. Overnight it drained very less. Mobile Networking was on by default. I switched off as I was using only Wi-Fi mode. I suggest you go to Settings and tweak things which are not required. Developer Mode was enabled by default. I turned it off. The capacitive touch screen was really good, some occasions I had to press little harder and at right locations, but pinch-zoom, highlight, Copy-Paste all worked very well.The tablet has micro USB Port, a regular USB port, 3.5-mm stereo Headphone Jack, built-in speaker, microphone, micro SD card slot (upto 32 GB), a DC Input Jack and a USB Host Interface. Note that for powering through wall adapter you need to use the provided DC input jack. Speaker was loud enough. IN a room, once I keep the tablet in a stand it was good. Speaker is on the backside, so you don't want to lie this down on back as it will hamper the audio coming out. This is a designAndroid tablets are really customizable to your heart's content. It is here where ProntoTec shines. Using a native Android 4.2.2, they have achieved something at a low cost. This can have a very wide reaching audience. In many countries, where affordability is key, having a tablet like this with Wi-Fi is a big boon. Imagine having entire Wikipedia at your fingertips for a child. I tried few educational applications on this. I consider this as a big hit with educators than gamers.I tried Google Voice Search and asked \"what is capital of United States\". The voice recognition part was great and it was able to recognize and dictate the answer. I also tried Wolfram Alpha and asked bunch of questions. E.g., what is world population, what is population of China etc? The microphone picked up correctly and answered through Wolfram Alpha. Apps like Calculator, Gmail performed flawlessly.I watched multiple video through few applications. Obvious first choice was YouTube. Was able to search and watch videos. Handholding is really easy given the weight of it. It was a colorful blue; no heat observed handholding the tablet. It is plastic, and buttons are made of plastic. For a kid, this is perfect also though the feature set is equally appealing to an adult. I was so enamored with low cost computers in late 90s and it seems I am reliving them with tablet. If you want to listen to podcasts/watch video then this is perfect. Just keep it in a stand and connect to power. See my video review to get an idea of what I am referring to.For a computer geek, it is a challenge to design something with minimal resources - screen resolution, RAM, storage, chipset. ProntoTec has designed a tablet with budget conscious customer in mind. Out of the box, it worked to my satisfaction given the specification and price. Once powered on, it directly came to a working condition. No need to setup account prior to using. I signed with wifi, the wifi router was in one bedroom. I configured in another room separated by two rooms. There was no issue with wifi signal. Once connected, I created a Google account as well. I generated a Application Specific password as I had 2 factor authentication. Once signed on, I updated applications like YouTube, Google Keyboard etc. I downloaded Chrome and browsed few websites. Listened to Audio / Watched Video. Out of the box battery needed a full charge. Initially without charge, I did a video stream and wanted to see how device shutdown. Sure enough it shut down as battery drained. Powered on after charging and everything was fine.I am impressed enough at the engineering for the price/value/budget it delivers. Cortex-A8 Processor is an ARM Cortex(tm)-A8 processor, based on the ARMv7 architecture, has the ability to scale in speed from 600MHz to greater than 1GHz. The Cortex-A8 processor can meet the requirements for power-optimized mobile devices needing operation in less than 300mW; and performance-optimized consumer applications requiring 2000 Dhrystone MIPS. This is from ARM specification. Pronto-Tec has pulled in many off the shelf components and assembled at a terrific value. I was particularly interested how it performs to streaming video. That is the golden test and it performed beautifully!", "Title": "Very good value in price/performance", "Date": "April 28, 2014"}, {"Author": "Mommy of many", "ReviewID": "RX6V3FLR8VKE", "Overall": "5.0", "Content": "I bought two of these for my 7 and 9 year olds to use for games and such. I had purchased a similar tablet from another site and was so disappointed that I returned them, but I decided to take a chance with these and I'm glad I did. I installed a bunch of games and educational apps right off the bat. There's 1GB system memory and a 6GB internal SD card which should be plenty of space but there's a microSD slot as well. Minecraft is the main reason the boys wanted some kind of Android device and it loaded fine. I haven't given the tablets to the boys yet so I'll update my review once they've played for a while. I tested a bunch of the arcade-style games and learning games and so far, so good. I only found one game so far that was not compatible with these devices.One of the tablets is a little more finicky about the wireless network than the other but generally, turning the wifi on the tablet off and back on again fixes any problems. I despise touch screens but I haven't had any trouble with these. The main camera is not quite as good as the camera on my cell phone and the secondary camera is about like a cheap webcam. Plenty good enough for the kids to take silly selfies.I bought these cases: http://www.amazon.com/gp/product/B00IOAP55S/ref=cm_cr_ryp_prd_ttl_sol_1 just to protect the tablets a little bit.This seller was awesome. I got the Prime 2-day shipping and the package arrived as scheduled within 2 days. The seller sent me a note a few days later just to confirm that everything was satisfactory. I would definitely purchase from this seller again and I would highly recommend this tablet to anyone looking for an inexpensive Android device.ETA: My boys have been playing Minecraft (as well as a few other games) nonstop and it seems to work well. The wireless is sometimes tricky...they tend to wind up sticking pretty close to the router when they're doing anything on the network but so far, no complaints...", "Title": "Great value tablet", "Date": "May 19, 2014"}, {"Author": "Amy", "ReviewID": "R19UW49EZQ8RF", "Overall": "3.0", "Content": "This is my first tablet, so I don't have much to compare it to. This is mainly just a list of my observations. I did return the first tablet they sent me because it would not charge at all. This is a review for its replacement. First off, my biggest complaints are as follows:1) It came with no instruction manual beyond how to turn the device on and locations of input device ports.2) It has terrible Wi-Fi signal reception (details below).Other observations:- The picture is clear and bright (once you take the thin protective plastic off the screen - not the thick protective cover it comes with, but the thin, hazy stuff that comes on most electronics).- The touchscreen is sensitive and accurate.- The audio is decent, but using headphones significantly increases audio quality.- The camera isn't high def by any stretch of the imagination and takes grainy images and is sometimes hard to focus, but the dual camera function is useful. If you want this device to be used as your main camera, keep looking. This is not for you.- As mentioned above, Wi-Fi signal reception leaves much to be desired. My wireless router is in the center of my house and sends out perfect signal (other devices get 4 of 4 bars through my entire property). However, this device gets 3 of 4 bars of signal when it is sitting five inches from the router. When I walk around the corner, about four feet from the router, the tablet drops to 2 of 4 bars of signal. When I move into a room, the tablet drops to 1 of 4 bars of signal, and sometimes even that drops out. So basically, if you want to use this as a small laptop, this is not the device for you. Keep looking.- It also must not be asleep to receive updates or downloads. For instance, when downloading an app, if the tablet sits idle long enough to sleep, the internet connection stops until I wake the tablet back up.- Internet connection is a bit slow.- Games and apps that do not require internet connection work well. Very little lag, if any.- Having Wi-Fi turned on drains the battery very quickly. If it is turned on during charging, the device will not charge.- I did add a 32 gig SD card, and that helped with storage. I have quite a few apps which use up storage quickly.- Playing video (not talking about streaming - just playing from storage) works perfectly fine. I used it as a video player while on a road trip with my 4 year old son. The battery life was good. Video quality was great. The picture was clear and there were no interruptions.- I like that included with the device was the wall charger, the usb connector, and an adapter so that a usb device could be plugged into the tablet, which could prove to be very handy.Bottom line: If you're looking for top notch quality in a tablet, this is not the one for you. However, if you have a small budget for a tablet and don't expect top dollar quality at this price, then it isn't a bad investment. I cannot recommend this particular tablet to everyone, but for my own casual use and entertainment, I do not regret this purchase.", "Title": "Not bad for the price", "Date": "May 30, 2014"}, {"Author": "summer", "ReviewID": "R3FL9LNP01FH6W", "Overall": "4.0", "Content": "Best deal I got , this tablet works super well downloading apps can be done in a blink of an eye . No freezing up of screen since I mostly use it for reading ebooks and playing games to entertain me !", "Title": "Best Deal", "Date": "June 4, 2014"}, {"Author": "Jofer", "ReviewID": "R2TG1XOURCCQJV", "Overall": "5.0", "Content": "I've had this tablet for about a week and so far so good. Everything works like it is supposed to and everything I installed is working fine. Video works great as well as games. I do wish the user's manual was better but most things are easy to figure out especially if you've used a tablet in the past. Can't beat it for the small cost of this tablet and the cost was taken into consideration when rating this 5 stars.", "Title": "Great For The Price", "Date": "June 1, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R36D5YS881X611", "Overall": "4.0", "Content": "This is an early review, based on first day with the device. I got this tablet for $56 from Amazon. For that price it seems a very good value for the features it brings.That feature set is limited, however, and this tablet might not meet some user's needs. I wanted it primarily to access the internet, podcasts, Netflix and to read Kindle books. For those purposes, it is fine. I have noticed HP is bringing out an entry level tablet with near identical specs for about $100.My 4 star evaluation is based on the physical manifestations, price, usability, and included features.Let's first address some possible limitations. Common features not included are GPS and Bluetooth. Don't buy this tablet expecting to use Maps or navigation. The documentation that came with the unit is sparse. However, if you've used any other Android device you probably won't need it. The power cord is SHORT. About 24 inches. The touch screen calibration seems a tad off. Presses near the top and bottom have to be biased slightly toward the center. I got used to that very quickly. Viewing angle is small if that is important to you. On my device the power plug did not insert all the way to the bottom, BUT it is connected so DON\"T force it! The limited ram sometimes bogs down with multiple programs running.Now for the good. The display is clear and the high pixel count is easy on the eyes. WiFi connected easily and seems robust in my home. Setting up Google account and Play store was easy. There is virtually no bloatware. All of the apps I commonly use downloaded and installed correctly. All worked 100% except GrooveIP. It had some crackling. I used Vonage for telephone calls over wifi instead. It is clear and sharp. A 32gb micro-sd card worked perfectly. A pen-drive attached to the usb otg adapter mounted perfectly. First battery impressions are favorable. A usb otg adapter, data cable and screen protector are included.A BIG plus for some - my device came with root access and SuperUser installed. I say for some because this gives users access to system files that could cause operating system failure if changed or deleted . Beware or be thrilled! I have not tried adb or looked at the bootloader or recovery. I didn't get this for development, just reading.Features I have not tried include HDMI out, Skype video, camera and 3g dongle.Bottom line - the included features seem to work fine. The main body is plastic. I did not list this as a plus or minus because it is entirely user preference. The feature set is limited but it is after all a $60 tablet with a decent display and enough ram/rom to be productive. Not for power users. Not for advanced gamers. Perfect for a low cost light weight web and e-reader.", "Title": "Outstanding value for price", "Date": "May 29, 2014"}, {"Author": "Sithlord", "ReviewID": "R3IJTPQH7HEDYU", "Overall": "5.0", "Content": "This tablet is a nice unit for under $50.00.It plays the new star wars Assault Team game that just came out perfect:).It might  not be super fast but it gets the job done and it comes with 8 gig of  of space but you can only use 6 of it. The picture looks great in 1024X600 HD. The speakers sound pretty good but when you plug in a headphone set instead it is even better. This is my first tablet so I can not compare it to any out there.", "Title": "Great Tablet for a good price!!", "Date": "May 12, 2014"}, {"Author": "Gib Gibbons", "ReviewID": "R10FTHQWVNNDGT", "Overall": "1.0", "Content": "I had to return one because the charging cord would not seat so charging was not possible.  The tiny user manual is a disaster, for example. \"Long press the button about 2-3 seconds to open the screen.\"  I got the idea but you will find many other 'lost in translation' examples. Manual is printed in about 1 point type (even with glasses I had to use a magnifying glass), illustrations or black streaks, impossible to figure out. I wouldn't have another of this model tablet if it was a gift.", "Title": "Thumbs Down On This Tablet!", "Date": "May 27, 2014"}, {"Author": "Britton", "ReviewID": "R2OC88YNEWCCNG", "Overall": "2.0", "Content": "Pros:CHEAP!Decent processing speed, and responsive touchscreenDecent WiFi connectionCons:480 x 800 px resolution is pretty grainyTouchscreen had several deadspots, made it so I had to rotate the screen from time-to-time in order to click on the items I wanted  (rotating the screen allowed me to avoid the deadspots).In less than 1 week, it died!  Won't turn on, can't charge, completely dead.I still am giving 2 stars because the product is pretty good for the price, and I'm hoping I just got a fluke or something.  It worked well while it lasted.  The deadspots were located around the edges.  Will be returning it shortly.", "Title": "Almost lasted 1 week...", "Date": "May 13, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00JAAPQDM", "Features": null, "ImgURL": null, "Name": null}}