{"Reviews": [{"Title": "Doesn't get any better", "Author": "Ralf Conquest \"RJC\"", "ReviewID": "R1HQN191F1EQ3S", "Overall": "5.0", "Content": "I bought a generic tablet back before tablets were really popular.  It was android 1.5 and no upgrades were really feasible.  I used it and loved it.  But finally decided to replace it.  So I did lots of research and found that tablets are all over the charts these days from reasonably priced to extreme.  I read the specs on this tablet and it was a story of sounding a little too good to be true.  But I took a gamble based on the low price and I bought.  I will say I couldn't be happier.  Everything works.  Browsing the web is just like a pc speedwise.  The Googleplay store works like a champ.  I love the voice active search.  I can speak what I want it to look for and it finds it.  I have used this many more times that I ever thought I would.  And this wasn't even listed on the features for the product listing so I consider it a bonus.  My wife and I raced to see who could lookup a listing of songs by an old band we remembered.  She on her laptop and I on my tablet.  I spoke and she typed.  I won of course.  You will be happy you bought this tablet.  Its better than some of those twice this price easy.", "Date": "March 28, 2013"}, {"Title": "Best Tablet .", "Author": "Techpreneur", "ReviewID": "RMQGPSFK3O62D", "Overall": "5.0", "Content": "Really amazed that this level of technology is available for this price. The simple and elegant design rivals that of ipad, yet it come pre-loaded with google play so you can download all the apps you want. I use for business mostly, PDF, CRMs, etc... Works great with any Wi Fi(i.e starbucks, barnes and noble, mcdonalds). Full HTML5 web browsing (i was surprised by that). Screen is responsive and easy to clean battery holds chrage for a long time as long as you dim the brightness. No complaints here. Just lots of impressed clients.", "Date": "March 4, 2013"}, {"Title": "A really good tablet", "Author": "pennywyze", "ReviewID": "R3NXEO7R31HXRS", "Overall": "5.0", "Content": "After being pleased with a Coby Kyros Mid 7122 and later being disappointed after buying a Coby Kyros MID 7042, I decided to give a shot to another budget tablet company that I haven't heard of. In fact, I'm not even sure what the name of the Tablet is other than an A13 tablet.I have to say...I'm more than pleased with my purchase. Now, onto my review-Appearance/Design-The first thing I noticed about this tablet is the fact that it's really thin. Not paper thin or anything, but comparable to Razr products being that it's about a centimeter in thickness.The colors are quite typical of budget tablets; it has a dark gray finish with black trim around the screen.One thing I wasn't too crazy about because I'm so used to my budget tablets being Coby Kyros design, would be that the inputs are in awkward spots. For example, the AC power jack input it located at the very top of the tablet as is the USB input. It just seems weird.The power button is on top (when I'm used to it being on the side as well) and the volume button is on the side of the tablet. (right side)Score- 8/10Interface/stability-This runs on android 4.0, but it can be upgraded and I believe mine is running on 4.1 or something along the lines.The one thing I wasn't crazy about was how big the icons are. I mean, they're huge and seem more suitable for a 10-inch tablet, however, this isn't the case. I've also noted that there aren't any options to change the size of the icons whatsoever. (Perhaps there's an app to help out, but why waste space?)Anyway, unlike the craptacular Coby Kyros mid 7042, this tablet DOES NOT HAVE ANY ISSUES WITH CRASHING.The customizable options are a little limited however and certain options found in earlier versions of android tablets are nowhere to be found in this one.Apps work really well on this tablet. Apps such as Netflix, Youtube (which is not pre-installed), Angry Birds, Temple Run, Fruit Ninja HD (which is pre-installed), Fish game and others run just fine with the only flaw I can possibly think of being that if you play a game while using a live wallpaper and the screen goes to \"sleep\", once you tap the program again, the screen will be a weird color (equivalent to that of a negative photo), until you do a quick exit and tap the game again to play it. This was minor at best and it wasn't a tablet-breaking experience. This minor quirk also didn't \"freeze\" the tablet or cause it to restart.It's just an excellent firmware with 4.0 plus interface that works as described.Score- 9.5/10Speed-This tablet is really fast. The speed is comparable to the Coby Kyros 4.0 or perhaps even some high end tablets.The only downer is that at times after web pages load, you'll often have to touch the screen an extra time or two because for \"some\" web pages, it has a slight delay. It's really not much to speak of but still worth noting. Games run like a charm. I played Fruit Ninja and it's really fast, the graphics have no lag, there's no input lag or anything.Netflix was slightly different because it needed a little extra time to start, but once it started, I was able to watch movies and shows, exit and re-initialize the program and actually the second time I re-opened Netflix, it loaded slightly faster for some reason. The start up time is somewhere around 20 seconds or less in some cases.Score- 9.8/10Features/toucscreen/Sound-This tablet features Google Play and it's very easy to setup. Basically, if you have a google account (gmail), you'll enter your gmail with password and it syncs. Nothing more needs to be done. In addition to syncing with google, you can also add your regular emails to keep in sync with everything.Personally, I'm not that crazy about Google play and I sort of prefer 1mobilemarket, but in Googleplay, you have all the apps you could possibly ask for with the exception of the few that are signature apps such as Amazon Kindle (my favorite)...This tablet also has a sound recorder, camera/camcorder (yes, you can do skype and such, but the camera is just ok. Make sure you have enough light or at least tweak the camera settings for Skype), it comes with what's called a 2160p pvideo player which actually has really good quality for streaming videos off an SD card or downloaded videos. I haven't tried the music player but there's one pre-installed, it has voice search capability, I'm assuming a GPS/satellite addy that comes with Google play. I have the slightest idea how it works, and it also comes pre-installed with some games.Anything else that you want will have to be downloaded by Googleplay, amazon app or 1mobile etc.Now, onto the touchscreen which I love. It's fast, it's responsive, however, you can't calibrate it. It's no big deal because it's sensitive enough. The only delay you'll have with the touchscreen would be when web pages are loading.One of the odd things about this tablet is actually the screen, because I'm not sure what it's made off, but it isn't slick like the other tablets I own. It feels dry, and it doesn't smudge for me.The sound is good, but it doesn't have an equalizer or any tweaks to boost the volume. You may want to download an app called 'Speakerboost' if you want loud volume. Of course, it sounds great with earphones/headphones or any external speakers.And finally, my cons list-Cons-The first thing I noticed about this tablet was how bright it was. It's extremely bright to the point of calling it slight oversaturation. Similar to if you turn your TV's brightness all the way up. This has no effect on videos but it does bother the battery life.The battery life itself was really bad until I turned the brightness all the way down. (don't worry, it's still going to be bright) and downloaded an app called \"Night Mode\" which helped the battery life. Initially, however, the first few minutes of fiddling around with the tablet, the battery was dying by the minute. I can't estimate how long the battery life is but I've tested it without charging it for the past 2 and a half hours and it's still kicking at around 50 percent and lower. (Keep in mind that initially, I DID NOT download an app to tune the screen brightness)Now that I have that app installed, the battery is quite normal. I'll have to update with an edit to tell everyone the exact battery life.In my opinion however, the Coby Kyros brand has a much better battery life than this tablet. (also, the ac adapter doesn't plug all the way into the jack. It sticks out slightly. It looks weird)Really, that's about the only con I could think of because I really like this tablet. It's fast, it was cheap (62 dollars), the placements are a little on the weird side, but the fact that it's so cheap and is comparable to my high end tablets, I'd definitely recommend buying this. Just keep in mind that the battery life is probably not the greatest, but you really can't beat the features for such a cheap price.Edit- May, 13th, 2013I'm still very happy with my tablet and still stand by my review. I'd definitely buy another one. Anyway...The battery life is variable. It really depends on how bright the screen is and since there's no way to adjust the contrast other than an app extension, I'd estimate it around 3- 3 and a half hours max. (That's considering the fact that Wi-fi is on, sound is used and the device isn't on a charger)The good thing about this tablet is that although the battery life isn't the best, it will charge really fast. (Barely takes 30 minutes to get it near full charge.)I'm actually thinking of having a battery transplant done to this tablet.Also, I had a question e-mailed to me about the date and time display on this tablet. The problem with the date/time is the fact that you have to manually set it. You really shouldn't have to set the time/date being that it's google play ready and the Wi-Fi connection usually takes care of that.Update- (July, 10th, 2013)Tablet is still going strong. I actually used it to play Rockpacalypse and it runs the game good. Still haven't had any issues with this tablet.", "Date": "May 9, 2013"}, {"Title": "PLEASE DO NOT BUY!!!", "Author": "Porsha Jones", "ReviewID": "RJ137P3MHZW5D", "Overall": "1.0", "Content": "Alldaymall(TM) 7-inch Capacitive Touch Screen Android 4.0 Tablet PC with Allwinner A13 1.0GHz 512MB/4GB WiFi Front-camera (Black)First of all, I ordered 2 of these for my 5yr old and 3yr old who both know how to work tablets very well. At this price I was not expecting miracles but I thought that they would at least work for more than one day. Wow! I have never been more compelled to write a review as I am now.When we first received the tablets (fast and packaged well) the kids were so excited. They came dead so that meant a few hours of charge time. The chargers are apparently not made for the tablet because they do not go down all the way (weird). One of the chargers just simply did not work at all. So I charged them both with the other charger.At first they both worked fine but about an hour into using them the screens began to flicker and the graphics turned black and faded away. BIG DISAPPOINTMENT!Please DO NOT BUY THIS TABLET! THEY ARE PURE CRAP!I will just spend more to get Kindle Fires so at least my kids won't have to be broken-hearted again!Please don't ignore the bad reviews like I did. I REPEAT:THEY ARE CRAP!!!!!!!!!!!", "Date": "July 28, 2013"}, {"Title": "Great for what it is", "Author": "Amazon Customer", "ReviewID": "RWP2KT45K7FEW", "Overall": "5.0", "Content": "I bought this little tablet for my 6 year old to be able to get online to do some of the educational activities that her school supports as well as be able to play some games and read books.  I have to update the flash player I think, because some of the webpages don't perform correctly.  I'm not really too terribly surprised by that though.The screen is not very sensitive, but that's to be expected, I think, at this extremely low price, so I'm not really going to take anything off on that. The only reason I deducted a star is that the screen IS extremely scratch prone.  My 6 year old has used it for a total of about 2 1/2 hours at this point and the screen has a dozen or more fine scratches on it.  (fruit ninja)  Given that this tablet is mainly going to be used by a kid I should have known to get a screen protector, but I didn't think about it.  Still though, I would never have expected it to be scratched so easily.Other than that, I really don't have any serious complaints.  Took a while for the Google Play Store to come up.  It just stayed there loading for more than an hour, and I wasn't sure it was ever going to come up, but just as I was giving up on it for the night, it came up.  (causing me to lose another hour of sleep haha)The camera isn't very good, but I didn't expect it to be.  Again though, this is for a kid, and as I am writing this, she's running around with her sister taking videos of anything she can find. (including me writing this)Audio is actually pretty good.  It's actually a bit louder than I would have expected it to be, and it's pretty clear. No complaints there at all.Alldaymall was surprisingly very speedy on delivery.  I ordered the tablet and it couldn't have been more than 2 - 3 hours later Amazon sent me an email that said my order had shipped.  I was pretty skeptical that it was accurate, but I checked later that night and it had already been scanned by the carrier.  The order was scheduled for April 3rd - 5th but it arrived on the 1st. I was pretty pleased by that to say the least.  In fact I ordered a protective cover (no screen protector) at the same time to go with it that was being shipped by Amazon, and it didn't SHIP until the 1st.  I would give the seller 5+ stars.  The tablet came in the original packaging wrapped in 2 sets of shipping material 1 UPS bubble envelope and a USPS shipping bag (no box, I was a little surprised by this, but it turned out ok).OK well seeing how this is only the first full day that I've had the tablet, these are my first impressions and I'll update this review after we have gotten to know it a little better.Update: After about a week now I thought I'd give an update.  I downloaded several interactive books from Amazon and they all performed well.  A couple of days ago my daughter was running across a parking lot and CRASH the tablet falls out of her hands and goes skidding across the asphalt.  I figured it was toast, but other than some scratches on the back where it skidded and a scuffed corner where it impacted, the tablet works fine.  Says a little something for durability in my book!::Update::Thanks to a comment made by another member, I found out that there is a nearly invisible shipping protector on the screen.  That's what was scratched not the screen.  Upgraded review to 5 stars, because even though the tablet isn't a great performer, it's not expensive either.", "Date": "April 2, 2013"}, {"Title": "the perfect lil tablet", "Author": "DivaBrown", "ReviewID": "R3RVP67AM86ZNJ", "Overall": "5.0", "Content": "This tablet was a replacement but I have to say it sounds better than the one it replaced that is the speakers and it dose more than I could have thought if you are looking for a 7\". Tablet this is the one and at a great price. I just love it", "Date": "March 9, 2013"}, {"Title": "Buyer Beware!!!", "Author": "Peter Iversen", "ReviewID": "R1PL3PMP0FH65E", "Overall": "1.0", "Content": "It is August 1 - this tablet stopped working today.I have hardly used it - just downloaded 2 apps to read books and one book.  Today I was using the calculator for some volunteer work and it just quit!I charged it in the morning and now - nothing.  The tablet does not respond to anything.  Recharging or - anything.I expected it to be simple and did not have a lot of heavy duty tasks for something that only cost $63.00 - but I did hope it would last for more than 6 weeks!  Lots of things I can get for $10 a week that would be much more gratifying!  The \"warranty' expired 11 days ago!BUYER BEWARE - there is no recourse when something like this just dies - only thing I can do now is use it as a paperweight.How disappointing.  This was my entry into the tablet age - a stepping stone to... whatever - and now...So - is there anyone at Amazon who reads this?  Anyone who wants to be accountable for the business they run - or is it the fault of the Chinese company that made this piece of junk.Time will tell...", "Date": "August 1, 2013"}, {"Title": "pretty good", "Author": "frank dye", "ReviewID": "RIX586GR80GNJ", "Overall": "4.0", "Content": "I got this cause it was a great price for a \"quad core\", but to find out that other dual core tablets will outperform this particular processor. so just do your homework. it works good and the battery life is just ok. i watched a movie and was left with 36% battery. so its not great. the screen is responsive and overall i like the tab. i like the charging options, either micro usb or the charger it comes with. thats nice. no bluetooth to connect other speakers or keyboards. the built in speaker will leave you wanting more sound. on a budget it will be a fun toy. and the \"8gb\" is actually just over 5gbs usable. i wouldnt buy another one. but on the other hand glad i got it. hope this helped.", "Date": "July 31, 2013"}, {"Title": "Great Product", "Author": "Shawn D Koga", "ReviewID": "R145CR5SGZLSJO", "Overall": "5.0", "Content": "Bought 2, my fiancé and I both use these every day. Would have no problem recommending this product to my friends", "Date": "March 14, 2013"}, {"Title": "usable. comes with root", "Author": "Joey Hess", "ReviewID": "R28K1PMBXF5NOR", "Overall": "4.0", "Content": "This tablet was a pleasant surprise, since it comes with root access built in. Just go to Storage, enable MTP, connect a USB cable, and \"adb shell\" will present a root@android prompt, which apparently has full permissions to do anything you desire with the hardware you just bought.(It's a sad state of affairs where full access to hardware you own is not guaranteed.)As far as the hardware goes, it seems acceptable for what it is. Battery life seems unlikely to go much over 2 hours. Having only a front-facing camera limits the utility of the tablet some. Built-in storage is limited; only 2.65 gb are free once annoying preloaded games are uninstalled. Hardware seems reasonably solid for the price.", "Date": "May 1, 2013"}, {"Title": "For 8 year old", "Author": "Shalyn Evans", "ReviewID": "R2U7R3QIB7P8N2", "Overall": "4.0", "Content": "I bought this as a replacement for my sons Coby Kyros tablet that cracked recently after just receiving it for Christmas. Even though he had his own tablet he always wanted mine because his didn't have google play or any games he really liked. I have a Samsung Galaxy and didnt want t to get broken. After reading plenty of reviews I ordered this tablet. It came very quickly, with in 2-3 days of order. It came with a screen protector and a stylus.  My son tried it out tonight and loves it. He was enjoying setting up his games on it that he had on mine. This was cheaper than the Coby tablet and I even like it better. Im thinking about getting a 2nd one when I can for my 5 year old so he will stop playing mine as well. Excellent product, excellent price.", "Date": "April 17, 2013"}, {"Title": "Love it", "Author": "speeps", "ReviewID": "R1E9Z2IMOVEFYO", "Overall": "5.0", "Content": "Just as good as a brand name tablet. No delay when using the touch screen (I expected the screen response to be slow for a cheaper product). Everything opens fast. No complaints. Highly recommended for price.", "Date": "September 5, 2013"}, {"Title": "Good tablet great price", "Author": "Light", "ReviewID": "R3QWFDMSZFZT4S", "Overall": "5.0", "Content": "Bought this tablet for my mom so she could read email, thats about all she needed it for. Works well for simple tasks, but was suprised when you could watch full HD movies in perfect playback and play angry birds no problem. Didn't expect it to be that good. Actually is a decent tablet, a little slower than my girls \"google nexus 7\" but that is to be expected, thats not what you would buy this tablet for. Anyone who is a light user or just getting into tablets this is a great buy!", "Date": "May 25, 2013"}, {"Title": "Great for Kids", "Author": "anonymous", "ReviewID": "R217IEELL09693", "Overall": "4.0", "Content": "I bought this for my kids (10 and 8) to play games on. We have several laptops/desktops in the family but this is the first tablet. Some PC games have new version in apps so we want to have a tablet to try those games. The instruction booklet indicates a welcome screen to set up the tablet. It didn't have that. It came with a locked screen which took me a while to figure out how to unlock it. After that, the tablet works great. The battery only lasts 1.5-2 hours. A couple of apps in Play Store did not show up on screen although I could see the files through my laptop. Maybe the version of Android on the tablet is incompatible. We are not serious users so this is good enough. It is great for the price.", "Date": "October 30, 2013"}, {"Title": "7 - inch Tablet", "Author": "JOHN T SMITH", "ReviewID": "R3KEJAT6SWLI0L", "Overall": "5.0", "Content": "For the price, I like it. I'm new as a senior but I will accomplish this piece of equipment. Only fault that I have is the manual, why is it so small. The print is to small. Is there a full size one out there. Want to save my eyes.", "Date": "May 15, 2013"}, {"Title": "IT'S JUST GREAT", "Author": "Sara", "ReviewID": "RKDUW83UDA6TX", "Overall": "5.0", "Content": "I love having a tablet. it's good for somebody's first tablet r ur 5th tablet. it's a great size for me.I want to think Alldaymall for letting me get a tablet for $68.99", "Date": "March 23, 2013"}, {"Title": "excellent", "Author": "soledad", "ReviewID": "R2UZXJ70SI3U2P", "Overall": "5.0", "Content": "Better than I expected. Graphics are good, sound is loud and clear, and all works very fast (at least compared with my old 512MB/4G tablet). I can say that now I have a useful tablet again, and at a very good price.", "Date": "July 26, 2013"}, {"Title": "Bad quality", "Author": "B. Vidolov", "ReviewID": "R22RRTY8UQE3QE", "Overall": "1.0", "Content": "Pros: Thin, lightCons: Very poor qualityThe item arrived very fast and the price was good, but the device quality is really bad. Examples: the gravity sensor that is used to change orientation doesn't work. I installed a few apps that track it and they detect the sensor, but confirm that the sensor simply doesn't work. As result, the only way I can use the device is as in landscape mode.The accelometer detects some of the movements, but has very low accuracy/sensitivity. The device cannot distinguish whether headphones are plugged in or not. In Skype you need to switch to speaker manually at each call, as it defaults to non-connected headphones. Camera is bad too, but it matches the expectations.Finally, the externals: the charger doesn't even go all the way in and a big metal piece is sticking half way out. Obviously, they used charger for a different device. The glass of the screen is not glued evenly, so it looks like it has peeled off on some edges. I wouldn't recommend.Update: I gave it to my relatives overseas and they now say that the screen cracked while the device was left charging. The charger didn't even fit well, so I won't be surprised if it has overheated due to wrong charger being shipped with the device. Unfortunately, I cannot even return it, as the device is on the other side of the earth.", "Date": "June 20, 2013"}, {"Title": "Barely works- not all apps will install and work correctly.", "Author": "Bert", "ReviewID": "RS8VMF4W3BYCN", "Overall": "2.0", "Content": "The device arrived packaged well and looked good enough. It powered on with no troubles and was surprisingly responsive. The viewing angles are pretty awful; in landscape mode, it looks mostly fine, but in portrait mode you don't get much viewing angle to work with. If you tilt it to the side by about 30 degrees the colors will fade out on you. All in all, the hardware seemed to be par for the course for a $70 tablet. I was not disappointed nor was I blown away by the hardware; if I was simply web surfing it would probably be fine. I didn't try streaming any videos with it.However, there is some problem with the OS that doesn't let all apps work correctly on it. I was planning on using this as a dedicated Pandora alarm clock by using Tasker and Pandora to automate it. For the price it would have been a great deal, but Tasker wouldn't run at all. It would install from the Play Store just fine, but would always return an error when attempting to run- it wouldn't load at ALL. I Googled around a lot, and it appears that this type of thing is a common problem with certain tablets. It has something to do with not having the Google Maps libraries installed, and no matter what I tried it absolutely wouldn't let Tasker start up. I am returning this tablet and going with a brand name I recognize.Summary: It may or may not run the apps you want it to. Build quality is decent, but I wouldn't expect it to hold up well to daily usage in the long term. Light usage should be fine. Unfortunately I cannot recommend this tablet as I don't know if it has the OS installed correctly or not, so any apps that I would want to run may not work at all.", "Date": "April 9, 2013"}, {"Title": "For my granddaughter", "Author": "John Chladek", "ReviewID": "R2TF9J9PA8P2QY", "Overall": "5.0", "Content": "The price was reasonable then the other tablets out there.  It has for me the great features i was looking for. My granddaughter loved this tablet. she was able to play the games she loves on the tablet. Overall a nice tablet for the price .  Thank you.", "Date": "May 7, 2014"}, {"Title": "The product was a disappointment", "Author": "C.J. Sallee", "ReviewID": "R3OGSLL28M22A5", "Overall": "1.0", "Content": "It stopped working after a week. I wasn't pleased with the product. I wish things would have worked out, but stuff happens.", "Date": "March 6, 2014"}, {"Title": "Semi Good", "Author": "BigRayne \"Rayne Armstrong\"", "ReviewID": "R1O84ATHH7L0X3", "Overall": "3.0", "Content": "It is a great pad to have but there are some downsides to it.  The battery is constantly being drained and you cannot update the android software.", "Date": "November 27, 2013"}, {"Title": "Very nice!!", "Author": "Emily hollingshead", "ReviewID": "RCB03QGGWDLQP", "Overall": "4.0", "Content": "I've gotten pretty attached to this little tablet, though it's a little slow and it doesn't pick up wifi connection very well. It's got plenty of memory and it's durable.  (I'm very clumsy and drop it all the time, and it's still fine). Great for gaming. It may not be the best if you're looking for a tablet for work, but it's great for kids and teens.", "Date": "August 16, 2013"}, {"Title": "I love the tablet", "Author": "Nicole Murphy", "ReviewID": "R3PC9YIOKPZHKR", "Overall": "5.0", "Content": "Had a few issues at first and they had so send me a replacement tablet but I can not say enough about the seller AllDayMall has the best customer service I have ever delt with they were prompt with responses and got everything sorted out! A+++++++++ I would definently buy from them again and would recomend them for sure!!!!", "Date": "July 12, 2013"}, {"Title": "You Get More Than You Pay For", "Author": "Amy", "ReviewID": "RXKXQ0F61SIXR", "Overall": "5.0", "Content": "I've had this tablet for three days now, so of course first impressions will last onto my review. If anything changes I will be sure to add it onto my review.This is also my first tablet, so I cannot compare very well to other tablets.In the box is a neatly packaged tablet, a self-explanatory user manual (it appears to be translated so the English is a little iffy, but understandable), a USB cable to connect to the computer, and a USB converter thing that allows you to use USB devices on the tablet. I tried connecting my iPod there, but it just charges without anything special popping up. And then there's the AC adapter for standard charging.First off, this 7-inch tablet is really fit for anyone's budget. If you don't want to be spending 3x the amount of money on those higher end tablets, then this is extremely suitable. As far as I'm concerned, this tablet can do anything the higher end tablets can do, but with less battery life and slower speed (this tablet lags quite easily from the use of some applications).The gravity aspect works well; it's also a bit slow but it works. The brightness is a huge battery waster, so I always tune down the lighting. At the lowest brightness setting, this tablet will work for about 4 hours max (on the browser, searching, watching videos, etc.). I'm sure the battery will leak much faster on brighter settings.This tablet comes with Google Play (and Angry Birds) so you can download all of your familiar apps on this thing. My only issue is that this tablet has very low storage space, so you can only fiddle around with several apps before uninstalling them and replacing them with new ones to conserve space. There's also a TF slot for anyone with a micro-SD card who needs more storage space, but since I do plan on getting a higher end tablet, I believe the kids can handle several apps and lose interest quickly enough to replace them.The audio is fine with headphones, the quality is unchanging. But the speakers are pretty bad so I'd say use external speakers as a substitute or headphones.In conclusion I can easily say that the price for this tablet is very reasonable, but I think I would spend more money on a larger storage, faster speed, and a longer battery life if I ever plan to use a tablet in a more significant setting. As for now, this tablet serves as a great substitute to the computer for the kids on the go and it's very thin and light so it's a great choice.I recommend this product to anyone who doesn't expect too much from a cheap tablet or wants to have a \"starter tablet\".5 stars for fast shipping and a great product.", "Date": "July 5, 2013"}, {"Title": "good", "Author": "hannah", "ReviewID": "R3FU8FQZZ3MOZU", "Overall": "4.0", "Content": "Its good for being an off brand tablet better then I expected and pretty durable got it for my 12 year old and its holding up", "Date": "June 24, 2013"}, {"Title": "Excellent tablet", "Author": "Shirley Largent", "ReviewID": "RH48ZAIBVBQEJ", "Overall": "5.0", "Content": "This is a really nice little tablet, more than expected. Bought it for my son, and he and my grandson use it daily", "Date": "June 7, 2013"}, {"Title": "cool 4 cheap", "Author": "reader", "ReviewID": "RYW58NJNTYNSD", "Overall": "5.0", "Content": "For the price I could stand a litlle slower response than the pricier tabletsand with that I would recommend it for someone needing the surf and or play a game or two.", "Date": "June 6, 2013"}, {"Title": "A Reasonable Tablet", "Author": "Tim \"Timdiana\" Dunn", "ReviewID": "R1E2IYXUH017SV", "Overall": "5.0", "Content": "I think this is a fairly useful tablet. I find that this tablet works best with the likes of New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa!. I think is good one to use if you are just starting off with Tablet. Plus it's at a reasonable price.", "Date": "May 30, 2013"}, {"Title": "Great Tablet", "Author": "Chris Stockton", "ReviewID": "R1V0DLQE71C2NE", "Overall": "4.0", "Content": "This is a great tablet for the money. I was very happy with everything from the speed and the easy interface. The android 4.0.4 is a great operating system, but I wish there was an easy way to update to 4.1. The only problem that I have is that it was not advertised the Android 4.0.4 will not allow you to use the expandable sd card to store apps. You can put your own media on the card and the tablet will read it however it will move anything to the external sd card(without a very strong understanding of the Android OS). Even then it can mess up the tablet. This should be advertised.", "Date": "April 20, 2013"}, {"Title": "It works ok,but product appeared to be used and not brand new.", "Author": "Lisa Beal", "ReviewID": "R3DS9F1LWPFGEL", "Overall": "3.0", "Content": "I purchased these in April to replace the Koby Kyros that my kids got for Christmas,because both units had quit charging. This is a decent tablet,my kids use them very frequently,and thus far have outlasted the Koby Kyros,which was JUNK. They are a little slow when running apps,my daugter plays littlest pet shop,my little pony,etc and they are useable,but slow to load. For an adult this would probably be horribly frustrating,but I think they are ok for younger children. However,on my sons tablet,there was a google play login stored to the tablet,and also a past used wifi name stored in the tablet. My understanding is that these were supposed to be brand new,meaning NEVER used. They came packaged as though they were new,but my sons clearly had been used before by somebody. So that's just an FYI for anybody thinking of purchasing,it may not be a brand new product.", "Date": "September 11, 2013"}, {"Title": "I like it a lot.", "Author": "Jessica Paaluhi", "ReviewID": "R2MAF4ZX0JEOIE", "Overall": "5.0", "Content": "I love it I get to do pretty much everything on it. I can play game on it and check my emails and shop online too.", "Date": "September 8, 2013"}, {"Title": "cheap", "Author": "Shalone Collins", "ReviewID": "R3BFLGVYJYLI1P", "Overall": "1.0", "Content": "This thing broke within the first week even with a protective case. my daughter is very disappointed and so am I because I had to buy a more expensive one", "Date": "September 6, 2013"}, {"Title": "grated screen", "Author": "merylin", "ReviewID": "RNTSB0CZ84J1N", "Overall": "2.0", "Content": "the prducto Alldaymall (TM) 7-inch Capacitive Touch Screen Android 4.0 Tablet PC with ... arrived at his destination with grated screen, I request a NEW product so I did not understand because I send with this defect, \"grated screen\" thanks", "Date": "September 5, 2013"}, {"Title": "Does NOT work!!!!!", "Author": "brenda espino", "ReviewID": "R154ODIK6I1BIX", "Overall": "1.0", "Content": "Where to start... After reading several reviews on this product we finally decided to order for my youngest sister. When it came in the charger was bent didn't fit properly at all. Then the thing came apart! Mind you this was minutes after taking it out of the package. Now it's been maybe two weeks after the purchase and it doesn't want to turn on it stays frozen on one thing and will not move any further. This has been a waste of money!!!! I'm very disappointed with this purchase. I honestly don't recommend it at all. For all this we should have just spent the little extra for a child's tablet.", "Date": "August 20, 2013"}, {"Title": "Waste of money...", "Author": "S. Higgins", "ReviewID": "RAPI3EY6WVE1D", "Overall": "1.0", "Content": "I bought two of these tablets for my kids. They were great for about three days then they both broke. Very disappointed kiddos and very annoyed mom out of the money. Will be saving up to buy better quality next time...", "Date": "August 16, 2013"}, {"Title": "Worked for 2 weeks!", "Author": "Amy Smallwood", "ReviewID": "R2SLTIMUTC93G5", "Overall": "1.0", "Content": "I bought this tablet for my daughter and it worked for 2 weeks and just stopped. Before it malfunctioned, it was great. WiFi connectivity was simple, Netflix ran great, Google Play store was great. Just shipped it back this morning. Unfortunate that they cannot exchange as I now have to wait for a refund and then reorder a tablet for my child. I will not be ordering another one of these.", "Date": "August 12, 2013"}, {"Title": "disappointed", "Author": "jasmine brazier", "ReviewID": "R2PGR6QIIWGSSP", "Overall": "1.0", "Content": "The tablet looked okay in the box but after I charged it and turned it on I realized that it was of very poor quality. Yes I know I only bought it for $60 but I was expecting better performance after all it comes with a 4.1 android O S . The battery life is like one hour at the most, the screen isn't very sensitive and it moves in choppy sort of way, plus it makes some sort of crackling back ground noise whenever you try to load a game. I bought it for my son to play games on but I am thinking of returning it. Think twice before you purchase.", "Date": "August 9, 2013"}, {"Title": "junk", "Author": "Arden McCartney", "ReviewID": "R2XLLV3QA3PXCT", "Overall": "2.0", "Content": "low quality poor performance cheap plastic surface that scratches easily do not waste your money wifi useless for any thing", "Date": "August 3, 2013"}, {"Title": "JFox", "Author": "JFox", "ReviewID": "R3PTHU6TNU7E5E", "Overall": "4.0", "Content": "This product more than met my expectations, which were low because of the price.  While I complain below, I am very very pleased with this tablet.Issue 1)This tablet does everything my Android phone with a quad core processor can do, it is just a little slower.  There is a lag when opening apps; I wouldn't have cared or probably wouldn't have noticed if I hadn't seen how fast my phone can open the same exact apps.Issue 2)The headphone jack is very simple.  It does not have a microphone in it like standard Iphones/Ipads or almost all Android cell phones.  That means you cannot use the Square card reader because it requires a headphone/mic input.  Square card readers will not work on this tablet.  The app works, just not the card reader.  Square wallet works fine too.Issue 3)Battery life keeps getting lost by the tablet looking for cell service!  Bizarre because this is a wifi only tablet.  Cell standby was using up to 70% of my battery.  You can save your battery by rooting the tablet and removing Phone and Telephony.apk.  This will void your warranty with Alldaymall.  Alldaymall should have fixed this before installing it on all their tablets (morons).Issues 4,5)Microphone and speakers could be better.", "Date": "July 26, 2013"}, {"Title": "Very Poor Quality", "Author": "g.v", "ReviewID": "R1VK59Q3WWQL8D", "Overall": "1.0", "Content": "I had this product for a total of three days before the screen went out. I did a master reset and still mess up.", "Date": "July 24, 2013"}, {"Title": "bad product", "Author": "Renna Rockett", "ReviewID": "R2OVM7ES52OTA6", "Overall": "1.0", "Content": "This table kept freezing on my daugther. I bought it for her gradution, and it just stop working a month later. it sucks big time. I will not buy for this seller again.", "Date": "July 24, 2013"}, {"Title": "overnight delivery excellent !!!!! as of the product so far ok", "Author": "sema", "ReviewID": "R1J44XOZ2VKL2", "Overall": "4.0", "Content": "I ordered the tablets for my kids and they are ok. Only thing is that they are little bit slow and they get frozen if you put the \"\"slide to unlock\"\" but if you keep it without locking it its good. I have to say you get for what you pay. My kids love it ! So thank you.!", "Date": "July 15, 2013"}, {"Title": "Everything is working as espectated, and was delivered on time, great!!", "Author": "Marvin Lau", "ReviewID": "R3AV1XWTSI544X", "Overall": "5.0", "Content": "Ok let's be clear, i bouth this tablet for my kids, i received it, and start configuring... it is a very nice tablet for a really good price, i think is right for playing games, may be browsing for school task research. Until now, no problems with this item.", "Date": "July 15, 2013"}, {"Title": "Not for impatient children...", "Author": "Dwayne K. Utsey", "ReviewID": "R38V5P3IMSXTAM", "Overall": "3.0", "Content": "I bought 2 of these for my 4 year old and 6 year old since they love to play with my Samsung Galaxy Tab 2. These tablets load most of the good apps VERY slowly which my kids were not used to and thought it was just freezing up. Some apps didn't recognize screen rotation and only worked in portrait mode....about portrait mode...its terrible. Viewing the screen in that orientation hurts your eyes and even looks kind of 3D-ish. For simple everyday emailing, web surfing, data-entry, etc. its just fine, quality and build is pretty good too, but if you are an intensive app user, spend a little more, you won't be sorry.", "Date": "July 12, 2013"}, {"Title": "Awful", "Author": "Karen Bennie", "ReviewID": "RBVZ69AZYQIR4", "Overall": "1.0", "Content": "This is so slow..by the time you get a page to load, the unit shuts down believing it's not in use.  Save your money and buy something else!!  I have tried using it at home , on vacation etc..its not the WI FI signal..it's the unit:(", "Date": "July 11, 2013"}, {"Title": "tablet", "Author": "satisfied shopper", "ReviewID": "RRR36KD8EMMQP", "Overall": "4.0", "Content": "A little better than I expected keyboard included with the case turned the tablet is not a mini laptop. thanks", "Date": "July 10, 2013"}, {"Title": "Its ok", "Author": "sandra solis", "ReviewID": "R72EQHKG53CCB", "Overall": "3.0", "Content": "Not as good as expected but ok. Kind of slow and sometimes the screens turns black and I have to shut down and back up and then its ok.", "Date": "July 10, 2013"}, {"Title": "Its alright.", "Author": "Matthew", "ReviewID": "R350PI43V7EECQ", "Overall": "3.0", "Content": "Its alright. Battery only last like 1 1/2 hr. screen scratches easily too.it is ROOTED!!!!!!! I got it for emulators. I use it for GBC/GBA/DS/N64/PSP Games. and to browse the internet . Works well for those uses.", "Date": "July 10, 2013"}, {"Title": "works fine!", "Author": "Candy Kocher", "ReviewID": "R1D3GZLTRP2Q85", "Overall": "4.0", "Content": "This one works great for the amount of money. I bought it for an  ereader , but I can check email, play games, all the things my son can do with his nook.", "Date": "July 7, 2013"}, {"Title": "worth the wait", "Author": "rlcookson", "ReviewID": "RWC785QVBWFK9", "Overall": "4.0", "Content": "Took a long time to get the and one of the chargers didn't work but the tablets themselves were great", "Date": "May 2, 2013"}, {"Title": "wasted money", "Author": "travis l hill", "ReviewID": "R3C67YJBE3S4MS", "Overall": "1.0", "Content": "It did not work proper it keep getting stuck on me. I feel like i wasted my money on buyinig it. Resetting it did not help it at all either.", "Date": "April 22, 2013"}, {"Title": "Be careful", "Author": "JOYCE MURFF", "ReviewID": "R1N0P766IXESTG", "Overall": "1.0", "Content": "I bought this tablet for my daughter, I received yesterday and has it packed for pick-up today. It appears to be used, it has bubbles around the screen and a long scratch on it.  I was expecting a new one.", "Date": "March 20, 2013"}, {"Title": "My ATM7029 Review", "Author": "Luci", "ReviewID": "R1MQGRQ6EFYBYE", "Overall": "4.0", "Content": "Overall we are very happy with this tablet purchase. Our first tablet was a KOBO VOX, 800 MHZ, 512RAM/8gig HDD. This tablet is very responsive with little lag. Game play is similar in speed to playing on our PC. Netflix plays smoothly. \"Touch\" on the screen is what I call normal, not too hard and not many accidental clicks. The only thing I miss on my VOX is the screen. With the VOX sitting in bed beside my partner I could easily see his screen as though I was sitting directly in front of it. With the ATM7029 looking at it from the same angle the screen is washed out grayish looking. So be prepared to get a case/stand for optimal viewing. There were very few 'stock' apps installed and I missed some from the VOX. Thankfully getting apps is easy and knowing what I liked on the VOX was a big help. So all in all we would purchase this tablet again it seems to be a decent mid range table.", "Date": "August 9, 2013"}, {"Title": "poor q", "Author": "Beckie McLarty", "ReviewID": "R18DL88GR1UD3F", "Overall": "1.0", "Content": "This was a disappointing gift for my grandson. I guess you get what you pay for. Was unusuable after afew weeks.", "Date": "August 6, 2013"}, {"Title": "Don't waste your money!!!!!", "Author": "Laura", "ReviewID": "R11PEIAJGX13F2", "Overall": "1.0", "Content": "Buyers beware delivered to me on April 8th not working right less than 3 months later! To top that Amazon says it's not elegible for return or replacement! So do not waste your money on a disposable tablet! It did work good for the first 3 months, but I expected a whole lot more time for what it cost!", "Date": "August 3, 2013"}, {"Title": "PERFECT for children", "Author": "Danielle C.", "ReviewID": "R3FNFXUKLDGKBW", "Overall": "5.0", "Content": "I have 3 sons. They are 11, 6, and 5. They all wanted tablets, and I was having a hard time deciding on something that I thought would hold up to these 3, be reasonably priced, and still do everything they wanted it too. They had been saving their own money for months waiting for me to find something. ( I don't think it's ever too early to teach kids the value of a dollar and they had to earn their own money) I looked for probably the better part of a month. My kids were all interested in different games. This tablet however had proved to be perfect for all 3 of my kids. They play all the games they want. The tablets came installed with fruit ninja and angry birds. I did purchase 3 cheap cases for the tablets as a little added security, but all in all they are perfect. They've been dropped, sat on, whatever else you think 3 boys can do to something, and they're still working perfectly. BEST tablet I could have purchased at a reasonable price for 3 children!!!", "Date": "July 1, 2013"}, {"Title": "Alldaymall  7\" Touch Screen Android 4.0 Tablet PC", "Author": "Nancy Marcantoni \"Liberty & Tirany\"", "ReviewID": "RT0F2U4OOTEOK", "Overall": "5.0", "Content": "This is my first tablet ever.  It is wonderful, log everything fast, I can watch what ever.  For the price is to good. It is very clear, sounds good, and I can play games.  I love it.  I recommended to my friends and people interested.  Thanks", "Date": "May 13, 2013"}, {"Title": "Works Perfectly!", "Author": "8684310", "ReviewID": "R1ECIFL68XTIDX", "Overall": "5.0", "Content": "Five stars! It works perfectly for what Intendly bought it for and then some. Would definitely recommend it and it's price was definitely in my budget range as a college student.", "Date": "April 24, 2013"}, {"Title": "GOOD VALUE FOR THE PRICE", "Author": "tami williams", "ReviewID": "RY2KSEMR5FP8T", "Overall": "4.0", "Content": "For the Price It DOES  everything I need it to do  I wish it had front and rear  FACING CAMERA . FOR UNDER $100 GOOD BUY.", "Date": "April 12, 2013"}, {"Title": "Kinda pokey, but a good value", "Author": "dhrachth", "ReviewID": "R19A8VM54C54H9", "Overall": "4.0", "Content": "The viewing angle on the screen is kinda narrow.  The battery life isn't great.  It runs a bit slow.However, it does work.  I can check my email, watch a youtube vid, and play a few rounds of Angry Birds.  It is small and light enough to easily fit in my purse or carry on.  At the price I paid if gets kicked or crunched when shoved under a seat or into a over head compartment, no big deal.I purchased this specifically to travel with and for that purpose it is great.  For a tablet for everyday use I would recommend paying extra for a little better model--but for the price this one works surprisingly well.  One thing I will say in this tablet's favor is that it didn't come with a lot of pre-installed bloatware.  My pricier tablet came loaded with a lot of apps I don't want and won't use.", "Date": "July 23, 2013"}, {"Title": "This is a steal and a great Android", "Author": "Bookie \"Bookie\"", "ReviewID": "R13PACWP09F3N4", "Overall": "5.0", "Content": "I absolutely love this tablet.I read books and read and send emails. for the price you cannot beat it.And it works great. Easy for a beginner.I went back and bought another for a gift for a friend and they loved it also.", "Date": "July 23, 2013"}, {"Title": "better instructions", "Author": "peter greenwood", "ReviewID": "R1C6VYLFNSQ8WV", "Overall": "3.0", "Content": "its reasonable,.instructions hard to understand, screen not good when working outside otherwise fairly satisfactory but would not buy again for anyone", "Date": "July 22, 2013"}, {"Title": "Screen Very Fragile", "Author": "cm", "ReviewID": "R1NJCW3Q3MRDB", "Overall": "3.0", "Content": "Just be careful and not for kids under 15..wait til they are responsible enough to use this product lol lol", "Date": "July 21, 2013"}, {"Title": "Support 3G Dongle?", "Author": "LRBB from CRC", "ReviewID": "R3NWUKM9M8G9RY", "Overall": "2.0", "Content": "I'm very disspointed since it doesn't support #G dongle as described. And the battery life is simple the worst I ever had in and electronic device.", "Date": "July 17, 2013"}, {"Title": "Low price negated by having to buy extra stuff to make it work", "Author": "Sylvia Hutson", "ReviewID": "R14ZFC51P7MT76", "Overall": "2.0", "Content": "This tablet would not charge with the cord that came with it, so I have had to spend $25 on different charging accessories... It also will not recognize the \"Square\" card reader, which it the main purpose that I bought the thing for... I spent more money buying an extension for the headphone plug in hopes that it was just the connection with that particular \"square\", but it did not work... The square works on other android units, but not mine...  It does allow me to use some android apps that I need right now, so that is the only reason I have not returned it...", "Date": "July 17, 2013"}, {"Title": "Price/Function, I like it.", "Author": "Gary Gone", "ReviewID": "RX1392P0ZUROB", "Overall": "4.0", "Content": "With the reasonable price,  the Tablet is suitable for travelling...  but battery last only 2 hours...may need to have power-bank on the road.  I like it.", "Date": "June 19, 2013"}, {"Title": "Oh my gosh", "Author": "brianna filips", "ReviewID": "R1X4Y6CP5VP29F", "Overall": "2.0", "Content": "well, i bought this for my brother's birthday, which was yesterday. i was waiting to review this item until he had it in his hands. he opened it and saw it needed charged. no big deal. we put it on the charger and it took ALL DAY to charge. not only that,  but he said it was slower than ever. i was hoping i could review high on this but i don't believe the product deserves it.", "Date": "June 16, 2013"}, {"Title": "You're throwing your money away.", "Author": "Sarah Bellotti", "ReviewID": "RBW15D1CITFOT", "Overall": "2.0", "Content": "It's really slow to respond and the photo quality is horrible. It's slow, disconnects itself from the internet randomly, and the mini USB port or whatever fell off the motherboard so I can't plug it into my computer anymore. I took it to a computer repair shop and they said to repair it would cost more than the whole thing is worth. I got it a month ago and have only used it a handful of times - sad.", "Date": "June 14, 2013"}, {"Title": "Excellent", "Author": "Bonnie Bolen", "ReviewID": "R1A90M89FAV14W", "Overall": "5.0", "Content": "This is a great value. I handed it to our 14 year old granddaughter and she loved it! Thank you", "Date": "June 12, 2013"}, {"Title": "Alldaymall Andriod", "Author": "carol nagy", "ReviewID": "R2QTW19JMYA7L0", "Overall": "1.0", "Content": "Could not get it to charge completely. Directions were useless. They did not tell one how to use it and were vague.", "Date": "June 12, 2013"}, {"Title": "NIFTY!", "Author": "Augustine", "ReviewID": "R2U3EU3TVPQQ43", "Overall": "5.0", "Content": "This is a great multi-functional device.  It's compact but definitely gets the job done.  I have no hesitation to recommend this product.", "Date": "June 11, 2013"}, {"Title": "very slow and no good conections with wifi", "Author": "KIMBERLY STEELE", "ReviewID": "R32Q5K1051N5BO", "Overall": "1.0", "Content": "I was very disappointed with this tablet.  The price was nice but the quality stinks!DONT BUY THIS IT DROPS WIFI OR HAS TROUBLE FINDING IT.", "Date": "June 10, 2013"}, {"Title": "Great for the price", "Author": "David Rivera", "ReviewID": "R2GADXA15M4IGW", "Overall": "5.0", "Content": "This tablet does everything it's supposed to, and for what it cost, does it very well. The screen does kinda scratch up a bit, but that's only because I don't have a screen protector.", "Date": "June 5, 2013"}, {"Title": "the best", "Author": "MAMADOU    SECK", "ReviewID": "R1LY932HQG6MYX", "Overall": "5.0", "Content": "this is a really good tablet,the only problem i had was the battery get drain really fast but other that it the best tablet i had", "Date": "May 30, 2013"}, {"Title": "Perfect for my son..", "Author": "Brooke", "ReviewID": "R1BPN6M2EVM1BQ", "Overall": "3.0", "Content": "The screen is kinda dark...the charger broke the day I got it, thank god I had an extra one. The battery life isnt the best BUT it does its job and its great for my 7yr old.", "Date": "May 30, 2013"}, {"Title": "Very decent tablet", "Author": "Jml", "ReviewID": "R2G70FXN20R3L2", "Overall": "4.0", "Content": "I was skeptical when I bought my brother this tablet for a graduation present, but I must say he loves it and I'm thinking of buying one myself. This tablet. Is extremely thin and the touch screen works pretty well. As for the speed it does lag and the viewing angels are bad. Over all I say you can't beat it for a budget tablet. One major draw back however is it uses a propriatery charger.", "Date": "May 29, 2013"}, {"Title": "Money's worth", "Author": "C. Yamaguchi \"pax\"", "ReviewID": "R3LWOIQSFM2OD9", "Overall": "4.0", "Content": "product came within a reasonable amount of time, esp for free shipping...works well..no complaints so far, except for short battery life--meter on device does not appear accurate...drainage possibly depends on functions using...unsure how to close apps, so this may be draining battery as does online usage", "Date": "May 24, 2013"}, {"Title": "android", "Author": "lisa", "ReviewID": "R1NK0XXAWHQUTO", "Overall": "5.0", "Content": "My tablet is great. It does everything i need it to do. It was a great purchase. Best buy ever.", "Date": "May 21, 2013"}, {"Title": "It's okay", "Author": "Gussie", "ReviewID": "R33IMSOGNT5C10", "Overall": "3.0", "Content": "This is not a bad item, but you do get what you pay for.  Very light weight.  I ordered 2 and had to immediately send one back because the screen did not work.  Luckily, the customer service was amazing and made the return simple and fast!  The power cord fits into the tablet awkwardly.  It's hard to plug it in and it doesn't go all of the way in...just enough that it connects.  Functions similarly to any other Android tablet.  If you are wanting a tablet that will get a lot of use, I would invest in something a bit more ... but for my mother (who can barely use electronics) it works fine for her to check email and play games.", "Date": "May 21, 2013"}, {"Title": "My granddaugther loves her new tablet", "Author": "Nancy Lau", "ReviewID": "R3CV9P0OJAITEK", "Overall": "5.0", "Content": "My granddaughter is 8 yrs old and I didn't think an Ipad or Samsung Tablet was approriate for her age. Kids don't really take care of things and this cost a lot less and does what she needs it to do!!!", "Date": "May 22, 2013"}, {"Title": "Alldaymail", "Author": "Douglas P. Garrow", "ReviewID": "R28WK7CQL92O10", "Overall": "5.0", "Content": "I ordered this item as a birthday gift for my grandson in June.  I know he will be jumping around. The ease of ordering here is product is always of good quality.", "Date": "May 21, 2013"}, {"Title": "Item seems to be ok.", "Author": "donald l.", "ReviewID": "RXJVI17PLIL9G", "Overall": "3.0", "Content": "I have not had it very long but so far so good. I will try to keep you posted if it stands the test of time.", "Date": "May 21, 2013"}, {"Title": "I'm using it to write this review", "Author": "dalthin", "ReviewID": "R1S9NY0841IM9R", "Overall": "5.0", "Content": "For the price it is awesome! I read the reviews and after setting it up with the night mode software (thank you pennywyze for recommending this excellent software, there are many good reviews on here but yours was by far the best)  the battery life was much more manageable. I gave it 5 stars because of the price, if you are looking for cutting edge you may want to get something else, but for less than $60 you'll be hard pressed to find better.", "Date": "May 19, 2013"}, {"Title": "Arrived dead.", "Author": "Damian Harouff", "ReviewID": "R2F8OS2X9MJQRM", "Overall": "1.0", "Content": "Arrive dead. Received it in the afternoon, played with it intermittently throughout the day trying to get it to turn on, but no go. Tried with the charger, without the charger, with the USB cable, without the USB cable.Could have been great. Oh well.", "Date": "May 11, 2013"}, {"Title": "Pay for what you get", "Author": "Madelyn Grey \"pendrell3\"", "ReviewID": "R12B472AB0Z4HP", "Overall": "3.0", "Content": "If you are buying this for the camera don't. The resolution is pretty terrible. As is the battery life. I got this for my kid and within 2 hours the battery was drained. It is a cheap tablet so I am paying for what I got. Set-up was remarkable easy and it does have a good screen resolution but it's nothing compared to an ipad or kindle", "Date": "April 26, 2013"}, {"Title": "its ok", "Author": "blondb", "ReviewID": "R3ESBUAU0LZRGG", "Overall": "3.0", "Content": "battery life  dies under 2 hours of use ,a bunch of apps that are already installed doesnt work  and apps that i download but its for my two year old son so he is happy with it just to play the games that do work. internet works fine.", "Date": "April 24, 2013"}, {"Title": "perfect for my 5 year old", "Author": "Pen Name", "ReviewID": "R3AE3ZV1N27O0E", "Overall": "4.0", "Content": "Product works very well. Some of the games downloaded did not work correctly but good enough for my daughter. She loves it, it's a good deal for the money", "Date": "February 8, 2013"}, {"Title": "Good as a supplemental external drive", "Author": "Stephen Boyd", "ReviewID": "R8PXMZYNPZZ2Z", "Overall": "3.0", "Content": "It has worked for me.  I use it as an external drive and store my musicon to use in my car.  Don't expect top of the line quality, but, worth whatyou pay.", "Date": "October 8, 2013"}, {"Title": "screen glass broken", "Author": "Omar", "ReviewID": "R264MJKVOXPEEM", "Overall": "4.0", "Content": "hello recently purchase a tablet you the problem is that I broke the lcd screen not only the front glass let me know if you have parts for this tablet if you have one please let me know", "Date": "June 27, 2013"}, {"Title": "Good tablet", "Author": "khoa trinh", "ReviewID": "ROXUO19O38YFI", "Overall": "5.0", "Content": "Tien nao cua do,neu dung de coi tin tuc,hay choi nhung games nhu angry bird,shooting...thi ok. tien loi co the bo trong tui", "Date": "May 3, 2013"}, {"Title": "7\" tablet", "Author": "Makayla", "ReviewID": "R1JRMCOTF7HW2", "Overall": "1.0", "Content": "They called me block and wanted me too remove my review and if u are reading this I'm not removing how I feel I don't care if u people gave my money back I'm telling people how it works and how it is a rip off . .. Because them calling me telling me too remove my comment for my review no I'm not the picture went out and the screen went black worked for a day or two", "Date": "June 3, 2013"}, {"Title": "my kid likes it", "Author": "susanne spellman", "ReviewID": "R1KLY5IHQ7IWTP", "Overall": "3.0", "Content": "to slow long to chargekids will eat it up not long enough charge cord do they expect you to sit to the wallif you are a fast person like me you wont want thismade a great gift for kid for the price only", "Date": "April 7, 2013"}, {"Title": "Tablet Bad", "Author": "YR", "ReviewID": "R1A35QHDIMF66C", "Overall": "2.0", "Content": "well all except for a tablet that does not load wine turns bad.tablet is bad loading and no more", "Date": "February 25, 2013"}, {"Title": "i dont have one but", "Author": "Drew Rogers", "ReviewID": "R18R03G0F5WPMH", "Overall": "1.0", "Content": "i dont have one of these pices of crap i have a 600$ asus tf700t.people stop looking at this crap go buy a name brand tab like asus ,samsung etc....dont buy  off brand crap.", "Date": "June 4, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00KHM8NMI"}}