{"Reviews": [{"Title": "Fantastic product!", "Author": "Alex miller", "ReviewID": "R2PD2SAJQIHXCG", "Overall": "5.0", "Content": "My 3 year old kids absolutely loves it.It is easy to use so he can easily navigate through the menu.so my kids love it.I am feeling relaxed for it's drop protection feature.It is great for a boy or girl and he will be on there for hours just learning!All in all, its a great product and you cant beat the price! I would definately recommend this product.", "Date": "May 22, 2014"}, {"Title": "love it already.", "Author": "samantha driscoll", "ReviewID": "R3G9DISOSNSO71", "Overall": "5.0", "Content": "its light weight. clear sharp screen. runs very smooth n quickly. i just got it n i love it already. great little tablet.", "Date": "June 2, 2014"}, {"Title": "Great Tablet", "Author": "Benjamin V \"Benjamin V.\"", "ReviewID": "RDOTTGKO615OC", "Overall": "5.0", "Content": "This is a really a great tablet, my kid is really enjoying it. Works nice without lag and the rubber feels great quality. A great way for me kid to start messing around with technology, and get a head start on the future. Will definitely recommend this to my friends and family with kids. Thank you!", "Date": "May 22, 2014"}, {"Title": "5 star product!", "Author": "Navygirl", "ReviewID": "R2PE2GIZJHZZ8U", "Overall": "5.0", "Content": "I as the parent love the tablet! It keeps the kids occupied on long trips and can download tons of google apps! My kids are using this like crazy. I just wish there was a car charger that I could buy! I really like the removable case. It helps absorb the shock when my kiddos have the dropsies.---Now for my kids to review the tablet---Awesome! Best thing our mom ever got for us! It's easy to use and fun to play with.", "Date": "June 9, 2014"}, {"Title": "orbo jr. review", "Author": "Megan Langbehn", "ReviewID": "R19B7MXBGXS6QE", "Overall": "5.0", "Content": "Tablet is a great product. It's big screen has great quality and very clear. It would be great as a starter tablet for anybody, not just kids. I got it for my daughter, and I have just as much fun on it as she does. The tablet does get pretty hot if being used for a long period of time, and it does seem to lag a bit. In the middle of an app, if the low battery warning comes on, or if I put the tablet down for a minute and the backlight gets turned off, it'll say the app isn't responding and forces it to shut down.", "Date": "June 7, 2014"}, {"Title": "A road-trip necessity", "Author": "aaron rockey", "ReviewID": "R2T8WQ2J8YPBSQ", "Overall": "5.0", "Content": "I received this tablet and upon opening it looked very professional. The case is very durable allowing me to feel like I could just whip at a wall no problem. It ran Facebook and YouTube no problem. I have it to my sister and she absolutely loved it. It goes everywhere with her now especially on the long car rides she would get bored on. If you have a kid 10 or below they would love it and safe for them to lug around without the worry of breaking it.", "Date": "June 6, 2014"}, {"Title": "Perfect Hold for Kids", "Author": "brittany burmeister", "ReviewID": "R2LJ05CJ5AJE4F", "Overall": "5.0", "Content": "This tablet is perfect for kids. Not only is the tablet easy to use and quite accessible, but the rubber case on the outside makes it that much more amazing. I am not concerned (as much) when it gets dropped because the case on the outside seems to soak up all of the shock. Its a fun color and gives the littles a more than just visual stimulation.", "Date": "June 6, 2014"}, {"Title": "Orbo Jr. 4GB Android 4.1 Five Point Multi Touch Tablet PC - Kids Edition...", "Author": "delshannon-gife-shop", "ReviewID": "R2WPCNH1KUIN4Y", "Overall": "5.0", "Content": "it come with every thing that you need and my kids love it. i have not find any thing wrong with it yet and it keep them off of my ipad", "Date": "June 3, 2014"}, {"Title": "Great tablet for my son", "Author": "Don", "ReviewID": "R3O0V083RXT4XZ", "Overall": "5.0", "Content": "I ordered this for my preteen son was not positive it was right for him as he is all boy.  It arrived day before we was to go camping. There was no stoping my son from taking it with us. To my amazement this little tablet held up great. It was dropped tossed around in tents back packs. Now that we are back home I'm running if through its passes and I'm very impressed.I'd recommend this to anyone want a first tablet for a  child.", "Date": "June 9, 2014"}, {"Title": "Great tablet, perfect for a kid:D", "Author": "victoria", "ReviewID": "R3FZX5CCDYJCL1", "Overall": "4.0", "Content": "Tablet is durable and the outside case that comes with it is very comfortable to hold and fits well in my child's hands. Although he is just a toddler the screen responded very well to his little fingers. As far as surfing the internet the tablet is fast and it renders games and videos great! Would have been five stars if only the battery lasted longer.", "Date": "June 9, 2014"}, {"Title": "Orbo Jr. 4GB Android 4.1 Five Point Multi Touch Tablet PC - Kids Edition...Pros and Cons", "Author": "Roy", "ReviewID": "RSJMZXESEKCIE", "Overall": "4.0", "Content": "Pros-Can upgrade to be up to date on the latest android version.Runs may different games flawlessly.Charge time is about two hours to fully charge.Can add extra external space up to 32gb.Cons-Needs more internal space.Could use a longer battery life.Needs bluetooth capabilities.", "Date": "June 8, 2014"}, {"Title": "Would be awesome if it would charge!", "Author": "K. Hayes \"K Hayes\"", "ReviewID": "ROOMWXBYU684Q", "Overall": "3.0", "Content": "Bought three of these for my kids and one of the chargers won't even work.  Now one of the tablets won't charge at all.  It's like the connection is loose.  So frustrating since I heard good things about these and my kiddos all want to play on their tablets, but have to share chargers.  I am contacting the company tomorrow.", "Date": "June 6, 2014"}, {"Title": "Great tablet", "Author": "Doris", "ReviewID": "R2FLJWYCW80YJH", "Overall": "5.0", "Content": "This is a nice little tablet.  It comes with everything that you need and it runs smoothly.  I would recommend purchasing it.", "Date": "June 6, 2014"}, {"Title": "not what I expected", "Author": "Hillary K Nickerson", "ReviewID": "R15J6JGVCEOT6W", "Overall": "2.0", "Content": "The screen is very hard to see, even after adjusting the settings. The processor is slower than I was expecting. Personally, I wouldn't purchase this product.", "Date": "June 5, 2014"}, {"Title": "Not amazing, but it's ok...", "Author": "Ryan Nickerson", "ReviewID": "R13CVLENFY26WM", "Overall": "3.0", "Content": "I reviewed it as well as my son. I was a little disappointed with the processor speed ... I guess it depends on what you're doing with it but don't expect anything to move too quick with it.", "Date": "June 5, 2014"}, {"Title": "worth every cent!", "Author": "nathalie esther gonzalez", "ReviewID": "RADQOJ733B86", "Overall": "5.0", "Content": "The tablet arrived quickly and in good condition.  I bought it for my son and he loves it! This is by far the best product I have bought on amazon. I will be ordering another soon for my other son.", "Date": "June 4, 2014"}, {"Title": "Perfect kids computer", "Author": "Cliff", "ReviewID": "R1T3VDTAAKNJ4L", "Overall": "5.0", "Content": "This is exactly what I wanted.  Not as powerful as some other tablets but perfect for a kid. Came with angry birds space and fruit ninja installed. I love that the silicone case is easily removed and cleaned.", "Date": "June 3, 2014"}, {"Title": "for 3 yr. old son", "Author": "courtney", "ReviewID": "R2OF1YJK6UDGO0", "Overall": "4.0", "Content": "prompt delivery my son hasn't  played with it yet because im waiting to give it to him on his birthday this month, but I played with it and added a couple apps for him to play with when he opens it I must say the tablet gets hot very quickly and when it does its lags or run slow im a little concern about that im going to wait until sons plays wit it a min to actually get a feel on how much I like the tablet but right now its alright.", "Date": "June 3, 2014"}], "ProductInfo": {"Price": "$199.99", "Features": "Google Android 4.1.2 Jelly Bean OS\nLightweight, Compact Design for Little Hands\nDurable Case Holds Up against Drops and Spills\nIncludes 4 GB of Memory with Room for Expansion\nInterface is Fun, Interactive and Easy to Use", "Name": "Orbo Jr. 4GB Android 4.1 Five Point Multi Touch Tablet PC - Kids Edition [March 2014] - Pink", "ImgURL": "http://ecx.images-amazon.com/images/I/41aGfCiNNCL._SY300_.jpg", "ProductID": "B00K0OBEE2"}}