{"Reviews": [{"Title": "Perfect for my kids", "Author": "Brent Hollander", "ReviewID": "R2FLK0T8BJECGN", "Overall": "5.0", "Content": "I ordered this tablet with the intention of giving it to my 2 children who are constantly using my ipad. It was a good deal and now my kids have something to play with and I can have my ipad all to myself now.As for the product itself, It has a decent amount of memory and speed to play apps and browse the web. I like the size because it is very compact and easy to carry around when you are travelling. The battery life is not bad, but really depends on what you are doing which has a direct effect on your battery.My kids use it to watch videos on youtube and play some games. I can also plug in my hdmi cable and hook it up to the kids tv when they want to watch a movie which is awesome. I recommend this to those with kids because it served me very well and does the job.", "Date": "May 22, 2014"}, {"Title": "Compact and addictive", "Author": "Veronique Dole", "ReviewID": "R1O7Y5AH6ZAOPT", "Overall": "5.0", "Content": "I'm usually into small gadgets but I decided to make a small investment into something bigger than just a mobile android device and at the same time not have to go out and spend $200 on a tablet.All I needed from a tablet was a nice style,  not too big or bulky and with a decent size screen with my likings. I like the tablet, it is just the right size I needed and comes with a few pre installed games which of of them are my favourite and probably yours too is candycrush. It also comes with facebook and youtube as do most android devices come with.I was expecting a poorly made device with slow performance, but this one is pretty smooth and slim. I also love the fact that it comes with an hdmi output which I could use to connect to my 65\" tv to watch movies, of course you would need to acquire your own hdmi cable as it does not come with one.The browser is great, the youtube videos do not lag at all, even with my decent wifi at home, and I can actually play candycrush on a bigger screen than my phone now.It has 4GB of Ram memory, but the system, shows less which is normal due to the android OS needing some memory to run. It also has 1GB ddr ram which for those of you who have no idea what that means, lets just say, the typical memory a tablet has is usually 512MB which means that this tablet is 2x as fast as most tablets.Overall, I love it, its compact and It works perfect for me. I'll be sure to get a few later this year as christmas gifts.", "Date": "May 18, 2014"}, {"Title": "Kid's Toy", "Author": "dad451", "ReviewID": "R1ND9EAV14RHIN", "Overall": "3.0", "Content": "HDMI Output 1080P???  Not so fast there guy. No way to change the output, mine was way below 1080p. Watching video is like watching cartoons with large pixels.Front & Back Camera w/ Bluetooth????? Yeah the camera's work, but just try to find anything bluetooth...ain't there folks.Everything else works fine (that I've tried) I only wanted to watch netfix on this...not gonna happen.This would be a really good beginner for a 8 year old or maybe granny, not for anyone else.", "Date": "May 31, 2014"}, {"Title": "Simple but yet refreshing", "Author": "Symphony Cornwell", "ReviewID": "R1CR7XM07LLR2I", "Overall": "5.0", "Content": "I never knew much on how to download videos and play games for computers so this tablet works great for me with the multi touch screen. I hate using mice and keyboards and I dont like to wait 10 minutes to install a game, its much easier for me to use this than a computer.It has a nice white color on the back of the device and has multiple ports where you could connect to such as the usb power port, hdmi output and a micro sd  slot for additional memory. It does come with 4GB in total memory, but you will only see around 2.5 since the operating system relies on some memory to function which is normal. I am overall satisfied.", "Date": "May 28, 2014"}, {"Title": "Great tablet at a good price", "Author": "genesis42347", "ReviewID": "R1L4X5TIAA57OQ", "Overall": "5.0", "Content": "Its a nice little tablet with the one of the latest android os versions available. It is good for travelling and the screen is pretty sensitive and does not lag at all.  I'm not into those big fancy tablets since my hands are not that big, but overall the tablet has exactly what I need and the price was great.", "Date": "May 23, 2014"}, {"Title": "Its fun", "Author": "Osho Champagnat", "ReviewID": "R1KFEOFFT31V5", "Overall": "5.0", "Content": "I normally use this tablet when im in class and almost falling alseep due to my teacher. I'm glad it is only 7 inches because it fits right into my bagpack and easy to put away during a lesson. It has some fun games and of course youtube which I love, thanks for the great tablet.", "Date": "May 27, 2014"}, {"Title": "Best tablet for my son", "Author": "Emlyn Palotti", "ReviewID": "R21QYJPSR8OYI", "Overall": "5.0", "Content": "I bought this as a present for my kid who was very happy to receive it on time for his trip. Everything looks good and I am now the father of the year", "Date": "June 5, 2014"}, {"Title": "Amazing Device", "Author": "Aleida Peck", "ReviewID": "R2KFEMDSAEL2C7", "Overall": "5.0", "Content": "Its portable and easy to use. I now have a companion when Im on road trips so no more using my mobile device. The size is just right for me and battery last a few hours more than my old cheap tablet.", "Date": "May 27, 2014"}, {"Title": "Kids love it", "Author": "Elke Wagner", "ReviewID": "R2RN62BL6S7F8J", "Overall": "4.0", "Content": "Its a nice handy little tablet thats actually smaller than what I expected but perfect for my girls. It comes with some games and has bluetooth and wifi which is exactly what I was looking for. I need to find a case for this device but for now its a great gift if you are looking for an inexpensive tablet.", "Date": "May 22, 2014"}, {"Title": "Perfect size", "Author": "Ilumination Paz", "ReviewID": "R3JHLRWA4TFXQI", "Overall": "4.0", "Content": "Its small and handy but I prefer if it came with some kind of bag to hold it in. I try not to get my tablet scratched up when Im outside. It functions good and the apps and games are a bonus. It has nice features such as hdmi output which is great for watching movies on my flatscreen tv. Its a good deal, I just wish it had a case or a bag to hold it in.", "Date": "May 28, 2014"}], "ProductInfo": {"Price": "$199.99", "Features": "CPU: Boxchip A20 Dual-Core, ARM Cortex A7 1.0Ghz\n4GB Internal Storage - 512MB DDR Ram Memory\n7-Inch Capacitive 16:9 - Preloaded with Youtube, Facebook & Apps", "Name": "PPTab® 7 Inch Android 4.2 PC Tablet - 512MB DDR RAM A20 - Best Touch Screen - HDMI Output 1080P - Micro USB Port - Great for Kids & Cheap - Front & Back Camera - Wifi for Internet - DualCore A7 1GHZ - Google Play Installed", "ImgURL": "http://ecx.images-amazon.com/images/I/41eHQJumH-L._SY300_.jpg", "ProductID": "B00KAJ9444"}}