{"Reviews": [], "ProductInfo": {"Price": "$139.99", "Features": "Replacing the popular 4-Star Zeepad 7.0, the NEW Zeepad® 7DRK features the latest 2014 powerful Dual Core Allwinner A23 CPU with top clock speeds of 1.5GHz for superior multi-tasking, ultra-fast 512MB DDR3 RAM for running apps, and a Quad Core Mali-400 GPU for smoother 3D graphics in gaming and multimedia.\nBuilt on the latest Google Android Jelly Bean 4.2.2 with voice commands it has a smoother, faster UI response, powerful search and notification handling, and Google Play Store is packed full with apps and media. Netflix, Angry Birds, Fruit Ninja, Youtube, Facebook are pre-installed and ready to run out of the box. 4GB on board memory, with 2.8GB Free\nHigh Resolution 800x480 7-inch display screen makes reading e-books and running apps clearer. Responsive capacitive touch with 5 point multi-touch screen makes for quicker swipes, pinches & zooming. Stream your favorite Netflix via wireless WiFi connection or add 32GB of video and music via the Micro SD slot.\nStay connected with Wi-Fi (802.11 a/b/g) or connect via the provided OTG cable to 3G/4G dongles for additional connectivity. And with its Dual Camera design, you can capture that special moment in High Resolution with its built-in 2.0 Megapixel rear camera for capturing picture and live video. Switch over to the 0.3 Megapixel Front-facing camera for a selfie, Snapchat, Skype & Video calling.\nFull 1 Year USA warranty direct from Zeepad / Worry Free Gadgets. Andteck USA also provides email support and is the only authorized seller of the NEW 2014 Zeepad® 7DRK Dual Core tablet. Don't forget to add a SquareTrade 2-year Accident Protection Plan for under $11 for drops, spills, or hardware failure. (A cracked screen can cost $35 to repair!) http://www.amazon.com/SquareTrade-2-Year-Electronics-Accident-Protection/dp/B0045DT46O", "Name": "Zeepad® 7DRK Dual Core 4.2 Yellow Android Tablet 7 Inch, Multi-Touch, Dual Camera, Wi-Fi (May 2014 YEL)", "ImgURL": "http://ecx.images-amazon.com/images/I/51bPcxJrJ5L._SY300_.jpg", "ProductID": "B00KGRSGMG"}}