{"Reviews": [{"Author": "g.v", "ReviewID": "R1VK59Q3WWQL8D", "Overall": "1.0", "Content": "I had this product for a total of three days before the screen went out. I did a master reset and still mess up.", "Title": "Very Poor Quality", "Date": "July 24, 2013"}, {"Author": "Renna Rockett", "ReviewID": "R2OVM7ES52OTA6", "Overall": "1.0", "Content": "This table kept freezing on my daugther. I bought it for her gradution, and it just stop working a month later. it sucks big time. I will not buy for this seller again.", "Title": "bad product", "Date": "July 24, 2013"}, {"Author": "sema", "ReviewID": "R1J44XOZ2VKL2", "Overall": "4.0", "Content": "I ordered the tablets for my kids and they are ok. Only thing is that they are little bit slow and they get frozen if you put the \"\"slide to unlock\"\" but if you keep it without locking it its good. I have to say you get for what you pay. My kids love it ! So thank you.!", "Title": "overnight delivery excellent !!!!! as of the product so far ok", "Date": "July 15, 2013"}, {"Author": "Marvin Lau", "ReviewID": "R3AV1XWTSI544X", "Overall": "5.0", "Content": "Ok let's be clear, i bouth this tablet for my kids, i received it, and start configuring... it is a very nice tablet for a really good price, i think is right for playing games, may be browsing for school task research. Until now, no problems with this item.", "Title": "Everything is working as espectated, and was delivered on time, great!!", "Date": "July 15, 2013"}, {"Author": "Dwayne K. Utsey", "ReviewID": "R38V5P3IMSXTAM", "Overall": "3.0", "Content": "I bought 2 of these for my 4 year old and 6 year old since they love to play with my Samsung Galaxy Tab 2. These tablets load most of the good apps VERY slowly which my kids were not used to and thought it was just freezing up. Some apps didn't recognize screen rotation and only worked in portrait mode....about portrait mode...its terrible. Viewing the screen in that orientation hurts your eyes and even looks kind of 3D-ish. For simple everyday emailing, web surfing, data-entry, etc. its just fine, quality and build is pretty good too, but if you are an intensive app user, spend a little more, you won't be sorry.", "Title": "Not for impatient children...", "Date": "July 12, 2013"}, {"Author": "Karen Bennie", "ReviewID": "RBVZ69AZYQIR4", "Overall": "1.0", "Content": "This is so slow..by the time you get a page to load, the unit shuts down believing it's not in use.  Save your money and buy something else!!  I have tried using it at home , on vacation etc..its not the WI FI signal..it's the unit:(", "Title": "Awful", "Date": "July 11, 2013"}, {"Author": "satisfied shopper", "ReviewID": "RRR36KD8EMMQP", "Overall": "4.0", "Content": "A little better than I expected keyboard included with the case turned the tablet is not a mini laptop. thanks", "Title": "tablet", "Date": "July 10, 2013"}, {"Author": "sandra solis", "ReviewID": "R72EQHKG53CCB", "Overall": "3.0", "Content": "Not as good as expected but ok. Kind of slow and sometimes the screens turns black and I have to shut down and back up and then its ok.", "Title": "Its ok", "Date": "July 10, 2013"}, {"Author": "Matthew", "ReviewID": "R350PI43V7EECQ", "Overall": "3.0", "Content": "Its alright. Battery only last like 1 1/2 hr. screen scratches easily too.it is ROOTED!!!!!!! I got it for emulators. I use it for GBC/GBA/DS/N64/PSP Games. and to browse the internet . Works well for those uses.", "Title": "Its alright.", "Date": "July 10, 2013"}, {"Author": "Candy Kocher", "ReviewID": "R1D3GZLTRP2Q85", "Overall": "4.0", "Content": "This one works great for the amount of money. I bought it for an  ereader , but I can check email, play games, all the things my son can do with his nook.", "Title": "works fine!", "Date": "July 7, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00KHM8NMI", "Features": null, "ImgURL": null, "Name": null}}