{"Reviews": [], "ProductInfo": {"Price": "$139.99", "Features": "The Andteck TouchTab 7X21 features the latest KitKat Android 4.4.2, a high performance Dual Core Actions ATM7021 CPU, ultra-fast 512MB DDR3 RAM, a Quad-Core PowerVR SGX540 GPU for smooth 3D gaming, an independent VPU (Video Processing Unit) for fluid and high performance video playback and boasts a 1080p HDMI output.\nBuilt on the latest Google Android 4.4.2 Kitkat with a more polished design, improved performance, and new features, it comes fully rooted for additional customization. Google Play Store is preinstalled and packed full with apps and media. Owl Media Player and Owl folder is preinstalled. 4GB on board memory, with 2.7GB Free\nHigh Resolution 800x480 7-inch display screen makes reading e-books and running apps clearer. Responsive capacitive touch with 5 point multi-touch screen makes for quicker swipes, pinches & zooming. Stream your favorite Netflix via wireless WiFi connection and output to your big screen TV via HDMI or add 32GB of video and music via the Micro SD slot.\nStay connected with Wi-Fi (802.11 a/b/g) or connect via the provided OTG cable to 3G/4G dongles for additional connectivity. And with its Dual Camera design, you can capture that special moment in High Resolution with its built-in 2.0 Megapixel rear camera for capturing picture and live video. Switch over to the 0.3 Megapixel Front-facing camera for a selfie, Snapchat, Skype & Video calling.\nFull 1 Year USA warranty direct from Andteck USA. We also provide email & phone support and is the only authorized seller of the TouchTab 7X21 Dual Core tablet. Don't forget to add a SquareTrade 2-year Accident Protection Plan for under $11 for drops, spills, or hardware failure. (A cracked screen can cost $30 to repair!) http://www.amazon.com/SquareTrade-2-Year-Electronics-Accident-Protection/dp/B0045DT46O", "Name": "TouchTab 7X21 Dual Core KitKat 4.4.2 Google Android Tablet PC, 7-inch, Wi-Fi, HDMI 1080p, Dual Camera (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/61YtzJ-av9L._SY300_.jpg", "ProductID": "B00KTZNJ2C"}}